{"id":988,"date":"2014-03-04T20:32:31","date_gmt":"2014-03-04T20:32:31","guid":{"rendered":"http:\/\/twelvershia.net\/?p=988"},"modified":"2014-03-04T20:32:31","modified_gmt":"2014-03-04T20:32:31","slug":"response-to-the-names-of-imam-ali-ass-sons","status":"publish","type":"post","link":"https:\/\/www.twelvershia.net\/2014\/03\/04\/response-to-the-names-of-imam-ali-ass-sons\/","title":{"rendered":"Response to: The Names of Imam Ali (as)’s Sons"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/imgstore.org\/a\/67hxw0egsgub?i=988\" alt=\"\" \/><\/p>\n<p style=\"text-align: justify;\"><strong>The following is a response to ShiaPen’s article entitled: The Names of Imam Ali (as)’s Sons. The article can be found <a href=\"http:\/\/www.shiapen.com\/comprehensive\/names-of-imam-ali-sons.html\" rel=\"external nofollow\">here<\/a>.<\/strong><\/p>\n<p style=\"text-align: justify;\">We remind our readers that we previously wrote a related article, you can read it <a href=\"http:\/\/twelvershia.net\/2013\/05\/02\/after-who-ahlul-bayt-named-their-children\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">In this article, ShiaPen are on damage control. It was their goal to minimize and downplay the accepted fact that `Ali named his sons Abu Bakr, `Umar, and `Uthman. This was done through multiple methods.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 1: Famous Arabs with the Name Abu Bakr.<\/strong><\/p>\n<p style=\"text-align: justify;\">ShiaPen started off by listing the names of “famous Arabs” that were referred to as Abu Bakr. With the existence of this list, they plan to establish that this is a common name, and the very circulation of it casts doubt that `Ali named his sons after Abu Bakr.<\/p>\n<p style=\"text-align: justify;\">ShiaPen argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">In Ahl’ul Sunnah’s authority work Al Isaba Volume four “Dhikr ‘Abu Bakr” Ibn Barr states:<\/span><br \/>\n<span style=\"color: #800000;\">The first was Abu Bakr bin Quhafa, the second Abu Bakr bin Shuab Laisy and the third was Abu Bakr Nafee bin al Harith Saqfi.<\/span><br \/>\n<span style=\"color: #800000;\">In the Risala Taseemee’thul Isma page 4 we read that the grandson of Prophet Ilyas (as) was called Abu Bakr.<\/span><br \/>\n<span style=\"color: #800000;\">If our opponents are still not convinced then we shall cite Sibt Ibn Jauzi al Hanafi’s “Tadhkirathul Khawwas, under the Chapter “Dhikr Abu Bakr” who provides a complete list of those individuals that were called Abu Bakr along with the tribe that they belonged to:<\/span><br \/>\n<span style=\"color: #800000;\">1. Abu Bakr bin Abdur Rahman Mukhdhoomee<\/span><br \/>\n<span style=\"color: #800000;\">2. Abu Bakr bin Hamam al Hameeree<\/span><br \/>\n<span style=\"color: #800000;\">3. Abu Bakr bin Muhammad bin Muslim Qurshee<\/span><br \/>\n<span style=\"color: #800000;\">4. Abu Bakr bin Abi Maleeka al Timeemee<\/span><br \/>\n<span style=\"color: #800000;\">5. Abu Bakr bin Sireen<\/span><br \/>\n<span style=\"color: #800000;\">6. Abu Bakr bin Marwan ibn Muhammad al Thathree<\/span><br \/>\n<span style=\"color: #800000;\">7. Abu Bakr Younis bin Bakeer al Shaybanee<\/span><br \/>\n<span style=\"color: #800000;\">8. Abu Bakr al Bahili<\/span><br \/>\n<span style=\"color: #800000;\">9. Abu Bakr al Sakhthayanai<\/span><\/p>\n<p style=\"text-align: justify;\">Simply quoting the above demonstrates the incompetence of the ShiaPen team. Firstly, Al-Isaba was not authored by “Ibn Barr”, who ShiaPen has incorrectly transliterated from Ibn `Abd Al-Barr. The book was in fact written by Ibn Hajar.<\/p>\n<p style=\"text-align: justify;\">They then made more mistakes in listing out the names of those that were referred to as Abu Bakr. The first is Abu Bakr Al-Sideeq, Ibn Abi Quhafa, whom they have called Ibn Quhafa. The second was Abu Bakr bin Sha’oob Al-Laythi. The third man on the list is Abu Bakrah, whom they have referred to as “Abu Bakr”.<\/p>\n<p style=\"text-align: justify;\">ShiaPen then quoted some strange source called “Taseemeeth’ul Isma”, which makes absolutely no sense in Arabic, so we weren’t able to find the text quoted therein. Regardless, one would need to prove that the prophet Ilyas (as), or more importantly, his grandson, was an Arab before even attributing the name “Abu Bakr” to him, until then this is no more than a &#8220;story&#8221; in a random unknown book.<\/p>\n<p style=\"text-align: justify;\">Finally, ShiaPen list out a group of nine people, those that were named Abu Bakr. The list cannot be found in Sibt Ibn Al-Jawzi’s Tathkhirat Al-Khawas, which once again demonstrates the incompetence of ShiaPen. They quoted a text which is not found in the source they named.<\/p>\n<p style=\"text-align: justify;\">Ironically though, upon further inspection, we found that all of these men were actually born after the death of Abu Bakr al-Sideeq. Making the list useless even if quoted properly.<\/p>\n<p style=\"text-align: justify;\">1. Abu Bakr bin Abdur Rahman Mukhdhoomee (born in the time of `Umar)<br \/>\n2. Abu Bakr bin Hamam al Hameeree (born in the year 126 AH)<br \/>\n3. Abu Bakr bin Muhammad bin Muslim Qurshee (born after the year 50 AH)<br \/>\n4. Abu Bakr bin Abi Maleeka al Timeemee (from the Tabi’een, died in the year 118 AH)<br \/>\n5. Abu Bakr bin Sireen (born in the time of `Uthman)<br \/>\n6. Abu Bakr bin Marwan ibn Muhammad al Thathree (born 147 AH)<br \/>\n7. Abu Bakr Younis bin Bakeer al Shaybanee (from the atba’a al-tabi’een, died in 199 AH)<br \/>\n8. Abu Bakr al Bahili (there are multiple scholars with this name, all were born at least a century after Abu Bakr al-Sideeq)<br \/>\n9. Abu Bakr al Sakhthayanai (born in the year 66 AH)<\/p>\n<p style=\"text-align: justify;\">For those that are not aware, the names above are the names of major Sunni scholars, including `Abdulrazaq Al-San’aani, Al-Zuhri, Ayoub Al-Sakhtiyani, Ibn Abi Maleeka, and Yunus the student of Ibn Ishaaq.<\/p>\n<p style=\"text-align: justify;\">In this we are in agreement with ShiaPen, that after the death of Abu Bakr, his name became extremely famous, and many great scholars were named Abu Bakr (meaning father of young camel).<\/p>\n<p style=\"text-align: justify;\">On the other hand, we have proven in this chapter that there were only two people during the time of the Prophet (salalahu alaihi wa salam) that were called Abu Bakr. The first is Abu Bakr Al-Siddeeq and the second is Abu Bakr bin Sha’oub. When returning to the reference provided by ShiaPen, namely Al-Isaba, we find that Abu Bakr bin Sha’oub was a non-Muslim that fought the Muslims in Badr, and recited poetry in memory of the dead Kuffar. Ibn Hajar then quotes Ibn Hisham who stated that this man became a Muslim for a period of time, and then became an apostate once again.<\/p>\n<p style=\"text-align: justify;\">We&#8217;re sure that the deep hatred of today&#8217;s Rafidhi Imamiyyah, will push them to believe that `Ali named his son after an evil apostate heretic instead of the successor of Rasul-Allah (saw) Abu Bakr al-Sideeq (ra).<\/p>\n<p style=\"text-align: justify;\">In conclusion, we can safely say that `Ali named his son Abu Bakr after Al-Sideeq, for the name was only shared by one other person in his time, which was an apostate. We can also be certain that unlike the common names of the time `Umar and `Uthman, there were no companions of the Prophet (salalahu alaihi wa salam) that were referred to as Abu Bakr.<br \/>\nThere is no doubt that `Ali loved Abu Bakr to the extent that he preferred him over himself.<br \/>\nFor more, please refer to our article on this subject, which can be found <a href=\"http:\/\/twelvershia.net\/2013\/12\/26\/detailed-research-on-the-chains-of-hadith-ul-afdaliyyah-narration-of-superiority\/\" rel=\"external nofollow\">here<\/a>.<\/p>\n<p style=\"text-align: justify;\">We add that some Imami Shia scholars said that `Ali named his son Abu Bakr out of Taqiyyah, in one of their narrations `Ali says he named his son Abu Bakr so that when he praises the man out of Taqiyyah, he&#8217;d be praising his own son, yet in another narration from their books that one cannot use the name of the enemies of Ahlul-Bayt, which are all clearly weak excuses concocted by their ancient leaders.<\/p>\n<p style=\"text-align: justify;\">From their book &#8220;Sulaym bin Qays&#8221; pg.302, they write that `Ali (ra) said:<\/p>\n<p style=\"text-align: justify;\">إني قد سميت ثلاثة بنين لي أبا بكر وعمر وعثمان ، فإذا سمعتموني أترحم على أحد من أئمة الضلالة فإني أعني بذلك بني<\/p>\n<p style=\"text-align: justify;\">[I have called three sons of mine as: Abu Bakr, `Umar and `Uthman. So if you hear me praise any of the leaders of misguidance, then know that I mean my sons.]<\/p>\n<p style=\"text-align: justify;\">Then contemporary Shia scholars like al-Sistani would write in their books of Fiqh that:<\/p>\n<p style=\"text-align: justify;\">كما يكره تسميته باسماء اعداء الاَئمّة صلوات الله عليهم<\/p>\n<p style=\"text-align: justify;\">[It is also disliked to call him (the new born) with the names of the enemies of the Imams peace be upon them.]<\/p>\n<p style=\"text-align: justify;\">Sadly `Ali (ra) has beaten you to it, he named his own sons after the names of his supposed enemies.<\/p>\n<p style=\"text-align: justify;\">Shia scholar al-Sayyid `Ali al-Shahrastani said in his book &#8220;al-Tasmiyat&#8221; pg.7 that it was `Umar (ra) who forced `Ali (ra) to name his son after him:<\/p>\n<p style=\"text-align: justify;\">و الامام استجاب لطلب عمر لأنه (عليه السلام) لو لم يقبل بذلك لتسببت له مشاكل كثيرة هو في غنى عنها لان الإسلام في مرحلة التأسيس وعليه الحفاظ على بيضة الإسلام.<\/p>\n<p style=\"text-align: justify;\">[The Imam (as) only accepted the request of `Umar, because if he didn&#8217;t then it would have caused him many problems that he couldn&#8217;t deal with at the time, since Islam was still in its first stages and he had to guard the egg of Islam.]<\/p>\n<p style=\"text-align: justify;\">So dear readers, we see various desperate attempts to make an excuse to how `Ali (ra) named his sons after his enemies, and we expected ShiaPen to do just that, a desperate attempt to prove that `Ali (ra) randomly chose those three names, without it having any meaning.<\/p>\n<p style=\"text-align: justify;\">ShiaPen never disappointed,<\/p>\n<p style=\"text-align: justify;\">May Allah save us from ignorance and desire, and in His name we continue,<\/p>\n<p style=\"text-align: justify;\"><strong>Section 2: Did `Ali Name his Son `Uthman Due to his Love for `Uthman bin Madh’oun?<\/strong><\/p>\n<p style=\"text-align: justify;\">The quick answer is that there are no evidences that suggest this. ShiaPen point to a narration in Bihar Al-Anwar:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">We should point out that in our Shi’a text Bihar al Anwar, Volume 45 page 38 we read the testimony of Imam ‘`Ali (as) that he named one of his sons `Uthman because on the day he was born he (as) stated:<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\"> إنما سميته بأسم أخي عثمان بن مظعون<\/span><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">`Ali (a.s) said:’ I named him after my brother `Uthman bin Madhoon’<\/span><\/p>\n<p style=\"text-align: justify;\">\n<span style=\"color: #800000;\">This is why the name `Uthman was kept by Imam ‘`Ali (as) it does not prove `Uthman bin Affan’s merit, not even in the slightest.<\/span><\/p>\n<p style=\"text-align: justify;\">However, upon returning to the source, we found that this attribution was taken from Maqatil Al-T`Alibeeyeen by Al-Asbahani, who is a nobody, he himself has failed to provide a source, and the narration has no chain of transmission. Therefore, one has no choice but to reject this information as dubious.<\/p>\n<p style=\"text-align: justify;\">We on the other hand have a Shia source that says otherwise, this source is superior since it was written by a respectable Zaydi Shia scholar, Zaydiyyah are not known for being notorious liars like the Imami Rafidhah, and the narration actually has a chain!<\/p>\n<p style=\"text-align: justify;\">Zaydi Shia scholar of Hadith al-Murshid Billah narrates with his chain in al-Amali al-Ithneeniyyah 1\/488 that `Ali (ra) says that he named after `Uthman ibn `Affan (ra) and `Umar bin al-Khattab (ra) and al-`Abbas (ra) the uncle of the Prophet (SAWS):<\/p>\n<p style=\"text-align: justify;\">أَخْبَرَنَا أَبُو الْحُسَيْنِ مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ مُحَمَّدِ بْنِ قَادَوَيْهِ الْعَدْلُ بِقِرَاءَتِي عَلَيْهِ فِيْ جَامِعِ الْكُوْفَةِ، قَالَ:<br \/>\nحَدَّثَنَا عَلِيُّ بْنُ عَبْدِ الرَّحِيْمِ بْنِ أَبِي السُّرِّي البَّكَّاي، قَالَ: حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ -يَعْنِي الْحَضْرَمِيَّ- قَالَ:<br \/>\nحَدَّثَنَا عَبَّادُ بْنُ أَحْمَدَ بْنِ عَبْدِ الرَّحْمَنِ الْعَرْزَمِيُّ، قَالَ: حَدَّثَنِي عَمِّي، عَنْ أَبِيْهِ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ<br \/>\nعَطِيَّةَ.عَنْ أَبِي سَعِيْدٍ الْخُدَرِيِّ، قَالَ: نَظَرْتُ إِلَى غُلاَمٍ حِيْنَ ارْتَفَقَتْ لَهُ ذُؤَابَةٌ وَجَمَّةُ جَعْدِةِ، وَاللَّهُ أَعْلَمُ أَنِّي<br \/>\nمِنْهُ لَفِي شَكٍّ أَغُلاَمٌ هُوَ أَمْ جَارِيَةٌ، فَمَرَرْتُ بِأَحْسَنَ مِنْهُ وَهُوَ جَالِسٌ إِلَى جَنْبِ عَلِيٍّ ، فَقُلْتُ لَهُ: عَافَاكَ<br \/>\nاللَّهُ مَنْ هَذَا الْفَتَى إِلَى جَنْبِكَ ؟ قَالَ: هَذَا عُثْمَانُ بْنُ عَلِيٍّ، سَمَّيْتُهُ بِاسْمِ عُثْمَانَ بْنِ عَفَّانَ، وَقَدْ سَمَّيْتُ<br \/>\nبِعُمَرَ بْنِ الْخَطَّابِ، وَقَدْ سَمَّيْتُ بِعَبَّاسٍ عَمِّ رَسُوْلِ اللَّهِ &#8211; صَلَّى اللَّهُ عَلَيْهِ وَآلَهُ وَسَلَّمَ-، وَقَدْ سَمَّيْتُ بِخَيْرِ<br \/>\nالبَرِيَّةِ &#8211; مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلَهُ وَسَلَّمَ-، فَأَمَّا الْحَسَنُ وَالْحُسَيْنُ وَمُحَسِّنٌ فَإِنَّمَا رَسُوْلُ اللَّهِ &#8211; صَلَّى<br \/>\nاللَّهُ عَلَيْهِ وَآلَهُ وَسَلَّمَ- سَمَّاهُمْ وَعَقَّ عَنْهُمْ وَحَلَقَ رُؤُوْسَهُمْ وَتَصَدَّقَ بِوَزْنِهَا وَأَمَرَ بِهِمْ فُسُرُّوا وَخُتِنُوْا.<\/p>\n<p style=\"text-align: justify;\">[We were told by abu al-Husayn Muhammad bin Ishaq bin Muhammad bin Qadawayh al-`Adl, after I narrated in front of him in the Masjid of al-Kufa, he said: `Ali bin `Abdul-Rahim bin abi al-Sarriy al-Bakkari told me, he said: Muhammad bin `Abdullah -meaning al-Hadrami- told me, he said: `Abbad bin Ahmad bin `Abdul-Rahman al-`Arzami told me, he said: My uncle told me, from his father, from `Amro bin Qays, from `Atiyyah, from abu Sa`eed al-Khudari that he said: &#8220;I saw a young boy with beautiful bangs, by Allah I was in doubt as to whether he was a boy or a female servant, then I passed by one who was even better looking as he sat besides `Ali, I asked: &#8220;May Allah make you safe, who is this young one besides you?&#8221; He replied: &#8220;This is `Uthman bin `Ali, I named him after `Uthman bin `Affan, and I had also named others after `Umar bin al-Khattab and al-`Abbas the uncle of Rasul-Allah (saw). I have also named after the best of creation Muhammad (saw), as for al-Hasan and al-Husayn and Muhassin, it was Rasul-Allah (saw) who named them and did `Aqiqah and shaved their heads and donated an equal weight etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">Also in the old classical Sunni history book Tareekh Madinat Dimashq by ibn `Asakir 45\/304, under the biography of `Umar bin `Ali ibn abi Talib, he reports what supports the above Zaydi Hadith:<\/p>\n<p style=\"text-align: justify;\">أخبرنا أبو عبد الله محمد بن إبراهيم النشابي أنا أبو الفضل أحمد بن عبد المنعم بن أحمد بن بندار أنا أبو الحسن العتيقي أنا أبو الحسن الدارقطني نا أبو بكر الشافعي نا عبد الله بن ناجية نا عباد بن أحمد العرزمي نا عمي عن أبيه عن عمرو بن قيس عن عطية عن أبي سعيد قال مررت بغلام له ذؤابة وجمة إلى جنب علي بن أبي طالب فقلت ما هذا الصبي إلى جانبك قال هذا عثمان بن علي سميته بعثمان بن عفان وقد سميته بعمر بن الخطاب وسميت بعباس عم النبي ( صلى الله عليه وسلم ) وسميت بخير البرية محمد ( صلى الله عليه وسلم ) فأما حسن وحسين ومحسن فإنما سماهم رسول الله ( صلى الله عليه وسلم ) وعق عنهم وحلق رؤوسهم وتصدق بوزنها وأمر بهم فسروا وختنوا<\/p>\n<p style=\"text-align: justify;\">[We were told by abu `Abdullah Muhammad bin Ibrahim al-Nashabi: abu al-Fadl Ahmad bin `Abdul-Mun`im bin Ahmad bin Bindar told us, abu al-Hasan al-`Atiqi told us, abu al-Hasan al-Daraqutni told us, abu Bakr al-Shafi`i told us, `Abdullah ibn Najiyah told us, `Abbad bin Ahmad al-`Arzami told us: My uncle told me, from his father, from `Amro bin Qays, from `Atiyyah, from abu Sa`eed: I passed by a young boy with bangs sitting next to `Ali ibn abi Talib, so I said: &#8220;Who is the boy next to you?&#8221; He answered: &#8220;This is `Uthman bin `Ali, I called him after `Uthman bin `Affan, and I called after `Umar bin al-Khattab, and I called after al-`Abbas the uncle of Rasul-Allah (saw), and I called after the best of creation Muhammad (saw). As for al-Hasan and al-Husayn and Muhassin, it was the messenger of Allah (saw) who named them and did `Aqiqah for them and shaved their heads etc&#8230;]<\/p>\n<p style=\"text-align: justify;\">The same was also reported in al Mukhtasar min kitab al Muwafaqah bayn Ahlul-Bayt wal Sahabah by al Zamakhshari, page 141.<\/p>\n<p style=\"text-align: justify;\">We do agree with ShiaPen that there are reasons that may allow one to name one’s son after the name of an enemy. The most obvious reason is the existence of a loved one that holds the same name. However, the notion that `Ali is said to have done this thrice, with three men that have supposedly usurped the Caliphate from under his legs, is absolutely preposterous.<\/p>\n<p style=\"text-align: justify;\">Also, we know for a fact that `Ali did not have any loved ones named Abu Bakr, unless the ShiaPen are insinuating that `Ali loved Abu Bakr ibn Sha’oub, the apostate.<\/p>\n<p style=\"text-align: justify;\"><strong>Section 3: Did the Prophet (salalahu alaihi wa salam) Name his Son Abd Al-Uzza?<\/strong><\/p>\n<p style=\"text-align: justify;\">ShiaPen argue:<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #800000;\">If the claim is that Imam ‘`Ali (as) named his sons after these three then Hanafi scholar Shibli Numani in Seerathun Nabi Volume 1 page 191 quotes Imam Bukhari’s “Tareekh al Sagheer” that Rasulullah (s) named one of his sons Abdul Uzza<\/span><\/p>\n<p style=\"text-align: justify;\">The narration is weak due to two flaws. The first is that the first narrator in this narration is Isma’eel bin Abi Uwais, who has been weakened by several scholars like Yahya bin Ma’een in one of his opinions, Al-Nasa’ee, Al-Daraqutni, and others, while even some of those that have praised him, referred to him as a fool, like Abu Hatim Al-Razi. See his biography in Tahtheeb Al-Tahtheeb.<\/p>\n<p style=\"text-align: justify;\">\nThe second issue is that Hisham bin Urwa narrates this hadith in a disconnected form. Hisham was born during the time of Mu’awiyah, and so his narration of something that happened back before the revelation is not historically acceptable.<\/p>\n<p style=\"text-align: justify;\">So we conclude that this desperate defense of what is known today as Tashayyu` is a failure in every sense of the word.<\/p>\n<p style=\"text-align: justify;\">\n","protected":false},"excerpt":{"rendered":"<div class=\"mh-excerpt\"><p>The following is a response to ShiaPen’s article entitled: The Names of Imam Ali (as)’s Sons. The article can be found here. We remind our readers that we previously wrote a related article, you can read it here. In this <a class=\"mh-excerpt-more\" href=\"https:\/\/www.twelvershia.net\/2014\/03\/04\/response-to-the-names-of-imam-ali-ass-sons\/\" title=\"Response to: The Names of Imam Ali (as)’s Sons\">[read more]<\/a><\/p>\n<\/div>","protected":false},"author":2,"featured_media":3894,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"class_list":{"0":"post-988","1":"post","2":"type-post","3":"status-publish","4":"format-standard","5":"has-post-thumbnail","7":"category-hadith"},"_links":{"self":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/988","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/comments?post=988"}],"version-history":[{"count":4,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/988\/revisions"}],"predecessor-version":[{"id":992,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/posts\/988\/revisions\/992"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media\/3894"}],"wp:attachment":[{"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/media?parent=988"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/categories?post=988"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.twelvershia.net\/wp-json\/wp\/v2\/tags?post=988"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}