

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.manhaj.com/manhaj/articles/omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 09:42:18 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood</title>
	
	
	<meta name="Keywords" content="Khalid Abd al-Rahman">
	<meta name="Description" content="Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood.  ...">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	
    <link rel="STYLESHEET" type="text/css" href="../scripts/bootstrap.min.css">
    <script src="../scripts/bootstrap.min.js"></script>
    <link rel="STYLESHEET" type="text/css" href="../style.css">
    <link rel="STYLESHEET" type="text/css" href="../scripts/custom.css">
    
</head>

<body>


	<div class="container">

		<div>
			

  <div class="d-flex flex-wrap align-items-center textSmall pb-2 pt-3 px-1">
    <div class="d-flex flex-wrap align-items-center w-full md:w-auto">
      
    </div>
    <div class="d-flex align-items-center pt-2 pt-md-0 justify-content-start justify-content-lg-end w-full md:w-auto ms-md-auto">
      <span>Monday, 11 August 2025&nbsp;&nbsp;&nbsp;</span>
      <a href="../index.html">Home</a> &nbsp;&#149;&nbsp; 
      <a href="../about.html">About Us</a> &nbsp;&#149;&nbsp;  
      
      <a href="../contact.html">Contact Us</a> 
    </div>
  </div>



  <div>
    <img src="../images/banner.gif" width="100%" height="auto" border="0" alt="">
  </div>







<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNav" aria-controls="navbarNav" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon">
        <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 30 30'><path stroke='#FFFFFF' stroke-linecap='round' stroke-miterlimit='10' stroke-width='2' d='M4 7h22M4 15h22M4 23h22'/></svg>
      </span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNav">
      <ul class="navbar-nav pt-2 pt-lg-0 me-auto">
        <li class="nav-item">
          <a class="nav-link" href="../index.html">HOME</a>
        </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/basics.html">BASICS</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/salafiyyah.html">SALAFIYYAH</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/dawah.html">DA'WAH</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/groups.html">SECTS & GROUPS</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/rulership.html">RULERSHIP</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/articles.html">GENERAL</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/jarh--tadeel.html">JARH & TA'DEEL</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/more-topics.html">MORE TOPICS >></a>
            </li>
        
        <li class="nav-item">
          <a class="nav-link" href="../reports.html">REPORTS</a>
        </li>
	    </ul>
      <ul class="navbar-nav">
        <li class="nav-item"><a class="nav-link" href="../rss.html">RSS</a></li>
        <li class="nav-item"><a class="nav-link" href="../tags.html">TAGS</a></li>
        <li class="nav-item"><a class="nav-link" href="../search.html">SEARCH</a></li>
        
          <li class="nav-item lg:ms-auto"><a class="nav-link" href="../signin.html">LOGIN</a></li>
        
      </ul>
    </div>
  </div>
</nav>



		</div>
	  
		 

		<div class="d-flex flex-column flex-lg-row bg-white pt-3">
			<div class="px-3 w-full">
				<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
					<tr>
						<td valign="top">
							<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
								<tr>
									
										<td valign="top" width="100%">
											<span class="articleTitle">Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood</span><BR>
											Filed under: <a href="../categories/articles.html">General</a><BR>
											Wednesday, February 20 2019 - by <a href="../authors/Abu.Iyaad.html">Abu.Iyaad</a>
											<BR>
											Key topics: 
											
												<a href="../tags/khalid-abd-al-rahman.html">
													Khalid Abd Al-Rahman 
												</a>
												
										</td>
									
								</tr>
							</table>
							<hr size="1" noshade style="margin-top:12" color="#cdcdcd">
							<a href="mailto:Enter_Email?subject=Manhaj.Com | Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood&body=You may be interested in this article:%0D%0A%0D%0ARevilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood%0D%0Ahttps://www.manhaj.com/manhaj/?omtup">Mail to a Friend</a> &#149;
							<a href="../print1985.html?omtup">Printer friendly</a> 
							
							<br><br>
							
							
<div class="articleContent">


<div class="articleContent">
<div class='sidebar'><blockquote style="font-size:17px;line-height:24px;"><u>Latest additions</u>:     <P>
<b>The Mu&#7779;a&#703;fiqah Network Split Asunder in the Issue of Giving Fatw&#257; in Naw&#257;zil and Their Hypocrisy and Contradiction Exposed (from an excellent article by &#703;Abd al-A&#702;l&#257; &#702;&#256;l Mu&#7717;ammad al-Qa&#7717;t&#257;n&#299;, <a href=../assets/docs/mbh-nawazil-libya.pdf>download here</a>):</b> Mu&#7717;ammad bin H&#257;d&#299;'s fatwas regarding fighting in Libya:   (<b><a href=../assets/images/mbh-fighting-libya-01.jpg>here</a></b>),   (<b><a href=../assets/images/mbh-fighting-libya-02.jpg>here</a></b>) and   (<b><a href=../assets/images/mbh-fighting-libya-03.jpg>here</a></b>).  Kh&#257;lid Ab&#363; &#703;Abd al-A&#703;l&#257; al-Mi&#7779;riyy's fatwa   (<b><a href=../assets/images/mbh-khalid-abu-abdul-alaa-libya-01.jpg>here</a></b>). A&#7717;mad Bazmul's fatwa on fighting revolutionaries in Libya (<b><a href=https://safeyoutube.net/w/zCoi>here</a></b>), and it is the one he tried to slip away from and began saying "I do not give fatwa in these issues and I am upon the fatwa of Im&#257;m Rab&#299;&#703;." (<b><a href=../assets/audio/bazmul-khalid-nawazil.mp3>here</a></b>). N&#257;sir Zakar&#299; (J&#257;z&#257;n) supporting Shaykh Rab&#299;&#703;'s fatwa regarding the Houth&#299;s (<b><a href=../assets/images/mbh-nasir-zakari-nawazil.jpg>here</a></b>). &#703;Abd All&#257;h A&#7717;mad (Riy&#257;&#7693;) rejoicing with Shaykh Rab&#299;&#703;'s fatw&#257; regarding the &#7716;outh&#299;s (<b><a href=../assets/images/mbh-abdullah-ahmad-nawazil.jpg>here</a></b>). Now, the Mu&#7779;a&#703;fiqah are saying that giving fatw&#257; in these issues in private gatherings is from the manhaj of the Kh&#257;rijites and deviation from the Sunnah. So it is something they did themselves and something Mu&#7717;ammad bin H&#257;d&#299; did also, and it is also something for which they would refer people back to the fatw&#257;s of Im&#257;m, Shaykh Rab&#299;&#703;--and now it has become "the manhaj of the  Kh&#257;rijites" and "a deviation from the Sunnah", but only for Shaykh Rab&#299;&#703; and no one else! Their agenda exposed in broad daylight.    <P>
<b>The Mu&#7779;a&#703;fiqah Network Reveals Its Agenda and Its True Colours</b>  <b><a href=../assets/docs/khalid-misree-03-those-in-authority.pdf>Download PDF (6 pages)</a></b>.  In their attempts to support Kh&#257;lid al-Mi&#7779;riyy, the network has come out of the shadows and revealed its true colours.     <P>
<b>Do You Not Have Any Intelligence O Kh&#257;lid al-Mi&#7779;r&#299;yy?  </b><b><a href=../assets/docs/khalid-misree-02-no-aql.pdf>Download PDF (8 pages)</a></b>. An excellent rebuttal of Khalid al-Misri and the argument concerning "majaalis sirriyyah" (secret gatherings).</blockquote></div>    <P>
<div class='sidebar'><blockquote><b>Kh&#257;lid &#703;Abd al_Ra&#7717;m&#257;n al-Mi&#7779;r&#299;</b>--over a period of time--has tried to engineer the slanderous claim that Shaykh Rab&#299;&#703; bin H&#257;d&#299; has opposed a foundation of the Sunnah and has traversed the manhaj of the Khaw&#257;rij. In a recent audio recording, he came out with this explicitly, after having only alluded to it indirectly in the past. He tried to present scholarly gatherings of sh&#363;r&#257; [consultative meetings in which legislative rulings on naw&#257;zil such as qit&#257;l are discussed] as <b>innovative secretive meetings</b> and that to affirm such meetings is an affirmation (taqr&#299;r) of the Khaw&#257;rij. He expressly accused Shaykh Rab&#299;&#703; of this. As soon as he was refuted and declared misguided and astray for reviling an Im&#257;m in the Sunnah in our era, <b>A&#7717;mad Bazmul</b> came swiftly to his defence, thereby exposing himself also.     <P>
This jam&#257;&#703;ah--<b>or this network</b>--is the one that has been exposed and brought to light through <b>the Mu&#7779;a&#703;fiqah fitnah</b> unleashed by <b>Mu&#7717;ammad bin H&#257;d&#299;</b> who has become the prominent visible face of a wider undercurrent that stretches back many years. What we have is a collection of individual networks that were previously unconnected or loosely-tied and which have now come together upon common goals (despite prior differences between themselve in some cases). They are desirous of <b>having affairs returned back to themselves</b>. They see the major scholars such as Shaykh Rab&#299;&#703;, Shaykh &#703;Ubayd as being reclusive and not in touch with people, their situations or their lands--which are blatant falsehoods. As for targeting some of the students of knowledge and mash&#257;yikh through the "&#7778;a&#703;&#257;fiqah" label--this was simply a strategy among the strategies to undermine these scholars--the real goal was to present <b>a new type of scholarship</b> to replace these major, senior, experienced scholars who have wisdom and foresight, by presenting them in the same way that the Qu&#7789;biyyah Sur&#363;riyyah were presenting the major scholars two decades ago:  Out of touch with the realities because they are surrounded by unscrupulous, evil people and ill-informed, or being blindly-followed in their alleged errors. And when the falsehood of this becomes known, these people are forced--because they committed so much time, wealth, resources and effort into this agenda--to reveal their true colours and just come out with what they have been concealing all along: Accusing these major scholars of opposing the Sunnah and traversing the ways of major innovated <a href='../tags/sects.html' class='tagLink'><font class='tagLink'>sects</font></a> such as the Murji&#702;ah or the Khaw&#257;rij.    <P>
Al&#7717;amdulill&#257;h, the response to this misguided liar and mu&#7779;a&#703;fiq has been immediate, strong and robust and we present here some of the best resources.</blockquote></div>    <P>
<b>Resources in Arabic and English:</b>    <P>
<ul>  <li> <b><a href=../assets/docs/khalid-misree-01-rabee-meeting.pdf>Shaykh Rab&#299;&#703;'s Response: Khalid 'Abd al-Rahman is a liar (kadhdhaab)</a></b>. Arabic. Contains good refutation of al-Mi&#7779;r&#299;'s doubts.   <blockquote class='quote'><img src='../images/quote-start.gif'>Shaykh Rab&#299;&#703;: "He is a liar (kadhdh&#257;b), rather, he is the one who has opposed Ahl al-Sunnah."</blockquote>    <P>
And from the excellent points by the author, exposing the slandering liar and his double standards:    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'><ol><li> His support for the fitnah of al-&#7778;a&#703;faqah (falsely declaring students and shaykhs as bankrupt in knowledge), which was overseen by [Mu&#7717;ammad Ibn H&#257;d&#299;], thereby turning away from the Book of All&#257;h which calls to <a href='../tags/unity.html' class='tagLink'><font class='tagLink'>unity</font></a> and warns from splitting. <li> Likewise, his turning away from the Book of All&#257;h in its ruling upon the one who makes a false accusation, in that he is a f&#257;siq (sinner) whose testimony is rejected.  <li> Also from his oppositions is revilement upon the senior people of knowledge, lying upon them and inciting the common-folk against them, as occurs in two audios of his which he filled with lies, sinfulness, apportioning of blame and deception. And it is from the signs of the people of innovation that they revile the people of athar (traditions). <li> Also from his oppositions is throwing the words of the scholars about the fitnah of al-&#7778;a&#703;faqah against the wall. <li> And from his oppositions is changing colours in the issue itself. So whereas he used to advise with returning to Shaykh &#703;Ubayd in the affair of Libya, as occurs in his audio recording, he now blames the senior scholars whom he used to advise with and accuses them of having the opinion of the Khaw&#257;rij!! Sublime are you O All&#257;h, this is a mighty slander. <li> And from his oppositions is judging politically with two scales, and this is his silence over Ibn H&#257;d&#299; who agreed with the Kh&#257;rijites that [persistence in sinful] action indicates isti&#7717;l&#257;l (holding something lawful), <a href=https://www.youtube.com/watch?v=xaB76bCbYzM>as occurs in his audio</a>. <li> And likewise, his silence over Ibn H&#257;d&#299; who opposed the waliy al-&#702;amr (leader) after agreeing that he would not speak against the students of knowledge, and he had actually signed [a resolution] over this in the presence of the judge as occurs in <a href=../assets/docs/rabee-05-mbh-ruhayli.pdf>the official document</a> containing the judge's ruling. <li> And from  his oppositions is his silence about Ibn H&#257;d&#299; <a href=https://www.youtube.com/watch?v=XYJMwD3ezvc>who permits backbiting of the ruler</a>, and this is from the actions of the Kh&#257;rijites in truth. So this one called Kh&#257;lid remains silent over all of this, yet reviles the people of knowledge whose hearts, tongues and pens are purified of the actions of the Kh&#257;rijites, and those who warned against the Kh&#257;rijites such as the Ikhw&#257;n, D&#257;eshites, Q&#257;&#702;idah and others. <li> And from his oppositions is their independence and isolation away from the senior people of knowledge and not caring about their advices, particularly in this fitnah.</ol></blockquote>    <P>
<li> <a href=http://www.tasfiatarbia.org/vb/showthread.php?t=24257>Shaykh &#703;Ubayd al-J&#257;bir&#299;'s Defence of Shaykh Rab&#299;&#703; and Clarification of Kh&#257;lid al-Mi&#7779;r&#299;'s Falsehood</a>. Translation:    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>In the name of All&#257;h, and all praise is due to All&#257;h. May All&#257;h make good mention and grant safety and peace to our Prophet Mu&#7717;ammad, his family and his companions. That which I know and worship All&#257;h with  is that the people of knowledge from olden times mutually consult between themselves in the affairs that are presented to them. All [of the scholars] give their opinion and they may agree or they may disagree [with each other]. And this is not from the partisan secretive gatherings. This  is because they consult with each other in matters that are open for ijtih&#257;d and subject to dispute. Everyone can express his view. This is known from olden times, it is known by everyone who is well-informed about the biographies of the people of knowledge, starting from the Companions, then the Successors and those after them from the People of Knowledge, Leadership and Excellence in the religion.  [And in all that time] no one said this statement [of Kh&#257;lid al-Mi&#7779;r&#299;]. Rather, this [saying] has been chosen by ignorant youngsters who stir in the murky waters. And from this corroboration [of the truth in this matter] it is known that Shaykh Rab&#299;&#703;-may All&#257;h preserve him-is our elder, our elder brother and he is free of this accusation, as is said, with the freedom of the wolf from the blood of Y&#363;suf (may All&#257;h mention him with good and grant him safety). I and Shaykh Rab&#299;&#703; bin H&#257;d&#299;-may All&#257;h grant him success- have such affection and love between us that is known to one who is far and near. He is free of what that Egyptian has accused him of, [All&#257;h says]: "<b>And who conduct their affairs by mutual consultation</b>" (42:38). This is general, we consult with each other, myself, and my brother Shaykh Rab&#299;&#703; and our student, companion, Shaykh &#703;Abd All&#257;h bin &#703;Abd al-Ra&#7717;&#299;m al-Bukh&#257;r&#299;. And I say openly [in this gathering], I dictate it with my mouth that he [Shaykh &#703;Abd All&#257;h] is an &#703;All&#257;mah, he has striving-in nurturing the youth and beautiful authorships-that is to be thanked for. So I say, may All&#257;h bless you, spread this, this is permission from me to spread this.</blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168185>Shaykh Kh&#257;lid al-Dhufayr&#299;'s Refutation</a> with <a href=https://twitter.com/SunnahPubs/status/1097341226943164416>translation</a>.   <blockquote class='quote'><img src='../images/quote-start.gif'>Shaykh Kh&#257;lid: "We advise you to fear All&#257;h, to return back to the basins of the Sunnah, to respect its people, especially the major scholars and to abandon this &#7716;add&#257;d&#299; path of reviling the scholars, accusing them of innovation, Kh&#257;rijiyyah and deviation  from the Sunnah... Indeed you have surpassed the &#7716;add&#257;diyyah in their &#7716;add&#257;diyah and now stand in the rank of the people of innovation who wage war against Ahl al-Sunnah."</blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168187>Shaykh &#703;Arafat al-Mu&#7717;ammad&#299;'s Refutation</a>. Arabic.  <blockquote class='quote'><img src='../images/quote-start.gif'>Summary: He explains that this is not surprising, this was expected and it was only a matter of time before they state explicitly what they have been concealing. That their desire to bring down Shaykh &#703;Ubayd has been in effect for years and now they are targeting Shaykh Rab&#299;&#703;. Their tact was to say Shaykh &#703;Ubayd is being played with by &#703;Araf&#257;t and others and likewise Shaykh Rab&#299;&#703; is being played and used. The same with the Kuwait&#299;s and Riy&#257;d&#299;s (who are part of this network). May All&#257;h sever the tongue of this one who accuses Shaykh Rab&#299;&#703; with the manhaj of the Khaw&#257;rij and anyone who supports or defends him. Shaykh Rab&#299;&#703; has been so kind, benevolent and patient with them, he promoted them and let them speak in his house.  Now, they accuse him like this.</blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168188>Shaykh &#703;Abd al-&#703;Az&#299;z Sayr al-Mub&#257;rik&#299;'s Defence of Shaykh Rab&#299;&#703;</a>. Arabic.     <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Summary:  The accusation of Kh&#257;lid al-Mi&#7779;r&#299; against Shaykh Rab&#299;&#703; of deviating from the Sunnah and traversing the manhaj of the Kh&#257;rijites is refuted in short by saying that if returning to the scholars in naw&#257;zil is khur&#363;j (revolting against the rulers), then what exactly is the Salafi methodology in that case (in this affair). For it is known that those who are scholars in these affairs are consulted with and their verdicts are taken. He cites "<b>But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known about it</b>." (4:38). As is not hidden, those in authority are the scholars and the rulers, and those who derive rulings are the scholars. So if this is khur&#363;j in your view, and opposition to a foundation of the Sunnah and deviation from the Sunnah,then you explain to us what is the manhaj of the Salaf in these affairs. Rather, Shaykh Rab&#299;&#703; has not opposed the Sunnah or agreed with the manhaj of the Khaw&#257;rij. Rather, your way is the way of the Khaw&#257;rij, because of your revilement because this is from their way. You have resembled the &#7716;add&#257;diyyah in this revilement. It is upon you to repent from this evil and to abandon partisanship to individuals and to abandon haw&#257;. We request all people in <a href='../tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a> to explain the truth and to defend Shaykh Rab&#299;&#703;. </blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168191>Advice to Kh&#257;lild &#703;Abd al-Ra&#7717;m&#257;n by &#7716;asan al-Mard&#257;w&#299; al-&#703;Ir&#257;q&#299;</a>. Arabic.    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Summary:  Alludes to a good point in that Kh&#257;lid &#703;Abd al-Ra &#7717;m&#257;n and his likes have followed the way of media propagandists who used the Kh&#257;shogg&#299; affair to malign and attack the Saud&#299; State. What is being spread about Shaykh Rab&#299;&#703; is propaganda aimed at bringing him down. He also explains that the fat&#257;w&#257; of Shaykh Rab&#299;&#703; have always been against the Khaw&#257;rij and the prevention of fighting and spilling blood and against people like Mu&#7717;ammad &#7716;ass&#257;n, Salm&#257;n al-&#703;&#256;wdah and others who call to fighting,  dissension and sedition. He also says that accusing Shaykh Rab&#299;&#703; of "inhiraaf" (deviation from the Sunnah) is tantamount to tabd&#299;&#703;. </blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168192>Defence of Shaykh &#703;All&#257;mah Rab&#299;&#703; by Shaykh Niz&#257;r bin H&#257;shim</a>. Arabic.  <li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168203>Shaykh &#703;Abd All&#257;h al-Bukh&#257;r&#299;'s Refutation of Kh&#257;lid &#703;Abd al-Ra&#7717;m&#257;n al-Mi&#7779;r&#299;</a>. Arabic.     <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Summary: The Shaykh states that the fabrication, slander and humiliating ignorance [of Khalid al-Mi&#7779;r&#299;] of the foundations and principles of knowledge alongside his attack upon a major figure of the Sunnah has reached him, and that it is nothing but sophistry. Ibn Taymiyyah said in his refutation of al-Bakr&#299;: "There is no doubt that among people are those who use sophistry in some affairs, thereby rejecting the truth after it had become clear, or denying having knowledge of it, or affirming some parts of it exclusive to others, or making realities to conform to [pre-existing] beliefs, meaning what he [already] believes." The person who  behaves in this manner is to be treated in accordance with what the Im&#257;ms of the Sunnah have affirmed with respect to the one who reviles an Im&#257;m of the Sunnah. Mu&#7717;ammad bin Ibr&#257;h&#299;m al-Makhz&#363;m&#299; said: "When you see a man reviling A&#7717;mad bin &#7716;anbal, then know that he is an innovator", as occurs in Tahdh&#299;b al-Kam&#257;l of al-Mizz&#299;. </blockquote>    <P>
<li> <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=168209>Refutation of Kh&#257;lid al-Mi&#7779;r&#299; by Shaykh Ya&#7717;y&#257; al-Nah&#257;r&#299;</a>. Arabic.    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Summary:  After the tribulation of the creation of the Qur&#702;&#257;n, the scholars came to Im&#257;m A&#7717;mad to discuss and to consider revolting against the rulers, but he prohibited them and warned that the outcome would be the spilling of blood. And [in this respect] Shaykh Rab&#299;&#703; is among the first of those who exposed the Muslim <a href='../tags/brotherhood.html' class='tagLink'><font class='tagLink'>brotherhood</font></a>, the likes of Sayyid Qu&#7789;b [a caller to the manhaj of the Khaw&#257;rij]. The Shaykh refuted and exposed him and then the likes of this one [Kh&#257;lid &#703;Abd al-Ra&#7717;m&#257;n] comes along with this speech which is based on fabrications and the intent of which is to defame and revile Shaykh Rab&#299;&#703;. This ignoramus does not know that he and those who support him such as A&#7717;mad <a href='../tags/bazmul.html' class='tagLink'><font class='tagLink'>Bazmul</font></a> and others are the ones who specified enmity to Shaykh Rab&#299;&#703; and Shaykh &#703;Ubayd because these scholars exposed what they were upon, with respect to their errors. So then they gathered together, and likewise their outlets and channels, such as al-Nahj al-W&#257;&#7693;i&#7717;, with the aim of working against these scholars and in order to defend themselves. The Shaykh explains that the goal of all such people is to remove those scholars who are a barrier to them, so that they are then free to say and do as they please, so they can raise themselves.  He says that this plan is not something new, that was born afresh today, and Shaykh Rab&#299;&#703; is not the first to be targeted in this manner. The Shaykh warned against following such people, they are not upon the correct manhaj. They should be supporting these scholars and not supporting the opposers and revilers of the scholars. Those people who organised the <a href='../tags/demonstrations.html' class='tagLink'><font class='tagLink'>demonstrations</font></a> in Libya, when they did so, they spoke ill of Shaykh Rab&#299;&#703;. So this Kh&#257;lid &#703;Abd al-Ra&#7717;m&#257;n, A&#7717;mad <a href='../tags/bazmul.html' class='tagLink'><font class='tagLink'>Bazmul</font></a> and their likes, they are supporters--whether they realise or not--they are are supporters of certain factions in places like Libya whom Shaykh Rab&#299;&#703; has warned against. And this indicates what is in their hearts of hatred of Shaykh Rab&#299;&#703;. </blockquote>    <P>
<li> <b>Do You Not Have Any Intelligence O Kh&#257;lid al-Mi&#7779;r&#299;yy? </b><a href=../assets/docs/khalid-misree-02-no-aql.pdf>Download PDF (8 pages)</a>. An excellent rebuttal of Khalid al-Misri and the argument concerning "majaalis sirriyyah" (secret gatherings).    <P>
</ul>    <P>
   <P>

</div>
<br>


<hr size="1" noshade color="#cdcdcd">




<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.html\'>Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.manhaj.com/manhaj/articles/omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.manhaj.com/manhaj/?omtup'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="width:100%;max-width:450px;" value="<a href='omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.html'>Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood</a>" onFocus="this.select()" onClick="this.select()"></form>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.html">Revilement of the Misguided Liar Khalid Abd al-Rahman al-Misri Upon Shaykh Rabi and Refutation of His Falsehood</a>

</ul>

</div>

<font class="smallHeadline">Add a Comment</font> (comments are currently moderated)
<br>






You must be registered and logged in to comment.



							
							<br>
							<br>
							<br>
						</td>
					</tr>
				</table>
			</div>
		</div>
		
		<div>
			
    <div style="background-color:#FFFFFF;padding-top:16px;">
        <div style="background-color:#666666;">

            <br>
            
                <div class="textsmall" style="color:#ffffff;" align="center">ý Manhaj.Com. All rights reserved.<BR>

</div>
            
            <div style="font-size:12px;padding-left:5px;" align="center"><a href="http://www.learnarabic.com/?n=41" target="_top">Gender of Arabic Nouns</a> </div>
            <br>
        </div>
        <div style="background-color:#FF9900;height:4px;width:100%;"></div>
    </div>
    <br>
    <br>
    <br>

		</div>
	</div>

</body>

<!-- Mirrored from www.manhaj.com/manhaj/articles/omtup-revilement-of-the-misguided-liar-khalid-abd-al-rahman-al-misri-upon-shaykh-rabi.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 09:44:11 GMT -->
</html>
