

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.manhaj.com/manhaj/articles/uyryh-documents-and-resources-for-countering-and-exposing-the-musafiqah.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 09:44:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah</title>
	
	
	<meta name="Keywords" content="">
	<meta name="Description" content="Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah.  ...">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	
    <link rel="STYLESHEET" type="text/css" href="../scripts/bootstrap.min.css">
    <script src="../scripts/bootstrap.min.js"></script>
    <link rel="STYLESHEET" type="text/css" href="../style.css">
    <link rel="STYLESHEET" type="text/css" href="../scripts/custom.css">
    
</head>

<body>


	<div class="container">

		<div>
			

  <div class="d-flex flex-wrap align-items-center textSmall pb-2 pt-3 px-1">
    <div class="d-flex flex-wrap align-items-center w-full md:w-auto">
      
    </div>
    <div class="d-flex align-items-center pt-2 pt-md-0 justify-content-start justify-content-lg-end w-full md:w-auto ms-md-auto">
      <span>Monday, 11 August 2025&nbsp;&nbsp;&nbsp;</span>
      <a href="../index.html">Home</a> &nbsp;&#149;&nbsp; 
      <a href="../about.html">About Us</a> &nbsp;&#149;&nbsp;  
      
      <a href="../contact.html">Contact Us</a> 
    </div>
  </div>



  <div>
    <img src="../images/banner.gif" width="100%" height="auto" border="0" alt="">
  </div>







<nav class="navbar navbar-expand-lg navbar-light bg-light">
  <div class="container-fluid">
    <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarNav" aria-controls="navbarNav" aria-expanded="false" aria-label="Toggle navigation">
      <span class="navbar-toggler-icon">
        <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 30 30'><path stroke='#FFFFFF' stroke-linecap='round' stroke-miterlimit='10' stroke-width='2' d='M4 7h22M4 15h22M4 23h22'/></svg>
      </span>
    </button>
    <div class="collapse navbar-collapse" id="navbarNav">
      <ul class="navbar-nav pt-2 pt-lg-0 me-auto">
        <li class="nav-item">
          <a class="nav-link" href="../index.html">HOME</a>
        </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/basics.html">BASICS</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/salafiyyah.html">SALAFIYYAH</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/dawah.html">DA'WAH</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/groups.html">SECTS & GROUPS</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/rulership.html">RULERSHIP</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/articles.html">GENERAL</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/jarh--tadeel.html">JARH & TA'DEEL</a>
            </li>
        
            <li class="nav-item">
              <a class="nav-link" href="../categories/more-topics.html">MORE TOPICS >></a>
            </li>
        
        <li class="nav-item">
          <a class="nav-link" href="../reports.html">REPORTS</a>
        </li>
	    </ul>
      <ul class="navbar-nav">
        <li class="nav-item"><a class="nav-link" href="../rss.html">RSS</a></li>
        <li class="nav-item"><a class="nav-link" href="../tags.html">TAGS</a></li>
        <li class="nav-item"><a class="nav-link" href="../search.html">SEARCH</a></li>
        
          <li class="nav-item lg:ms-auto"><a class="nav-link" href="../signin.html">LOGIN</a></li>
        
      </ul>
    </div>
  </div>
</nav>



		</div>
	  
		 

		<div class="d-flex flex-column flex-lg-row bg-white pt-3">
			<div class="px-3 w-full">
				<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
					<tr>
						<td valign="top">
							<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
								<tr>
									
										<td valign="top" width="100%">
											<span class="articleTitle">Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah</span><BR>
											Filed under: <a href="../categories/articles.html">General</a><BR>
											Saturday, March 24 2018 - by <a href="../authors/Admin.html">Admin</a>
											<BR>
											Key topics: 
											
										</td>
									
								</tr>
							</table>
							<hr size="1" noshade style="margin-top:12" color="#cdcdcd">
							<a href="mailto:Enter_Email?subject=Manhaj.Com | Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah&body=You may be interested in this article:%0D%0A%0D%0ADocuments and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah%0D%0Ahttps://www.manhaj.com/manhaj/?uyryh">Mail to a Friend</a> &#149;
							<a href="../print52fb.html?uyryh">Printer friendly</a> 
							
							<br><br>
							
							
<div class="articleContent">


<div class="articleContent">
<div style="padding:20px">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b>Shaykh Rab&#299;&#703;'s Reading of His Treatise on Mending Relationships in the Presence of Shaykh &#7716;assan bin &#703;Abd al-Wahh&#257;b al-Bann&#257; and Comments on Fitnah of Mu&#7717;ammad bin H&#257;d&#299; (Audio).   <a href=../assets/audio/rabee-hasan-meeting-2019-03.mp3>Listen to MP3 Recording</a>    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b>The Types of People in the Fitnah of Mu&#7717;ammad bin H&#257;d&#299;  <a href=../assets/docs/types-of-people-mbh-fitnah.pdf>Download PDF</a>.    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> Statement of Shaykh &#703;Al&#299; al-Wa&#7779;&#299;f&#299; and Shaykh &#7716;asan bin &#703;Abd al-Wahh&#257;b al-Bann&#257; Regarding the Fitnah and <a href='../tags/ghuluww.html' class='tagLink'><font class='tagLink'>Ghuluww</font></a> of Mu&#7717;ammad bin H&#257;d&#299; (12 page PDF). Summary translation in English to follow insh&#257;&#702;All&#257;h.   <a href=../assets/docs/waseefee-bannaa-mbh-fitnah.pdf>Download PDF</a>.  Translated excerpts: <a href=../assets/docs/waseefee-bannaa-mbh-01.pdf>Part 1</a>, <a href=../assets/docs/waseefee-bannaa-mbh-02.pdf>Part 2</a>, <a href=../assets/docs/waseefee-bannaa-mbh-03.pdf>Part 3</a>, <a href=../assets/docs/waseefee-bannaa-mbh-04.pdf>Part 4</a>.  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> Update on the Blind-Following Mu&#7779;a&#703;fiqah and Their Deceptive Tactics  <a href=../assets/docs/rabee-11-mbh-evidence-bankrupt.pdf>Download PDF</a>.    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> Mu&#7717;ammad bin H&#257;d&#299;'s Oppressive Tabd&#299;&#703; of Salaf&#299;s and Revilement of Shaykh Rab&#299;&#703;, Accusing Him of Ignorance or Following Desires  <a href=../assets/docs/mbh-tabdee-mulhaqoon.pdf>Download PDF</a>.    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> The Statements and Rulings of Shaykh, &#703;All&#257;mah Rab&#299;&#703; Upon Mu&#7717;ammad bin H&#257;d&#299; and his Blind-Followers.  <a href=../assets/docs/rabee-06-mbh-disparagements.pdf>Download PDF</a>.    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> Lessons From the Ibrah&#299;m al-Ru&#7717;ayl&#299; Affair: The Difference Between Knowledge Based <a href='../tags/refutations.html' class='tagLink'><font class='tagLink'>refutations</font></a> With Evidence and Fiery, Emotional Babble (&#1579;&#1585;&#1579;&#1585;&#1577;) -- The Criminal Court Ruling Against Mu&#7717;ammad bin H&#257;d&#299; in 2015  <a href=../assets/docs/rabee-05-mbh-ruhayli.pdf>Download PDF</a>.    </span>  <hr size="1">  </span>  <span style="font-size:25px;line-height:33px;"><b>NEW:</b> Shaykh Rab&#299;&#703; Said That the Fitnah of Mu&#7717;ammad Ibn H&#257;d&#299; is More Severe than that of &#703;Abd al-Ra&#7717;m&#257;n &#703;Abd al-K&#7717;&#257;liq, (Egyptian Ikhw&#257;n&#299;).  <a href=../assets/docs/rabee-02-mbh-evidences.pdf>Download PDF</a>.    </span>  <hr size="1">  <span style="font-size:25px;line-height:33px;"><b>NEW:</b>Shaykh, &#703;All&#257;mah, Im&#257;m Rab&#299;&#703; bin H&#257;d&#299; on the Fencesitters in Canada in the Fitnah of Mu&#7717;ammad bin H&#257;d&#299; and His Supporters Who Are Working to Split the Da&#703;wah and Divide Communities. <a href=../assets/docs/rabee-04-mbh-canada.pdf>Download PDF</a>.    </span>  </div>    <P>
<div class='sidebar'><blockquote><img src=../assets/images/protocols-musafiqah.png align="right" width="400" style="margin-left:15px;" border=0><font style='font-size:19px;line-height:27px;'>The <b>Mu&#7779;a&#703;fiqah</b> are a group of "oppressive" and ignorant "blind-followers" who accept <b>tabd&#299;&#703;</b> (declaring someone an innovator), <b>ta&#7693;l&#299;l</b> (declaring someone misguided in religion) and <b>tajd&#299;&#703;</b> (amputation, isolation, cutting off people from the body of Ahl al-Sunnah) of well-known students of knowledge and shaykhs <b>without evidence <u>that warrants</u> such extreme, harsh and mighty judgements</b>. The alleged, perceived or actual errors found with them do not justify this <a href='../tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a>. Read this last sentence again three times and you will have grasped the entire issue, and you will be able to see through all the doubts and alleged evidences of the Mu&#7779;a&#703;fiqah. They let loose in early to mid-2017 and the Major Scholars have stood to curb their evil and reject their <a href='../tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> and transgression.     <P>
On this page are some useful resources that have been prepared which may come in use if you encounter the Mu&#7779;a&#703;fiqah-&#7778;a&#703;&#257;fiqah. They are oppressive blind-followers who think they are treating a disease, not realising that <b>they are the disease itself</b>. Just like the followers of al-Ma&#703;rib&#299;, al-&#7716;arb&#299;, al-&#7716;&#257;j&#363;r&#299; before them, they are bringing the same doubts and accusations of "taql&#299;d" of certain scholars and "<a href="../tags/ghuluww.html" class="tagLink"><font class="tagLink">Ghuluww</font></a>" in them. This is after it has become clear that they have zero evidence for the tabd&#299;&#703;, ta&#7693;l&#299;l and tajd&#299;&#703; that they blindly followed others in.     <P>
The quickest and most effective way to stop them dead in their tracks is to demand them to provide the evidences which prove that those whom they disparage are:    <P>
<ul><li> <a href='../tags/innovators.html' class='tagLink'><font class='tagLink'>Innovators</font></a>, people of desires (as tabd&#299;&#703; has been made of them),   <li>Misguided in the foundations (u&#7779;&#363;l) of their religion (as ta&#7693;l&#299;l has been made of them) and   <li> To be boycotted (as tajd&#299;&#703; has been made of them). </ul>    <P>
You will note that they will bring alleged, perceived or actual mistakes.  However there is nothing within them that justifies the above three affairs (tabd&#299;&#703;, ta&#7693;l&#299;l and tajd&#299;&#703;). This is because when someone from Ahl al-Sunnah errs, then he is dealt with in a certain way, in which his honour and standing is preserved. He is not warned against, ridiculed and abused. As for what has been done by the Mu&#7779;a&#703;fiqah and their leaders, then it is <a href='../tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> and injustice, and it is a manifestation of the manhaj of the <a href='../tags/haddaadiyyah.html' class='tagLink'><font class='tagLink'>Haddaadiyyah</font></a>, in fact worse than it for reasons that will become apparent. They are unable to bring any evidence that those whom they attack and revile have opposed an a&#7779;l from the u&#7779;&#363;l of Ahl al-Sunnah, were advised, corrected, had the proof established upon them, and then persisted upon falsehood, such that they should be given such harsh treatment involving these oppressive judgements. And this is besides the turmoil this <a href='../tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> has brought to the da'wah in many parts across the world.    <P>
Their primary targets are Shaykh Rab&#299;&#703; bin H&#257;d&#299; and Shaykh &#703;Ubayd al-J&#257;bir&#299;, however their attacks against these shaykhs are by-proxy only at the moment [meaning, indirect], in that they target the students of these shaykhs and anyone who does not blindly follow them in their unjust disparagements. It won't be long before their attacks are bolder and more direct. As it stands their insinuations are already clear: Shaykh Rab&#299;&#703; is old, he is ill, he is surrounded by an evil inner circle, he is dictated to, led along by others (like an animal is led to water) and so on. Some of these are things which have been heard in previous fitnahs when those who deviated were devoid of evidences for the falsehood they were upon.    <P>
Shaykh Rab&#299;&#703; exposed the first &#7716;add&#257;diyyah and refuted their doubts over 20 years ago. From them Ma&#7717;m&#363;d al-&#7716;add&#257;d, and then &#703;Abd al-La&#7789;&#299;f B&#257;shm&#299;l. Then he refuted the likes of F&#257;li&#7717; al-&#7716;arb&#299; and then after him, Ya&#7717;y&#257; al-&#7716;&#257;j&#363;r&#299;. It is strange that the Mu&#7779;a&#703;fiqah take all of these <a href='../tags/refutations.html' class='tagLink'><font class='tagLink'>refutations</font></a> with acceptance, but now all of a sudden--when the Shaykh has pointed out yet another manifestation of &#7716;add&#257;diyyah against Salaf&#299;s--the Shaykh has become old and ill and is led and dictated to by others. These are all revilements in reality, and these people are simply following the same path as the followers of those aforementioned figureheads.   </font>  </blockquote>  </div>    <P>
<style>  * {box-sizing: border-box;}  /* Create three unequal columns that floats next to each other */  .column {float: left; padding: 10px; vertical-align:top;}  .leftout, .leftin, .rightin, .rightout {width: 25%;}  /* Clear floats after the columns */  .row:after {content: "";display: table;clear: both;}  .box {border: 1px solid black; width: 230px; display:inline-block;}  .boxred {border: 2px solid red; width: 230px; display:inline-block;}  .head{background-color:#e7edf9;display:inline-block;padding:8px;font-weight:bold;width:100%;}  .desc {background-color:#ffffff;display:inline-block;padding:8px;}  </style>    <P>
<div style="padding:20px">  <span style="font-size:25px;line-height:33px;">NEW: Questions of Some Students of Knowledge from J&#257;z&#257;n to Shaykh, &#703;All&#257;mah Rab&#299;&#703; bin H&#257;d&#299; (9th of Rama&#7693;&#257;n of the year 1439H) and   <a href=../assets/docs/qa-jazan-rabee-musafiqah.pdf>Arabic</a> and  <a href=../assets/docs/qa-jazan-rabee-musafiqah-trans.pdf>English Translation</a>.  Mu&#7717;ammad bin H&#257;d&#299; is "more severe than the &#7716;add&#257;diyyah" and his followers "defend falsehood and are not to be sat with".</span>  </div>    <P>
<div class="row">  <div class="column leftout">  <span class="box">  <span class="head">  <a href=../assets/docs/rabee-wisdom.pdf>Why Shaykh Rab&#299; bin &#7716;&#257;d&#299; is an Insightful Im&#257;m Given Tawf&#299;q in Speaking With Truth and Wisdom</a></span>  <span class="desc">  Parts 1-5 (16 page PDF). Extremely important lessons as to how to deal with those who err and deviate in a manner that comprises wisdom and foresight.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/docs/rabee-exposes-oppressors.pdf>Exposition of the Oppressors</a>    </span>  <span class="desc"> 7 page PDF.   How Shaykh Rab&#299;&#703;'s statements have led to the exposure of the blind-following liars and oppressors.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../indexbcb3.html?mnekq>Message of Advice from al-All&#257;mah Rab&#299; bin H&#257;d&#299; al-Madkhal&#299; to &#703;Abd al-Ra&#7717;m&#257;n al-&#703;Umays&#257;n</a>  </span>  <span class="desc">  Includes a Response to a Doubt Regarding the Bay&#257;n of Maktabah <a href='../tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a>.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/audio/naharee-rabee-mbh.mp3>Al-All&#257;mah Rab&#299; bin H&#257;d&#299; al-Madkhal&#299;: Mu&#7717;ammad bin H&#257;d&#299;'s path is more severe than that of the <a href="../tags/haddaadiyah.html" class="tagLink"><font class="tagLink">Haddaadiyah</font></a></a>  </span>  <span class="desc">  An audio from Shaykh Ya&#7717;y&#257; al-Nah&#257;r&#299; (student of Shaykh A&#7717;mad al-Najm&#299;),  who narrates from Shaykh Rab&#299;&#702; that Mu&#7717;ammad bin H&#257;d&#299;'s path is more severe than that of the &#7716;add&#257;diyyah and that he has harmed <a href='../tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> and caused splits all across the world.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/docs/mbh-wala-abu-rayhana.pdf>Personal Loyalty with Mu&#7717;ammad bin H&#257;d&#299;</a>   </span>  <span class="desc">44 page PDF. A former student of Mu&#7717;ammad bin H&#257;d&#299; provides compelling evidences to show that Mu&#7717;ammad bin H&#257;d&#299;'s wal&#257;&#702; (loyalty) is based around personal reasons and not upon uniform, consistent foundations and principles.   </span>  </span>  </div>    <P>
<div class="column leftin">  <span class="boxred">  <span class="head">  <a href=../assets/docs/tunisian-qa-rabee.pdf>Questions and Answers with Shaykh Rab&#299; Regarding the "&#7778;a&#703;&#257;fiqah" Label</a>  </span>  <span class="desc">10 page PDF.   Meeting with Tunisians on 29 Jumada al-Ula 1439H. Shaykh Rab&#299;&#703; explains that those who blindly  follow Shaykh Mu&#7717;ammad bin H&#257;d&#299; have not been nurtured upon the books of Im&#257;m A&#7717;mad nor Ibn Taymiyyah (due to their ta&#703;a&#7779;&#7779;ub and taql&#299;d).  </span>  </span>    <P>
<span class="boxred">  <span class="head">  Al-All&#257;mah Shaykh Rab&#299;&#703;: Mu&#7717;ammad bin H&#257;d&#299; is affected by Ahl al-Bid&#703;ah, wages war against Salaf&#299;s and causes splits all across the world:   </span>  <span class="desc">Relates from the Shaykh that those who make false accusations and blindly-follow in the affair of Mu&#7717;ammad bin H&#257;d&#299; should be labelled "&#7778;a&#703;&#257;fiqah". Read:  <a href=../assets/images/rabee-on-mbh-A-01.png>Page 1</a>, <a href=../assets/images/rabee-on-mbh-A-02.png>Page 2</a>, <a href=../assets/images/rabee-on-mbh-A-03.png>Page 3</a> and <a href=../assets/docs/rabee-mbh-ahlal-ahwaa.pdf>English translation</a>.  </span>  </span>    <P>
<span class="boxred">  <span class="head">  <a href=../assets/docs/rabee-mbh-akhassu-haddaadiyah.pdf>Al-All&#257;mah Shaykh Rab&#299;&#703;: The path of Mu&#7717;ammad bin H&#257;d&#299; is more vile than that of the Haddaadites</a>  </span>  <span class="desc">From a gathering of some Tunisian students of knowledge on 9th night of Ramadan 1439H.   </span>  </span>    <P>
<span class="boxred">  <span class="head">  NEW: Questions of Some Students of Knowledge from J&#257;z&#257;n to Shaykh, &#703;All&#257;mah Rab&#299;&#703; bin H&#257;d&#299; (23rd of Rama&#7693;&#257;n of the year 1439H).   </span>  <span class="desc"><a href=../assets/docs/qa-jazan-rabee-musafiqah.pdf>Arabic</a> and  <a href=../assets/docs/qa-jazan-rabee-musafiqah-trans.pdf>English Translation</a>. Mu&#7717;ammad bin H&#257;d&#299; is "more severe than the &#7716;add&#257;diyyah" and his followers "defend falsehood and are not to be sat with".  </span>  </span>    <P>
<span class="boxred">  <span class="head">  Shaykh Rab&#299;&#703; bin H&#257;d&#299; Said That the Fitnah of Ibn H&#257;d&#299; is More Severe than that of &#703;Abd al-Ra&#7717;m&#257;n &#703;Abd al-K&#7717;&#257;liq, (the Egyptian Ikhw&#257;n&#299;).  </span>  <span class="desc">  The Shaykh explains that the fitnah of Mu&#7717;ammad bin H&#257;d&#299; is ?more severe than that of &#703;Abd  al-Ra&#7717;m&#257;n &#703;Abd al-Kh&#257;liq? because it has covered the whole world and caused splits everywhere. <a href=../assets/docs/rabee-02-mbh-evidences.pdf>Downlad PDF</a> .  </span>  </span>    <P>
</div>    <P>
<div class="column rightin">  <span class="box">  <span class="head">  <a href=../assets/docs/musafiqah-doubts.pdf>A Refutation of the Doubts of the Mu&#7779;a&#703;fiqah</a>  </span>  <span class="desc">  <b>Contextual Background</b> 28 page PDF which exposes the nature and reality of this fitnah. The alleged, perceived, or actual mistakes of Salafi students of knowledge which can be treated with patience and wisdom do not justify unwarranted, hasty, extreme judgements of tabd&#299;&#703;, ta&#7693;l&#299;l and tajd&#299;&#703; (cutting off) as this amounts to dhulm and will lead to splitting and emergence of tribulations.   </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/images/rabee-on-mbh-B.png>Al-All&#257;mah Shaykh Rab&#299;&#703;: There are evidences which I have not seen, neither has Mu&#7717;ammad bin H&#257;d&#299;, and nor anyone else</a>  </span>  <span class="desc">  A report from a sitting in which Shaykh Rab&#299;&#703; once more dissmisses the alleged evidences of Shaykh Mu&#7717;ammad bin H&#257;d&#299;.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/docs/safuq-dhulm.pdf>Invitation to the Mu&#7779;a&#703;fiqah to Make Tawbah</a>  </span>  <span class="desc">9 page PDF.   Those Who Spread False Speech, False Witness, Name-calling and Reviling.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/docs/qadhf-four-witnesses-lying.pdf>Ibn Al-Qayyim: The One Who Makes The Accusation Of Zin&#257; And Does Not Bring Four Witnesses, Even If His Report Is True To The Facts,  Then He Is A Liar In The Sight Of All&#257;h</a>  </span>  <span class="desc">An important quote from Ibn al-Qayyim regarding the judgement upon the one who reports observing an act of zin&#257; but does not bring four witnesses to ascertain his claim.   </span>  </span>    <P>
<span class="boxred">  <span class="head">  NEW: Shaykh &#703;Ubayd al-J&#257;bir&#299; Warns from Attending [the Gatherings] of Mu&#7717;ammad bin H&#257;d&#299;.  </span>  <span class="desc"> Shaykh &#703;Ubayd warns from attending his gatherings and states he has committed a crime against <a href='../tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> and has been put to trial with desire for leadership.  <a href=https://www.sahab.net/forums/index.php?app=forums&amp;module=forums&amp;controller=topic&amp;id=167099>View on Sahab.Net</a>, or <a href=../assets/images/ubayd-01-warn-gatherings-mbh-b.png>here</a>. <a href=../assets/images/ubayd-01-warn-gatherings-mbh-a.png>English Translation</a>  </span>  </span>    <P>
    <P>
</div>    <P>
<div class="column rightout">  <span class="box">  <span class="head">  <a href=../assets/images/shk-rabee-no-daleel-saafiqah-01.jpg>Shaykh Rab&#299; bin &#7716;&#257;d&#299; Refutes the Claim that He Did not Understand the Evidence</a>.  </span>  <span class="desc">  A statement [in Arabic] related from Shaykh Rab&#299; regarding the claim that he did not understand the evidences that were presented to him against the so-called "&#7778;a&#703;&#257;fiqah".  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/images/protocols-musafiqah.png>Protocols of the Blind-Following Mu&#7779;a&#703;fiqah</a>.  </span>  <span class="desc">  An explanation of how the Mu&#7779;a&#703;fiqah operate in accusing others falsely and then retreating when unable to provide evidence.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/audio/ubayd-letter-algeria.mp3>Shaykh &#703;Ubayd al-J&#257;bir&#299;'s Advice to Ferkous, Snaiqrah and Jum&#363;&#703;ah</a> (MP3)  </span>  <span class="desc">  The Shaykh advises and cautions some of the Shaykhs in Algeria caught up in the fitnah of labelling others as "&#7778;a&#703;&#257;fiqah" and invites them to rectify the affairs and not harm the Salaf&#299; da&#703;wah. Read <a href=../assets/images/ubayd-letter-algeria-b.png>Page 1</a>,  <a href=../assets/images/ubayd-letter-algeria-a.png>Page 2</a>.  </span>  </span>    <P>
<span class="box">  <span class="head">  <a href=../assets/docs/muhannad-mbh-evidence-arabic.pdf>Observations on Dr. Mu&#7717;ammad bin H&#257;d&#299;'s Evidences</a>.  </span>  <span class="desc">  A response that was requested by Shaykh Rab&#299;&#703; which addresses the nature of the alleged evidences of Mu&#7717;ammad bin H&#257;d&#299;. <a href=../assets/docs/muhannad-mbh-evidence.pdf>English Translation</a>  </span>  </span>    <P>
<span class="boxred">  <span class="head">  <a href=../assets/docs/rabee-01-comments-revilements-mbh.pdf>Shaykh Rab&#299;&#703; bin H&#257;d&#299;: Comments on the Revilements of Shaykh Mu&#7717;ammad bin H&#257;d&#299; Against People Who Are Innocent of What He Described Them With</a>  </span>  <span class="desc">  Shaykh Rab&#299;&#703; openly requests Mu&#7717;ammad bin H&#257;d&#299; to provide evidence for his harsh judgements upon Salafi students and shaykhs. <a href=../assets/docs/rabee-01-comments-revilements-mbh-summary.pdf>Summary of the document in English</a>.  </span>  </span>    <P>
</div  </div>    <P>
   <P>

</div>
<br>


<hr size="1" noshade color="#cdcdcd">




<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'uyryh-documents-and-resources-for-countering-and-exposing-the-musafiqah.html\'>Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.manhaj.com/manhaj/articles/uyryh-documents-and-resources-for-countering-and-exposing-the-musafiqah.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='https://www.manhaj.com/manhaj/?uyryh'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="width:100%;max-width:450px;" value="<a href='uyryh-documents-and-resources-for-countering-and-exposing-the-musafiqah.html'>Documents and Resources for Countering the Doubts of the Mu&#7779;a&#703;fiqah</a>" onFocus="this.select()" onClick="this.select()"></form>



<span class="smallHeadline">Related Articles:</span><BR>

</div>

<font class="smallHeadline">Add a Comment</font> (comments are currently moderated)
<br>






You must be registered and logged in to comment.



							
							<br>
							<br>
							<br>
						</td>
					</tr>
				</table>
			</div>
		</div>
		
		<div>
			
    <div style="background-color:#FFFFFF;padding-top:16px;">
        <div style="background-color:#666666;">

            <br>
            
                <div class="textsmall" style="color:#ffffff;" align="center">ý Manhaj.Com. All rights reserved.<BR>

</div>
            
            <div style="font-size:12px;padding-left:5px;" align="center"><a href="http://www.learnarabic.com/profile/?iqrahiqrah" target="_top">LearnArabic.Com</a> </div>
            <br>
        </div>
        <div style="background-color:#FF9900;height:4px;width:100%;"></div>
    </div>
    <br>
    <br>
    <br>

		</div>
	</div>

</body>

<!-- Mirrored from www.manhaj.com/manhaj/articles/uyryh-documents-and-resources-for-countering-and-exposing-the-musafiqah.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 09:59:21 GMT -->
</html>
