

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.bidah.com/print.cfm?rouuz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:17:40 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Bidah.Com | Refuting the Notion of Bid'ah Hasanah (Good Innovation) in Worship: Part 3 - the Statements of Imaam Al-Shafi'i</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/bidah/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Bidah.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Refuting the Notion of Bid'ah Hasanah (Good Innovation) in Worship: Part 3 - the Statements of Imaam Al-Shafi'i</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, July, 13 2011 and
 filed under <a href="categories/iq-bidah-hasanah.html">Bidah Hasanah</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/bidah-hasanah.html">
Bidah Hasanah 
</a> &#149; <a href="tags/good-innovation.html">
Good Innovation 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><div align=center><img src=assets/sysimages/aal-hamd.gif width="100%" style="max-width:446px;" border=0></div>    <P>
<div class='sidebar'>It is essential that you have read both <a href=indexadb8.html?ezaqa>Part 1</a> and <a href=index7350.html?uvlmw>Part 2</a> of this series. Also useful is the <a href=indexea20.html?muagm>definition of bid'ah</a> and understanding that it is of two types (haqiqiyyah and idafiyyah) from the angle of how it relates to <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> evidences (see <a href=indexab0d.html?hwnvg>this article</a>, and <a href=index5fc3.html?agquf>this one</a>). </div>    <P>
We have to understand that there are two orientations as it relates to how bidah is defined and how bidah is defined will affect the nature of any scholars' speech on the subject.  As for the first orientation then they use the word bidah (<span class='arb' lang='AR-SA'>&#1576;&#1583;&#1593;&#1577;</span>) to refer to every newly-arising thing which is not found in the Book and the Sunnah, irrespective of whether it relates to worship (ibaadah) or custom (aadah) and regardless of whether it is praiseworthy or blameworthy. This understanding and usage of the term bidah is known from Imam <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> and his followers were influenced in this such as <a href='tags/al-izz-bin-abd-al-salam.html' class='tagLink'><font class='tagLink'>al-Izz bin Abd al-Salam</font></a>, <a href='tags/al-nawawi.html' class='tagLink'><font class='tagLink'>al-Nawawi</font></a>, Abu Shaamah, and likewise from the <a href='tags/malikis.html' class='tagLink'><font class='tagLink'>Malikis</font></a>, al-Qarafi and al-Zarqani, and from the Hanafis Ibn Abideen, and from the Hanbalis, Ibn al-Jawzi. The other orientation is the one which states that bidah (<span class='arb' lang='AR-SA'>&#1576;&#1583;&#1593;&#1577;</span>) is applied only to  religious matters and thus it can only ever be blameworthy and evil, and in this they are applying the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> meaning for the word bidah.    <P>
<font class='titleHeadline'>The Statements of Imaam <a href="tags/al-shafii.html" class="tagLink"><font class="tagLink">al-Shafi'i</font></a></font>    <P>
<div class='sidebar'><img src=assets/images/warning-sign.gif align=left border=0><b>Deception Alert:</b> The <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> present the statements of some of these scholars like <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> and <a href='tags/al-izz-bin-abd-al-salam.html' class='tagLink'><font class='tagLink'>al-Izz bin Abd al-Salam</font></a> to the people by citing them through <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> al-Asqalani's citation of them in Fath al-Bari (Kitab al-Tawhid), and they have a particular deceptive purpose in mind for this: To make it look as if <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> al-Asqalani's view is one of total corroboration and acceptance, despite the fact that when we see the entire section, we see <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> al-Asqalani's clarification of the matter shows that his view and definition of bidah (as defined by the Shariah) is one that agrees with that of <a href='tags/al-shatibi.html' class='tagLink'><font class='tagLink'>al-Shatibi</font></a> and that of the Salaf in general. This will be covered in a separate subsequent part in this series inshaa'Allaah.</div>    <P>
Al-Bayhaqi, <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> and <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-taymiyyah-ik.html" class="tagLink"><font class="tagLink">Ibn Taymiyyah</font></a></font></a> (and others) have cited the statements of <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a>, so we can document them here for the record. Al-Bayhaqi relates in Manaqib <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> (1/469) with his isnad that Imam <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> said:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1575;&#1604;&#1605;&#1581;&#1583;&#1579;&#1575;&#1578; &#1605;&#1606; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1590;&#1585;&#1576;&#1575;&#1606;: &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1605;&#1575; &#1571;&#1581;&#1583;&#1579; &#1605;&#1605;&#1575; &#1610;&#1582;&#1575;&#1604;&#1601; &#1603;&#1578;&#1575;&#1576;&#1575; &#1571;&#1608; &#1587;&#1606;&#1577; &#1571;&#1608; &#1571;&#1579;&#1585;&#1575; &#1571;&#1608; &#1573;&#1580;&#1605;&#1575;&#1593;&#1575;&#1548; &#1601;&#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1575;&#1604;&#1590;&#1604;&#1575;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577;: &#1605;&#1575; &#1571;&#1581;&#1583;&#1579; &#1605;&#1606; &#1575;&#1604;&#1582;&#1610;&#1585; &#1604;&#1575; &#1582;&#1604;&#1575;&#1601; &#1601;&#1610;&#1607; &#1604;&#1608;&#1575;&#1581;&#1583; &#1605;&#1606; &#1607;&#1584;&#1575;&#1548; &#1608;&#1607;&#1584;&#1607; &#1605;&#1581;&#1583;&#1579;&#1577; &#1594;&#1610;&#1585; &#1605;&#1584;&#1605;&#1608;&#1605;&#1577;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The newly-invented matters are of two types: The first of them is that which has been introduced from that which opposes [something from] the book, or [something from] the sunnah, or a narration, or [a matter of] consensus. This is the misguided <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a>. And the second is that which has been introduced of goodness and there is no opposition to anyone of these things [qur'an, sunnah, athar, ijmaa']. This is the newly-invented matter which is not blameworthy.</blockquote>    <P>
Ibn Hajar also mentions it in al-Fath (Maktabah <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> edition, 13/253):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1602;&#1575;&#1604; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; "&#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1576;&#1583;&#1593;&#1578;&#1575;&#1606;: &#1605;&#1581;&#1605;&#1608;&#1583;&#1577; &#1608;&#1605;&#1584;&#1605;&#1608;&#1605;&#1577;&#1548; &#1601;&#1605;&#1575; &#1608;&#1575;&#1601;&#1602; &#1575;&#1604;&#1587;&#1606;&#1577; &#1601;&#1607;&#1608; &#1605;&#1581;&#1605;&#1608;&#1583; &#1608;&#1605;&#1575; &#1582;&#1575;&#1604;&#1601;&#1607;&#1575; &#1601;&#1607;&#1608; &#1605;&#1584;&#1605;&#1608;&#1605;" &#1571;&#1582;&#1585;&#1580;&#1607; &#1571;&#1576;&#1608; &#1606;&#1593;&#1610;&#1605; &#1576;&#1605;&#1593;&#1606;&#1575;&#1607; &#1605;&#1606; &#1591;&#1585;&#1610;&#1602; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1576;&#1606; &#1575;&#1604;&#1580;&#1606;&#1610;&#1583; &#1593;&#1606; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610;&#1548; &#1608;&#1580;&#1575;&#1569; &#1593;&#1606; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1571;&#1610;&#1590;&#1575; &#1605;&#1575; &#1571;&#1582;&#1585;&#1580;&#1607; &#1575;&#1604;&#1576;&#1610;&#1607;&#1602;&#1610; &#1601;&#1610; &#1605;&#1606;&#1575;&#1602;&#1576;&#1607; &#1602;&#1575;&#1604; "&#1575;&#1604;&#1605;&#1581;&#1583;&#1579;&#1575;&#1578; &#1590;&#1585;&#1576;&#1575;&#1606; &#1605;&#1575; &#1571;&#1581;&#1583;&#1579; &#1610;&#1582;&#1575;&#1604;&#1601; &#1603;&#1578;&#1575;&#1576;&#1575; &#1571;&#1608; &#1587;&#1606;&#1577; &#1571;&#1608; &#1571;&#1579;&#1585;&#1575; &#1571;&#1608; &#1573;&#1580;&#1605;&#1575;&#1593;&#1575; &#1601;&#1607;&#1584;&#1607; &#1576;&#1583;&#1593;&#1577; &#1575;&#1604;&#1590;&#1604;&#1575;&#1604;&#1548; &#1608;&#1605;&#1575; &#1571;&#1581;&#1583;&#1579; &#1605;&#1606; &#1575;&#1604;&#1582;&#1610;&#1585; &#1604;&#1575; &#1610;&#1582;&#1575;&#1604;&#1601; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1584;&#1604;&#1603; &#1601;&#1607;&#1584;&#1607; &#1605;&#1581;&#1583;&#1579;&#1577; &#1594;&#1610;&#1585; &#1605;&#1584;&#1605;&#1608;&#1605;&#1577;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Al-Shafi'i said:<blockquote>Bidah is of two types: praiseworthy and blameworthy. Whatever is in agreemenet with the Sunnah it is praiseworthy and whatever opposes it is blameworthy.</blockquote>Ibn Nu'aym related it with its meaning through Ibrahim bin al-Junaid from <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a>. Also from <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> is what al-Bayhaqi related in his Manaqib, he said: <blockquote>The newly-invented matters are of two types: The first of them is that which has been introduced from that which opposes [something from] the book, or [something from] the sunnah, or a narration, or [a matter of] consensus. This is the misguided <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a>. And the second is that which has been introduced of goodness and does not oppose any of these things [qur'an, sunnah, athar, ijmaa']. This is the newly-invented matter which is not blameworthy.</blockquote></blockquote>    <P>
<font class='titleHeadline'>Understanding These Statements Correctly</font>    <P>
We have already established in <b><a href=indexadb8.html?ezaqa>Part 1</a></b> from <b>Ibn Hajar al-Asqalani</b> that whenever the term 'bidah' is used to refer to a praiseworthy matter it is being employed with its broader linguistic meaning. <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> said in Fath al-Bari (Maktabah <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> print, 13/278)     <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1608;&#1571;&#1605;&#1575; " &#1575;&#1604;&#1576;&#1583;&#1593; " &#1601;&#1607;&#1608; &#1580;&#1605;&#1593; &#1576;&#1583;&#1593;&#1577; &#1608;&#1607;&#1610; &#1603;&#1604; &#1588;&#1610;&#1569; &#1604;&#1610;&#1587; &#1604;&#1607; &#1605;&#1579;&#1575;&#1604; &#1578;&#1602;&#1583;&#1605; &#1601;&#1610;&#1588;&#1605;&#1604; &#1604;&#1594;&#1577; &#1605;&#1575; &#1610;&#1581;&#1605;&#1583; &#1608;&#1610;&#1584;&#1605; &#1548; &#1608;&#1610;&#1582;&#1578;&#1589; &#1601;&#1610; &#1593;&#1585;&#1601; &#1571;&#1607;&#1604; &#1575;&#1604;&#1588;&#1585;&#1593; &#1576;&#1605;&#1575; &#1610;&#1584;&#1605; &#1608;&#1573;&#1606; &#1608;&#1585;&#1583;&#1578; &#1601;&#1610; &#1575;&#1604;&#1605;&#1581;&#1605;&#1608;&#1583; &#1601;&#1593;&#1604;&#1609; &#1605;&#1593;&#1606;&#1575;&#1607;&#1575; &#1575;&#1604;&#1604;&#1594;&#1608;&#1610; </div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for innovations (<span class='arb' lang='AR-SA'>&#1575;&#1604;&#1576;&#1583;&#1593;</span>), it is the plural of <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> (<span class='arb' lang='AR-SA'>&#1576;&#1583;&#1593;&#1577;</span>) and it is everything which does not have any prior example. Linguistically, [the word] encompasses what is both praiseworthy and blameworthy. In the usage of the people of the legislation (i.e. Scholars) it is specifically for what is blameworthy <b>and if it is used in connection to what is praiseworthy, then it is upon its linguistic meaning</b>.</blockquote>    <P>
This explanation leads us to the following diagram which makes things easier to visualize:    <P>
<div align=center><img src=assets/images/bidah-terminology.png width="100%" border=0></div>    <P>
What <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> is referring to goes beyond and outside of the scope of the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> defnition of bidah, and this is established by the fact that his followers (such as al-Izz bin Abd al-Salam) make it clear in their particular classification of bidah that they enter matters which go beyond affairs of worship and enter into wasaa'il (means) and masaalih mursalah (matters of public interest). The statement of <a href='tags/al-izz-bin-abd-al-salam.html' class='tagLink'><font class='tagLink'>al-Izz bin Abd al-Salam</font></a> will be discussed in the next article, along with al-Shatibi's clarification and rebuttal of it. The late Salafi Shaykh of Qatar, Ahmad bin Hajar Aal Butami (d. 1423H), who is Shafi'i in fiqh, explains in his book <i>Tahdhir al-Muslimin anil-Ibtidaa' wal-Bida' fil-Din</i> (Dar al-Imam al-Bukhari, 1428H, p. 114):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for the saying of Imaam <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a>, "<i>Bidah is of two types: praiseworthy and blameworthy. Whatever is in agreemenet with the Sunnah it is praiseworthy and whatever opposes the Sunnah is blameworthy</i>", the intent behind "praiseworthy innovation" is what has been innovated of beneficial matters relating to worldly affairs and [affairs of] habitation, livelihood such as the use of radio, electricity, airplanes, cars and using the phone and what is similar to that of good and beneficial inventions. This is because they are not harmful (in and of themselves) and do not lead (in and of themselves) to any evil that comes to the people, or to the performance of what is <a href='tags/haraam.html' class='tagLink'><font class='tagLink'>haraam</font></a> or destroying any foundation from the foundations of the religion. And Allaah, the Sublime and Exalted, has permitted His servants to invent whatever they wish to look after their worldly interests, He, the Exalted said (<span class='arb' lang='AR-SA'>&#1608;&#1614;&#1575;&#1601;&#1618;&#1593;&#1614;&#1604;&#1615;&#1608;&#1575; &#1575;&#1604;&#1618;&#1582;&#1614;&#1610;&#1618;&#1585;&#1614; &#1604;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1603;&#1615;&#1605;&#1618; &#1578;&#1615;&#1601;&#1618;&#1604;&#1616;&#1581;&#1615;&#1608;&#1606;&#1614;</span>), "<b>And work good that you may be successful</b>" (2:77).</blockquote>    <P>
Shaykh al-Islam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-taymiyyah-ik.html" class="tagLink"><font class="tagLink">Ibn Taymiyyah</font></a></font></a> states in Majmu' al-Fatawa (20/163):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'> &#1608;&#1605;&#1606; &#1607;&#1606;&#1575; &#1610;&#1593;&#1585;&#1601; &#1590;&#1604;&#1575;&#1604; &#1605;&#1606; &#1575;&#1576;&#1578;&#1583;&#1593; &#1591;&#1585;&#1610;&#1602;&#1575;&#1611; &#1571;&#1608; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1575;&#1611; &#1586;&#1593;&#1605; &#1571;&#1606; &#1575;&#1604;&#1575;&#1610;&#1605;&#1575;&#1606; &#1604;&#1575; &#1610;&#1578;&#1605; &#1573;&#1604;&#1575; &#1576;&#1607;&#1548; &#1605;&#1593; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1571;&#1606; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1604;&#1605; &#1610;&#1584;&#1603;&#1585;&#1607;&#1548; &#1608;&#1605;&#1575; &#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1606;&#1589;&#1608;&#1589; &#1601;&#1607;&#1608; &#1576;&#1583;&#1593;&#1577; &#1576;&#1575;&#1578;&#1601;&#1575;&#1602; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1605;&#1575; &#1604;&#1605; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1582;&#1575;&#1604;&#1601;&#1607;&#1575; &#1601;&#1602;&#1583; &#1604;&#1575; &#1610;&#1587;&#1605;&#1609; &#1576;&#1583;&#1593;&#1577;&#1548; &#1602;&#1575;&#1604; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;&#8207;:&#8207; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1576;&#1583;&#1593;&#1578;&#1575;&#1606;&#8207;:&#8207; &#1576;&#1583;&#1593;&#1577; &#1582;&#1575;&#1604;&#1601;&#1578; &#1603;&#1578;&#1575;&#1576;&#1575;&#1611; &#1608;&#1587;&#1606;&#1577; &#1608;&#1573;&#1580;&#1605;&#1575;&#1593;&#1575;&#1611;&#1548; &#1608;&#1571;&#1579;&#1585;&#1575;&#1611; &#1593;&#1606; &#1576;&#1593;&#1590; &#8207;(&#8207;&#1571;&#1589;&#1581;&#1575;&#1576;&#8207;)&#8207; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1601;&#1607;&#1584;&#1607; &#1576;&#1583;&#1593;&#1577; &#1590;&#1604;&#1575;&#1604;&#1577;&#1548; &#1608;&#1576;&#1583;&#1593;&#1577; &#1604;&#1605; &#1578;&#1582;&#1575;&#1604;&#1601; &#1588;&#1610;&#1574;&#1575;&#1611; &#1605;&#1606; &#1584;&#1604;&#1603; &#1601;&#1607;&#1584;&#1607; &#1602;&#1583; &#1578;&#1603;&#1608;&#1606; &#1581;&#1587;&#1606;&#1577; &#1604;&#1602;&#1608;&#1604; &#1593;&#1605;&#1585;&#8207;:&#8207; &#8207;[&#8207;&#1606;&#1593;&#1605;&#1578; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1607;&#1584;&#1607;&#8207;]&#8207; &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1571;&#1608; &#1606;&#1581;&#1608;&#1607; &#1585;&#1608;&#1575;&#1607; &#1575;&#1604;&#1576;&#1610;&#1607;&#1602;&#1610; &#1576;&#1573;&#1587;&#1606;&#1575;&#1583;&#1607; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1601;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And from here, the misguidance of the one who innovated a path or belief -claiming that faith cannot be completed except without it - becomes known, alongside the <a href='tags/knowledge.html' class='tagLink'><font class='tagLink'>knowledge</font></a> that the Messenger did not mention it. And whatever opposes the texts, then it is an <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> by agreement of the <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a>, and that which is not known to oppose [the texts], then it is not always called 'bidah' (in the blameworthy <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> sense). <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>Al-Shafi'i</font></a> (rahimahullaah) said:<blockquote>Bidah is of two types: A bidah that opposes [something from] the book, or [something from] the sunnah, or [a matter of] consensus, or a narration from some of the Companions of Allaah's Messenger (sallallaahu alayhi wasallam), this is the misguided <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a>. And a bidah which does not oppose any of these things [qur'an, sunnah, athar, ijmaa']. This is what can be good (hasanah), due to the saying of Umar, "What an excellent <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> this is".</blockquote> This statement or what is similar to it has been related by al-Bayhaqi with in authentic chain of narration in al-Madkhal...</blockquote>    <P>
Al-Mubarakfuri wrote in Tuhfatul al-Ahwazi (7/366):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1601;&#1602;&#1608;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1590;&#1604;&#1575;&#1604;&#1577; &#1605;&#1606; &#1580;&#1608;&#1575;&#1605;&#1593; &#1575;&#1604;&#1603;&#1604;&#1605; &#1604;&#1575; &#1610;&#1582;&#1585;&#1580; &#1593;&#1606;&#1607; &#1588;&#1610;&#1569; &#1608;&#1607;&#1608; &#1571;&#1589;&#1604; &#1593;&#1592;&#1610;&#1605; &#1605;&#1606; &#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1571;&#1605;&#1575; &#1605;&#1575; &#1608;&#1602;&#1593; &#1601;&#1610; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1587;&#1604;&#1601; &#1605;&#1606; &#1575;&#1587;&#1578;&#1581;&#1587;&#1575;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1576;&#1583;&#1593; &#1601;&#1573;&#1606;&#1605;&#1575; &#1584;&#1604;&#1603; &#1601;&#1610; &#1575;&#1604;&#1576;&#1583;&#1593; &#1575;&#1604;&#1604;&#1594;&#1608;&#1610;&#1577; &#1604;&#1575; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610;&#1577; &#1601;&#1605;&#1606; &#1584;&#1604;&#1603; &#1602;&#1608;&#1604; &#1593;&#1605;&#1585; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; &#1601;&#1610; &#1575;&#1604;&#1578;&#1585;&#1575;&#1608;&#1610;&#1581; &#1606;&#1593;&#1605;&#1578; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>For his saying (sallallaahu alayhi wasallam), "Every <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> is misguidance" is from the concise, profound words (jawaami' al-kalim), nothing exits from them, and it is a mighty foundation from the foundations of the religion. As for whta occurs in the speech of some of the Salaf of considering some of the innovations  to be good, then that is in relation to linguistic (usage of) bidah, not the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> (usage). From (the examples) of that is the saying of Umar (radiallaahu anhu) regarding the tarawih (<a href='tags/prayer.html' class='tagLink'><font class='tagLink'>prayer</font></a>), "What an excellent <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a>."</blockquote>    <P>
And Ibn Katheer said in his tafseer (Dar Tayyibah, 1422H, 1/398):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1608;&#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1593;&#1604;&#1609; &#1602;&#1587;&#1605;&#1610;&#1606; &#1578;&#1575;&#1585;&#1577; &#1578;&#1603;&#1608;&#1606; &#1576;&#1583;&#1593;&#1577; &#1588;&#1585;&#1593;&#1610;&#1577; &#1603;&#1602;&#1608;&#1604;&#1607; &#1601;&#1573;&#1606; &#1603;&#1604; &#1605;&#1581;&#1583;&#1579;&#1577; &#1576;&#1583;&#1593;&#1577; &#1608;&#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1590;&#1604;&#1575;&#1604;&#1577; &#1608;&#1578;&#1575;&#1585;&#1577; &#1578;&#1603;&#1608;&#1606; &#1576;&#1583;&#1593;&#1577; &#1604;&#1594;&#1608;&#1610;&#1577; &#1603;&#1602;&#1608;&#1604; &#1571;&#1605;&#1610;&#1585; &#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1610;&#1606; &#1593;&#1605;&#1585; &#1576;&#1606; &#1575;&#1604;&#1582;&#1591;&#1575;&#1576; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; &#1593;&#1606; &#1580;&#1605;&#1593;&#1607; &#1573;&#1610;&#1575;&#1607;&#1605; &#1593;&#1604;&#1609; &#1589;&#1604;&#1575;&#1577; &#1575;&#1604;&#1578;&#1585;&#1575;&#1608;&#1610;&#1581; &#1608;&#1575;&#1587;&#1578;&#1605;&#1585;&#1575;&#1585;&#1607;&#1605; : &#1606;&#1593;&#1605;&#1578; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1607;&#1584;&#1607;  </div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And bidah is of two types. Sometimes it can be a legislative <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> (bidah shar'iyyah), such as his saying, "Every newly-invented matter is an <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> and every <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> is  misguidance" and sometimes it can be a linguistic <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> (bidah lughawiyyah), such as the saying of Amir al-Mu'minin Umar bin al-Khattaab, (radiallaahu anhu) about his bringing them together for the tarawih <a href='tags/prayer.html' class='tagLink'><font class='tagLink'>prayer</font></a> and their continuance upon that, "What an excellent <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> this is."  </blockquote>    <P>
From what has preceded it should now be very clear that in the usage of some of the Scholars, they employ the word bidah with its linguistic meaning to include praiseworthy matters which either <b>a)</b> already have a specific precedent in the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> and are therefore not 'bidah'  in the legislative (Shar'iyy) sense or <b>b)</b> matters which pertain to <a href='tags/public-interest.html' class='tagLink'><font class='tagLink'>public interest</font></a> (maslahah mursalah) which do not clash with the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> but rather are in agreement with it and its objectives and are considered praiseworthy (such as building schools). This should be kept totally separate and distinct from the censured and condemned bidah in matters of worship which can be <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> from all angles, in every sense of the word (<a href='tags/bidah-haqiqiyyah.html' class='tagLink'><font class='tagLink'>bidah haqiqiyyah</font></a>) or from some angles only (<a href='tags/bidah-idafiyyah.html' class='tagLink'><font class='tagLink'>bidah idafiyyah</font></a>). Or in other words: Every <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> in the arena of the acts of worship which do not have any basis or foundation in the Book or the Sunnah or from the rightly-guided Caliphs or Companions, in either their foundations, or their details, then  it is a blameworthy, repulsive bidah in the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a>.    <P>
<font class='titleHeadline'>Imam <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> Did Not Permit Departure from the Sunnah</font>    <P>
It is appropriate here to show that Imam <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> was a follower of the Sunnah and did not permit departure from the Sunnah into bidah, and that al-Shafi'i's statements cited above are no proof whatsoever for those people who claim attachment to him, but misunderstand his words (regarding the linguistic use of the term 'bidah') and confuse them with the <a href='tags/bidah-idafiyyah.html' class='tagLink'><font class='tagLink'>bidah idafiyyah</font></a>. The example that can be given here is what is cited by <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> in Fath al-Bari from <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> in relation to touching the corners of the kabah. In Kitab al-Hajj, al-Bukhari brings a chapter heading titled "<i>On the one who does not touch except the two Yemeni corners</i>" and in his commentary <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> discusses the various narrations in this regard that pertain to Mu'awiyyah (radiallaahu anhu) touching all four corners and <a href='tags/ibn-abbaas.html' class='tagLink'><font class='tagLink'>Ibn Abbaas</font></a> (radiallaahu anhu) advising him that only the two corners are to be touched. Mu'awiyyah states, "There is nothing from the house (ka'bah) that is abandoned." <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> cites <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> (see 3/473-474):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1608;&#1571;&#1580;&#1575;&#1576; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1593;&#1606; &#1602;&#1608;&#1604; &#1605;&#1606; &#1602;&#1575;&#1604; &#1604;&#1610;&#1587; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1576;&#1610;&#1578; &#1605;&#1607;&#1580;&#1608;&#1585;&#1575; &#1576;&#1571;&#1606;&#1575; &#1604;&#1605; &#1606;&#1583;&#1593; &#1575;&#1587;&#1578;&#1604;&#1575;&#1605;&#1607;&#1605;&#1575; &#1607;&#1580;&#1585;&#1575; &#1604;&#1604;&#1576;&#1610;&#1578; &#1548; &#1608;&#1603;&#1610;&#1601; &#1610;&#1607;&#1580;&#1585;&#1607; &#1608;&#1607;&#1608; &#1610;&#1591;&#1608;&#1601; &#1576;&#1607; &#1548; &#1608;&#1604;&#1603;&#1606;&#1575; &#1606;&#1578;&#1576;&#1593; &#1575;&#1604;&#1587;&#1606;&#1577; &#1601;&#1593;&#1604;&#1575; &#1571;&#1608; &#1578;&#1585;&#1603;&#1575; &#1548; &#1608;&#1604;&#1608; &#1603;&#1575;&#1606; &#1578;&#1585;&#1603; &#1575;&#1587;&#1578;&#1604;&#1575;&#1605;&#1607;&#1605;&#1575; &#1607;&#1580;&#1585;&#1575; &#1604;&#1607;&#1605;&#1575; &#1604;&#1603;&#1575;&#1606; &#1578;&#1585;&#1603; &#1575;&#1587;&#1578;&#1604;&#1575;&#1605; &#1605;&#1575; &#1576;&#1610;&#1606; &#1575;&#1604;&#1571;&#1585;&#1603;&#1575;&#1606; &#1607;&#1580;&#1585;&#1575; &#1604;&#1607;&#1575; &#1548; &#1608;&#1604;&#1575; &#1602;&#1575;&#1574;&#1604; &#1576;&#1607;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> responded to the saying of the one who said, "There is nothing from the house (ka'bah) that is abandoned" with (the response) that: We have not left touching the (two corners) out of abandoning the house, and how can a person be abandoning it when he is making tawaf around it. <b>Rather, we follow the Sunnah both in performance (fi'l) and abandonment (tark)</b>, and if not touching them both constitutes abandoning them, then not touching what is between the corners would also be abandonment of it, yet there is no one expressing  this [view].</blockquote>    <P>
Al-Shafi'i indicates this is the practice of the Messenger (alayhis salaam) - to only touch the two corners - and <a href='tags/ibn-hajar-oz.html' class='tagLink'><font class='tagLink'><a href="tags/ibn-hajar.html" class="tagLink"><font class="tagLink">Ibn Hajar</font></a></font></a> says (3/474) that to kiss the first (the stone) and touch the second (Yemeni corner) only (and not touch or kiss the other two) is the view of the majority.    <P>
The point of evidence here is that upon the argument of the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> that "<a href="tags/good-innovation.html" class="tagLink"><font class="tagLink"><a href="tags/good-innovation-qr.html" class="tagLink"><font class="tagLink">good <a href="tags/innovation.html" class="tagLink"><font class="tagLink">innovation</font></a></font></a></font></a>" is allowed so long as it has a basis in the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> then why did <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> show rejection against this because it can be argued that since touching the other two corners is already established in the Sunnah (so we now have a basis) why cannot we innovate and touch the other two corners and none of this would clash with the <a href='tags/shariah-bj.html' class='tagLink'><font class='tagLink'><a href="tags/shariah.html" class="tagLink"><font class="tagLink">Shariah</font></a></font></a> and it would be "<a href="tags/good-innovation.html" class="tagLink"><font class="tagLink"><a href="tags/good-innovation-qr.html" class="tagLink"><font class="tagLink">good <a href="tags/innovation.html" class="tagLink"><font class="tagLink">innovation</font></a></font></a></font></a>". This is because they do not understand the statements of <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> correctly, who does not allow any <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> whatsoever in the matters of worship because matters of worship are not the same as matters included within the broader linguistic usage of the term 'bidah' (like the masalih mursalah) which is how <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> makes application of the term 'bidah.'    <P>
In reality, what they are upon is the <a href='tags/bidah-idafiyyah.html' class='tagLink'><font class='tagLink'>bidah idafiyyah</font></a> in matters of worship (ibadah) and they attempt to make it appear that what they are upon of reprehensible <a href='tags/innovation.html' class='tagLink'><font class='tagLink'>innovation</font></a> which has no evidence for its particulars and details from the Sunnah is of the same category as what is entered into a purely linguistic usage of the term 'bidah' by some of the scholars. So their <a href='tags/deception.html' class='tagLink'><font class='tagLink'>deception</font></a> is clear walhamdulillaah. We will make their <a href='tags/deception.html' class='tagLink'><font class='tagLink'>deception</font></a> even more clear in our series "<b>Proof That The <a href='tags/bidah-idafiyyah.html' class='tagLink'><font class='tagLink'>bidah idafiyyah</font></a> is Evil and Rejected</b>" (<a href=series/proof-that-the-bidah-idafiyyah-is--evil-and-rejected.html>read series here</a>). Refer to that for more details which will highlight ever more clearly their departure from the way of <a href='tags/al-shafii.html' class='tagLink'><font class='tagLink'>al-Shafi'i</font></a> (and others they claim to be following such as al-Izz bin Abd al-Salam).    <P>
    <P>
    <P>
   <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.bidah.com/print.cfm?rouuz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:17:40 GMT -->
</html>


