

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?qdxlp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:19:42 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Abdul-Kareem ash-Sharahstani (d. 584H), Ash'ari Scholar: On the Speech of Allaah and the Qur'an</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Abdul-Kareem ash-Sharahstani (d. 584H), Ash'ari Scholar: On the Speech of Allaah and the Qur'an</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Thursday, October, 08 2009 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/shahrastaani.html">
Shahrastaani 
</a> &#149; <a href="tags/shahrastani.html">
Shahrastani 
</a> &#149; <a href="tags/quran.html">
Qu'ran 
</a> &#149; <a href="tags/quran.html">
Quran 
</a> &#149; <a href="tags/quraan.html">
Quraan 
</a> &#149; <a href="tags/shahrastaani.html">
Shahrastaani 
</a> &#149; <a href="tags/shahrastani.html">
Shahrastani 
</a> &#149; <a href="tags/quran.html">
Qu'ran 
</a> &#149; <a href="tags/quran.html">
Quran 
</a> &#149; <a href="tags/quraan.html">
Quraan 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>In his book, "Nihaayat ul-Iqdaam", ash-Shahrastani says on the subject of Allaah's Speech and the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> (p. 177 onwards)    <P>
<div class='arabic' align='right' lang='AR-SA'>  &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1587;&#1604;&#1601; &#1608;&#1575;&#1604;&#1581;&#1606;&#1575;&#1576;&#1604;&#1577; &#1602;&#1583; &#1578;&#1602;&#1585;&#1585; &#1575;&#1604;&#1575;&#1578;&#1601;&#1575;&#1602; &#1593;&#1604;&#1609; &#1571;&#1606; &#1605;&#1575; &#1576;&#1610;&#1606; &#1575;&#1604;&#1583;&#1601;&#1578;&#1610;&#1606; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1606; &#1605;&#1575; &#1606;&#1602;&#1585;&#1571;&#1607; &#1608;&#1606;&#1587;&#1605;&#1593;&#1607; &#1608;&#1606;&#1603;&#1578;&#1576;&#1607; &#1593;&#1610;&#1606; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1607;&#1610; &#1576;&#1593;&#1610;&#1606;&#1607;&#1575; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1608;&#1604;&#1605;&#1575; &#1578;&#1602;&#1585;&#1585; &#1575;&#1604;&#1575;&#1578;&#1601;&#1575;&#1602; &#1593;&#1604;&#1609; &#1571;&#1606; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1594;&#1610;&#1585; &#1605;&#1582;&#1604;&#1608;&#1602; &#1601;&#1610;&#1580;&#1576; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1571;&#1586;&#1604;&#1610;&#1577; &#1594;&#1610;&#1585; &#1605;&#1582;&#1604;&#1608;&#1602;&#1577; &#1608;&#1604;&#1602;&#1583; &#1603;&#1575;&#1606; &#1575;&#1604;&#1571;&#1605;&#1585; &#1601;&#1610; &#1571;&#1608;&#1604; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1593;&#1604;&#1609; &#1602;&#1608;&#1604;&#1610;&#1606; &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1575;&#1604;&#1602;&#1583;&#1605; &#1608;&#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1575;&#1604;&#1581;&#1583;&#1608;&#1579; &#1608;&#1575;&#1604;&#1602;&#1608;&#1604;&#1575;&#1606; &#1605;&#1602;&#1589;&#1608;&#1585;&#1575;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1575;&#1604;&#1605;&#1603;&#1578;&#1608;&#1576;&#1577; &#1608;&#1575;&#1604;&#1570;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569;&#1577; &#1576;&#1575;&#1604;&#1571;&#1604;&#1587;&#1606; &#1601;&#1589;&#1575;&#1585; &#1575;&#1604;&#1570;&#1606; &#1573;&#1604;&#1609; &#1602;&#1608;&#1604; &#1579;&#1575;&#1604;&#1579; &#1608;&#1607;&#1608; &#1581;&#1583;&#1608;&#1579; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1608;&#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1602;&#1583;&#1605; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1608;&#1575;&#1604;&#1571;&#1605;&#1585; &#1575;&#1604;&#1584;&#1610; &#1578;&#1583;&#1604; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1608;&#1602;&#1583; &#1581;&#1587;&#1606; &#1602;&#1608;&#1604; &#1604;&#1610;&#1587; &#1605;&#1606;&#1607;&#1605;&#1575; &#1593;&#1604;&#1609; &#1582;&#1604;&#1575;&#1601; &#1575;&#1604;&#1602;&#1608;&#1604;&#1610;&#1606; &#1601;&#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1587;&#1604;&#1601; &#1593;&#1604;&#1609; &#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1602;&#1583;&#1605; &#1608;&#1575;&#1604;&#1571;&#1586;&#1604;&#1610;&#1577; &#1604;&#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1583;&#1608;&#1606; &#1575;&#1604;&#1578;&#1593;&#1585;&#1590; &#1604;&#1589;&#1601;&#1577; &#1571;&#1582;&#1585;&#1609; &#1608;&#1585;&#1571;&#1607;&#1575; &#1608;&#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1593;&#1604;&#1609; &#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1581;&#1583;&#1608;&#1579; &#1608;&#1575;&#1604;&#1582;&#1604;&#1602;&#1610;&#1577; &#1604;&#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1608;&#1575;&#1604;&#1571;&#1589;&#1608;&#1575;&#1578; &#1583;&#1608;&#1606; &#1575;&#1604;&#1578;&#1593;&#1585;&#1590; &#1604;&#1571;&#1605;&#1585; &#1608;&#1585;&#1571;&#1607;&#1575; &#1601;&#1571;&#1576;&#1583;&#1593; &#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610; &#1602;&#1608;&#1604;&#1575;&#1611; &#1579;&#1575;&#1576;&#1578;&#1575;&#1611; &#1608;&#1602;&#1590;&#1609; &#1576;&#1581;&#1583;&#1608;&#1579; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1608;&#1607;&#1608; &#1582;&#1585;&#1602; &#1575;&#1604;&#1573;&#1580;&#1605;&#1575;&#1593; &#1608;&#1581;&#1603;&#1605; &#1576;&#1571;&#1606; &#1605;&#1575; &#1606;&#1602;&#1585;&#1571;&#1607; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1605;&#1580;&#1575;&#1586;&#1575;&#1611; &#1604;&#1575; &#1581;&#1602;&#1610;&#1602;&#1577; &#1608;&#1607;&#1608; &#1593;&#1610;&#1606; &#1575;&#1604;&#1575;&#1576;&#1578;&#1583;&#1575;&#1593; &#1601;&#1607;&#1604;&#1575; &#1602;&#1575;&#1604; &#1608;&#1585;&#1583; &#1575;&#1604;&#1587;&#1605;&#1593; &#1576;&#1571;&#1606; &#1605;&#1575; &#1606;&#1602;&#1585;&#1571;&#1607; &#1608;&#1606;&#1603;&#1578;&#1576;&#1607; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1583;&#1608;&#1606; &#1571;&#1606; &#1610;&#1578;&#1593;&#1585;&#1590; &#1604;&#1603;&#1610;&#1601;&#1610;&#1578;&#1607; &#1608;&#1581;&#1602;&#1610;&#1602;&#1578;&#1607; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583; &#1575;&#1604;&#1587;&#1605;&#1593; &#1576;&#1573;&#1579;&#1576;&#1575;&#1578; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1605;&#1606; &#1575;&#1604;&#1608;&#1580;&#1607; &#1608;&#1575;&#1604;&#1610;&#1583;&#1610;&#1606; &#1573;&#1604;&#1609; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1582;&#1576;&#1585;&#1610;&#1577;.    <P>
&#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1587;&#1604;&#1601; &#1604;&#1575; &#1610;&#1592;&#1606; &#1575;&#1604;&#1592;&#1575;&#1606; &#1571;&#1606;&#1575; &#1606;&#1579;&#1576;&#1578; &#1575;&#1604;&#1602;&#1583;&#1605; &#1604;&#1604;&#1581;&#1585;&#1608;&#1601; &#1608;&#1575;&#1604;&#1571;&#1589;&#1608;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1602;&#1575;&#1605;&#1578; &#1576;&#1571;&#1604;&#1587;&#1606;&#1578;&#1606;&#1575; &#1608;&#1589;&#1575;&#1585;&#1578; &#1589;&#1601;&#1575;&#1578; &#1604;&#1606;&#1575; &#1601;&#1573;&#1606;&#1575; &#1593;&#1604;&#1609; &#1602;&#1591;&#1593; &#1606;&#1593;&#1604;&#1605; &#1575;&#1601;&#1578;&#1578;&#1575;&#1581;&#1607;&#1575; &#1608;&#1575;&#1582;&#1578;&#1578;&#1575;&#1605;&#1607;&#1575; &#1608;&#1578;&#1593;&#1604;&#1602;&#1607;&#1575; &#1576;&#1571;&#1603;&#1587;&#1575;&#1576;&#1606;&#1575; &#1608;&#1571;&#1601;&#1593;&#1575;&#1604;&#1606;&#1575; &#1608;&#1602;&#1583; &#1576;&#1584;&#1604;&#1578; &#1575;&#1604;&#1587;&#1604;&#1601; &#1571;&#1585;&#1608;&#1575;&#1581;&#1607;&#1605; &#1608;&#1589;&#1576;&#1585;&#1608;&#1575; &#1593;&#1604;&#1609; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1576;&#1604;&#1575;&#1610;&#1575; &#1608;&#1575;&#1604;&#1605;&#1581;&#1606; &#1605;&#1606; &#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1583;&#1608;&#1606; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604;&#1608;&#1575; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1605;&#1582;&#1604;&#1608;&#1602; &#1608;&#1604;&#1605; &#1610;&#1603;&#1606; &#1584;&#1604;&#1603; &#1593;&#1604;&#1609; &#1581;&#1585;&#1608;&#1601; &#1608;&#1571;&#1589;&#1608;&#1575;&#1578; &#1607;&#1610; &#1571;&#1601;&#1593;&#1575;&#1604;&#1606;&#1575; &#1608;&#1571;&#1603;&#1587;&#1575;&#1576;&#1606;&#1575; &#1576;&#1604; &#1607;&#1605; &#1593;&#1585;&#1601;&#1608;&#1575; &#1610;&#1602;&#1610;&#1606;&#1575;&#1611; &#1571;&#1606; &#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1602;&#1608;&#1604;&#1575;&#1611; &#1608;&#1603;&#1604;&#1575;&#1605;&#1575;&#1611; &#1608;&#1571;&#1605;&#1585;&#1575;&#1611; &#1608;&#1573;&#1606; &#1571;&#1605;&#1585;&#1607; &#1594;&#1610;&#1585; &#1582;&#1604;&#1602;&#1607; &#1576;&#1604; &#1607;&#1608; &#1571;&#1586;&#1604;&#1610; &#1602;&#1583;&#1610;&#1605; &#1576;&#1602;&#1583;&#1605;&#1607; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583; &#1584;&#1604;&#1603; &#1608;&#1601;&#1610; &#1602;&#1608;&#1604;&#1607; "&#1571;&#1604;&#1575; &#1604;&#1607; &#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1575;&#1604;&#1571;&#1605;&#1585;" &#1608;&#1602;&#1608;&#1604;&#1607; "&#1604;&#1604;&#1607; &#1575;&#1604;&#1571;&#1605;&#1585; &#1605;&#1606; &#1602;&#1576;&#1604; &#1608;&#1605;&#1606; &#1576;&#1593;&#1583;" &#1608;&#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; "&#1573;&#1606;&#1605;&#1575; &#1602;&#1608;&#1604;&#1606;&#1575; &#1604;&#1588;&#1610;&#1569; &#1573;&#1584;&#1575; &#1571;&#1585;&#1583;&#1606;&#1575;&#1607; &#1571;&#1606; &#1606;&#1602;&#1608;&#1604; &#1604;&#1607; &#1603;&#1606; &#1601;&#1610;&#1603;&#1608;&#1606;" &#1601;&#1575;&#1604;&#1603;&#1575;&#1574;&#1606;&#1575;&#1578; &#1603;&#1604;&#1607;&#1575; &#1573;&#1606;&#1605;&#1575; &#1578;&#1578;&#1603;&#1608;&#1606; &#1576;&#1602;&#1608;&#1604;&#1607; &#1608;&#1571;&#1605;&#1585;&#1607; &#1608;&#1602;&#1608;&#1604;&#1607; &#1573;&#1606;&#1605;&#1575; &#1571;&#1605;&#1585;&#1607; &#1573;&#1584;&#1575; &#1571;&#1585;&#1575;&#1583; &#1588;&#1610;&#1574;&#1575;&#1611; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1604;&#1607; &#1603;&#1606; &#1601;&#1610;&#1603;&#1608;&#1606; &#1608;&#1602;&#1608;&#1604;&#1607; &#1608;&#1573;&#1584; &#1602;&#1575;&#1604; &#1585;&#1576;&#1603; &#1608;&#1573;&#1584; &#1602;&#1604;&#1606;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1607;&#1584;&#1575; &#1603;&#1604;&#1607; &#1602;&#1608;&#1604; &#1602;&#1583; &#1608;&#1585;&#1583; &#1601;&#1610; &#1575;&#1604;&#1587;&#1605;&#1593; &#1605;&#1590;&#1575;&#1601;&#1575;&#1611; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1571;&#1582;&#1589; &#1573;&#1590;&#1575;&#1601;&#1577; &#1605;&#1606; &#1575;&#1604;&#1582;&#1604;&#1602; &#1601;&#1573;&#1606; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602; &#1604;&#1575; &#1610;&#1606;&#1587;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1573;&#1604;&#1575; &#1605;&#1606; &#1580;&#1607;&#1577; &#1608;&#1575;&#1581;&#1583;&#1577; &#1608;&#1607;&#1608; &#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1575;&#1604;&#1573;&#1576;&#1583;&#1575;&#1593; &#1608;&#1575;&#1604;&#1571;&#1605;&#1585; &#1576;&#1606;&#1587;&#1576; &#1573;&#1604;&#1610;&#1607; &#1604;&#1575; &#1593;&#1604;&#1609; &#1578;&#1604;&#1603; &#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1608;&#1573;&#1604;&#1575; &#1601;&#1610;&#1585;&#1578;&#1601;&#1593; &#1575;&#1604;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1575;&#1604;&#1582;&#1604;&#1602;&#1610;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1575;&#1578;.    <P>
&#1602;&#1575;&#1604;&#1608;&#1575; &#1605;&#1606; &#1580;&#1607;&#1577; &#1575;&#1604;&#1605;&#1593;&#1602;&#1608;&#1604; &#1575;&#1604;&#1593;&#1575;&#1602;&#1604; &#1610;&#1580;&#1583; &#1605;&#1606; &#1606;&#1601;&#1587;&#1607; &#1601;&#1585;&#1602;&#1575;&#1611; &#1590;&#1585;&#1608;&#1585;&#1610;&#1575;&#1611; &#1576;&#1610;&#1606; &#1602;&#1575;&#1604; &#1608;&#1601;&#1593;&#1604; &#1608;&#1576;&#1610;&#1606; &#1571;&#1605;&#1585; &#1608;&#1582;&#1604;&#1602; &#1608;&#1604;&#1608; &#1603;&#1575;&#1606; &#1575;&#1604;&#1602;&#1608;&#1604; &#1601;&#1593;&#1604;&#1575;&#1611; &#1603;&#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1571;&#1601;&#1593;&#1575;&#1604; &#1576;&#1591;&#1604; &#1575;&#1604;&#1601;&#1585;&#1602; &#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1610; &#1601;&#1579;&#1576;&#1578; &#1571;&#1606; &#1575;&#1604;&#1602;&#1608;&#1604; &#1594;&#1610;&#1585; &#1575;&#1604;&#1601;&#1593;&#1604; &#1608;&#1607;&#1608; &#1602;&#1576;&#1604; &#1575;&#1604;&#1601;&#1593;&#1604; &#1608;&#1602;&#1576;&#1604;&#1610;&#1578;&#1607; &#1602;&#1604;&#1610;&#1577; &#1571;&#1586;&#1604;&#1610;&#1577; &#1573;&#1584; &#1604;&#1608; &#1603;&#1575;&#1606; &#1604;&#1607; &#1571;&#1608;&#1604; &#1604;&#1603;&#1575;&#1606; &#1601;&#1593;&#1604;&#1575;&#1611; &#1587;&#1576;&#1602;&#1607; &#1602;&#1608;&#1604; &#1570;&#1582;&#1585; &#1608;&#1610;&#1578;&#1587;&#1604;&#1587;&#1604; &#1579;&#1605; &#1604;&#1605;&#1575; &#1571;&#1580;&#1605;&#1593;&#1578; &#1575;&#1604;&#1587;&#1604;&#1601; &#1593;&#1604;&#1609; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1607;&#1608; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1604;&#1605; &#1610;&#1585;&#1583; &#1605;&#1606;&#1575;&#1607;&#1580; &#1573;&#1580;&#1605;&#1575;&#1593;&#1607;&#1605; &#1608;&#1604;&#1605; &#1610;&#1576;&#1581;&#1579; &#1571;&#1606;&#1607;&#1605; &#1571;&#1585;&#1575;&#1583;&#1608;&#1575; &#1575;&#1604;&#1602;&#1585;&#1575;&#1569;&#1577; &#1571;&#1608; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1608;&#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1577; &#1571;&#1608; &#1575;&#1604;&#1605;&#1603;&#1578;&#1608;&#1576; &#1603;&#1605;&#1575; &#1571;&#1606;&#1607;&#1605; &#1573;&#1584;&#1575; &#1608;&#1589;&#1604;&#1608;&#1575; &#1573;&#1604;&#1609; &#1578;&#1585;&#1576;&#1577; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1602;&#1575;&#1604;&#1608;&#1575; &#1607;&#1584;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1581;&#1610;&#1608;&#1575; &#1608;&#1589;&#1604;&#1608;&#1575; &#1608;&#1587;&#1604;&#1605;&#1608;&#1575; &#1578;&#1587;&#1604;&#1610;&#1605;&#1575;&#1611; &#1605;&#1606; &#1594;&#1610;&#1585; &#1578;&#1589;&#1585;&#1601; &#1601;&#1610; &#1571;&#1606; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585; &#1573;&#1604;&#1610;&#1607; &#1588;&#1582;&#1589;&#1607; &#1571;&#1605; &#1585;&#1608;&#1581;&#1607;.    <P>
 &#1608;&#1581;&#1602;&#1602;&#1608;&#1575; &#1586;&#1610;&#1575;&#1583;&#1577; &#1578;&#1581;&#1602;&#1610;&#1602; &#1601;&#1602;&#1575;&#1604;&#1608;&#1575; &#1602;&#1583; &#1608;&#1585;&#1583; &#1601;&#1610; &#1575;&#1604;&#1578;&#1606;&#1586;&#1610;&#1604; &#1571;&#1592;&#1607;&#1585; &#1605;&#1605;&#1575; &#1584;&#1603;&#1585;&#1606;&#1575;&#1607; &#1605;&#1606; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1607;&#1608; &#1575;&#1604;&#1578;&#1593;&#1585;&#1590; &#1604;&#1573;&#1579;&#1576;&#1575;&#1578; &#1603;&#1604;&#1605;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1581;&#1610;&#1579; &#1602;&#1575;&#1604; &#1593;&#1586; &#1605;&#1606; &#1602;&#1575;&#1574;&#1604; "&#1608;&#1578;&#1605;&#1578; &#1603;&#1604;&#1605;&#1575;&#1578; &#1585;&#1576;&#1603; &#1589;&#1583;&#1602;&#1575;&#1611; &#1608;&#1593;&#1583;&#1604;&#1575;&#1611; &#1604;&#1575; &#1605;&#1576;&#1583;&#1604; &#1604;&#1603;&#1604;&#1605;&#1575;&#1578;&#1607;" &#1579;&#1605; &#1602;&#1575;&#1604; "&#1608;&#1604;&#1608;&#1604;&#1575; &#1603;&#1604;&#1605;&#1577; &#1587;&#1576;&#1602;&#1578; &#1605;&#1606; &#1585;&#1576;&#1603;" &#1608;&#1602;&#1575;&#1604; "&#1602;&#1604; &#1604;&#1608; &#1603;&#1575;&#1606; &#1575;&#1604;&#1576;&#1581;&#1585; &#1605;&#1583;&#1575;&#1583;&#1575;&#1611; &#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1585;&#1576;&#1610;" &#1608;&#1602;&#1575;&#1604; &#1608;&#1604;&#1608; &#1571;&#1606; &#1605;&#1575; &#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1590; &#1605;&#1606; &#1588;&#1580;&#1585;&#1577; &#1571;&#1602;&#1604;&#1575;&#1605; &#1608;&#1575;&#1604;&#1576;&#1581;&#1585; &#1610;&#1605;&#1583;&#1607; &#1605;&#1606; &#1576;&#1593;&#1583;&#1607; &#1587;&#1576;&#1593;&#1577; &#1571;&#1576;&#1581;&#1585; &#1605;&#1575; &#1606;&#1601;&#1583;&#1578; &#1603;&#1604;&#1605;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607;" &#1608;&#1602;&#1575;&#1604; "&#1608;&#1604;&#1603;&#1606; &#1581;&#1602; &#1575;&#1604;&#1602;&#1608;&#1604; &#1605;&#1606;&#1610; &#1604;&#1571;&#1605;&#1604;&#1571;&#1606; &#1580;&#1607;&#1606;&#1605; &#1608;&#1603;&#1584;&#1604;&#1603; &#1581;&#1602;&#1578; &#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1593;&#1584;&#1575;&#1576;" &#1601;&#1578;&#1575;&#1585;&#1577; &#1610;&#1580;&#1610; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1576;&#1604;&#1601;&#1592; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1578;&#1579;&#1576;&#1578; &#1604;&#1607; &#1575;&#1604;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1582;&#1575;&#1604;&#1589;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1603;&#1579;&#1585;&#1577; &#1601;&#1610;&#1607;&#1575; "&#1608;&#1605;&#1575; &#1571;&#1605;&#1585;&#1606;&#1575; &#1573;&#1604;&#1575; &#1608;&#1575;&#1581;&#1583;&#1577; &#1603;&#1604;&#1605;&#1581; &#1576;&#1575;&#1604;&#1576;&#1589;&#1585;" &#1608;&#1578;&#1575;&#1585;&#1577; &#1610;&#1580;&#1610; &#1576;&#1604;&#1601;&#1592; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1578;&#1579;&#1576;&#1578; &#1604;&#1607;&#1575; &#1575;&#1604;&#1603;&#1579;&#1585;&#1577; &#1575;&#1604;&#1576;&#1575;&#1604;&#1594;&#1577; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1608;&#1581;&#1583;&#1577; &#1601;&#1610;&#1607;&#1575; &#1608;&#1604;&#1575; &#1606;&#1607;&#1575;&#1610;&#1577; &#1604;&#1607;&#1575; "&#1605;&#1575; &#1606;&#1601;&#1583;&#1578; &#1603;&#1604;&#1605;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607;" &#1601;&#1604;&#1607; &#1573;&#1584;&#1575;&#1611; &#1571;&#1605;&#1585; &#1608;&#1575;&#1581;&#1583; &#1608;&#1603;&#1604;&#1605;&#1575;&#1578; &#1603;&#1579;&#1610;&#1585;&#1577; &#1608;&#1604;&#1575; &#1610;&#1578;&#1589;&#1608;&#1585; &#1573;&#1604;&#1575; &#1576;&#1581;&#1585;&#1608;&#1601; &#1601;&#1593;&#1606; &#1607;&#1584;&#1575; &#1602;&#1604;&#1606;&#1575; &#1571;&#1605;&#1585;&#1607; &#1602;&#1583;&#1610;&#1605; &#1608;&#1603;&#1604;&#1605;&#1575;&#1578;&#1607; &#1603;&#1579;&#1610;&#1585;&#1577; &#1571;&#1586;&#1604;&#1610;&#1577; &#1608;&#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1605;&#1592;&#1575;&#1607;&#1585; &#1575;&#1604;&#1571;&#1605;&#1585; &#1604;&#1604;&#1571;&#1605;&#1585; &#1608;&#1575;&#1604;&#1585;&#1608;&#1581;&#1575;&#1606;&#1610;&#1575;&#1578; &#1605;&#1592;&#1575;&#1607;&#1585; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1580;&#1587;&#1575;&#1605; &#1605;&#1592;&#1575;&#1607;&#1585; &#1575;&#1604;&#1585;&#1608;&#1581;&#1575;&#1606;&#1610;&#1575;&#1578; &#1608;&#1575;&#1604;&#1573;&#1576;&#1583;&#1575;&#1593; &#1608;&#1575;&#1604;&#1582;&#1604;&#1602; &#1573;&#1606;&#1605;&#1575; &#1610;&#1576;&#1578;&#1583;&#1574; &#1605;&#1606; &#1575;&#1604;&#1571;&#1585;&#1608;&#1575;&#1581; &#1608;&#1575;&#1604;&#1571;&#1580;&#1587;&#1575;&#1605; &#1571;&#1605;&#1575; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1601;&#1571;&#1586;&#1604;&#1610;&#1577; &#1602;&#1583;&#1610;&#1605;&#1577; &#1601;&#1603;&#1605;&#1575; &#1571;&#1606; &#1571;&#1605;&#1585;&#1607; &#1604;&#1575; &#1610;&#1588;&#1576;&#1607; &#1571;&#1605;&#1585;&#1606;&#1575; &#1608;&#1603;&#1604;&#1605;&#1575;&#1578;&#1607; &#1608;&#1581;&#1585;&#1608;&#1601;&#1607; &#1604;&#1575; &#1578;&#1588;&#1576;&#1607; &#1603;&#1604;&#1605;&#1575;&#1578;&#1606;&#1575; &#1608;&#1607;&#1610; &#1581;&#1585;&#1608;&#1601; &#1602;&#1583;&#1587;&#1610;&#1577; &#1608;&#1593;&#1604;&#1608;&#1610;&#1577; &#1608;&#1603;&#1605;&#1575; &#1571;&#1606; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1576;&#1587;&#1575;&#1574;&#1591; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1571;&#1587;&#1576;&#1575;&#1576; &#1575;&#1604;&#1585;&#1608;&#1581;&#1575;&#1606;&#1610;&#1575;&#1578; &#1608;&#1575;&#1604;&#1585;&#1608;&#1581;&#1575;&#1606;&#1610;&#1575;&#1578; &#1605;&#1583;&#1576;&#1585;&#1575;&#1578; &#1575;&#1604;&#1580;&#1587;&#1605;&#1575;&#1606;&#1610;&#1575;&#1578; &#1608;&#1603;&#1604; &#1575;&#1604;&#1603;&#1608;&#1606; &#1602;&#1575;&#1574;&#1605; &#1576;&#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1604;&#1607; &#1605;&#1581;&#1601;&#1608;&#1592; &#1576;&#1571;&#1605;&#1585; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1604;&#1575; &#1610;&#1594;&#1601;&#1604; &#1593;&#1575;&#1602;&#1604; &#1593;&#1606; &#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1587;&#1604;&#1601; &#1608;&#1592;&#1607;&#1608;&#1585; &#1575;&#1604;&#1602;&#1608;&#1604; &#1601;&#1610; &#1581;&#1583;&#1608;&#1579; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1601;&#1573;&#1606; &#1604;&#1607; &#1588;&#1571;&#1606;&#1575;&#1611; &#1608;&#1607;&#1605; &#1610;&#1587;&#1604;&#1605;&#1608;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1602;&#1585;&#1575;&#1569;&#1577; &#1608;&#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1608;&#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1577; &#1608;&#1575;&#1604;&#1605;&#1603;&#1578;&#1608;&#1576; &#1608;&#1610;&#1581;&#1603;&#1605;&#1608;&#1606; &#1576;&#1571;&#1606; &#1575;&#1604;&#1602;&#1585;&#1575;&#1569;&#1577; &#1575;&#1604;&#1578;&#1610; &#1607;&#1610; &#1589;&#1601;&#1578;&#1606;&#1575; &#1608;&#1601;&#1593;&#1604;&#1606;&#1575; &#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1608;&#1575;&#1604;&#1584;&#1610; &#1604;&#1610;&#1587; &#1607;&#1608; &#1589;&#1601;&#1577; &#1604;&#1606;&#1575; &#1608;&#1604;&#1575; &#1601;&#1593;&#1604;&#1606;&#1575; &#1594;&#1610;&#1585; &#1571;&#1606; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1576;&#1575;&#1604;&#1602;&#1585;&#1575;&#1569;&#1577; &#1602;&#1589;&#1589; &#1608;&#1571;&#1582;&#1576;&#1575;&#1585; &#1608;&#1571;&#1581;&#1603;&#1575;&#1605; &#1608;&#1571;&#1608;&#1575;&#1605;&#1585; &#1608;&#1604;&#1610;&#1587; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1605;&#1606; &#1602;&#1589;&#1577; &#1570;&#1583;&#1605; &#1608;&#1573;&#1576;&#1604;&#1610;&#1587; &#1607;&#1608; &#1576;&#1593;&#1610;&#1606;&#1607; &#1575;&#1604;&#1605;&#1602;&#1585;&#1608;&#1569; &#1605;&#1606; &#1602;&#1589;&#1577; &#1605;&#1608;&#1587;&#1609; &#1608;&#1601;&#1585;&#1593;&#1608;&#1606; &#1608;&#1604;&#1610;&#1587; &#1571;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1588;&#1585;&#1575;&#1574;&#1593; &#1575;&#1604;&#1605;&#1575;&#1590;&#1610;&#1577; &#1607;&#1610; &#1576;&#1593;&#1610;&#1606;&#1607;&#1575; &#1571;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1588;&#1585;&#1575;&#1574;&#1593; &#1575;&#1604;&#1582;&#1575;&#1578;&#1605;&#1577; &#1601;&#1604;&#1575; &#1576;&#1583; &#1573;&#1584;&#1575;&#1611; &#1605;&#1606; &#1603;&#1604;&#1605;&#1575;&#1578; &#1578;&#1589;&#1583;&#1585; &#1605;&#1606; &#1603;&#1604;&#1605;&#1577; &#1608;&#1578;&#1585;&#1583; &#1593;&#1604;&#1609; &#1603;&#1604;&#1605;&#1577; &#1608;&#1604;&#1575; &#1576;&#1583; &#1605;&#1606; &#1581;&#1585;&#1608;&#1601; &#1578;&#1578;&#1585;&#1603;&#1576; &#1605;&#1606;&#1607;&#1575; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1608;&#1578;&#1604;&#1603; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1604;&#1575; &#1578;&#1588;&#1576;&#1607; &#1581;&#1585;&#1608;&#1601;&#1606;&#1575; &#1608;&#1578;&#1604;&#1603; &#1575;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578; &#1604;&#1575; &#1578;&#1588;&#1576;&#1607; &#1603;&#1604;&#1575;&#1605;&#1606;&#1575; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583; &#1601;&#1610; &#1581;&#1602; &#1605;&#1608;&#1587;&#1609; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1587;&#1605;&#1593; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1603;&#1580;&#1585; &#1575;&#1604;&#1587;&#1604;&#1575;&#1587;&#1604; &#1608;&#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1605;&#1589;&#1591;&#1601;&#1609; &#1589;&#1604;&#1608;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1601;&#1610; &#1575;&#1604;&#1608;&#1581;&#1610; &#1571;&#1581;&#1610;&#1575;&#1606;&#1575;&#1611; &#1610;&#1571;&#1578;&#1610;&#1606;&#1610; &#1603;&#1589;&#1604;&#1589;&#1604;&#1577; &#1575;&#1604;&#1580;&#1585;&#1587; &#1608;&#1607;&#1608; &#1571;&#1588;&#1583; &#1593;&#1604;&#1610; &#1579;&#1605; &#1610;&#1601;&#1589;&#1605; &#1593;&#1606;&#1610; &#1608;&#1602;&#1583; &#1608;&#1593;&#1610;&#1578; &#1605;&#1575; &#1602;&#1575;&#1604; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605;.  </div> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?qdxlp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:19:42 GMT -->
</html>


