

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?icwge by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:24 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Imaam at-Tirmidhee Refutes The Jahmee Accusation of Tashbeeh Against The People of Knowledge</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Imaam at-Tirmidhee Refutes The Jahmee Accusation of Tashbeeh Against The People of Knowledge</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Saturday, June, 20 2009 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/at-tirmidhee.html">
At-Tirmidhee 
</a> &#149; <a href="tags/tashbeeh.html">
Tashbeeh 
</a> &#149; <a href="tags/at-tirmidhee.html">
At-Tirmidhee 
</a> &#149; <a href="tags/tashbeeh.html">
Tashbeeh 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>Speaking about those ahaadeeth which mention the attributes of Allah, Imaam <a href='tags/at-tirmidhee.html' class='tagLink'><font class='tagLink'>at-Tirmidhee</font></a> (d.279H)- (rahimahullaah) said in his Sunan (1/128-129):    <P>
<div class='arabic' align='right' lang='AR-SA'> &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1594;&#1610;&#1585; &#1608;&#1575;&#1581;&#1583; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1608;&#1605;&#1575; &#1610;&#1588;&#1576;&#1607; &#1607;&#1584;&#1575; &#1605;&#1606; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1608;&#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1585;&#1576; &#1578;&#1576;&#1575;&#1585;&#1603; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1602;&#1575;&#1604;&#1608;&#1575; &#1602;&#1583; &#1578;&#1579;&#1576;&#1578; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1601;&#1610; &#1607;&#1584;&#1575; &#1608;&#1610;&#1572;&#1605;&#1606; &#1576;&#1607;&#1575; &#1608;&#1604;&#1575; &#1610;&#1615;&#1578;&#1614;&#1608;&#1614;&#1607;&#1617;&#1614;&#1605; &#1608;&#1604;&#1575; &#1610;&#1602;&#1575;&#1604; &#1603;&#1610;&#1601;. &#1607;&#1603;&#1584;&#1575; &#1585;&#1608;&#1610; &#1593;&#1606; &#1605;&#1575;&#1604;&#1603; &#1608; &#1587;&#1601;&#1610;&#1575;&#1606; &#1576;&#1606; &#1593;&#1610;&#1610;&#1606;&#1577; &#1608; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1575;&#1604;&#1605;&#1576;&#1575;&#1585;&#1603; &#1571;&#1606;&#1607;&#1605; &#1602;&#1575;&#1604;&#1608;&#1575; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1571;&#1605;&#1585;&#1608;&#1607;&#1575; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601; &#1608;&#1607;&#1603;&#1584;&#1575; &#1602;&#1608;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1580;&#1607;&#1605;&#1610;&#1577; &#1601;&#1571;&#1606;&#1603;&#1585;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1607;&#1584;&#1575; &#1578;&#1588;&#1576;&#1610;&#1607; &#1608;&#1602;&#1583; &#1584;&#1603;&#1585; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; &#1601;&#1610; &#1594;&#1610;&#1585; &#1605;&#1608;&#1590;&#1593; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576;&#1607; &#1575;&#1604;&#1610;&#1583; &#1608;&#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1576;&#1589;&#1585; &#1601;&#1578;&#1571;&#1608;&#1604;&#1578; &#1575;&#1604;&#1580;&#1607;&#1605;&#1610;&#1577; &#1607;&#1584;&#1607; &#1575;&#1604;&#1570;&#1610;&#1575;&#1578; &#1601;&#1601;&#1587;&#1585;&#1608;&#1607;&#1575; &#1593;&#1604;&#1609; &#1594;&#1610;&#1585; &#1605;&#1575; &#1601;&#1587;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1604;&#1605; &#1610;&#1582;&#1604;&#1602; &#1570;&#1583;&#1605; &#1576;&#1610;&#1583;&#1607; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1573;&#1606; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1610;&#1583; &#1607;&#1607;&#1606;&#1575; &#1575;&#1604;&#1602;&#1608;&#1577; &#1608;&#1602;&#1575;&#1604; &#1573;&#1587;&#1581;&#1602; &#1576;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; [&#1585;&#1575;&#1607;&#1608;&#1610;&#1607;] &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1578;&#1588;&#1576;&#1610;&#1607; &#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1610;&#1583; &#1603;&#1610;&#1583; &#1571;&#1608; &#1605;&#1579;&#1604; &#1610;&#1583; &#1571;&#1608; &#1587;&#1605;&#1593; &#1603;&#1587;&#1605;&#1593; &#1571;&#1608; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1601;&#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1587;&#1605;&#1593; &#1603;&#1587;&#1605;&#1593; &#1571;&#1608; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1601;&#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1588;&#1576;&#1610;&#1607; &#1608;&#1571;&#1605;&#1575; &#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1610;&#1583; &#1608;&#1587;&#1605;&#1593; &#1608;&#1576;&#1589;&#1585; &#1608;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604; &#1603;&#1610;&#1601; &#1608;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1608;&#1604;&#1575; &#1603;&#1587;&#1605;&#1593; &#1601;&#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1578;&#1588;&#1576;&#1610;&#1607;&#1575; &#1608;&#1607;&#1608; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; : &#1604;&#1610;&#1587; &#1603;&#1605;&#1579;&#1604;&#1607; &#1588;&#1610;&#1569; &#1608;&#1607;&#1608; &#1575;&#1604;&#1587;&#1605;&#1610;&#1593; &#1575;&#1604;&#1576;&#1589;&#1610;&#1585; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It has been stated by more than one person from the People of Knowledge about this hadeeth and what resembles it from the narrations, such as the Attributes, and the descent of our Lord - the Blessed and Most High -  to the lowest heaven every night. So they say: "Affirm these narrations, have eemaan (faith) in them, do not deny them, nor ask how." The likes of this has been related from Maalik ibn Anas, Sufyaan ath-Thawree, Ibn Uyainah and <a href='tags/abdullaah-ibn-al-mubaarak.html' class='tagLink'><font class='tagLink'>Abdullaah Ibn al-Mubaarak</font></a>, who all said about such ahaadeeth: "Leave them as they are, without asking how." Such is the saying of the People of Knowledge from the Ahl us-Sunnah wal-Jamaa'ah. However, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> oppose these narrations and say: This is tashbeeh! However, Allaah the Most High, has mentioned in various places in His Book, the Attribute of <a href='tags/al-yad.html' class='tagLink'><font class='tagLink'>al-yad</font></a> (Hand), as-Sama' (Hearing), and al-Basr (Seeing) - but the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> make <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a> of these aayaat, explaining them in a way, other than how they are explained by the People of Knowledge. They say: Indeed, Allaah did not create Aadam with His own Hand - they say that Hand means the Power of Allaah. <u>Ishaaq ibn Ibraheem ar-Raahawaih said</u>: <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> is if it is said: "Hand like my hand, or similar to my hand", or it is said: "Hearing like my Hearing,or similar to my hearing", then this is <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. But if what is being said is what Allah has said: Hand, Hearing, Seeing and it is not asked how, nor is it said: "Like my hearing, or similar to my hearing" - then it is not <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. Allaah, the Most Blessed, Most High, said in His Book (ash-Shooraa 42:11):     <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> There is none like unto Him, and he is the all-Hearing, the all-Seeing </b><img src='images/qnend.gif'></blockquote>  </blockquote>  <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?icwge by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:24 GMT -->
</html>


