

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?kiagk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:14 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Muhammad Sa'eed Ramadan Buti: We (The Ash'aris) and the Mu'tazilah are United that the Qur'an Is Created And What the Mu'tazilah Call 'Knowledge (al-Ilm)' and 'Will (al-Iraadah)', We Simply Call 'al-Kalaam an-Nafsee'</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Muhammad Sa'eed Ramadan Buti: We (The Ash'aris) and the Mu'tazilah are United that the Qur'an Is Created And What the Mu'tazilah Call 'Knowledge (al-Ilm)' and 'Will (al-Iraadah)', We Simply Call 'al-Kalaam an-Nafsee'</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Saturday, October, 10 2009 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/muhammad-saeed-ramadan-al-buti.html">
Muhammad Sa'eed Ramadan Al-Buti 
</a> &#149; <a href="tags/quran.html">
Qur'an 
</a> &#149; <a href="tags/quran.html">
Quran 
</a> &#149; <a href="tags/kalaam-nafsee.html">
Kalaam Nafsee 
</a> &#149; <a href="tags/muhammad-saeed-ramadan-al-buti.html">
Muhammad Sa'eed Ramadan Al-Buti 
</a> &#149; <a href="tags/quran.html">
Qur'an 
</a> &#149; <a href="tags/quran.html">
Quran 
</a> &#149; <a href="tags/kalaam-nafsee.html">
Kalaam Nafsee 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>All praise is due to Allaah and may the prayers and salutations be upon His Messenger, to proceed.    <P>
<img src=assets/images/buti-kubra-al-yaqeeniyyaat.gif border=1 align=right hspace=8 border=0>    <P>
<font class='titleHeadline'>Bayaan Talbees al-Ash'ariyyah [al-Kullaabiyyah al-Jahmiyyah]</font>    <P>
In previous articles we explained how the <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> believe in secret that the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> we recite and memorize is created (<a href=index7636.html?ajlfv >but they forbid that this should be said openly</a>). Then there was the saying of <a href='tags/fakhr-ud-din-ar-razi.html' class='tagLink'><font class='tagLink'>Fakhr ud-Din <a href="tags/ar-razi.html" class="tagLink"><font class="tagLink">ar-Razi</font></a></font></a> (d. 606H) that the As'haris and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> are actually agreed that the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> we have is created, but they just differ on issues of wording and terminology (<a href=index4fa5.html?hirxg >see here</a>). We also brought a quote from the Mufassir, <a href='tags/ibn-jareer-at-tabari.html' class='tagLink'><font class='tagLink'>Ibn Jareer <a href="tags/at-tabari.html" class="tagLink"><font class="tagLink">at-Tabari</font></a></font></a> (d. 310) <a href=index171b.html?xyfnr >in which he cleaned out the rat-holes and secret hideouts</a> of the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> in a single sweep, <a href=index171b.html?xyfnr >cursing them, reviling them and making takfeer of them</a> on account of their claiming the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is created - and may Allaah have mercy upon him.    <P>
So today, we are going to add to all of the above with a corroboration of it from a contemporary prominent Ash'ari and he is <a href='tags/muhammad-saeed-ramadan-al-buti.html' class='tagLink'><font class='tagLink'>Muhammad Sa'eed Ramadan al-Buti</font></a>.    <P>
  Its a good idea to go back to the article on the statement of <a href='tags/fakhr-ud-din-ar-razi.html' class='tagLink'><font class='tagLink'>Fakhr ud-Din <a href="tags/ar-razi.html" class="tagLink"><font class="tagLink">ar-Razi</font></a></font></a> and read the "Background" section so that this whole subject can be put into context (<a href=index4fa5.html?hirxg >read it here</a>).    <P>
<font class='titleHeadline'>The Statement of Muhammad Sa'eed Ramada al-Buti</font>    <P>
In the book, "Kubraa al-Yaqeeniyyaat al-Kawniyyah", al-Buti says (pp. 126-127), under a heading called "<b>The Essence of the difference between the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and Ahl us-Sunnah wal-Jamaa'ah</b>" (he means the Ash'aris and not the actual Ahl us-Sunnah wal-Jamaa'ah who are the Companions, Taabi'een and the early Salaf and their Imaams and whoever followed them in creed the methodology) so under this heading after outlining the Mu'tazili and Ash'ari viewpoints, he says:    <P>
<img src=assets/images/buti-kalam-nafsi.gif border=0>    <P>
The translation of which is (and with our comments):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And here the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> separated from the majority [meaning of the Ash'ari Scholars] since they do not ascribe an eternal attribute to Allaah with this meaning [that of the Ash'aris] whose name is "al-kalaam" or "al-kalaam an-nafsee".</blockquote>    <P>
Actually the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> were not the ones who separated from the majority on this issue of not affirming "al-kalaam an-nafsee". Rather it was the Kullaabis and the Ash'aris who blindly followed the saying of <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> (d. 240H) who innovated "al-kalaam an-nafsee" and there was no one from the Salaf who ever ascribed an eternal attribute called "al-kalaam an-nafsee" to Allaah.    <P>
It was Ibn Kullaab's attempts to reconcile between the saying of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> (the Qur'aan we have is created) and the saying of Ahl us-Sunnah, the Qur'aan is the speech of Allaah, uncreated. So <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> innovated the saying of "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>" (a meaning present with Allaah's Essence from eternity), and that the Qur'aan, being from that singular meaning, is qadeem (eternal), and this allowed the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> to say, "<i>The <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is Allaah's speech uncreated</i>" which appears to be truth, but in reality it is falsehood in light of what they intend by it and it is and nothing more than the saying of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>. Then <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> in his days in Baghdad, sitting in the circles of the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a>, took this saying, and he changed it a little, for the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> said the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> we have is a "quotation" (hikaayah) and <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> said it is in "ibaarah" (expression).    <P>
So al-Buti's claim here is incorrect, and it is important that when you speak about history, you get your facts straight, and that you know your factions and their statements in detali, and that you attribute them appropriately.     <P>
Ibn Taymiyyah (rahimahullaah) said in Majmoo' al-Fataawaa 6/528):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601; &#1593;&#1606;&#1583; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1581;&#1583;&#1610;&#1579;&#1548; &#1601;&#1607;&#1608; &#1602;&#1608;&#1604; &#1580;&#1605;&#1575;&#1607;&#1610;&#1585; &#1601;&#1585;&#1602; &#1575;&#1604;&#1571;&#1605;&#1577;&#1548; &#1601;&#1573;&#1606; &#1580;&#1605;&#1575;&#1607;&#1610;&#1585; &#1575;&#1604;&#1591;&#1608;&#1575;&#1574;&#1601; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1589;&#1608;&#1578; &#1605;&#1593; &#1606;&#1586;&#1575;&#1593;&#1607;&#1605; &#1601;&#1610; &#1571;&#1606; &#1603;&#1604;&#1575;&#1605;&#1607; &#1607;&#1604; &#1607;&#1608; &#1605;&#1582;&#1604;&#1608;&#1602;&#1548; &#1571;&#1608; &#1602;&#1575;&#1574;&#1605; &#1576;&#1606;&#1601;&#1587;&#1607;&#1567; &#1602;&#1583;&#1610;&#1605; &#1571;&#1608; &#1581;&#1575;&#1583;&#1579;&#1567; &#1571;&#1608; &#1605;&#1575; &#1586;&#1575;&#1604; &#1610;&#1578;&#1603;&#1604;&#1605; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569;&#1567; &#1601;&#1573;&#1606; &#1607;&#1584;&#1575; &#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1603;&#1585;&#1575;&#1605;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1608;&#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1605;&#1585;&#1580;&#1574;&#1577;&#1548; &#1608;&#1575;&#1604;&#1587;&#1575;&#1604;&#1605;&#1610;&#1577;&#1548; &#1608;&#1594;&#1610;&#1585; &#1607;&#1572;&#1604;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1581;&#1606;&#1601;&#1610;&#1577; &#1608;&#1575;&#1604;&#1605;&#1575;&#1604;&#1603;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1581;&#1606;&#1576;&#1604;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577;.    <P>
&#1608;&#1604;&#1610;&#1587; &#1605;&#1606; &#1591;&#1608;&#1575;&#1574;&#1601; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1571;&#1606;&#1603;&#1585; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1589;&#1608;&#1578; &#1573;&#1604;&#1575; &#1575;&#1576;&#1606; &#1603;&#1604;&#1575;&#1576; &#1608;&#1605;&#1606; &#1575;&#1578;&#1576;&#1593;&#1607; &#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1604;&#1610;&#1587; &#1601;&#1610; &#1591;&#1608;&#1575;&#1574;&#1601; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1602;&#1575;&#1604;: &#1573;&#1606; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1605;&#1593;&#1606;&#1609; &#1608;&#1575;&#1581;&#1583; &#1602;&#1575;&#1574;&#1605; &#1576;&#1575;&#1604;&#1605;&#1578;&#1603;&#1604;&#1605; &#1573;&#1604;&#1575; &#1607;&#1608; &#1608;&#1605;&#1606; &#1575;&#1578;&#1576;&#1593;&#1607;&#1548; &#1608;&#1604;&#1610;&#1587; &#1601;&#1610; &#1591;&#1608;&#1575;&#1574;&#1601; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1602;&#1575;&#1604;: &#1573;&#1606; &#1571;&#1589;&#1608;&#1575;&#1578; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1576;&#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1602;&#1583;&#1610;&#1605;&#1577; &#1571;&#1586;&#1604;&#1610;&#1577;&#1548; &#1608;&#1604;&#1575; &#1571;&#1606;&#1607; &#1610;&#1587;&#1605;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1589;&#1608;&#1578;&#1611;&#1575; &#1602;&#1583;&#1610;&#1605;&#1611;&#1575;&#1548; &#1608;&#1604;&#1575; &#1571;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1606;&#1587;&#1605;&#1593;&#1607; &#1606;&#1581;&#1606; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607;&#1548; &#1573;&#1604;&#1575; &#1591;&#1575;&#1574;&#1601;&#1577; &#1602;&#1604;&#1610;&#1604;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1606;&#1578;&#1587;&#1576;&#1610;&#1606; &#1573;&#1604;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1605;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1608;&#1571;&#1581;&#1605;&#1583; &#1608;&#1583;&#1575;&#1608;&#1583; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1548; &#1608;&#1604;&#1610;&#1587; &#1601;&#1610; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1610;&#1602;&#1608;&#1604;: &#1573;&#1606; &#1575;&#1604;&#1581;&#1585;&#1601; &#1575;&#1604;&#1584;&#1610; &#1607;&#1608; &#1605;&#1583;&#1575;&#1583; &#1575;&#1604;&#1605;&#1589;&#1575;&#1581;&#1601; &#1602;&#1583;&#1610;&#1605; &#1571;&#1586;&#1604;&#1610;&#1548; &#1601;&#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1581;&#1585;&#1601; &#1608;&#1575;&#1604;&#1589;&#1608;&#1578; &#1576;&#1605;&#1593;&#1606;&#1609; &#1571;&#1606; &#1575;&#1604;&#1605;&#1583;&#1575;&#1583; &#1608;&#1571;&#1589;&#1608;&#1575;&#1578; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583; &#1602;&#1583;&#1610;&#1605;&#1577; &#1576;&#1583;&#1593;&#1577; &#1576;&#1575;&#1591;&#1604;&#1577; &#1604;&#1605; &#1610;&#1584;&#1607;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575; &#1571;&#1581;&#1583; &#1605;&#1606; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577;&#1548; &#1608;&#1573;&#1606;&#1603;&#1575;&#1585; &#1578;&#1603;&#1604;&#1605; &#1575;&#1604;&#1604;&#1607; &#1576;&#1575;&#1604;&#1589;&#1608;&#1578;&#1548; &#1608;&#1580;&#1593;&#1604; &#1603;&#1604;&#1575;&#1605;&#1607; &#1605;&#1593;&#1606;&#1609; &#1608;&#1575;&#1581;&#1583;&#1611;&#1575; &#1602;&#1575;&#1574;&#1605;&#1611;&#1575; &#1576;&#1575;&#1604;&#1606;&#1601;&#1587; &#1576;&#1583;&#1593;&#1577; &#1576;&#1575;&#1591;&#1604;&#1577; &#1604;&#1605; &#1610;&#1584;&#1607;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575; &#1571;&#1581;&#1583; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601; &#1608;&#1575;&#1604;&#1571;&#1574;&#1605;&#1577;</div>    <P>
Which translates as:    <P>
<blockquote>And as this is known with Ahl us-Sunnah wal-Hadeeth, then it is also the saying of all of the sects of the Ummah, for the majority of all of the various factions say: "Allaah speaks with a voice" alongside their dispute regarding whether His speech (<a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>) is created (or not)? And is it established with His Self (or not)? And whether it is eternal (qadeem) or recent (haadith)? And whether He has never ceased being "one who speaks when He wills" (or not)?    <P>
For this (that Allaah speaks with a voice) is the saying of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/karraamiyyah.html' class='tagLink'><font class='tagLink'>Karraamiyyah</font></a>, Shee'ah, most of the Murji'ah, Saalimiyyah, and other than them from the Hanafiyyah, Maalikiyyah, Shaafi'iyyah, Hanbaliyyah and Soofiyyah.    <P>
And there is not from the factions of the Muslims anyone who rejected that Allaah speaks with a voice (sawt) except <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and whoever followed him.  Just like there is not from the factions of the Muslims who said: "<i>Speech (<a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>) is a singular meaning (ma'naa waahid) established with the one who speaks (mutakallim)</i>" except him (<a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a>) and whoever followed him. And there is not amongst the factions of the Muslims who said: "<i>The voices of the servants (when reciting) the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> are eternal</i>". And nor (anyone who said): "<i>That the voice being heard from the servants [from their recitation of the Qur'an] is eternal</i>". And nor (anyone who said): "<i>The <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> we hear (being recited) is being (heard directly) from Allaah</i>" - except a small faction from those who ascribe themselves to the people of hadeeth from the companions of ash-Shaafi'ee, Ahmad and Dawud and others. And there is not amongst the Muslims who says: "<i>The letter that is <u>the ink</u> of the written copies of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> (masaahif) is eternal</i>."    <P>
So the affirmation of letter and voice (al-harf was-sawt) with the meaning that the ink and voice of the servants is eternal is a futile innovation, not one of the Imaams held this [view]. And rejection of Allaah speaking with voice, and making His speech (<a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>) to be a single [indivisible] meaning, established with His Self, is a futile innovation, not one of the Salaf and the Imaams held this [view]. </blockquote>    <P>
This is the truth of the affair, and it is not permissible for the likes of al-Buti to make sweeping generalizations when characterizing and ascribing views to others, and as for what he says about <a href='tags/imaam-ahmad.html' class='tagLink'><font class='tagLink'>Imaam Ahmad</font></a> (see below), then this saying of <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> (rahimahullaah) addresses that.    <P>
Al-Buti continues:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>They (the Mu'tazilah) had said:     <P>
<blockquote>Indeed, the sense, meaning (madlool) of the expressions (ibaaraat) to which you have applied the name of "al-kalaam an-nafsee" returns in reality to the attribute of knowledge (ilm), if this meaning is information (khabar), and returns to the attribute of wish, desire (iraadah) if it is a command (amr) or prohibition (nahee) (and you will already know that they consider the wish, iraadah  and the command, amr, to be a single meaning). As for the expressions themselves, then their words are haadithah, makhlooqah (recent, created) from Allaah - just as we have all agreed (upon this) - for they are not the attribute of Allaah, the Most High, but they are a creation from amongst His creatures, and the [word] "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" is nothing but an explanation of this (meaning).</blockquote>    <P>
When you reflect upon what we have mentioned, you will have grasped the point of difference between the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and Ahl us-Sunnah wal-Jamaa'ah [he means the Ash'aris], and it is:    <P>
There is a meaning of the words of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> from which the command (al-amr), prohibition (an-nahee), information (al-khabar) are composed of and which are directed to mankind and which is eternal (qadeem) [referring here to the meaning, ma'naa]. So what is the name of this meaning (ma'naa)?    <P>
<u>The <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> [say]</u>: It's name is knowledge (al-ilm) if it is informing with knowledge (ikhbaar), and wish, desire (al-iraadah) if it is  command or prohibition.    <P>
<u>The majority (meaning of the Ash'aris) [say]</u>: It's name is "al-kalaam an-nafsee", and it is an attribute in addition to both knowledge (ilm) and wish (iraadah), which is established with the essence of Allaah.    <P>
<b>As for the speech (al-kalaam) which is the wording (al-lafdh), then they are agreed (the Ash'aris and Mu'tazilah) that it is created (makhlooq), and that it is not established with His, the Sublime's essence</b> - with the exception of Ahmad bin Hanbal and some of his followers. For they held [the view] that these letters and voices are also eternal in and of themselves, and that they are the meaning of the attribute of al-kalaam (speech).</blockquote>    <P>
The creed of the Salaf, without exception, and of <a href='tags/imaam-ahmad.html' class='tagLink'><font class='tagLink'>Imaam Ahmad</font></a> and the Imaams of the Salaf is that Allaah spoke the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a>, with letters, words and voice, with a voice that befits His Majesty - and the attribute of "sawt" is firmly established in the revealed texts and it takes the same way as all the other attributes, <a href='tags/ithbaat.html' class='tagLink'><font class='tagLink'>ithbaat</font></a> without <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a>, <a href='tags/tamtheel.html' class='tagLink'><font class='tagLink'>tamtheel</font></a>, <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>.     <P>
This is what <a href='tags/ibn-hajr.html' class='tagLink'><font class='tagLink'>Ibn Hajr</font></a> said on this issue (<a href=index5b23.html?igaob>see full article on this here</a>) in his explanation of Kibaat ut-Tawheed of Fath ul-Baaree:     <P>
<blockquote>The <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> said: Speech is not by (anything) but letter and voice, and the speech attributed to Allaah existed in the tree. And the Ashaa'irah said: The Speech of Allaah is not letter and voice, and they affirmed al-kalaam an-nafsee, whose reality is a meaning that is established with the Self, even if it may vary, such as [being in] Arabic or a foreign (language). And this difference (in language) does not indicate a difference in that which is being expressed (i.e. the meaning established with His self), as the <a href='tags/kalaam-nafsee.html' class='tagLink'><font class='tagLink'>Kalaam Nafsee</font></a> is that which is being expressed (through these languages).    <P>
And the Hanbalees affirmed that Allaah speaks by way of letter and sound, as for letters then that is due to their being explicitly stated in the apparentness of the Qur'aan. And as for voice, then whoever prevented (from this saying), he said that the voice is (formed through) the hearing of (the sound made through) blocked or interrupted air (occurring) in the larynx (throat). And those who affirmed the voice replied that voice that is described as such is what is well-known amongst men, just like hearing and seeing, but the Attributes of the Lord are different to that and thus, the aforementioned caution is not binding whilst holding a belief of tanzeeh (Allaah being far removed from deficiencies and imperfections) and absence of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (not resembling that voice to that of the creation), and that it is possible for (the voice) to be without a larynx (throat), and thus <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> is not binding (by affirming the voice for Allaah).     <P>
And Abdullaah bin Ahmad bin Hanbal said in the book Kitaab us-Sunnah: I asked my father about a people who say, when Allaah spoke to Moses, that he did not speak with a voice. So my father said to me, "Rather, He spoke with a voice. These ahaadeeth are to be reported as they have come", and then he mentioned the hadeeth of Ibn Mas'ood and others.</blockquote>    <P>
And it is clear from this that "as-sawt" is like all the other attributes, it has come in the revealed texts explicitly, and it is affirmed without <a href='tags/tamtheel.html' class='tagLink'><font class='tagLink'>tamtheel</font></a>, and <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a>, and <a href='tags/ibn-hajr.html' class='tagLink'><font class='tagLink'>Ibn Hajr</font></a> has rebutted the presumption of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. And <a href='tags/ibn-hajr.html' class='tagLink'><font class='tagLink'>Ibn Hajr</font></a> rebuts the saying of <a href='tags/al-bayhaqi.html' class='tagLink'><font class='tagLink'>al-Bayhaqi</font></a> who tries to bring evidence for negating that Allaah's speech is with letter and voice (al-harf was-sawt) in his explanation of Kitaab ut-Tawheed in Fath ul-Bari using the same rebuttal as above, and inshaa'Allaah we can put that into a separate article.    <P>
Thus, Allaah spoke the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> to Jibreel with a voice and Jibreel heard it. From Allaah did it originate, in the sense that the "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" (in letter, word and  meaning) belongs to Him, and then Jibreel conveyed that "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" which consists of letter, word and meaning, with his own voice to Muhammad (alayhis salaam), who conveyed this <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>, which is letter, word and  meaning, to the Ummah with his own voice - and <u>whatever is conveyed</u> is Allaah's uncreated speech, in letter and word.     <P>
So the Salaf believe that the name "ar-Rahmaan" with the letters "alif, laam, raa, haa, meem, alif, noon" is <u>an uncreated Name of Allaah</u>, it is from what Allaah spoke, and the same with everything in the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> - and as for the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> they believe the Names of Allah are created, and the <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a>, after penetrating their sophistry, also believe, in reality, that <a href='tags/allaahs-names.html' class='tagLink'><font class='tagLink'>Allaah's Names</font></a> are created - which is a saying following on from their saying that the letters and words in the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a>, which we recite, hear and memorize, are all created.    <P>
And as for the voice of the reciter and what is written in the mushaf of ink, and the inscription in the Preserved Tablet, then that is no doubt created, but what is meant as uncreated is the letters and words, they are all the uncreated speech of Allaah, they originated with Him. For when a person says "ar-Rahmaan", then we have two elements, the actual sound, voice, which is the created voice of the one who said this, but what is he saying, what is his utterance, it consists of letters that make up a word - that word originated with Allaah, it was spoken by Allaah, and it is uncreated.    <P>
And the Salaf declared as innovators and they made takfeer of the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> for claiming that this <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> that we have, in its letter and wording - not speaking about the voice of the reciter, or the ink in the written <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> - but the letter and wording is created. And this is the saying of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> and <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> - there being no difference between them as you can see, save the sophistry of "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>" innovated by <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and followed blindly by the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a>.    <P>
Al-Buti continues:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And we do not enter - after you have come to know the point of agreement and difference [between the Ash'aris and the Mu'tazilah] - into anything of debate and argument that have arose regarding this study [of this subject], due to our belief that [short] discourses are easier than [all of that].    <P>
And though we believe what the majority [i.e. of the Ash'aris] have tended to that the meaning (ma'naa, present with Allaah) which is the [original] sense, or meaning (madlool) behind of the expressions (ibaaraat), is name is "al-kalaam an-nafsee", and that it is an attribute in addition to both the attribute of knowledge and wish (al-ilm wal-iraadah), <b>except that the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> are all agreed, entirely, with the majority [meaning of Ash'ari scholars] in affirming this meaning for Allaah, the Most High, and that it is an eternal attribute established with His essence, even if they do not call it "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" like we do</b>.    <P>
And most of what you hear of the alarming reverberations of the historical difference in this matter, then the origin of it [all] is the difference between Ahmad bin Hanbal (radiallaahu anhu), and the other sects such as the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and Mu'tazilah  </blockquote>    <P>
Note here how al-Buti dismisses this issue as just something that originated with the difference between <a href='tags/imaam-ahmad.html' class='tagLink'><font class='tagLink'>Imaam Ahmad</font></a> and the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and that it is not an issue that should be entered into after it has become clear (according to him) that there is no real difference between the Ash'aris and the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> except one of wording only.    <P>
So here it is as clear as daylight, the Ash'ari viewpoint is no different from the Mu'tazili viewpoint that this <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> we have which we read, recite, memorize and hear, its letters and words are created. The only difference they have is one of words and labels.    <P>
Also read these articles:    <P>
<div class='sidebar'>  <ul><li><b>Fakhr ud-Deen <a href='tags/ar-razi.html' class='tagLink'><font class='tagLink'>ar-Razi</font></a> (d. 606H), Imaam of the Ash'aris: We Agree With the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> That the (Recited) <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is Created And Our Dispute Is One of Wording Only. </b><BR>  <a href=index4fa5.html?hirxg>http://www.asharis.com/creed/?hirxg</a>    <P>
<li><b>The <a href='tags/jahmite.html' class='tagLink'><font class='tagLink'>Jahmite</font></a> Ash'aris: The Qur'aan We Memorize and Recite Is Makhlooq (Created) And Is From <a href='tags/hudooth.html' class='tagLink'><font class='tagLink'>Hudooth</font></a> - But We Only Say That In Private, Not Openly - the <a href='tags/haashiyah.html' class='tagLink'><font class='tagLink'>Haashiyah</font></a> of al-Bayjoori</b><BR>  <a href=index7636.html?ajlfv >http://www.asharis.com/creed/?ajlfv </a>  </ul>  </div> <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?kiagk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:14 GMT -->
</html>


