

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?uwfub by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:19:25 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Aristotle of Stageira, Philo of Alexandria, Augustine of Hippo, the Sabeans of Harraan, the Mu'tazilites of Basrah and Baghdad and the Jahmite Ash'ari Heretics of Today Claiming Orthodoxy - Part 5</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Aristotle of Stageira, Philo of Alexandria, Augustine of Hippo, the Sabeans of Harraan, the Mu'tazilites of Basrah and Baghdad and the Jahmite Ash'ari Heretics of Today Claiming Orthodoxy - Part 5</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, December, 01 2010 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/aristotle.html">
Aristotle 
</a> &#149; <a href="tags/philo.html">
Philo 
</a> &#149; <a href="tags/augustine.html">
Augustine 
</a> &#149; <a href="tags/sabeans.html">
Sabeans 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>In the first four parts of this series we look at the influence of the conceptual tools of <a href='tags/aristotle.html' class='tagLink'><font class='tagLink'>Aristotle</font></a> upon the Jews, Christians and the Mutakallimin ((see   <a href=index5cf8.html?fsbea>Part 4</a>, <a href=index03de.html?wfjmn>Part 3</a>, <a href=indexb520.html?wtxta>Part 2</a>, <a href=index2670.html?kagzi>Part 1</a>). We established that there is to be found in the theology of the likes of <a href='tags/philo.html' class='tagLink'><font class='tagLink'>Philo</font></a> Judaeus (d. 50CE), <a href='tags/augustine.html' class='tagLink'><font class='tagLink'>Augustine</font></a> of Hippo (d. 430H), and the likes of <a href='tags/thomas-aquinas.html' class='tagLink'><font class='tagLink'>Thomas Aquinas</font></a> (d. 1274H) that which is identical, to the letter and word, to that which is found in the language of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> and Maturidiyyah. In particular it is the language of al-ajsaam and al-a'raad, and issues related to predication of attributes, qualities and actions, and maintaining indivisibility and immutability (absence of change) as the desired <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, and then purifying Allaah (making tanzih) of everything that opposes this <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> of al-Jawhar wal-'Arad, even if it be what Allaah and His Messenger affirmed for Him. It might be a good idea to familiarize yourself with the introductory background information that is provided in <a href=indexb520.html?wtxta>one of those earlier articles</a>, because with that background you will benefit much  more from the contents of the articles of this series, including this one.</div>    <P>
We also pointed out that the Mutakallimin never deliberately set out to use this language or these conceptuals tools, but that they fell prey to them because of the proof of huduth al-ajsaam which they made to be the unfalsifiable truth and something which Islam itself depends upon. Then they were forced to adhere to its lawaazim (binding necessities), which means the negation of all of Aristotle's ten categories from Allaah, which explains their language:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He is not a <a href='tags/jism.html' class='tagLink'><font class='tagLink'>jism</font></a> (body), nor a <a href='tags/jawhar.html' class='tagLink'><font class='tagLink'>jawhar</font></a> (<a href='tags/substance.html' class='tagLink'><font class='tagLink'>substance</font></a>), nor an <a href='tags/arad.html' class='tagLink'><font class='tagLink'>'arad</font></a> (incidental attribute) nor above, or below, or in direction (<a href='tags/jihah.html' class='tagLink'><font class='tagLink'>jihah</font></a>), or in place (makaan), or in spatial occupation (tahayyuz), nor does He act (with acts attributed to His essence), nor is He affectionate (be pleased, angered, or love), he does not have limits, nor temporal parts .... and so on.</blockquote>    <P>
This is called "negative theology", describing Allaah only with negative assertions, and this was what previous nations, like the <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a>, were upon. They were influenced in this by the philosophy of the Greeks. So we want to follow up those previous articles today by having a brief look at these <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> of Harraan.    <P>
<div class='sidebar'>These materials are taken from our forthcoming book, <b>The Creed of the Kullaabi Ash'arites</b>, to be published in due course by Allaah's permission (<a href=series/the-kullabi-ashari-creed-publication-previews.html>see here for excerpts</a>).</div>    <P>
Again we are going to make use of a third party source, a paper published on the <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> of Harraan.     <P>
<img src=assets/images/sabeans-harraan-a.gif border=0>    <P>
This paper is more to do with how the <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> of Harraan acquired what is called "The Classical Tradition" what this refers to is the philosophy and heritage of the early civilizations like the Greeks, Zoroastrians, and prominent individuals like Ptolemy, Euclid and others, and it is not focused on the theology of the <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> in particular, but there is a citation in there through al-Kindi.    <P>
Here it is:    <P>
<img src=assets/images/sabeans-harraan-b.gif border=0>    <P>
This is straightforward, and it is the foundation of al-Ja'd bin Dirham and the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> in denying the attributes and the foundation of the <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> and Maturidiyyah in denying some of Allaah's attributes and His actions tied to His will and power. Since  the attributes in the things caused are evidence of their being originated [upon the proof of huduth al-ajsaam which was first used by these <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> and then taken up by <u>all the Mutakallimin</u> as the foundation of their creed], then Allaah cannot be described with them. And Abu al-Hasan <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-<a href="tags/ashari.html" class="tagLink"><font class="tagLink">Ash'ari</font></a></font></a> affirms that this proof of al-ajsaam and al-a'raad originates with the Philosophers:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><font style="font-size:19px;line-height:26px">And that by which he (alayhis salaam) used to seek evidence through his reports is more clear and apparent in indication than the indication of [the proof] of al-a&#703;r&#257;&#7693; which the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>, those who followed them from the Qadariyyah [i.e. the Mu'tazilah], and the people of  innovation who deviated from the [the way of] Messengers depended upon in deducing evidence... But those [philosophers] who affirmed the recency of the universe and an originator for it sought proof [for this] through the [evidence of] al-a&#703;r&#257;&#7693; and al-ajs&#257;m due to their rejection of the Messengers and their rejection of the permissibility of their arrival (i.e. being sent).</font></blockquote>    <P>
Refer to <i>Ris&#257;lah il&#257; Ahl al-Thaghr</i> (ta&#7717;q&#299;q, &#703;Abd All&#257;h al-Junayd&#299;, Maktabah al-&#703;Ul&#363;m wal-&#7716;ikam, 2nd edition, 2002), p. 185, 191. This book of <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-<a href="tags/ashari.html" class="tagLink"><font class="tagLink">Ash'ari</font></a></font></a> is mentioned by Ibn Asaakir in Tabyin Kadhib al-Muftari (see p. 136).    <P>
These <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-<a href="tags/ashari.html" class="tagLink"><font class="tagLink">Ash'ari</font></a></font></a> is speaking of are <b>the Sabeans</b>, since amongst them were those who believed in the universe being originated and they devised this proof. When they devised this proof, they rejected all attributes for Allaah and described Him only in negatives "He is not a body (<a href='tags/jism.html' class='tagLink'><font class='tagLink'>jism</font></a>), He does not have attributes (<a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a>), He is not this, He is not that..." and so on, and hence the characterization of their belief by al-Kindi as:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The world has a cause who has never ceased to be, who is one, not manifold, who cannot be described by means of attributes which apply to the things caused.</blockquote>    <P>
Something similar is also mentioned by Ibn al-Nadim in al-Fihrist, he says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And their saying that All&#257;h is one (w&#257;hid), no attribute (sifah) is incumbent upon Him and no binding predicate is permitted to (be said of) Him and no syllogisms can be imposed upon Him , as occurs in [the book of Aristotle] <a href='tags/metaphysics.html' class='tagLink'><font class='tagLink'>Metaphysics</font></a>...</blockquote>    <P>
Refer to Ibn an-Nad&#299;m, <i>Al-Fihrist</i>, Section nine, part one, '<b>A Description of the Chaldean Harranians Known as the Sabeans</b>.' Al-Fihrist was translated into English by Bayard Dodge in two volumes (London, 1969).    <P>
Also, the above statement of al-Ash&#703;ar&#299; regarding the origins of the proof of &#7717;ud&#363;th al-ajs&#257;m is to be understood in light of the fact that al-Ash&#703;ar&#299; abandoned the way of the Mu&#703;tazilah and eventually considered this approach  of &#7717;ud&#363;th al-ajs&#257;m to be an innovation and inferior to the way of the Prophet (sallallaahu alayhi wasallam) in demonstrating his own truthfulness and the truthfulness of what he brought.     <P>
<div class='sidebar'><u>However</u>, al-Ash&#703;ar&#299; never considered this proof to be <u>false in and of itself</u> due to his shortcoming in seeing its corruption and whilst he considered it an innovation and discouraged it, he never refuted it. He simply considered it extremely long winded, too intricate, with too many differences of opinion even on its basic premises, and that the Prophets never called to this way, hence it is an innovation. But those who came after him, particularly al-B&#257;qill&#257;ni, opposed al-Ash&#703;ar&#299; and included it within his works, making it integral to the school and its treatment was pretty much taken entirely from the Mu&#703;tazilah. </div>    <P>
The point of evidence, however, in the above quote is that al-Ash&#703;ar&#299; affirms that this method of demonstrating that the universe is originated has its origins with the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> themselves, and they are the Sabean <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> from whom al-Ja&#703;d and al-Jahm took their doctrines. The reference to the Qadariyyah in the above quote is a reference to the Mu&#703;tazilah, these two terms were synonymous in that time because  the Mu&#703;tazilah championed and promulgated the innovation pertaining to al-Qadar. After the Sabean <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and Mu&#703;tazilah, this approach was taken up by the Ash&#703;ariyyah, M&#257;turidiyyah and also the <a href='tags/mujassimah.html' class='tagLink'><font class='tagLink'>Mujassimah</font></a>, <a href='tags/mushabbihah.html' class='tagLink'><font class='tagLink'>Mushabbihah</font></a> who are the Karr&#257;miyyah and the R&#257;fi&#7693;ah like the followers of Hish&#257;m bin al-&#7716;akam.     <P>
<div class='sidebar'>As for the proof of &#7717;ud&#363;th al-ajs&#257;m in all of the books of the Ash'arites:    <P>
<blockquote>Refer to al-Ash&#703;ar&#299; (d. 324H) in <i>al-Luma&#703; Fi al-Radd &#703;al&#257; Ahl al-Zaygh</i> (this was when he had recently left the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, in his later books like <i>Ris&#257;lah il&#257; Ahl al-Thaghar</i>, he considered this proof an innovation), then al-B&#257;qill&#257;n&#299; (d. 403H), in <i>al-Tamh&#299;d al-Aw&#257;'il</i>,  then &#703;Abd al-Qahir al-Baghd&#257;d&#299; (d. 429H) in <i>Kit&#257;b U&#7779;&#363;l al-D&#299;n</i>, then al-Isfar&#257;y&#299;n&#299; (d. 471H) in <i>al-Tab&#7779;&#299;r Fil-D&#299;n</i>, then al-Juwayn&#299; (d. 478H) in <i>Kit&#257;b al-Irsh&#257;d</i> and also <i>al-Sh&#257;mil F&#299; U&#7779;&#363;l al-Din</i>, then al-Ghaz&#257;l&#299; (d. 505H) in <i>al-Iqtis&#257;d F&#299; al-I&#703;tiq&#257;d</i>, and also <i>Tah&#257;fut al-Fal&#257;sifah</i>, then al-Shahrast&#257;n&#299; (d. 548H) in <i>Nih&#257;yah al-Aqd&#257;m</i>, then al-R&#257;z&#299; (d. 606H) in <i>Mu&#7717;a&#7779;&#7779;al Afk&#257;r al-Mutaqaddim&#299;n wal-Muta'akhkhir&#299;n</i> and also <i>Kit&#257;b al-Arba&#703;&#299;n F&#299; U&#7779;&#363;l al-D&#299;n</i>, then al-&#298;j&#299; (d. 756H) in <i>al-Maw&#257;qif F&#299; &#703;Ilm al-Kal&#257;m</i>. The proof of huduth al-ajsaam is in all their books. <b><u>IT IS THE ULTIMATE FOUNDATION OF THEIR THEOLOGY</u></b>. However, when its falsehood became apparent to some of the later ones amongst them, they started incorporating other proofs, the proof of tarkib (composition) and the proof of takhsis (specification) into their works - and both are taken from the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> themselves - in order to cover their backs and to hide that vulnerability. Others were not smart enough to realise the flaw in huduth al-ajsaam, so they remained upon it, defending it.</blockquote>     <P>
And you can see some examples from the Mu'tazil, al-Qadi Abdul-Jabbar,, and also <a href='tags/al-baqillani.html' class='tagLink'><font class='tagLink'>al-<a href="tags/baqillani.html" class="tagLink"><font class="tagLink">Baqillani</font></a></font></a> (d. 403H), al-Baghdadi (d. 4299H), and <a href='tags/al-juwayni.html' class='tagLink'><font class='tagLink'>al-Juwayni</font></a> (d. 478H) in this article:    <P>
<ul><li> <b>Aristotelians Anonymous: 1st Workshop</b> - Admitting Your Creed Is Built Around Aristotle's Maqoolaat Is the First Step to Recovery - (<a href=index27ca.html?mrgly>see here</a>)</ul>    <P>
</div>    <P>
Shaykh al-Islam bin Taymiyyah said in <i>Minh&#257;j al-Sunnah al-Nabawiyyah</i> (8/5):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There was no one from the Companions or T&#257;bi&#703;&#299;n who sought evidence for the origination of the universe through the [proof] of &#7717;ud&#363;th al-ajs&#257;m, or who established the origination of bodies with the evidence of a&#703;r&#257;&#7693; (incidental attributes) and motion and rest, and that the bodies require them and are not separable from them and that whatever does not precede originated events, must itself be an event, and building this upon the issue of [the negation that] events have no beginning. The first from whom this speech appeared in Isl&#257;m after the first century was from the direction of al--Ja&#703;d bin Dirham and al-Jahm bin &#7778;afw&#257;n, then it was taken up by the associates of &#703;Amr bin &#703;Ubayd [the Mu&#703;tazilah] ...</blockquote>    <P>
<font class='titleHeadline'>Closing Notes and Conclusions</font>    <P>
We can bring this series to a close now, and much has already been said, we can just re-iterate the facts.     <P>
<blockquote>The conceptual tools of <a href='tags/aristotle.html' class='tagLink'><font class='tagLink'>Aristotle</font></a> corrupted many a nation aforetime, from the <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a>, Jews and Christians, and they used these tools in their theology. The Mutakallimin in Islam also spoke with the same language of those earlier ones in describing their Lord, but they did not initially set out to do so. Rather, they were forced to do so when they adopted the proof of huduth al-ajsaam which came into the Ummah through al-Ja'd bin Dirham, <a href='tags/al-jahm-bin-safwan.html' class='tagLink'><font class='tagLink'>al-<a href="tags/jahm-bin-safwan.html" class="tagLink"><font class="tagLink">Jahm bin Safwan</font></a></font></a> and the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>. It was later taken up by the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a> and the Maturidiyyah. Then they were forced to abide by all of its lawaazim (binding necessities) which is to reject all names, attributes and actions for Allaah. However, they then differed on these lawaazim and exactly what can and cannot be affirmed or denied for Allaah whilst remaining consistent with this proof. This is the real nature of the difference between the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> and Maturidiyyah. Further, they are united with the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> (like Ibn Sinah, al-Farabi and others) that the real truth lies in what is proven by reason (aql) and not what is in the revealed texts (which is nothing but tajsim and tashbih) and what the Mutakallimin actually mean here is the proof of huduth al-ajsaam. Whenever they say, "reason proves this" or "reason denies that", what they really mean is that the proof of huduth al-ajsaam confirms or denies this. So they made this the foundation of their speech concerning their Lord. But whilst they were forced to agree with the type of the language of the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> and <a href='tags/sabeans.html' class='tagLink'><font class='tagLink'>Sabeans</font></a> in describing their Lord, they differed with them and fought them on the matters of the origination or eternity of the universe, revelation and prophethood.    <P>
Unfortunately, they used corrupt, flawed, defective tools (the ilm al-kalaam, that of al-ajsaam and al-a'raad which the Salaf condemned) and as a result they did more harm than good. This is because the proof of huduth al-ajsaam is itself corrupt and flawed and can be used to prove the universe is eternal. For this reason the later <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a>, the shrewd ones amongst them, when they cottoned on to this, started to diversify in order to cover their backs, and once again all they did was to borrow the proofs of the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>, the proof of tarkib (composition) and the proof of takhsis (specification). Both of these were laid down by <a href='tags/ibn-sina.html' class='tagLink'><font class='tagLink'>Ibn Sina</font></a> (d. 429H) who is supposed to be the arch-enemy of the Mutakallimin, and he was indeed a shrewd and nasty zindeeq, far smarter than the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a>, he gamed them good and proper, as we will outline in a separate article inshaa'Allaah, but we see here, how the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a> just went deeper and deeper into the abyss. Eventually <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a> was simply hybridized with <a href='tags/falsafah.html' class='tagLink'><font class='tagLink'>Falsafah</font></a>.    <P>
Today what we have are deluded, intellectually-bankrupt, mightily confused, pseudo-intellectuals, posing as "Ash'aris" and this would include the learned amongst them who conceal the truth from their followers, people like Hamza Yusuf, <a href='tags/nuh-keller.html' class='tagLink'><font class='tagLink'>Nuh Keller</font></a> and their likes. When this is the condition of these people, what then do you expect of the average <a href='tags/asharite.html' class='tagLink'><font class='tagLink'>Ash'arite</font></a>?     <P>
<div class='sidebar'>So we make du'a for the average <a href='tags/asharite.html' class='tagLink'><font class='tagLink'>Ash'arite</font></a>, who ascribes to <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-<a href="tags/ashari.html" class="tagLink"><font class="tagLink">Ash'ari</font></a></font></a> with good intention, who is sincere, and is wishing to arrive at the truth, we ask Allaah to guide them, to cleanse them from this impurity of <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a> [the specific <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a> condemned by the Salaf upon which the theology of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> and Maturidiyyah is based upon entirely], it is a disease, a virus, and it's extremely hard to let go of that baatil once it catches you. So we ask Allaah to guide them to the truth. Ameen. As for the shayaateen amongst them, and there are indeed wicked shayaateen amongst them who are not sincere at all, rather they are pleased with baatil and even if all the proofs and evidences were sitting on their noses, their bigotry, envy, hatred and other diseases of the heart would prevent them from accepting the truth themselvess, and likewise prevent them from directing those whom they have sway over to the truth. So Allah is watchful over them and we ask Allaah to guide them or break their backs. Ameen.</div>    <P>
Finally, <u>all praise</u> is due to Allah who grants succes in following the revealed Books and sent Messengers in affirming for Him what He and His Messengers affirmed for Him without takyif and tamthil and tahrif and ta'til, and all praise is due to Allaah who saves from following the Greek and Sabean star and idol worshipping pagan disbelievers, their conceptual tools of al-ajsaam and al-a'raad, their language in theism and their "negative theology" all of which does not fulfil the objective and does nothing but destroy the mind, and as the Salaf said, whoever entered into <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>, never prospered and lost his reason (aql).</blockquote>    <P>
    <P>
    <P>
 <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?uwfub by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:19:25 GMT -->
</html>


