

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?cqcvp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | The Ash'ari Clinic: 3rd Case Study of 'Ash'ari Burnout' - Psychologically Disturbed Lone Ash'ari Mujassim Stalks Blogs and Forums Asking Forbidden Questions</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">The Ash'ari Clinic: 3rd Case Study of 'Ash'ari Burnout' - Psychologically Disturbed Lone Ash'ari Mujassim Stalks Blogs and Forums Asking Forbidden Questions</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Sunday, November, 01 2009 and
 filed under <a href="categories/ww-the-clinic.html">The Clinic</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/the-clinic.html">
The Clinic 
</a> &#149; <a href="tags/ashari-burnout.html">
Ash'ari Burnout 
</a> &#149; <a href="tags/ahmed-cobra.html">
Ahmed Cobra 
</a> &#149; <a href="tags/the-clinic.html">
The Clinic 
</a> &#149; <a href="tags/ashari-burnout.html">
Ash'ari Burnout 
</a> &#149; <a href="tags/ahmed-cobra.html">
Ahmed Cobra 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><b>Just in!</b> Third case of "<a href="tags/ashari-burnout.html" class="tagLink"><font class="tagLink">Ash'ari Burnout</font></a>". To learn more <a href=categories/the-clinic.html>please see this page</a>. "<a href="tags/ashari-burnout.html" class="tagLink"><font class="tagLink">Ash'ari Burnout</font></a>" is a phenomenon arising when the inability to satisfactorily resolve and come to terms with certain (historical) facts and information results firstly in "psychological denial" which disturbs the mental constitution, then denial of the denial secondly, and then finally, barely comprehensible, illogical, irrational "outbursts" taking place mainly on blogs and forums.     <P>
<font class='titleHeadline'>Introduction And Backround Information For the Case</font>    <P>
This case is fresh, <u>and has just been reported</u>. It appears a lone As'hari Burnout victim is letting loose and regurgitating the mutterings of the ancient <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> - [that the likes of Fudayl bin 'Iyaad (d. 187H) and Hammaad bin Zayd (d. 179H) and Ishaaq bin Raahawaih (d. 238H) had to deal with in the late second and early third century hijrah - <a href=indexa274.html?zrchw>see their quotes in this article</a>] - so he's making these mutterings with a view to arguing the case for <u>the Aristotelian Tawheed</u> that is centered around the notions of al-jawhar (<a href='tags/substance.html' class='tagLink'><font class='tagLink'>substance</font></a>) and al-'arad (incidental attribute) - these terminologies and classifications being the foundations of a [flawed, corrupt] intellectual proof called "<a href="tags/hudooth-ul-ajsaam.html" class="tagLink"><font class="tagLink">hudooth ul-ajsaam</font></a>" that is used to demonstrate that all the bodies (ajsaam) that make up the universe are a bunch of events (hawaadith) because they have incidental attributes (<a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a>) and occurrences (hawaadith) that take place in them, and since occurrences (hawaadith) must have a beginning, there must be an originator for these events, a creator. And once this is established, prophethood can now be argued for as can resurrection against those same atheists from whom this language and terminology was borrowed in the first place. <b>And since they treated this proof to be the ultimate truth upon which the veracity of the religion itself depends upon, they are forced to make all of their speech regarding Allaah to be nothing but a series of negations based around these same terms</b>.     <P>
Ibn Suraij as-Shafi'ee (d. 306H) said, as narrated from him by Abu Ismaa'eel al-Harawi in "Dhamm ul-Kalaam" and as mentioned by <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> in "<a href="tags/bayaan-talbees-al-jahmiyyah.html" class="tagLink"><font class="tagLink">Bayaan Talbees al-<a href="tags/jahmiyyah.html" class="tagLink"><font class="tagLink">Jahmiyyah</font></a></font></a>":    <P>
<div class='arabic' align='right' lang='AR-SA'> &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1588;&#1607;&#1583; &#1571;&#1606; &#1604;&#1575; &#1575;&#1604;&#1607; &#1575;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1606; &#1605;&#1581;&#1605;&#1583;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604; &#1575;&#1604;&#1582;&#1608;&#1590; &#1601;&#1610; &#1575;&#1604;&#1571;&#1593;&#1585;&#1575;&#1590; &#1608;&#1575;&#1604;&#1571;&#1580;&#1587;&#1575;&#1605; &#1608;&#1575;&#1606;&#1605;&#1575; &#1576;&#1593;&#1579; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1576;&#1575;&#1606;&#1603;&#1575;&#1585; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Tawheed of the people of knowledge and the jamaa'ah of the Muslims is "<i>I testify none is worthy of worship except Allaah (alone) and that Muhammad is the Messenger of Allaah</i>". And the Tawheed of the people of falsehood is disputing about al-a'raad (incidental attributes) and al-ajsaam (bodies) and the Prophet (sallallaahu alayhi wasallam) was sent with the rejection of that.</blockquote>    <P>
Thus Tawheed is centered around nothing but purifying Allaah of the <a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a> (incidental attributes) and occurrences (hawaadith) that are characteristic of bodies (ajsaam) - so the language of Tawheed now becomes, "<i>Allaah is not a <a href='tags/jism.html' class='tagLink'><font class='tagLink'>jism</font></a>, nor a <a href='tags/jawhar.html' class='tagLink'><font class='tagLink'>jawhar</font></a>, nor an <a href='tags/arad.html' class='tagLink'><font class='tagLink'>'arad</font></a>, nor above, nor below, nor within, nor without, He does not have a place, nor direction </i>...", and thus Tawheed becomes nothing but a series of negations all aimed at ensuring that Allaah is not described with anything that hints at <a href='tags/jismiyyah.html' class='tagLink'><font class='tagLink'>Jismiyyah</font></a> (being a body).     <P>
Thus Tawheed has gone from being:     <P>
<blockquote>Affirming whatever Allaah affirmed for Himself in His Book or upon the tongue of His Messenger (alayhis salaam) and negating whatever Allaah and His Messenger negated from Him, and adhering to that language on the basis that Allaah is most knowledgeable of His Self, the most eloquent in conveying and expressing that knowledge and His Messenger being the most sincere in intending guidance for the Ummah. And affirming what is affirmed for Allaah in the revealed texts without <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a> (asking or specifying how) and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (resemblance to the creation).</blockquote>    <P>
and turned instead to:    <P>
<blockquote>Ensuring Allaah is not described with anything that falls under Aristotle's Ten Categories (al-Maqoolaat al-Ashar), otherwise known as al-Jawhar wal-'Arad which is the terminology of the atheist <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> for classifying the observable universe - for if Allaah is described with what amounts to <a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a> (incidental attributes) or events (hawaadith) it would mean that He is a body (<a href='tags/jism.html' class='tagLink'><font class='tagLink'>jism</font></a>) - and the intellectual proof is invalidated, for it now means that Allaah is also just an event and is created. </blockquote>    <P>
<img src=assets/images/aristotle-maqoolaat-al-ashar.gif border=1 border=0>    <P>
And whenever a Sunni Muthabbit speaks with the language of the Messengers and restricts himself to that, nothing more and nothing less, when speaking in the affair of Tawheed, and says for example, as Allaah said, and the Messenger said, and the Companions said, and all the Salaf said, and the early Kullaabi Ash'aris said, "<i>Allaah is above the Throne</i>" except that this Sunni Muthabbit is assaulted by an Aristotelian tail-end - "<i>Hey that's location (makaan) and that's kufr!</i>" - and so the revealed texts became subject to evaluation by the language, terminology and classification of the atheist <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>, and were of little value in providing knowledge about Allaah, the Most High.    <P>
    <P>
<font class='titleHeadline'>Case Involving Lone Ash'ari Mujassim Attempting To Make the Revealed Texts Subservient and Subject to the Rules and Necessities of Aristotelian Tawheed</font>    <P>
Inshaa'Allaah we will be give special care and attention to this case, and we advise all those who come in the vicinity of this victim to just keep quite and to back off <u>and not to make any further interaction</u> with the victim. Let's first start with the "intellectual dump" of this burnout victim.     <P>
<img src=assets/images/clinic-case3-nuzool-a.gif border=1 border=0>    <P>
With his brain obviously fizzled and mashed and unable to escape that <u>asylum of Aristotelian language and terminology</u> (al-jawhar wal-arad - al-maqoolaat al-ashar (the ten categories) - <a href=indexab1a.html?iowfm>see here</a>) which he has been defrauded to believe to be the ultimate criterion for what constitutes Tawheed, we are seeing those same symptoms that were observed by the Salaf from the early <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> of the mid-second century hjrah of asking questions about the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> - "<i>Does Allaah enter the creation?</i>", "<i>Does He leave <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>?</i>", "<i>Does He become under <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>?</i>".     <P>
These types of questions and problems with that which has come in the authentic narrations is not surprising since <a href='tags/jahm-bin-safwan.html' class='tagLink'><font class='tagLink'>Jahm bin Safwan</font></a> (ex. 128H) utilized the same notions (of the language and terminology of the atheist philosophers) to devise a crude version of that intellectual proof against the Indian Materialist <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> (the Sumaniyyah) and as a result of which he had to deny much of what came in the Book and the Sunnah. This was out of the fear of invalidating his intellectual proof against the Atheists by describing Allaah with such things (that came in the revealed texts) that would have amounted to - [in accordance with his intellectual proof using the notions of <a href='tags/jawhar.html' class='tagLink'><font class='tagLink'>jawhar</font></a> (<a href='tags/substance.html' class='tagLink'><font class='tagLink'>substance</font></a>) and <a href='tags/arad.html' class='tagLink'><font class='tagLink'>'arad</font></a> (incidental attribute)] - Allaah being a <a href='tags/jism.html' class='tagLink'><font class='tagLink'>jism</font></a> (body).    <P>
<img src=assets/images/straight-jacket.gif align=right hspace=8 border=0> The victim's question question is similar to what the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> started asking around the mid-second century pertaining to Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>. <u>The first course of action with this victim is to put him in a straight-jacket</u>.  This is because despite being a burnout victim, he's actually trying to be smart and sophisticated and intending to make mockery of the revealed texts, those which the Salaf took with unanimous acceptance. So the straight-jacket is the only way to deal with cases like these. And while the victim becomes comfortable in the straight-jacket, we can start explaining some background to the observers.    <P>
<font class='titleHeadline'>Are the Deniers of the Attributes <a href='tags/mushabbihah.html' class='tagLink'><font class='tagLink'>Mushabbihah</font></a> and <a href='tags/mujassimah.html' class='tagLink'><font class='tagLink'>Mujassimah</font></a>?</font>    <P>
The answer is yes, as has been said by Ahl us-Sunnah that the Mu'ttilah (deniers of the attributes) first made <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (in their hearts and minds), and then they made <a href='tags/tateel.html' class='tagLink'><font class='tagLink'>ta'teel</font></a>. Take a good read of what has been narrated by Imaam at-Tirmidhi of the concensus of the Salaf on the subject of the Attributes. <a href='tags/at-tirmidhee.html' class='tagLink'><font class='tagLink'>At-Tirmidhee</font></a> (d. 279H) said in his Sunan (1/128-129):    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'> &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1594;&#1610;&#1585; &#1608;&#1575;&#1581;&#1583; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1608;&#1605;&#1575; &#1610;&#1588;&#1576;&#1607; &#1607;&#1584;&#1575; &#1605;&#1606; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1608;&#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1585;&#1576; &#1578;&#1576;&#1575;&#1585;&#1603; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1602;&#1575;&#1604;&#1608;&#1575; &#1602;&#1583; &#1578;&#1579;&#1576;&#1578; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1601;&#1610; &#1607;&#1584;&#1575; &#1608;&#1610;&#1572;&#1605;&#1606; &#1576;&#1607;&#1575; &#1608;&#1604;&#1575; &#1610;&#1615;&#1578;&#1614;&#1608;&#1614;&#1607;&#1617;&#1614;&#1605; &#1608;&#1604;&#1575; &#1610;&#1602;&#1575;&#1604; &#1603;&#1610;&#1601;. &#1607;&#1603;&#1584;&#1575; &#1585;&#1608;&#1610; &#1593;&#1606; &#1605;&#1575;&#1604;&#1603; &#1608; &#1587;&#1601;&#1610;&#1575;&#1606; &#1576;&#1606; &#1593;&#1610;&#1610;&#1606;&#1577; &#1608; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1575;&#1604;&#1605;&#1576;&#1575;&#1585;&#1603; &#1571;&#1606;&#1607;&#1605; &#1602;&#1575;&#1604;&#1608;&#1575; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1571;&#1605;&#1585;&#1608;&#1607;&#1575; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601; &#1608;&#1607;&#1603;&#1584;&#1575; &#1602;&#1608;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1580;&#1607;&#1605;&#1610;&#1577; &#1601;&#1571;&#1606;&#1603;&#1585;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1607;&#1584;&#1575; &#1578;&#1588;&#1576;&#1610;&#1607; &#1608;&#1602;&#1583; &#1584;&#1603;&#1585; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; &#1601;&#1610; &#1594;&#1610;&#1585; &#1605;&#1608;&#1590;&#1593; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576;&#1607; &#1575;&#1604;&#1610;&#1583; &#1608;&#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1576;&#1589;&#1585; &#1601;&#1578;&#1571;&#1608;&#1604;&#1578; &#1575;&#1604;&#1580;&#1607;&#1605;&#1610;&#1577; &#1607;&#1584;&#1607; &#1575;&#1604;&#1570;&#1610;&#1575;&#1578; &#1601;&#1601;&#1587;&#1585;&#1608;&#1607;&#1575; &#1593;&#1604;&#1609; &#1594;&#1610;&#1585; &#1605;&#1575; &#1601;&#1587;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1604;&#1605; &#1610;&#1582;&#1604;&#1602; &#1570;&#1583;&#1605; &#1576;&#1610;&#1583;&#1607; &#1608;&#1602;&#1575;&#1604;&#1608;&#1575; &#1573;&#1606; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1610;&#1583; &#1607;&#1607;&#1606;&#1575; &#1575;&#1604;&#1602;&#1608;&#1577; &#1608;&#1602;&#1575;&#1604; &#1573;&#1587;&#1581;&#1602; &#1576;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; [&#1575;&#1604;&#1585;&#1575;&#1607;&#1608;&#1610;&#1607;] &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1578;&#1588;&#1576;&#1610;&#1607; &#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1610;&#1583; &#1603;&#1610;&#1583; &#1571;&#1608; &#1605;&#1579;&#1604; &#1610;&#1583; &#1571;&#1608; &#1587;&#1605;&#1593; &#1603;&#1587;&#1605;&#1593; &#1571;&#1608; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1601;&#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1587;&#1605;&#1593; &#1603;&#1587;&#1605;&#1593; &#1571;&#1608; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1601;&#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1588;&#1576;&#1610;&#1607; &#1608;&#1571;&#1605;&#1575; &#1573;&#1584;&#1575; &#1602;&#1575;&#1604; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1610;&#1583; &#1608;&#1587;&#1605;&#1593; &#1608;&#1576;&#1589;&#1585; &#1608;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604; &#1603;&#1610;&#1601; &#1608;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604; &#1605;&#1579;&#1604; &#1587;&#1605;&#1593; &#1608;&#1604;&#1575; &#1603;&#1587;&#1605;&#1593; &#1601;&#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1578;&#1588;&#1576;&#1610;&#1607;&#1575; &#1608;&#1607;&#1608; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; : &#1604;&#1610;&#1587; &#1603;&#1605;&#1579;&#1604;&#1607; &#1588;&#1610;&#1569; &#1608;&#1607;&#1608; &#1575;&#1604;&#1587;&#1605;&#1610;&#1593; &#1575;&#1604;&#1576;&#1589;&#1610;&#1585; </div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It has been stated by more than one person from the People of Knowledge about such ahaadeeth, that there is no <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (resemblance) to the Attributes of Allaah, and our Lord - the Blessed and Most High - descends to the lowest heaven every night. So they say: "Affirm these narrations, have eemaan (faith) in them, do not deny them, nor ask how." The likes of this has been related from Maalik ibn Anas, Sufyaan ath-Thawree, Ibn Uyainah and <a href='tags/abdullaah-ibn-al-mubaarak.html' class='tagLink'><font class='tagLink'>Abdullaah Ibn al-Mubaarak</font></a>, who all said about such ahaadeeth: "Leave them as they are, without asking how." Such is the saying of the People of Knowledge from the Ahl us-Sunnah wal-Jamaa'ah. <u>However, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> oppose these narrations and say: This is tashbeeh!</u>     <P>
<b>Allaah the Most High, has mentioned in various places in His Book, the Attribute of <a href='tags/al-yad.html' class='tagLink'><font class='tagLink'>al-yad</font></a> (Hand), as-Sama' (Hearing), and al-Basr (Seeing) - but the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> make <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a> of these aayaat, explaining them in a way, other than how they are explained by the People of Knowledge</b>. They say: Indeed, Allaah did not create Aadam with His own Hand - they say that Hand means the Power of Allaah. Ishaaq ibn Ibraheem [ar-Raahawaih] said:     <P>
<blockquote>Tashbeeh is if it is said: "Hand like my hand, or similar to my hand", or it is said: "Hearing like my Hearing,or similar to my hearing", then this is <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. But if what is being said is what Allah has said: Hand, Hearing, Seeing and it is not asked how, nor is it said: "Like my hearing, or similar to my hearing" - then it is not <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. Allaah, the Most Blessed, Most High, said in His Book (ash-Shooraa 42:11):   "<b>There is none like unto Him, and he is the all-Hearing, the all-Seeing</b>" </blockquote> </blockquote>     <P>
This statement of at-Tirmidhi and what at-Tirmidhi has quoted from Ishaaq bin Raahawaih, shows <u>the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> presumed that whatever has come in the revealed texts of such attributes is inherently <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> and tajseem</u>. It is for this reason they resorted to pure <a href='tags/tateel.html' class='tagLink'><font class='tagLink'>ta'teel</font></a> or <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a>. So the i'tiqaad (belief) of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> regarding the texts, originated with them. <u>The Ash'aris clearly state this in their books, and its no hidden matter</u> - the opponent cannot deny it - for they say that when any text gives the presumption of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> or <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a>, then it is obligatory to make <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a> or tafweed. So when they see in the revealed texts, "<u>yad</u>", "<u>wajh</u>", "<u><a href='tags/istiwaa.html' class='tagLink'><font class='tagLink'>istiwaa</font></a></u>" and the likes, they immediately think these are only the attributes of bodies. Thus, the i'tiqaad (belief) of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> and <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> is the starting point for them, and as such they are the <a href='tags/mushabbihah.html' class='tagLink'><font class='tagLink'>Mushabbihah</font></a> and <a href='tags/mujassimah.html' class='tagLink'><font class='tagLink'>Mujassimah</font></a> in reality. When this thought of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> and <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> hits their hearts and minds (because that is what they presume about the revealed texts), it disturbs them and so they are forced to deny these attributes - even though they deceptively claim they affirm the attributes. What they really mean is "We affirm <u>the existence of the words</u> yad, and wajh and <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> in the revealed texts" - and this is not the same as making an affirmation of existence for the actual attributes themselves. See <a href='tags/al-khatib-al-baghdadi.html' class='tagLink'><font class='tagLink'>al-Khatib al-Baghdadi</font></a> dealing with their deception in this regard <a href=index4487.html?nwlcy>in this article</a>.    <P>
Tashbeeh and <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> occurs at two levels:     <P>
<blockquote><b>The first</b> is when one exaggerates in affirmation of what has come in the texts and says "<i>hand like my hand</i>" and "<i>seeing like my seeing</i>" and "<i>hearing like my hearing</i>". This is the <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> of the <a href='tags/mushabbihah.html' class='tagLink'><font class='tagLink'>Mushabbihah</font></a> who believe that they cannot have really affirmed these attributes or believed in these texts without doing so upon the kaifiyyah found in the creation. This is their false presumption. Thus, they exaggerated in <a href='tags/ithbaat.html' class='tagLink'><font class='tagLink'>ithbaat</font></a> (affirmation) in this manner, thinking that only this type of <a href='tags/ithbaat.html' class='tagLink'><font class='tagLink'>ithbaat</font></a> (affirmation) signifies an actual acceptance of what Allaah affirmed for Himself. These people fell into <a href='tags/tateel.html' class='tagLink'><font class='tagLink'>ta'teel</font></a> through their <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>, because in likening the Attributes of Allaah with those of the creation they denied the reality of Allaah's attributes as they really are. This is why it is said, "<i>Every Mushabbih is a Mu'attil</i>".    <P>
<b>The second</b> is when one fails to separate between the <u>meaning (ma'naa)</u> on the one hand and the <u>kayf, haqeeqah (true reality)</u> on the other, with respect to what has come in the revealed texts. So in essence they hold that <u>the kayf is the meaning and is synonymous to it and inseparable from it</u> - and this is from their jahl (ignorance) and also from their deception, for they are able to affirm "hearing" and "seeing" as  meanings in the mind devoid of the <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a> that is found for them in the creation and on this basis accept them as attributes.     <P>
Failing to distinguish between the ma'naa (meaning) and the kayf (how something is, its reality) is what <u>the Mu'attilah in general</u> (Jahmiyyah, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, Ash'ariyyah) are guilty of. So when they come across "hearing (as-sam')" or "seeing (al-basr), or "hand (<a href='tags/al-yad.html' class='tagLink'><font class='tagLink'>al-yad</font></a>)", immediately in their minds they hold the belief of <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> because they treated the kaifiyyah to be the actual meaning itself - meaning that they do not understand these attributes except with the kayf, haqeeqah and tahdeed (definition in words of the kayf, haqeeqah) of what is in the creation - bypassing the verse, "<b>There is nothing which is a likeness unto Him</b>". Built upon this presumption and belief of <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> in these revealed texts, they reject the attributes in a number of ways (despite claiming to affirm them):    <P>
<ul><li><u>The way of ta'weel</u> - which is to give it a meaning other than the  one it came with    <P>
<li><u>The way of tafweed</u> - which is to first abolish the meaning that it came with, and then to claim the real meaning (whatever it is) is only known to Allaah.</ul>    <P>
And they take either of these two steps for no other reason except that initially, at the very start, they held the belief and presumption of <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and tasbeeh regarding the revealed texts. Then they justify their rejection of these attributes in this manner (ta'weel or tafweed) through the very verse that should have prevented them from holding that presumption of <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> in the first place, which is "<b>There is nothing which is a likeness unto Him</b>", and which would have otherwise prevented them from playing around and fooling with the texts, even though they had been commanded by the Salaf, "<i>Leave them as they have come, without asking how...</i>". So these people made <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> first, and due to it they made <a href='tags/tateel.html' class='tagLink'><font class='tagLink'>ta'teel</font></a>, and this is why it is said, "<i>Every Mu'attil is a Mushabbih</i>".</blockquote>    <P>
<div class='sidebar'>As for the way of Ahl us-Sunnah then it is what has been stated by Imaam <a href='tags/at-tirmidhee.html' class='tagLink'><font class='tagLink'>at-Tirmidhee</font></a>, and you can also refer to <a href=index4487.html?nwlcy>this article</a> on the statement of <u>al-Khateeb al-Baghdaadee (d. 463H)</u> which contains a nice explanation of the entire subject. And it is to affirm whatever Allaah affirmed for Himself in His Book or upon the tongue of His Messenger, with an affirmation of <u>an actual existence of the attribute</u> (not just an affirmation of the existence of <u>the text</u> of the attribute), to affirm that the attribute has a meaning (ma'naa) which is known to us and  has a reality (haqeeqah) which is unknown to us and is impossible for us to know, and that this haqeeqah is unlike what we see and observe in the creation, and to affirm all of that, and to leave the texts as they have come, without <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>, <a href='tags/tamtheel.html' class='tagLink'><font class='tagLink'>tamtheel</font></a> and <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a> and without <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a> and tahreef, and that the principle regarding the attributes (<a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>sifaat</font></a>) is like the principle regarding the essence (dhaat).</div>    <P>
Following on from this, the burnout victim who should have gotten comfortable in the straight-jacket by now, has presumed that whatever Allaah has described Himself with of attributes such as Face, Hands, Eyes, <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> and so on, <u>must be like that which is in the creation</u>. This sickness originated in his own mind. And thus when the victim wrote:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'><b>Literal descent & entering creation</b>. assalaamu alaikum Do salafees believe Allah's dhaat is in the lowest sky when believing Allah literally descended/moved to the lowest sky?</blockquote>    <P>
The victim only wrote this because of his presumption that Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> must be of the type that is found within the creation. And all of these doubts of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> that have been raised in the past such as:    <P>
<ul> <li>Does Allaah leave His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> or not when He descends?  <li> How can Allaah descend in the last third of every night for all people in all parts of the earth?  <li> Does Allaah enter the creation when He descends?  <li> Is His essence (dhaat) in the lowest heaven?  <li> Does <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> become above Him?  </ul>    <P>
These questions only arise when it is presumed that the kaifiyyah of Allaah's Descent is like the descent of created beings, for when you presume that, then the likes of these questions arise - and the Salaf never entertained any of these questions because they negated knowledge of the kaifiyyah, and the only ones who raised such questions were the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>.    <P>
And this is the response of Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> to such presumptions of such <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a>, as occurs in "Sharh Hadeeth in-Nuzool" (p. 459):    <P>
<img src=assets/images/ibn-taymiyyah-sharh-nuzool-end-quote.gif border=1 border=0>    <P>
Which translates:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And that which it is obligatory [to speak with] definitively: Is that Allaah, there is nothing that is a likeness to Him in everything that He has described Himself with. <u>Thus, anyone who describes Him with the likeness of the attributes of the creation in anything from amongst the things, then he is errant, definitively, absolutely</u>. Such as the one who says, "<i>He descends, undergoing motion and movement (yataharrak, yantaqil) just like a person descends from the roof to the lowest part of the house</i>" and like the saying of the one who says, "<i>His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> becomes unoccupied of Him, and so His descent is vacating one space and occupying another</i>", and this is baatil (false), it is obligatory to free the Lord from this, as has preceded.</blockquote>    <P>
And in another place (p. 320) <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> says, in response to another objection related to the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, on account of which some people made <a href='tags/taweel.html' class='tagLink'><font class='tagLink'>ta'weel</font></a> of the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> to something else:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This [objection] that they mentioned: Is only valid if the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> is made to be of the type of <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of the bodies of people from the roof to the ground, and this resembles the saying of the one who said, "<i>His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> becomes unoccupied of Him</i>" such that some of the created things become above Him, and some of them below Him.</blockquote>    <P>
The point being here is that if you presume Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> to be like that of the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of the created bodies - which this victim has - and at the same time, <u>your brain is already fizzled, popped and whacked out with that Aristotelian Tawheed of al-Jawhar wal-Arad</u>, then you are going to start spluttering questions regarding the "kayf" that the Salaf prohibited you from and which first originated with the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> of old.     <P>
And the above sayings of <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> apply to both those who actually say such things or those who presume such things in their minds and as a result of such false presumptions of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> reject Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> - which is the way of today's <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> such as our poor burnout victim who has now found himself in a straight-jacket for his folly.     <P>
<font class='titleHeadline'>The <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> are Intellectual Fraudsters</font>    <P>
We have stated something previously which is extremely appropriate here and it shows how these people (including this victim of ours) are dishonest and fraudulent in their discussions. Previously a dumb-witted Gutter Press-Jahmee brought a similar type of doubt. And irrespective of whether one says:    <P>
<ul> <li>Does Allaah leave His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> or not when He descends?  <li> How can Allaah descend in the last third of every night for all people in all parts of the earth?  <li> Does Allaah enter the creation when He descends?  <li> Is His essence (dhaat) in the lowest heaven?  <li> Does <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> become above Him?  </ul>    <P>
It is all the same, all these objections are the same, there is no difference between them in reality. So while our victim is still comfortable in that straight-jacket, we will say something similar to what was said previously:    <P>
<b><u>Firstly:</u> This Issue Is of No Concern To The Psychologically Disturbed Victim Because He Does Not Affirm There Is A Deity Above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> To Begin With, Thus It Is Falsehood For Him To Even Raise This Issue</b>    <P>
The <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> tried to deny the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> because it relates to their bid'ah in a number of ways. First the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> requires that Allaah is above the heaven, above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> (something which contradicts Him being everywhere) and secondly it is an action tied to Allaah's will, which to the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> is a "haadithah" (event, occurrence) and this would mean to them that Allaah is a body, as only bodies undergo occurrences (hawaadith).     <P>
So the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> began raising doubts about the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, and from amongst their questions was "<i>Does Allaah's <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> become unoccupied when He descends or not?</i>" - so they are the ones who innovated this as they were not content with those ahaadeeth. <u>They tried to cast doubts upon these narrations by making it necessary that Allaah would have to enter His creation if He descended according to the ahaadeeth, <b>upon their presumption</b> that Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> is just like the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of created bodies</u>, so they raised these doubts and the Salaf responded that Allaah descends however He wills, meaning that He is able to descend exactly as He said without the false necessities arising in the corrupt minds of the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a>.     <P>
So the issue here is that if you do not affirm Allaah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> to begin with, or that there is a Lord above the Heavens, the question of how He descends does not even concern you, if we just leave to one side the fact that <u>it is prohibited for you to even start asking about the "kayf" in the first place</u>. So this is deception on behalf of the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> on this particular issue.    <P>
Adh-Dhahabee brings, with a saheeh isnaad the following narration (in Mukhtasar <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-<a href="tags/uluww.html" class="tagLink"><font class="tagLink">uluww</font></a></font></a>, p. 193-194):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And Ibrahim bin Abi Talib said: I heard Ahmad bin Sa'eed ar-Ribaatee saying: I attended the gathering of Ibn Tahir [the Ameer of Khurasaan] and Ishaaq [bin Raahawaih] (d. 238H) attended. He was asked about the hadeeth of <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> (Descent), whether it is authentic. He said, "Yes". One of the chiefs (of the Ameer) said, "How does He descend?" So he (Ishaaq) said: "Affirm Him [being above the Throne] for me such that I can describe the descent to you" So the man said, "I affirm Him [to be] above". So Ishaaq said, "Allaah said:    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And your Lord will come, and the Angels, ranks upon ranks </b><img src='images/qnend.gif'></blockquote>    <P>
Then Ibn Tahir said, "This is on the Day of Judgement O Aba Ya'qub". So he (Ishaaq) said, "And He who comes on the Day of Judgement, who prevents Him today?"</blockquote>    <P>
And Shaykh ul-Islaam, Abu Isma'eel al-Harawi (d. 481H) narrates, in his book "Dhamm ul-Kalaam":    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>From Muhammad bin Ishaaq ath-Thaqafi: I heard Ishaaq [bin Raahawaih] bin Ibraaheem al-Handhali (who) said: I entered one day upon [Abdullaah bin] Taahir and Mansur bin Talhah was present with him. Mansur said to me, "O Abu Ya'qub! You say that Allaah descends to the lowest heaven every night?" I said, "And we believe in it, but you do not believe that you have a Lord [that is] above the heaven, so you are not in need of asking me about this?!" </blockquote>    <P>
We see from these narrations that Ishaaq bin Raahawaih - before answering the question - asked one of those detractors who were trying to stir the Ameer against him, whether he affirms Allaah is above or not, and he told him that this issue is of no concern to him because he does not affirm a Lord above the heaven in the first place. This is because the speech about the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> branches off from the affirmation of the foundation, which is Allaah being above the heaven, above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>. And if this is not affirmed in the first place, then questioning the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> is false speech.    <P>
<div class='sidebar'><font style="font-size:19px;line-height:25px;">The burnout victim has no right to raise and dispute in this particular issue because he does not believe - on the basis of  the principles of Aristotle's Ten Categories (<a href=indexab1a.html?iowfm>see here</a>) - that there is a Lord above the heaven, or a deity above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> to begin with such that he should start asking questions about the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>. Thus, there is no place for him in this discussion and his entering into it and raising it is intellectual fraud. In opposition to the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a>, the Salaf affirmed with unanimous agreement that Allaah is above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, with His Essence (al-Qurtubi: see <a href=indexddfc.html?mnwfg>here</a> and <a href=index4beb.html?wmhvd>here</a>) as did  the Early As'haris (<a href=index24b1.html?ddxry>see here</a>). To raise questions about this issue of <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> without first acknowledging that it is indeed the truth that Allaah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, with His Essence, is an intellectual fraud. So this victim's first discussion should be on the subject of <u>why he opposes the Kullaabi Ash'aris</u> in affirming Allaah is above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, With His Essence and why he agrees with the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, the Kafir <a href='tags/ibn-sina.html' class='tagLink'><font class='tagLink'>Ibn Sina</font></a> and the later [Jahmite] Ash'aris, that Allaah is not above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, with His Essence. If he was honest and truthful, this is the question he should be asking, instead of asking questions related to <u>the kaifiyyah</u> of Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, which is prohibited for him to do so in the first place.</font></div>    <P>
So we say to this victim, it is of no concern to you because you negate there is a deity above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> to begin with (just like your predecessors, the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> of old). So leave off this pretense and deception. This only becomes an issue of discussion between ourselves, the followers of the Book and the Sunnah and the Salaf, and yourselves (the inheritors of the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> of the Greeks, the followers of the doctrines of al-Jahm and al-Ja'd) if you affirm there is a deity above the heaven, above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, and as you do not, there is no place in this discussion for you at all.    <P>
<b><u>Secondly:</u> These Same <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> Do Not Utilize the Sayings of the Salaf Except as A Cover To Conceal Their Deception</b>    <P>
To illustrate, these people are the first to spread the sayings of the Salaf that "<i>Leave these narrations as they have come, without asking how</i>" - and they are the first to oppose them when they start asking about the how of Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> and Allaah's <a href='tags/istiwaa.html' class='tagLink'><font class='tagLink'>istiwaa</font></a> - and they raise these questions after first having presumed that these attributes or actions of Allaah, must be upon the manner and kayf of the created bodies - whereas Ahl us-Sunnah deny that is the case, and leave the knowledge of the kayf to Allaah.     <P>
<font class='titleHeadline'>Victims Responds, Struggling with His Straight-Jacket</font>    <P>
The victim is now responding, struggling with the straight-jacket and has claimed:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>He quotes Ishaq as if we deny Allah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>. While fact is that we only deny Allah being above or rising above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> means Allah is located above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> just as we deny Allah being closer than the juglar vein means Allah is located near the juglar vein... I believe Allah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> higher than you ever thought</blockquote>    <P>
As we have said previously, when these <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> say Allaah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, they do not mean what the Salaf meant or what the Kullaabi Ash'aris meant - which is that Allaah Himself is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, separate and distinct from the creation. They mean Allaah is above in terms of <u>status and rank</u>, and when these people come out on forums and blogs, they knowingly deceive people by this language. See this article to understand their deception: <b>From The Sayings Of The Jahmites: 'I Never Said That Allaah Is Not Above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>. I Said He Is Not In A Location Above The Throne'</b> - (<a href=http://www.abovethethrone.com/arsh/?embgq>read here</a>).    <P>
And their intent here is to protect themselves from the scorn that all people of sound fitrah would show against them for rejecting that "Allaah is above the Throne" <u>as the Salaf stated it and understood it</u>, upon consensus - <a href=http://www.abovethethrone.com/arsh/chronology.cfm>take a look here for what the Salaf were upon in this regard</a>.    <P>
It is precisely for this reason that you have to straight-jacket these people and pin them down, because as Ibn Qudaamah said, there is no group of people <a href=indexb6ea.html?ilvva>being more cowardly</a> in truthfully, honestly and openly expressing their real intent in their statements (expressing their creed) except the Heretics and the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a>. The victim has clearly demonstrated that deceiving the people is standard practice when it comes to speaking about Allaah being "above" <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, and similar is their way in their belief of <u>two</u> Qur'ans - <a href=indexb6ea.html?ilvva>see here</a>. So you have to recognize this is a trait with these people and you simply cannot take them at face value.    <P>
The Salaf, when they made takfir of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, it was not because the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> were denying that Allaah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> in "<u>rank and status</u>", but because through their belief that Allaah is in every place, they were denying Allaah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, with His Essence, separate and distinct from His creation. Thus, when you see these <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> today saying:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>...as if we deny Allah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> ... I believe Allah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> higher than you ever thought..</blockquote>    <P>
They mean only in "status and rank". And you should know that their true and real saying is the very same as the <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> of old, and that of <a href='tags/ibn-sina.html' class='tagLink'><font class='tagLink'>Ibn Sina</font></a> the Kafir, that "<i>Allaah is neither within the creation, nor outside of it</i>" and the aboveness they speak of is an aboveness of "status and rank", it is not an aboveness in which Allaah actually exists, with His Essence, outside of the universe - so beware and beware again of the deception of these people. They say, "<i>I affirm Allaah is above the Throne</i>", and what they really mean is "<i>The <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> is just a metaphor for Allaah's dominion and Allaah is above this figurative <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> in the sense of rank and status</i>" - this is how they deceive people and hide their real beliefs from the people, because they know that the sound uncorrupted fitrah will know that their real saying "<i>There is no Lord above the heaven</i>", and "<i>There is no deity above the Throne</i>" and "<i>Allaah is not within the universe nor outside of it</i>" is falsehood and amounts to the non-existence of the Creator.    <P>
<font class='titleHeadline'>The Saying of Abu Uthmaan as-Saaboonee (d. 449H) Regarding the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> Should Treat and Heal this Psychologically Deluded Victim and His Questions</font>    <P>
Abu Uthmaan as-Saaboonee said in the book titled, "Aqeedat us-Salaf wa Ashaabil-Hadeeth" (tahqeeq Nasir al-Juday', Dar ul-Aasimah, 1st edition, 1415H, pp. 191-232) - spending around 40 pages on this subject:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1610;&#1579;&#1576;&#1578; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1585;&#1576; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575;&#1548; &#1605;&#1606; &#1594;&#1610;&#1585; &#1578;&#1588;&#1576;&#1610;&#1607; &#1604;&#1607; &#1576;&#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1610;&#1606;&#1548; &#1608;&#1604;&#1575; &#1578;&#1605;&#1579;&#1610;&#1604; &#1608;&#1604;&#1575; &#1578;&#1603;&#1610;&#1610;&#1601; &#1576;&#1604; &#1610;&#1579;&#1576;&#1578;&#1608;&#1606; &#1605;&#1575; &#1571;&#1579;&#1576;&#1578;&#1607; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1610;&#1606;&#1578;&#1607;&#1608;&#1606; &#1601;&#1610;&#1607; &#1573;&#1604;&#1610;&#1607;&#1548; &#1608;&#1610;&#1605;&#1585;&#1608;&#1606; &#1575;&#1604;&#1582;&#1576;&#1585; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1575;&#1604;&#1608;&#1575;&#1585;&#1583; &#1576;&#1584;&#1603;&#1585;&#1607; &#1593;&#1604;&#1609; &#1592;&#1575;&#1607;&#1585;&#1607;&#1548; &#1608;&#1610;&#1603;&#1604;&#1608;&#1606; &#1593;&#1604;&#1605;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the People of Hadeeth affirm the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of the Lord, Sublime and Exalted, every night to the lowest heaven without resemblance (<a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>) to the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of the created beings, and nor likening (<a href='tags/tamtheel.html' class='tagLink'><font class='tagLink'>tamtheel</font></a>) or asking how (<a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a>). Rather, they affirm whatever Allaah's Messenger (sallallaahu alayhi wasallam) affirmed, and they stop regarding the issue at where [he stopped]. And they pass on the authentic narration that has come with mention of it (the nuzool) upon its apparent [meaning] (dhaahir), and they leave its knowledge to Allaah.</blockquote>    <P>
As-Saaboonee means here that they leave the knowledge of its kayfiyyah (how it is, its reality) to Allaah, as is clear from the entire statement as well as what follows. Then as-Saaboonee mentions the attributes of Majee and <a href='tags/ityaan.html' class='tagLink'><font class='tagLink'>Ityaan</font></a> (coming and arriving) which are also mentioned in the Book of Allaah, and then regarding all three (nuzool, majee, ityaan) he says (p. 192):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1606;&#1572;&#1605;&#1606; &#1576;&#1584;&#1604;&#1603; &#1603;&#1604;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601;&#1548; &#1601;&#1604;&#1608; &#1588;&#1575;&#1569; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1571;&#1606; &#1610;&#1576;&#1610;&#1606; &#1604;&#1606;&#1575; &#1603;&#1610;&#1601;&#1610;&#1577; &#1584;&#1604;&#1603; &#1601;&#1593;&#1604;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And we believe in all of that, in the manner that it came (in the texts), without [asking about or specifying a] kayf. And if Allaah, the Sublime, had willed to explain to us the kaifiyyah (how it takes place and its reality), then He would have done so ...</blockquote>    <P>
Then as-Saaboonee brings the narrations from Ishaaq bin Raahawaih that we mentioned earlier, as well as a narration from Abdullaah bin al-Mubaarak (d. 181H), and we can mention here one of the narrations:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1571;&#1582;&#1576;&#1585;&#1606;&#1575; &#1571;&#1576;&#1608; &#1576;&#1603;&#1585; &#1576;&#1606; &#1586;&#1603;&#1585;&#1610;&#1575; &#1575;&#1604;&#1588;&#1610;&#1576;&#1575;&#1606;&#1610; &#1587;&#1605;&#1593;&#1578; : &#1571;&#1576;&#1575; &#1581;&#1575;&#1605;&#1583; &#1576;&#1606; &#1575;&#1604;&#1588;&#1585;&#1602;&#1610; &#1610;&#1602;&#1608;&#1604;: &#1587;&#1605;&#1593;&#1578;  &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1608;&#1571;&#1576;&#1575; &#1583;&#1575;&#1608;&#1583; &#1575;&#1604;&#1582;&#1601;&#1575;&#1580;&#1610; &#1610;&#1602;&#1608;&#1604;&#1575;&#1606;: &#1587;&#1605;&#1593;&#1606;&#1575; &#1573;&#1587;&#1581;&#1575;&#1602; &#1576;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1575;&#1604;&#1581;&#1606;&#1592;&#1604;&#1610;  &#1610;&#1602;&#1608;&#1604;: &#1602;&#1575;&#1604; &#1604;&#1610; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585; &#1593;&#1576;&#1583;&#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1591;&#1575;&#1607;&#1585;: &#1610;&#1575; &#1571;&#1576;&#1575; &#1610;&#1593;&#1602;&#1608;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1584;&#1610; &#1578;&#1585;&#1608;&#1610;&#1607; &#1593;&#1606; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; " &#1610;&#1606;&#1586;&#1604; &#1585;&#1576;&#1606;&#1575; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575;. &#1603;&#1610;&#1601; &#1610;&#1606;&#1586;&#1604;&#1567; &#1602;&#1575;&#1604;&#1548; &#1602;&#1604;&#1578;: &#1571;&#1593;&#1586; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585;&#1548; &#1604;&#1575; &#1610;&#1602;&#1575;&#1604; &#1604;&#1571;&#1605;&#1585; &#1575;&#1604;&#1585;&#1576; &#1603;&#1610;&#1601;&#1567; &#1573;&#1606;&#1605;&#1575; &#1610;&#1606;&#1586;&#1604; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Ahmad as-Sullamee and Abu Dawud al-Khafaajee said: We heard Ishaaq bin Ibraaheem [ar-Raahawaih] al-Handhalee say: THe Ameer, Abdullaah bin Taahir said to me, "O Abaa Ya'qub, this hadeeth that you narrate from the Messenger of Allaah (sallallaahu alayhi wasallam), '<i>Our Lord descends to the lowest heaven every night</i>', how does He descend?" I said, "May Allaah honor and strengthen the ameer, it is not said regarding the affair of the Lord, "Kayf (how)?". Verily, He descends without [asking about the] kayf.</blockquote>    <P>
Our psychologically disturbed victim has not heeded these types of narrations and does not understand them, so as he struggles in his straight-jacket, we should politely tell him that asking the type of question he is asking:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'><b>Literal descent & entering creation</b>. assalaamu alaikum Do salafees believe Allah's dhaat is in the lowest sky when believing Allah literally descended/moved to the lowest sky?</blockquote>    <P>
Is the very same thing that Ishaaq bin Raahawaih (and others from the Salaf) spoke about, because all of these objections and questions which are mentioned in such narrations are based upon the presumption that Allaah's Essence must leave <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> and enter the creation in order for Him to descend - and it is because those raising these questions imagined a "kayf" in their mind, and this is what led them to such questions.    <P>
Then as-Saaboonee spends quite a few pages on mentioning all the companions that narrated these ahaadeeth and their routes, and then he brings with his own chains of narrations, such ahaadeeth. On page 222 after quoting one particular narration with his chain back to Abu Hurairah (radiallaahu anhu), he says after it:    <P>
<div class='arabic' align='right' lang='AR-SA'> &#1587;&#1605;&#1593;&#1578;  &#1575;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1571;&#1576;&#1575; &#1605;&#1606;&#1589;&#1608;&#1585; &#1593;&#1604;&#1609; &#1573;&#1579;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1584;&#1610; &#1571;&#1605;&#1604;&#1575;&#1607; &#1593;&#1604;&#1610;&#1606;&#1575; &#1610;&#1602;&#1608;&#1604; &#1587;&#1574;&#1604; &#1571;&#1576;&#1608; &#1581;&#1606;&#1610;&#1601;&#1577; &#1593;&#1606;&#1607; &#1601;&#1602;&#1575;&#1604;: "&#1610;&#1606;&#1586;&#1604; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601; " &#1608;&#1602;&#1575;&#1604; &#1576;&#1593;&#1590;&#1607;&#1605;: "&#1610;&#1606;&#1586;&#1604; &#1606;&#1586;&#1608;&#1604;&#1575; &#1610;&#1604;&#1610;&#1602; &#1576;&#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601;&#1548; &#1605;&#1606; &#1594;&#1610;&#1585; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1606;&#1586;&#1608;&#1604;&#1607; &#1605;&#1579;&#1604; &#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1582;&#1604;&#1602;&#1548; &#1576;&#1604; &#1576;&#1575;&#1604;&#1578;&#1580;&#1604;&#1610; &#1608;&#1575;&#1604;&#1578;&#1605;&#1604;&#1610;&#1548; &#1604;&#1571;&#1606;&#1607; &#1580;&#1604; &#1580;&#1604;&#1575;&#1604;&#1607; &#1605;&#1606;&#1586;&#1607; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1589;&#1601;&#1575;&#1578;&#1607; &#1605;&#1579;&#1604; &#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1582;&#1604;&#1602;&#1548; &#1603;&#1605;&#1575; &#1603;&#1575;&#1606; &#1605;&#1606;&#1586;&#1607;&#1575; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1584;&#1575;&#1578;&#1607; &#1605;&#1579;&#1604; &#1584;&#1608;&#1575;&#1578; &#1575;&#1604;&#1582;&#1604;&#1602;&#1548; &#1601;&#1605;&#1580;&#1610;&#1574;&#1607; &#1608;&#1573;&#1578;&#1610;&#1575;&#1606;&#1607; &#1608;&#1606;&#1586;&#1608;&#1604;&#1607; &#1593;&#1604;&#1609; &#1581;&#1587;&#1576; &#1605;&#1575; &#1610;&#1604;&#1610;&#1602; &#1576;&#1589;&#1601;&#1575;&#1578;&#1607;&#1548; &#1605;&#1606; &#1594;&#1610;&#1585; &#1578;&#1588;&#1576;&#1610;&#1607; &#1608;&#1603;&#1610;&#1601;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I heard the Ustaadh, [Muhammad bin Abdullaah] Abu Mansoor [bin Hamshaad] saying, after this hadeeth which he dictated to us: Abu Haneefah was asked about it and he said, "He descends without kayf (asking 'How?')".     <P>
And some of them said: He descends with descent (<a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>) that befits His Ruboobiyyah (Lordship), without kayf  (asking 'How?'), without His <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> being like the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of the creation of vacating a place to occupy another, because He whose Majesty is great, is purified that His Attributes should be like the attributes of the creation. As He is purified of His Essence being like the essences of the creation, then His coming (majee'), arriving (<a href='tags/ityaan.html' class='tagLink'><font class='tagLink'>Ityaan</font></a>) and descending (<a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>) are according to what befits His Attributes, without <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (resemblance) and kayf (asking 'How?').</blockquote>    <P>
Then on p. 232, as-Saaboonee says:    <P>
<div class='arabic' align='right' lang='AR-SA'> &#1602;&#1604;&#1578;: &#1601;&#1604;&#1605;&#1575; &#1589;&#1581; &#1582;&#1576;&#1585; &#1575;&#1604;&#1606;&#1586;&#1608;&#1604; &#1593;&#1606; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1602;&#1585; &#1576;&#1607; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577;&#1548; &#1608;&#1602;&#1576;&#1604;&#1608;&#1575; &#1575;&#1604;&#1582;&#1576;&#1585;&#1548; &#1608;&#1571;&#1579;&#1576;&#1578;&#1608;&#1575; &#1575;&#1604;&#1606;&#1586;&#1608;&#1604; &#1593;&#1604;&#1609; &#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1604;&#1605; &#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1578;&#1588;&#1576;&#1610;&#1607;&#1575; &#1604;&#1607; &#1576;&#1606;&#1586;&#1608;&#1604; &#1582;&#1604;&#1602;&#1607;&#1548; &#1608;&#1593;&#1604;&#1605;&#1608;&#1575; &#1608;&#1578;&#1581;&#1602;&#1602;&#1608;&#1575; &#1608;&#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1571;&#1606; &#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1604;&#1575; &#1578;&#1588;&#1576;&#1607; &#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1582;&#1604;&#1602;&#1548; &#1603;&#1605;&#1575; &#1571;&#1606; &#1584;&#1575;&#1578;&#1607; &#1604;&#1575; &#1578;&#1588;&#1576;&#1607; &#1584;&#1608;&#1575;&#1578; &#1575;&#1604;&#1582;&#1604;&#1602; &#1578;&#1593;&#1575;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1588;&#1576;&#1607;&#1577; &#1608;&#1575;&#1604;&#1605;&#1593;&#1591;&#1604;&#1577; &#1593;&#1604;&#1608;&#1575; &#1603;&#1576;&#1610;&#1585;&#1575;&#1548; &#1608;&#1604;&#1593;&#1606;&#1607;&#1605; &#1604;&#1593;&#1606;&#1575; &#1603;&#1576;&#1610;&#1585;&#1575;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I say: When the narration of the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> is authentically (reported) from the Messenger (sallallaahu alayhi wasallam), Ahl us-Sunnah affirmed it, and they accepted the report, and they affirmed the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> upon what Allaah's Messenger (sallallaahu alayhi wasallam) said. And they did not hold a belief of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (resemblance) for it with the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> of His creation. And they knew and verified [the truth in the matter] and believed that the Attributes of Allaah, the Sublime, do not resemble the Attributes of the creation, just as His Essence does not resemble the essences of the creation - lofty and exalted is Allaah from what the <a href='tags/mushabbihah.html' class='tagLink'><font class='tagLink'>Mushabbihah</font></a> and Mu'attilah say with the great exaltation and may Allaah curse them with a great curse.</blockquote>    <P>
The previous dosage of narrations should have sedated him somewhat and it looks we are going to have to move up a step to the tranquilizers. This is what happens when instead of taking Tawheed from the Messengers, you actually take it from  the language, terminology, and classifications of the atheist <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> and the necessities arising therefrom.    <P>
<img src=assets/images/aristotle-maqoolaat-al-ashar.gif border=1 border=0>    <P>
The contemporary Ash'aris approach all the revealed texts through what you see above. The above is the ultimate criterion as to what can and cannot be believed about Allaah and as to what should or should not be figuratively explained. This is the core of it all. When you see these people raising all these questions and objections, you should know that ultimately, this is what is behind it all. You see what is in that picture above is the basis upon which they devised an intellectual proof to argue that the universe is created and to convince the atheists of a creator. It is a corrupt and flawed proof, and since they claimed that the very truthfulness of the religion of Islam depends upon it, they were in turn, forced to make all of their speech regarding Allaah to be inextricably linked to this same language and terminology. From this you will better grasp the nature of the questions and doubts these people keep raising against the creed of the Salaf.    <P>
<font class='titleHeadline'>Its Official, <a href='tags/ahmed-cobra.html' class='tagLink'><font class='tagLink'>Ahmed Cobra</font></a> the Ash'ari Needs Tranquilizers</font>    <P>
As we suspected from the beginning, this is a very strange case and we were justified in opting for the straight-jacket as the first step before making any clinical observations.     <P>
<img src=assets/images/clinic-case3-nuzool-b.gif border=1 border=0>    <P>
We can see from his statement above, the victim clearly needs a dose of tranquilizers. After smoking Aristotle's "al-Maqoolaat al-Ashar" for a few hours - [this really sensitizes you and allows you to see <a href='tags/jismiyyah.html' class='tagLink'><font class='tagLink'>Jismiyyah</font></a> (kufr) in the revealed texts] - he thought he would go out and have a bit of fun. So he first came on the scene with this question:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'><b>Literal descent & entering creation</b>. assalaamu alaikum Do salafees believe Allah's dhaat is in the lowest sky when believing Allah literally descended/moved to the lowest sky?</blockquote>    <P>
And this <u>absolutely confirms</u>, without a shadow of doubt, what we said earlier in this article after bringing the statement of Imaam at-Tirmidhi, that these people first hold the belief (i'tiqaad) of <a href='tags/takyeef.html' class='tagLink'><font class='tagLink'>takyeef</font></a>, <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>, <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> in their hearts regarding what they see and read in the revealed texts. If you look at this victim and see what he has written, "<i>Literal descent & entering creation</i>" and the content of his question itself, you realize he has not understood the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> except in the manner of the creation, and it is built upon this false presumption that his that his question arises.     <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>...i'll do it after some one directly answers my question.IS ALLAHS DHAAT LOCATED IN THE LOWEST SKY?(<u>NOTE: am not asking how Allah descened</u>)</blockquote>    <P>
The question itself branches off from the issue of <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, so it's a contradiction for it to be said, "<i>Is Allaah's dhaat in the lowest sky?</i>" and at the same time, "<i>I am not asking how Allaah descended</i>" - that question only arises if you have presumed a "kayf" in your mind for Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> - which is what the victim is doing.    <P>
To remove him from his misery:    <P>
<div class='sidebar'>Ahl us-Sunnah hold that Allaah is above the heaven, above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, and that when He descends, He does not leave <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, <u>and that He always remains above the Throne</u>, (and this means that the second heaven is not above Him) and the reality of this descent is unknown to us and it is not fathomable, and it is unlike the descent of created beings, and since we do not know the reality of how Allaah's dhaat (essence) is, then we do not know the realities of His attributes and actions, from them the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>. The way of the Salaf is to affirm the narrations without asking "how?" And anyone who asks the question "<i>Is Allaah's dhaat located in the lowest sky?</i>" has only asked this question because of the presumption of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> and <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> in his heart that Allaah's descent must be like that of created bodies, like that of a person descending from the roof of a house such that the roof becomes above him - as has been explained by <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> previously in this article. And Allaah is exalted and lofty above what these people presume with a lofty exaltation. And if you can't fathom this, then question your mind and intellect and not the revealed texts.</div>    <P>
It appears this case has come to an abrupt end, at the hands of the patient himself that is. Hence, we can wrap up and write our little report with the appropriate recommendations.    <P>
<font class='titleHeadline'>Case Diagnosis and Summary Report</font>    <P>
As this was a live, real-time case, there is not much to add to a diagnosis, as most of this has been done already in what has preceded.    <P>
In summary, we say that the victim has been snorting Aristotle's "<u>al-Maqoolaat al-Ashar</u>" for too long (without realizing what it actually is - he may have been spiked) and this took a toll on his perception of the revealed texts such that the only thing he was able to see and presume from them is <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. This led the poor victim to start asking questions that only arise and follow on from such presumptions of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> and <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a>, and which are baseless questions in the first place.    <P>
<div class='sidebar'><b>New Venture Announcement!</b> Due to the very sad nature of this case that we have just experienced and witnessed first hand, and due to the compulsive behaviour of this victim (who until now is still persisting in his baseless question), we have felt it very necessary to open our next not-for-profit venture, in addition to <a href=categories/the-clinic.html>our Clinic</a>. It is "<b>The AA</b>" - "<u><a href='tags/aristotelians-anonymous.html' class='tagLink'><font class='tagLink'>Aristotelians Anonymous</font></a></u>" or perhaps "<u>Ash'aris Anonymous</u>" (we are undecided on the name yet). This is a <u>support group</u> to help victims <u>detoxify their system</u>s from the harmful effects of the language and terminology of atheist <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a> (jism, <a href='tags/jawhar.html' class='tagLink'><font class='tagLink'>jawhar</font></a>, <a href='tags/arad.html' class='tagLink'><font class='tagLink'>'arad</font></a> and so on) which they have made to be the foundation of Tawheed and the foundation of the veracity of the very religion itself. And likewise, (on the basis of this language and terminology) they have treated the revealed texts to be the foundations of <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> and <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a>. And thus we see a clash between the Tawheed of the Messengers and the Aristotelian Tawheed of the <a href='tags/mutakallimoon.html' class='tagLink'><font class='tagLink'>Mutakallimoon</font></a>. All of this is clearly leading them to hallucinate <a href='tags/tajseem.html' class='tagLink'><font class='tagLink'>Tajseem</font></a> in the revealed texts when there is in fact no such thing. Whilst <a href=categories/the-clinic.html>our Clinic</a> is fine for mild to moderate cases, <u>compulsive cases</u> (such as this one) need specialized treatment, so as time allows, we will be developing a <a href='tags/detox.html' class='tagLink'><font class='tagLink'>Detox</font></a> program to help victims get back upon the language and terminology of the Tawheed of the Messengers. If you would like to help the poor victims that you come across, please send them to <a href=categories/the-clinic.html>our Clinic</a> for now, until we get the support group up and running. You see we really do feel sorry for these people, they are our Muslim brothers and sisters who have unfortunately been caught up in something that is very hard to let go - the disease and <a href='tags/intoxication.html' class='tagLink'><font class='tagLink'>Intoxication</font></a> of of the mind is more severe than the disease and <a href='tags/intoxication.html' class='tagLink'><font class='tagLink'>Intoxication</font></a> of the body - so they need as much support and help as possible.    <P>
<b>Update:</b> Upon a recommendation from a reader that we call our new not-for-profit venture "<b><a href='tags/aristotelians-anonymous.html' class='tagLink'><font class='tagLink'>Aristotelians Anonymous</font></a></b>", we've decided to go along with it. "Aristotelian Anonymous" is the new support group to be launched soon, and will consist of a <a href='tags/detox.html' class='tagLink'><font class='tagLink'>Detox</font></a> protocol for affected and intoxicated minds. Having said that we must <u>clearly distinguish the Kullaabi Ash'aris</u> - who despite being influenced by what the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> took of these notions (based upon Aristotelian Metaphysics) in devising an intellectual proof to show the universe is created and has a creator (and were therefore lumped with sticking to this same language in all their speech about Allaah) - these early Kullaabi Ash'aris were nevertheless <u>much better all round</u> and affirmed most of what Ahl us-Sunnah affirmed, with the exception of the <a href='tags/sifaat-filiyyah.html' class='tagLink'><font class='tagLink'>Sifaat Fi'liyyah</font></a> (actions tied to Allaah's will).  So we clearly distinguish them <u>and give them some respect</u>, as opposed to the later <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> who practically reverted to much of what the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> were upon. <u>Clear proof by way of some examples</u>: Their saying that "<i>Allaah is neither within the universe nor outside of it</i>" (<a href=indexc0cf.html?mrsit>thank you for that</a> <a href='tags/ibn-sina.html' class='tagLink'><font class='tagLink'>Ibn Sina</font></a> you shrewd Kafir), and likewise using the same ta'weels of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> for the attributes of "hands" (al-yadaan) for Allaah - that it is favor or power (ni'mah, qudrah) which the early Kullaabi Ash'aris refuted.    <P>
So "<b>Aristotelian's Anonymous</b>" it is.</div>    <P>
<font class='titleHeadline'>Recommendations and Remedy</font>    <P>
As this is <u>a compulsive case</u>, unfortunately, you are going to have to wait for the opening of "The AA" (should not be too long). In the meanwhile, we advise you to print off and read this article five times daily.   <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?cqcvp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:12 GMT -->
</html>


