

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?qnnsm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:13 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Abdul-Kareem Ash-Shahrastani, Sixth Century Ash'ari (d. 548H): Abu al-Hasan al-Ash'ari Broke the Ijmaa' and Innovated a Third Saying On the Subject of Allaah's Speech and the Qur'an</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Abdul-Kareem Ash-Shahrastani, Sixth Century Ash'ari (d. 548H): Abu al-Hasan al-Ash'ari Broke the Ijmaa' and Innovated a Third Saying On the Subject of Allaah's Speech and the Qur'an</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Wednesday, December, 09 2009 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/ibn-kullaab.html">
Ibn Kullaab 
</a> &#149; <a href="tags/kullaabiyyah.html">
Kullaabiyyah 
</a> &#149; <a href="tags/shahrastani.html">
Shahrastani 
</a> &#149; <a href="tags/al-shahrastani.html">
Al-Shahrastani 
</a> &#149; <a href="tags/nihaayat-ul-iqdaam.html">
Nihaayat Ul-Iqdaam 
</a> &#149; <a href="tags/quran.html">
Qur'an 
</a> &#149; <a href="tags/kalaam-nafsee.html">
Kalaam Nafsee 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>The Ash'aris reject Allaah's speech is with letter and voice (al-harf was-sawt) <b>and this is something that all factions without exception were united upon (that speech is with letter and voice)</b> despite their different sayings regarding Allaah's speech (whether it is created or not), <u>up until</u> <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> came and along and until Abu al-Hasan <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> followed them in that. <u>There was actually no dispute about that at all, there was ijmaa' that speech is letter and voice (al-harf was-sawt), and that Allaah speaks with letter and voice</u>.     <P>
Abdul-Kareem ash-Shahrastani (d. 584H), one of the important figures of the <a href='tags/later-asharis.html' class='tagLink'><font class='tagLink'>Later Ash'aris</font></a> himself writes that Abu al-Hasan <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a>, in this subject of Allaah's speech (<a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>) and letter and voice (al-harf was-sawt), that he broke the ijmaa' that existed previously and innovated a third saying not known before. In reality, it was <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and not <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> - but we can look at the saying of ash-Shahrastani (d. 584H) in another article in much detail, it is from his book, "Nihaayat ul-Iqdaam", where he says (p. 177), whilst noting that ash-Shahrastani's statements in characterizing the view of the Salaf are not entirely accurate and precise, but there is enough in what he has said that approximates to what is correct:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1601;&#1571;&#1576;&#1583;&#1593; &#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610; &#1602;&#1608;&#1604;&#1575;&#1611; &#1579;&#1575;&#1604;&#1579;&#1575;&#1611; &#1608;&#1602;&#1590;&#1609; &#1576;&#1581;&#1583;&#1608;&#1579; &#1575;&#1604;&#1581;&#1585;&#1608;&#1601; &#1608;&#1607;&#1608; &#1582;&#1585;&#1602; &#1575;&#1604;&#1573;&#1580;&#1605;&#1575;&#1593; &#1608;&#1581;&#1603;&#1605; &#1576;&#1571;&#1606; &#1605;&#1575; &#1606;&#1602;&#1585;&#1571;&#1607; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1605;&#1580;&#1575;&#1586;&#1575;&#1611; &#1604;&#1575; &#1581;&#1602;&#1610;&#1602;&#1577; &#1608;&#1607;&#1608; &#1593;&#1610;&#1606; &#1575;&#1604;&#1575;&#1576;&#1578;&#1583;&#1575;&#1593; &#1601;&#1607;&#1604;&#1575; &#1602;&#1575;&#1604; &#1608;&#1585;&#1583; &#1575;&#1604;&#1587;&#1605;&#1593; &#1576;&#1571;&#1606; &#1605;&#1575; &#1606;&#1602;&#1585;&#1571;&#1607; &#1608;&#1606;&#1603;&#1578;&#1576;&#1607; &#1603;&#1604;&#1575;&#1605; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1583;&#1608;&#1606; &#1571;&#1606; &#1610;&#1578;&#1593;&#1585;&#1590; &#1604;&#1603;&#1610;&#1601;&#1610;&#1578;&#1607; &#1608;&#1581;&#1602;&#1610;&#1602;&#1578;&#1607; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583; &#1575;&#1604;&#1587;&#1605;&#1593; &#1576;&#1573;&#1579;&#1576;&#1575;&#1578; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1605;&#1606; &#1575;&#1604;&#1608;&#1580;&#1607; &#1608;&#1575;&#1604;&#1610;&#1583;&#1610;&#1606; &#1573;&#1604;&#1609; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603; &#1605;&#1606; &#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1582;&#1576;&#1585;&#1610;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> <u>innovated a third saying</u> and judged with the emergence of the letters, and this is the destruction of the ijmaa' (concensus) and he judged that what we read is Allaah's speech <u>only metaphorically (majaazan)</u> not in reality (haqeeqatan) - <u>and this is pure innovation</u>. Why did he not (simply) say that the revelation mentions that what we read and write is the Speech of Allaah without (him) delving into its kaifiyyah (how it is) and its haqeeqah (its reality) - just like in the revelation many attributes have been mentioned such as Face, Two Hands and other than them from the <a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>sifaat</font></a> Khabariyyah.</blockquote>    <P>
Here he is saying that <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> broke the Ijmaa' and innovated a third saying, which is that the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is said to be Allaah's speech only "metaphorically", since their view was that Allaah's real <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a> is the "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>", and not the letters and words that make up the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a>.     <P>
And in ascribing this innovation to <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a>, ash-Shahrastani is in error here because it was <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> who originated this view and not <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> himself. But this is the subject for a separate article as this quote is part of a longer passage that discusses other relevant issues so we can look at this in a separate article. And also, as mentioned previously, <a href='tags/ibn-hajr-al-asqalani.html' class='tagLink'><font class='tagLink'>Ibn Hajr al-Asqalani</font></a> (in Fath ul-Bari, Kitaab ut-Tawheed) rebuts the presumption of <a href='tags/tashbeeh.html' class='tagLink'><font class='tagLink'>tashbeeh</font></a> (which comes from the Ash'aris) that affirming "voice" (sawt) for Allaah necessitates that it requires what is required for voice amongst the servants of Allaah, <a href='tags/ibn-hajr.html' class='tagLink'><font class='tagLink'>Ibn Hajr</font></a> rebuts this - and this will be documented in a separate article inshaa'Allaah.    <P>
Abu Nasr as-Sijzee (d. 444H) said in his book "Risaalah Ilaa Ahl Zubayd" - which is a book written to refute the <a href='tags/jahmite.html' class='tagLink'><font class='tagLink'>Jahmite</font></a> <a href='tags/lafdhiyyah.html' class='tagLink'><font class='tagLink'>Lafdhiyyah</font></a> taking the guise of "<a href="tags/asharites.html" class="tagLink"><font class="tagLink">Ash'arites</font></a>" -  in the opening pages:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1575;&#1593;&#1604;&#1605;&#1608;&#1575; &#1600; &#1571;&#1585;&#1588;&#1583;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1573;&#1610;&#1575;&#1603;&#1605; &#1600; &#1571;&#1606;&#1607; &#1604;&#1605; &#1610;&#1603;&#1606; &#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1575;&#1604;&#1582;&#1604;&#1602; &#1593;&#1604;&#1609; &#1575;&#1582;&#1578;&#1604;&#1575;&#1601; &#1606;&#1581;&#1604;&#1607;&#1605; &#1605;&#1606; &#1571;&#1608;&#1604; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1573;&#1604;&#1609; &#1575;&#1604;&#1608;&#1602;&#1578; &#1575;&#1604;&#1584;&#1610; &#1592;&#1607;&#1585; &#1601;&#1610;&#1607; &#1575;&#1576;&#1606; &#1603;&#1604;&#1575;&#1576; &#1608;&#1575;&#1604;&#1602;&#1604;&#1575;&#1606;&#1587;&#1610; &#1608;&#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610; &#1608;&#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610; &#1608;&#1571;&#1602;&#1585;&#1575;&#1606;&#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1578;&#1592;&#1575;&#1607;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1585;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1608;&#1607;&#1605; &#1605;&#1593;&#1607;&#1605; &#1576;&#1604; &#1571;&#1582;&#1587; &#1581;&#1575;&#1604;&#1575;&#1611; &#1605;&#1606;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1576;&#1575;&#1591;&#1606; &#1601;&#1610; &#1571;&#1606; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1573;&#1604;&#1575; &#1581;&#1585;&#1601;&#1575;&#1611; &#1608;&#1589;&#1608;&#1578;&#1575;&#1611; &#1584;&#1575; &#1578;&#1571;&#1604;&#1610;&#1601; &#1608;&#1575;&#1578;&#1587;&#1575;&#1602; &#1608;&#1573;&#1606; &#1575;&#1582;&#1578;&#1604;&#1601;&#1578; &#1576;&#1607; &#1575;&#1604;&#1604;&#1594;&#1575;&#1578; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Know - may Allaah guide us and you - that there did not used to be any difference amongst the creation, despite the variance in their creeds, from the first era that <a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a> (speech) is not [anything] but letter (al-harf) and voice (as-sawt) that is composed, harmonious, even with the variation in languages [until] the time in which the likes of <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a>, al-Qalaanisee, as-Saalihee and <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> appeared, and their associates, those who make an open display of refuting the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, whilst they are really with them, rather of a more vile condition than them inwardly.</blockquote>    <P>
You should note that there are scholars who did not take a liking to Abu al-Hasan <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> and spoke in rather negative terms about him, this includes Scholars like Abu Ismaa'eel al-Harawee (d. 481H) and Ibn Qudaamah al-Maqdisee (d. 620H). What <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> has explained to be correct is that after leaving the doctrines of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> for those of the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a>, Abu al-Hasan <a href='tags/al-ashari.html' class='tagLink'><font class='tagLink'>al-Ash'ari</font></a> made a migration towards the madhhab of the people of Hadeeth and this became evident through his books that he wrote towards the end of his life, including al-Maqaalaat and al-Ibaanah. However, because his knowledge of ilm ul-kalaam was detailed and his knowledge of the sunnah was deficient, then he did not complete his migration completely and fully and still retained some influence from his past.    <P>
And <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> said in "Majmoo ul-Fataawaa" (6/528):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601; &#1593;&#1606;&#1583; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1581;&#1583;&#1610;&#1579;&#1548; &#1601;&#1607;&#1608; &#1602;&#1608;&#1604; &#1580;&#1605;&#1575;&#1607;&#1610;&#1585; &#1601;&#1585;&#1602; &#1575;&#1604;&#1571;&#1605;&#1577;&#1548; &#1601;&#1573;&#1606; &#1580;&#1605;&#1575;&#1607;&#1610;&#1585; &#1575;&#1604;&#1591;&#1608;&#1575;&#1574;&#1601; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1589;&#1608;&#1578; &#1605;&#1593; &#1606;&#1586;&#1575;&#1593;&#1607;&#1605; &#1601;&#1610; &#1571;&#1606; &#1603;&#1604;&#1575;&#1605;&#1607; &#1607;&#1604; &#1607;&#1608; &#1605;&#1582;&#1604;&#1608;&#1602;&#1548; &#1571;&#1608; &#1602;&#1575;&#1574;&#1605; &#1576;&#1606;&#1601;&#1587;&#1607;&#1567; &#1602;&#1583;&#1610;&#1605; &#1571;&#1608; &#1581;&#1575;&#1583;&#1579;&#1567; &#1571;&#1608; &#1605;&#1575; &#1586;&#1575;&#1604; &#1610;&#1578;&#1603;&#1604;&#1605; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569;&#1567; &#1601;&#1573;&#1606; &#1607;&#1584;&#1575; &#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1603;&#1585;&#1575;&#1605;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1608;&#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1605;&#1585;&#1580;&#1574;&#1577;&#1548; &#1608;&#1575;&#1604;&#1587;&#1575;&#1604;&#1605;&#1610;&#1577;&#1548; &#1608;&#1594;&#1610;&#1585; &#1607;&#1572;&#1604;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1581;&#1606;&#1601;&#1610;&#1577; &#1608;&#1575;&#1604;&#1605;&#1575;&#1604;&#1603;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1581;&#1606;&#1576;&#1604;&#1610;&#1577;&#1548; &#1608;&#1575;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577;.    <P>
&#1608;&#1604;&#1610;&#1587; &#1605;&#1606; &#1591;&#1608;&#1575;&#1574;&#1601; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1571;&#1606;&#1603;&#1585; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1589;&#1608;&#1578; &#1573;&#1604;&#1575; &#1575;&#1576;&#1606; &#1603;&#1604;&#1575;&#1576; &#1608;&#1605;&#1606; &#1575;&#1578;&#1576;&#1593;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And as this is known with Ahl us-Sunnah wal-Hadeeth, then it is also the saying of all of the sects of the Ummah, for the majority of all of the various factions say: "Allaah speaks with a voice" alongside their dispute(s) regarding whether His speech (<a href='tags/kalaam.html' class='tagLink'><font class='tagLink'>Kalaam</font></a>) is created (or not)? And is it established with His Self (or not)? And whether it is eternal (qadeem) or recent (haadith)? And whether He has never ceased being "one who speaks when He wills" (or not)?    <P>
For this (that Allaah speaks with a voice) is the saying of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/karraamiyyah.html' class='tagLink'><font class='tagLink'>Karraamiyyah</font></a>, Shee'ah, most of the Murji'ah, Saalimiyyah, and other than them from the Hanafiyyah, Maalikiyyah, Shaafi'iyyah, Hanbaliyyah and Soofiyyah.    <P>
And there is not from the factions of the Muslims anyone who rejected that Allaah speaks with a voice (sawt) except <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> and whoever followed him.</blockquote>    <P>
<u>Also understand</u> that the Ash'aris (following the Kullaabiyyah) were forced to reject that speech is with letter and voice (al-harf was-sawt) and to innovate the "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>" because they were trying to tread a middle ground between Ahl us-Sunnah and the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>. So on the one hand they wanted to affirm the truth (Allaah has speech) and at the same time not invalidate their intellectual proof of "<a href="tags/hudooth-ul-ajsaam.html" class="tagLink"><font class="tagLink">hudooth ul-ajsaam</font></a>" (anything that is subject to occurrences, events must be created, which in the case of Allaah's Speech is Allaah speaking <u>as and when He wills</u>) - and thus "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" now became (to them):     <P>
<ul><li> just the meaning present with the Self of Allaah,   <li> a singular indivisible meaning and   <li> not tied to Allaah's will and power </ul>    <P>
These views were innovated in order to protect that intellectual  proof of "<a href="tags/hudooth-ul-ajsaam.html" class="tagLink"><font class="tagLink">hudooth ul-ajsaam</font></a>", which argues that the presence of qualities (<a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>sifaat</font></a>), incidental attributes (<a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a>) and actions (af'aal, hawaadith) present in the bodies that make up the universe are a proof of those bodies being created, and thus the universe as a whole is created, and thus there must be a creator. <u>This is actually a false, corrupt proof</u>. But because they made this proof to be the ultimate rational truth upon which the veracity of the religion depends, they had to start fooling around with the revealed texts and innovate sayings in order not to falsify this proof, continuing the legacy of their Imaams in that, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>.    <P>
And these three sayings above in relation to what is Allaah's "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" are the most evident  plain, manifest falsehood which are invalidated, <u>without any shadow of doubt</u>, by the clear texts of the Book of Allaah. <u>And the shrewd ones amongst them knew this full well</u>, which is why Abu al-Mu'aalee <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> (d. 478H) innovated another innovation to conceal the previous falsehood the earlier ones were upon. So <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> said, as mentioned by Ibn Abi al-Izz in his Sharh of at-Tahaawiyyah, that al-Juwaynee's view was that what is referred to as Allaah's "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" (speech) is something that shares between a) the meaning that is established with Allaah's self (al-ma'naa al-qaa'imu bidh-dhaat) - which is what the Kullaabis and <a href='tags/early-asharis.html' class='tagLink'><font class='tagLink'>Early Ash'aris</font></a> were upon - <u>and</u> b) what Allaah creates in other than Himself of letters, voices (which is what the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> said is Allaah's "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>") - this is because the shrewd ones knew you can't go around saying "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" is just the singular meaning (al-ma'naa al-waahid) in the self - it can't be sustained, the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> and Sunnah falsify it and it is known, its a matter of ijmaa' that "<a href="tags/kalaam.html" class="tagLink"><font class="tagLink">Kalaam</font></a>" (speech) is both meaning (ma'naa) and wording (lafdh) - none of this was disputed until the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> and <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> used an unverified line of poetry of a Christian Poet called al-Akhtal as a basis to argue that speech is the "meaning in the self", and then they went looking in the revealed texts for anything that would support them in this. It's a case of "<i>believe first, and find evidence for it afterwards</i>", which is what they did with "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>", they (the Kullaabiyyah) innovated this saying of theirs to reconcile between the deen of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and that of Ahl us-Sunnah, and then went looking for evidences for it in the texts.    <P>
And what <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> has done - seeing the falsehood in that - is to simply combine the deen of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, with the deen of <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> by devising a new definition for what is "Kalaamullaah (the speech of Allaah)", and <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> took much of the Kullaabi Ash'arite creed in this direction. <a href='tags/ibn-kullaab.html' class='tagLink'><font class='tagLink'>Ibn Kullaab</font></a> said Allaah's speech is just the "<a href="tags/kalaam-nafsee.html" class="tagLink"><font class="tagLink">Kalaam Nafsee</font></a>" and the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> said, Allaah's speech is what He creates in the servants of speech, and so <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> said, why not just combine between them both so we can have the best of both views in trying to defend that intellectual proof called "<a href="tags/hudooth-ul-ajsaam.html" class="tagLink"><font class="tagLink">hudooth ul-ajsaam</font></a>", so he proposed a hybrid definition and also ascribed it to others from the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a> (refer to his book "al-Irshaad") - and <a href='tags/al-juwaynee.html' class='tagLink'><font class='tagLink'>al-Juwaynee</font></a> was responsible for taking much of the Ash'arite creed back towards the direction of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, in this same manner. <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?qnnsm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:13 GMT -->
</html>


