

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.asharis.com/creed/print.cfm?lsrvc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:24 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Asharis.Com | Imam al-Dhahabi, His Disapproval of the Phrase 'Bi Dhatihi', and the Deception and Stupidity of Today's Jahmite Ash'aris</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Asharis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Imam al-Dhahabi, His Disapproval of the Phrase 'Bi Dhatihi', and the Deception and Stupidity of Today's Jahmite Ash'aris</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Monday, November, 08 2010 and
 filed under <a href="categories/mp-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/al-dhahabi.html">
Al-Dhahabi 
</a> &#149; <a href="tags/bi-dhatihi.html">
Bi Dhatihi 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>Imam al-Dhahabi wrote a book called <b><i>al-Uluww lil-Aliyy il-Ghaffaar</i></b> in order to affirm and defend the belief of Ahl al-Sunnah that Allah, Himself, is above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>. However, he disapproved of the use of the phrase "<i>bi dhatihi</i>" (with His essence), arguing that since the Innovators, when they deny <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-<a href="tags/uluww.html" class="tagLink"><font class="tagLink">uluww</font></a></font></a>, and when they make ta'wil of it, themselves clearly intend that Allaah "dominated, conquered" <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> "bi dhatihi", then he saw it pointless to reply by saying Allah is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> "bi dhatihi", since it is superfluous speech.</div>    <P>
Further, in many parts in this book, al-Dhahabi frequently attacks the Mutakallimin (Ashariyyah, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, Jahmiyyah), and speaks ill of their theology built upon the language of the <a href='tags/philosophers.html' class='tagLink'><font class='tagLink'>Philosophers</font></a>, that of ajsaam and <a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a> (bodies and their incidental attributes), and rebuts them for their rejection of <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-<a href="tags/uluww.html" class="tagLink"><font class="tagLink">uluww</font></a></font></a>.    <P>
However, when the diseased of heart amongst them saw that al-Dhahabi disapproved of the use of this phrase "bi dhatihi" they took it as an opportunity to deceive the people by setting up <u>smoke and mirrors</u> to try and make the situation look like other than what it really is. So they fabricated lies against al-Dhahabi and said, for example, that al-Dhahabi freed himself from this book later in his life (a blatant lie - <a href=dld5dea.html?a=pre-dhahabi-bi-dhatihi.pdf>see this PDF article</a>), or that al-Dhahabi had two views, one in the book <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-<a href="tags/uluww.html" class="tagLink"><font class="tagLink">uluww</font></a></font></a>, and then another in al-Siyar, his biographical work. This is also from the conniving of the <a href='tags/asharites.html' class='tagLink'><font class='tagLink'>Ash'arites</font></a>. What exactly are these supposed two views?    <P>
So these statements are just smoke and mirrors used to deceive those who a) don't know Arabic, and b) don't have access to these works so they can check for themselves.     <P>
<font class='titleHeadline'>The Statements of Imam al-Dhahabi</font>    <P>
Al-Dhahabi said [in Mukhtasar al-&#703;Uluww (al-Maktab al-Isl&#257;m&#299;, Beirut, 1991), p. 263]:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1602;&#1604;&#1578; &#1602;&#1608;&#1604;&#1603; &#1576;&#1584;&#1575;&#1578;&#1607; &#1607;&#1584;&#1575; &#1605;&#1606; &#1603;&#1610;&#1587;&#1603; &#1608;&#1604;&#1607;&#1575; &#1605;&#1581;&#1605;&#1604; &#1581;&#1587;&#1606; &#1608;&#1604;&#1575; &#1581;&#1575;&#1580;&#1577; &#1573;&#1604;&#1610;&#1607;&#1575; &#1601;&#1573;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1571;&#1608;&#1604; &#1575;&#1587;&#1578;&#1608;&#1609; &#1610;&#1602;&#1608;&#1604; &#1571;&#1610; &#1602;&#1607;&#1585; &#1576;&#1584;&#1575;&#1578;&#1607; &#1608;&#1573;&#1587;&#1578;&#1608;&#1604;&#1609; &#1576;&#1584;&#1575;&#1578;&#1607; &#1576;&#1604;&#1575; &#1605;&#1593;&#1610;&#1606; &#1608;&#1604;&#1575; &#1605;&#1572;&#1575;&#1586;&#1585; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I say: Your saying bi dh&#257;tih&#299; is from your kays (subtlety, intelligence),  and it has a good interpretation (mahmal hasan), but there is no requirement for it because the one who interprets istaw&#257;' says that He subdued with His essence (bi dh&#257;tih&#299;) and that He conquered (istatwl&#257; bi dh&#257;tih&#299;) without any aider or assistance. And without doubt, leaving superfluous speech is from the better part of Islam.</blockquote>    <P>
And he also said [Mukhtasar al-&#703;Uluww (al-Maktab al-Isl&#257;m&#299;, Beirut, 1991), p. 267]:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1602;&#1604;&#1578; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1606;&#1602;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605; &#1605;&#1588;&#1607;&#1608;&#1585; &#1605;&#1581;&#1601;&#1608;&#1592; &#1587;&#1608;&#1609; &#1603;&#1604;&#1605;&#1577; &#1576;&#1584;&#1575;&#1578;&#1607; &#1601;&#1573;&#1606;&#1607;&#1575; &#1605;&#1606; &#1603;&#1610;&#1587;&#1607; &#1606;&#1587;&#1576;&#1607;&#1575; &#1573;&#1604;&#1610;&#1607;&#1605; &#1576;&#1575;&#1604;&#1605;&#1593;&#1606;&#1609; &#1604;&#1610;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1593;&#1585;&#1588; &#1608;&#1576;&#1610;&#1606; &#1605;&#1575; &#1593;&#1583;&#1575;&#1607; &#1605;&#1606; &#1575;&#1604;&#1571;&#1605;&#1603;&#1606;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I say: This which he has quoted from them is well-known and preserved, except for the phrase bi dh&#257;tihi, for this is from his subtlety, intelligence (kaysih&#299;), he attributed it to them in terms of meaning in order to distinguish between <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> and what is besides it of the [various] places.</blockquote>    <P>
And of Ibn Abi Zayd's use of this phrase, al-Dhahabi, says [Mukhtasar al-&#703;Uluww, p. 255-256]:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1573;&#1606;&#1605;&#1575; &#1571;&#1585;&#1575;&#1583; &#1575;&#1576;&#1606; &#1571;&#1576;&#1610; &#1586;&#1610;&#1583; &#1608;&#1594;&#1610;&#1585;&#1607; &#1575;&#1604;&#1578;&#1601;&#1585;&#1602;&#1577; &#1576;&#1610;&#1606; &#1603;&#1608;&#1606;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1593;&#1606;&#1575; &#1608;&#1576;&#1610;&#1606; &#1603;&#1608;&#1606;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1608;&#1602; &#1575;&#1604;&#1593;&#1585;&#1588; &#1601;&#1607;&#1608; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1608;&#1605;&#1593;&#1606;&#1575; &#1576;&#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1571;&#1606;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1603;&#1605;&#1575; &#1571;&#1593;&#1604;&#1605;&#1606;&#1575; &#1581;&#1610;&#1579; &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1575;&#1587;&#1578;&#1608;&#1609; &#1608;&#1602;&#1583; &#1578;&#1604;&#1601;&#1592; &#1576;&#1575;&#1604;&#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1605;&#1584;&#1603;&#1608;&#1585;&#1577; &#1580;&#1605;&#1575;&#1593;&#1577; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1603;&#1605;&#1575; &#1602;&#1583;&#1605;&#1606;&#1575;&#1607; &#1608;&#1576;&#1604;&#1575; &#1585;&#1610;&#1576; &#1571;&#1606; &#1601;&#1590;&#1608;&#1604; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1578;&#1585;&#1603;&#1607; &#1605;&#1606; &#1581;&#1587;&#1606; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;.    <P>
&#1608;&#1603;&#1575;&#1606; &#1575;&#1576;&#1606; &#1571;&#1576;&#1610; &#1586;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1593;&#1575;&#1605;&#1604;&#1610;&#1606; &#1576;&#1575;&#1604;&#1605;&#1594;&#1585;&#1576; &#1608;&#1603;&#1575;&#1606; &#1610;&#1604;&#1602;&#1576; &#1576; &#1605;&#1575;&#1604;&#1603; &#1575;&#1604;&#1589;&#1594;&#1610;&#1585; &#1608;&#1603;&#1575;&#1606; &#1594;&#1575;&#1610;&#1577; &#1601;&#1610; &#1593;&#1604;&#1605; &#1575;&#1604;&#1571;&#1589;&#1608;&#1604;. &#1608;&#1602;&#1583; &#1584;&#1603;&#1585;&#1607; &#1575;&#1604;&#1581;&#1575;&#1601;&#1592; &#1575;&#1576;&#1606; &#1593;&#1587;&#1575;&#1603;&#1585; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576; &#1578;&#1576;&#1610;&#1610;&#1606; &#1603;&#1584;&#1576; &#1575;&#1604;&#1605;&#1601;&#1578;&#1585;&#1610; &#1601;&#1610;&#1605;&#1575; &#1606;&#1587;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610; &#1608;&#1604;&#1605; &#1610;&#1584;&#1603;&#1585; &#1604;&#1607; &#1608;&#1601;&#1575;&#1577;. &#1578;&#1608;&#1601;&#1610; &#1587;&#1606;&#1577; &#1587;&#1578; &#1608;&#1579;&#1605;&#1575;&#1606;&#1610;&#1606; &#1608;&#1579;&#1604;&#1575;&#1579;&#1605;&#1575;&#1574;&#1577; &#1608;&#1602;&#1576;&#1604; &#1587;&#1606;&#1577; &#1578;&#1587;&#1593; &#1608;&#1579;&#1605;&#1575;&#1606;&#1610;&#1606; &#1608;&#1579;&#1604;&#1575;&#1579;&#1605;&#1575;&#1574;&#1577; &#1608;&#1602;&#1583; &#1606;&#1602;&#1605;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1576;&#1584;&#1575;&#1578;&#1607; &#1601;&#1604;&#1610;&#1578;&#1607; &#1578;&#1585;&#1603;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Ibn Ab&#299; Zayd and others intended to distinguish between All&#257;h, the Exalted being with us, and between His, the Exalted, being above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>. And so it just as he  said, that All&#257;h is with us in knowledge, and that He is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> where He says, "The Most Merciful ascended over the Throne" (20:5). And a group from the Scholars have spoken with this aforementioned wording as we have already [mentioned] previously, and without doubt, leaving superfluous speech is from the good part of Isl&#257;m. And Ibn Ab&#299; Zayd was from the Scholars residing in al-Maghrib (Morocco), and he was titled, M&#257;lik al-Sagh&#299;r (the Small M&#257;lik), and he was skilled in the knowledge of the us&#363;l (foundations). Al-H&#257;fidh Ibn &#703;As&#257;kir mentioned him in the book Taby&#299;n Kadhib al-Muftar&#299; F&#299;ma Nusiba il&#257; al-Ash&#703;ar&#299;, but he did not mention his death (date).  He died in 386H and it has been said 389H. And they showed hostility to him for his saying bi dh&#257;tih&#299;, so if only he had left it.</blockquote>    <P>
And al-Dhahabi says in al-Siyar (19/607):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1602;&#1583; &#1584;&#1603;&#1585;&#1606;&#1575; &#1571;&#1606; &#1604;&#1601;&#1592;&#1577; &#1576;&#1584;&#1575;&#1578;&#1607; &#1604;&#1575; &#1581;&#1575;&#1580;&#1577; &#1573;&#1604;&#1610;&#1607;&#1575; &#1608;&#1607;&#1610; &#1578;&#1588;&#1594;&#1576; &#1575;&#1604;&#1606;&#1601;&#1608;&#1587; &#1608;&#1578;&#1585;&#1603;&#1607;&#1575; &#1571;&#1608;&#1604;&#1609; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>We have mentioned that there is no need for the phrase bi dh&#257;tih&#299; (with His essence) and it disturbs the souls, to leave it is more befitting and All&#257;h knows best.</blockquote>     <P>
Al-Dhahabi has mentioned here how Ibn Abi Zayd was attacked because of this phrase - no doubt those Jahmitess did not like it and this is why al-Dhahabi exclaimed, "if only he had left it", so that he would have not been subjected to harm. And this is the angle from which al-Dhahabi did not like this phrase, because it is superfluous and redundant, and that it disturbs the souls (of the those who do not know any better) and it brought harm to notable scholars like Ibn Abi Zayd.     <P>
<div class='sidebar'>However, this is merely the opinion and view of al-Dhahabi, and the phrase "bi dhatihi" in relation to Allah's 'uluww in particular, is just like other clarifications and wordings from the Salaf used to make the true meanings of the Book and the Sunnah clear such as "<i>baa'inun min khalqihi</i>" (separate and distinct from His creation) and "<i>ghayr makhlooq</i>" (the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is uncreated) and  "<i>minhu bada'a</i>" (from Him did it originate [as speech]) and so on. And there is no harm in using such phrases which are found from many of the Salaf in the context of refuting the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and their offshoots, the <a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a> who continue to spread their doubts today. This is why they are trying to find utility in the speech of al-Dhahabi, a sign of their cheapness, <u>because they cannot find anything before the year 400H</u> from any of the Salaf to contest this particular belief (Allah is above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, bi dhatihi) to which they are greatly opposed because it is of the greatest of matters that clashes with their proof of huduth al-ajsam which they use to prove the universe is created, and so they wish to erase it from the hearts, minds and fitrahs of the people - just as the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> of old were attempting to do. </div>    <P>
<font class='titleHeadline'>Al-Dhahabi on Using "Bi Dhatihi" for al-Nuzul and the Likes</font>    <P>
In another place in al-Siyar (20/331) al-Dhahabi says:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1605;&#1587;&#1571;&#1604;&#1577; &#1575;&#1604;&#1606;&#1586;&#1608;&#1604; &#1601;&#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1607; &#1608;&#1575;&#1580;&#1576; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1582;&#1608;&#1590; &#1601;&#1610; &#1604;&#1608;&#1575;&#1586;&#1605;&#1607; &#1571;&#1608;&#1604;&#1609; &#1608;&#1607;&#1608; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1587;&#1604;&#1601; &#1601;&#1605;&#1575; &#1602;&#1575;&#1604; &#1607;&#1584;&#1575; &#1606;&#1586;&#1608;&#1604;&#1607; &#1576;&#1584;&#1575;&#1578;&#1607; &#1573;&#1604;&#1575; &#1573;&#1585;&#1594;&#1575;&#1605;&#1575; &#1604;&#1605;&#1606; &#1578;&#1571;&#1608;&#1604;&#1607; &#1608;&#1602;&#1575;&#1604; &#1606;&#1586;&#1608;&#1604;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1576;&#1575;&#1604;&#1593;&#1604;&#1605; &#1601;&#1602;&#1591; &#1606;&#1593;&#1608;&#1584; &#1576;&#1575;&#1604;&#1604;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1585;&#1575;&#1569; &#1601;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606;  &#1608;&#1603;&#1584;&#1575; &#1602;&#1608;&#1604;&#1607;  <<&#1608;&#1580;&#1575;&#1569; &#1585;&#1576;&#1603;>>  &#1608;&#1606;&#1581;&#1608;&#1607; &#1601;&#1606;&#1602;&#1608;&#1604; &#1580;&#1575;&#1569; &#1608;&#1610;&#1606;&#1586;&#1604; &#1608;&#1606;&#1606;&#1607;&#1609; &#1593;&#1606; &#1575;&#1604;&#1602;&#1608;&#1604; &#1610;&#1606;&#1586;&#1604; &#1576;&#1584;&#1575;&#1578;&#1607; &#1603;&#1605;&#1575; &#1604;&#1575; &#1606;&#1602;&#1608;&#1604; &#1610;&#1606;&#1586;&#1604; &#1576;&#1593;&#1604;&#1605;&#1607; &#1576;&#1604; &#1606;&#1587;&#1603;&#1578; &#1608;&#1604;&#1575; &#1606;&#1578;&#1601;&#1575;&#1589;&#1581; &#1593;&#1604;&#1609; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1576;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1605;&#1576;&#1578;&#1583;&#1593;&#1577; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the issue of al-Nuzul, having faith in it is obligatory, and abandoning disputation about its necessities is more befitting, for it is the way of the Salaf, and so this [one who] said that His nuzul is with His essence except to compel the one who made ta'wil of it and who said "It is His nuzul to the heaven with His knowledge only". We seek refuge in Allaah from argumentation, speculation in the religion. And the same regarding His saying, "<b>And your Lord will come</b>", and what is similar to it. So we say, He will come and He descends, and we prohibit from the saying, "He descends with His essence", just as we do not say, "He descends with His knowledge". Rather, we remain silent and we do not pretend to be more eloquent than the Messenger with innovated expressions, and Allah knows best.</blockquote>    <P>
Al-Dhahabi disapproves of the use of "bi dhatihi" for these sifat fi'liyyah, Allah's chosen actions, however, to say Allah makes <a href='tags/istiwaa.html' class='tagLink'><font class='tagLink'>istiwaa</font></a> over His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, "bi dhatihi", is established from the Salaf.     <P>
<div class='sidebar'><b>Important Note:</b> All of this discussion is only after it is agreed that Allaah himself is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, and hence there is no room for the <a href='tags/jahmite-asharis.html' class='tagLink'><font class='tagLink'>Jahmite Ash'aris</font></a> to stick their noses into this matter and start fraudulently using the speech of al-Dhahabi as if somehow it supports their rejection of Allah's <a href='tags/uluww.html' class='tagLink'><font class='tagLink'>uluww</font></a> outright, for they do not believe there is a Lord who is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> in reality to begin with. And thus, when they see a <u>subsidiary matter</u> (should we say <i>bi dhatihi</i> or not) which branches off from affirmation of <u>the foundation</u> (Allah is indeed above His Throne), and they see one, two or a few scholars differing  with the majority on the subsidiary matter, they jump on it in order to deceive the people regarding the foundational matter in which there is no dispute at all between all the Salaf and those on their way. It is very dishonest how they operate. But al-hamdulillah, people are fleeing from their philosophical <a href='tags/jahmite.html' class='tagLink'><font class='tagLink'>Jahmite</font></a> nonsense because their fitrah does not accept it, and this is why we see such dishonesty, conniving, treachery, twisting, lying, distorting and so on coming from these contemporary <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> posing as Ash'aris.</div>    <P>
<b>In any consideration</b>, there is nothing here for the <a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a> <a href='tags/jahmites.html' class='tagLink'><font class='tagLink'>Jahmites</font></a> in the speech of al-Dhahabi which supports their aim and objective of trying to obliterate the belief that Allaah himself, with His essence, is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a>, above the creation, from the hearts and minds of the Muslims, which is what they are attempting by staging this <u>smoke and mirrors</u> in front of the people. And it is all <u>in order to defend and prop up that proof of huduth al-ajsam</u> which they took from the Sabean star and idol worshipping pagan disbelievers through the isnad of al-Ja'd bin Dirham, <a href='tags/al-jahm-bin-safwan.html' class='tagLink'><font class='tagLink'>al-<a href="tags/jahm-bin-safwan.html" class="tagLink"><font class="tagLink">Jahm bin Safwan</font></a></font></a>, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, Amr bin Ubayd and the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> - which is the proof of ajsaam (bodies) and and <a href='tags/araad.html' class='tagLink'><font class='tagLink'>a'raad</font></a> (incidental attributes) which is what their belief in Allaah is centered around as is evident in all of their books. It's just that these pusillanimous <a href='tags/jahmite.html' class='tagLink'><font class='tagLink'>Jahmite</font></a> cowards don't want you to know that.    <P>
Finally, what better way than to finish off with the very last words of al-Dhahabi in his book al-Uluww:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I (al-Dhahab&#299;) say: Yes, this is what the deniers of the &#703;Uluww (highness) of the Lord, Mighty and Majestic, have depended upon. And they turned away from the requirement of the Book, the Sunnah, the sayings of the Salaf and the innate dispositions of the whole of creation. What they claim to be necessitated (from affirming All&#257;h's &#703;Uluww) is only applicable to created bodies. Yet there is nothing like All&#257;h and the necessities arising from the clear and evident texts (of the Book and the Sunnah) are also true. However, we do not make use of any expression except one that comes through a narration.    <P>
In addition to this we say: We do not accept that the Creator's being upon His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a> and above the heavens, necessitates that He is confined (in space) and in a direction, since whatever is below <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> is said to be confined (in space) and in direction. However, what is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> is not like that. And All&#257;h is above <a href='tags/the-throne.html' class='tagLink'><font class='tagLink'>the <a href="tags/throne.html" class="tagLink"><font class="tagLink">Throne</font></a></font></a> as the very first generation are unanimously agreed upon and as the Im&#257;ms after them have quoted from them. They said this in refutation of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, those who said that He is in every place seeking as a proof His saying, '<b>And He is with you</b>...' So these are the two sayings which were present in the time of the T&#257;bi&#703;&#299;n and their successors who came after them. And they are the two sayings that can be understood in the statement.    <P>
As for the third saying which arose later which is that "All&#257;h the Most High is not in any of the places, nor outside of them, nor above His <a href='tags/throne.html' class='tagLink'><font class='tagLink'>Throne</font></a>, not attached (merged) with His creation, nor separate from it, nor is His essence (dh&#257;t) confined in space, nor is He separate and distinct from His creation, nor is He in any of the directions, nor is He exempt from of any of the directions, and nor this and nor that", then this is something that cannot be comprehended nor understood, along with the fact that within it is opposition to the verses (of the Book) and the narrations (from the Salaf). Therefore flee with your religion and beware of the opinions of the Mutakallim&#363;n (<a href='tags/theologians.html' class='tagLink'><font class='tagLink'>Theologians</font></a>). Believe in All&#257;h and what has come from Him upon the desired intent of All&#257;h, then submit your affair to Him and there is no power nor movement except by All&#257;h. The book is completed and all praise is to All&#257;h alone.</blockquote>    <P>
And this creed is affirmed in al-Siyar in abdundance in the biographies of many of the Salaf, so beware of the deception of the Jahmites! And in al-Siyar we see al-Dhahabi citing and affirming Allah's <a href='tags/uluww.html' class='tagLink'><font class='tagLink'>uluww</font></a> from many of the Salaf, such as the saying of Ayyub al-Sakhtiyaani, al-Awzaa'ee, Ibn al-Mubaarak, Hammad bin Zayd, <a href='tags/imaam-ahmad.html' class='tagLink'><font class='tagLink'>Imaam Ahmad</font></a>, the two Razis, Abu Hatim and Abu Zur'ah, al-Darimi, Ibn al-Surayj al-Shafi'ee, Abu Ma'mar al-Qatee'ee, al-Muzani who said, "<i>The <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> of any person is not sound until he knows Allaah, possessing attributes, to be above the Throne</i>" (al-Siyar 12/494).     <P>
   <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.asharis.com/creed/print.cfm?lsrvc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 12:11:24 GMT -->
</html>


