




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?vdcip by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</span><BR>
Sunday, December 20 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>Introduction</font>    <P>
The Noble Shaykh, Ahmad an-Najmee (rahimahullaah) wrote a book called: (<span class='arb'>&#1575;&#1604;&#1605;&#1608;&#1585;&#1583; &#1575;&#1604;&#1593;&#1584;&#1576; &#1575;&#1604;&#1586;&#1604;&#1575;&#1604; &#1601;&#1610;&#1605; &#1575;&#1606;&#1578;&#1602;&#1583; &#1593;&#1604;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1606;&#1575;&#1607;&#1580; &#1575;&#1604;&#1583;&#1593;&#1608;&#1610;&#1577; &#1605;&#1606; &#1575;&#1604;&#1593;&#1602;&#1575;&#1574;&#1583; &#1608;&#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604;</span>) - <b>The Sweet Cool [Water] Spring Regarding What Has Been Criticized of Beliefs and Actions of Some of the Methodologies of Da'wah</b>" in which he covered the mistakes, innovations and deviation of many groups and movements including al-Ikhwaan al-Muslimeen and Jamaa'at ut-Tableegh.    <P>
Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> sent a letter to Shaykh Ahmad an-Najmee requesting him not to print the book, and he said, as quoted by Shaykh an-Najmee in his response to him (p. 3):    <P>
<div class='arabic' align='right'>&#1608;&#1604;&#1605;&#1617;&#1575; &#1608;&#1589;&#1604;&#1578;&#1615; &#1573;&#1604;&#1609; &#1575;&#1604;&#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1575;&#1587;&#1593; &#1608;&#1602;&#1593;&#1578; &#1593;&#1604;&#1609; &#1605;&#1575;&#1604;&#1605; &#1571;&#1603;&#1606; &#1571;&#1578;&#1608;&#1602;&#1593;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And when I reached the ninth chapter, I came upon what I did not expect...</blockquote>    <P>
Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was surprised at the criticisms and pointing out of the errors of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a>. In this series we want to mention some of what <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> was criticised for by Shaykh Ahmad an-Najmee, by quoting from Shaykh Najmee's response to Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a>.    <P>
<font class='titleHeadline'><a href="tags/wahdat-ul-wujood.html" class="tagLink"><font class="tagLink">Wahdat ul-Wujood</font></a></font>    <P>
Shaykh Ahmad an-Najmee (rahimahullaah) said, addressing Ibn Jibreen:    <P>
<div class='arabic' align='right'> &#1601;&#1603;&#1617;&#1585; &#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1581;&#1605;&#1604;&#1606;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610; &#1585;&#1580;&#1604; &#1602;&#1583; &#1605;&#1575;&#1578; &#1608;&#1571;&#1606;&#1575; &#1601;&#1610; &#1587;&#1606; &#1575;&#1604;&#1591;&#1601;&#1608;&#1604;&#1577; &#1608;&#1604;&#1605; &#1610;&#1587;&#1601;&#1603; &#1604;&#1610; &#1583;&#1605;&#1575;&#1611; &#1608;&#1604;&#1605; &#1610;&#1606;&#1578;&#1607;&#1603; &#1604;&#1610; &#1593;&#1585;&#1590;&#1575;&#1611; &#1608;&#1604;&#1605; &#1610;&#1571;&#1582;&#1584; &#1593;&#1604;&#1610;&#1617;&#1614; &#1605;&#1575;&#1604;&#1575;&#1611;  , &#1601;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1605;&#1604;&#1606;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610;&#1607; &#1608;&#1604;&#1605; &#1610;&#1592;&#1604;&#1605;&#1606;&#1610; &#1571;&#1606;&#1575; &#1588;&#1582;&#1589;&#1610;&#1575;&#1611; &#1576;&#1588;&#1610;&#1569; , &#1573;&#1606; &#1603;&#1606;&#1578; &#1578;&#1603;&#1604;&#1605;&#1578;&#1615; &#1601;&#1610;&#1607; &#1605;&#1606; &#1594;&#1610;&#1585; &#1587;&#1575;&#1576;&#1602; &#1592;&#1604;&#1605; &#1605;&#1606;&#1607; &#1604;&#1610; &#1608;&#1604;&#1575; &#1605;&#1589;&#1604;&#1581;&#1577; &#1583;&#1610;&#1606;&#1610;&#1577; &#1578;&#1603;&#1604;&#1605;&#1578; &#1601;&#1610;&#1607;&#1575; &#1605;&#1606; &#1571;&#1580;&#1604;&#1607;&#1575; &#1601;&#1571;&#1606;&#1575; &#1592;&#1575;&#1604;&#1605; &#1605;&#1593;&#1578;&#1583;&#1610; &#1608;&#1587;&#1610;&#1571;&#1582;&#1584; &#1575;&#1604;&#1604;&#1607; &#1604;&#1607; &#1576;&#1581;&#1602;&#1607; &#1605;&#1606;&#1610;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Reflect upon what has carried me to speak about a man who died whilst I was only young in age, and he did not shed any blood of mine, and nor violate my honour and nor take wealth from me. So what has carried me to speak about him when he personally has not wronged me? If I had spoken about him without him having previously wronged me, and it was not for any religious benefit that I spoke about him, then I am an oppressor, transgressor, and Allaah will soon take from me his right.</blockquote>    <P>
And thereafter, he gives him an example of the criticism, on account of which he spoke against him:    <P>
<div class='arabic' align='right'> &#1601;&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1602;&#1608;&#1604; &#1576;&#1573;&#1593;&#1578;&#1585;&#1575;&#1601; &#1571;&#1582;&#1610;&#1607; &#1605;&#1601;&#1578;&#1582;&#1585;&#1575;&#1611; &#1608;&#1607;&#1608; &#1605;&#1606;&#1588;&#1608;&#1585; &#1601;&#1610; &#1603;&#1578;&#1576; &#1571;&#1607;&#1604; &#1581;&#1586;&#1576;&#1607;</div>    <P>
<img src=assets/images/bannaa-poetry-unity-existence.gif border=0>    <P>
<div class='arabic' align='right'>&#1601;&#1573;&#1606; &#1603;&#1606;&#1578; &#1578;&#1585;&#1609; &#1571;&#1606; &#1581;&#1605;&#1617;&#1604;&#1578; &#1603;&#1604;&#1575;&#1605;&#1607; &#1605;&#1575;&#1604;&#1605; &#1610;&#1581;&#1578;&#1605;&#1604;&#1607; &#1601;&#1601;&#1587;&#1585; &#1604;&#1610; &#1603;&#1604;&#1575;&#1605;&#1607; &#1607;&#1584;&#1575; &#1576;&#1605;&#1575; &#1610;&#1581;&#1578;&#1605;&#1604;&#1607; &#1588;&#1585;&#1593;&#1575;&#1611; &#1608;&#1593;&#1602;&#1604;&#1575;&#1611; &#1594;&#1610;&#1585; &#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1608;&#1580;&#1608;&#1583; .</div>    <P>
  <blockquote class='quote'><img src='images/quote-start.gif'>He is the one, according to his own brother's acknowledgement, who would boastfully say, and this is widely circulated in the books of his party:    <P>
<div align=center><i>Allaah raised and scattered (all) the existence and what it contains<BR>  So if you desire to attain perfection<BR>  Then everything in the universe if you realize it<BR>  Is non-existent, specifically and generally<BR></i></div></blockquote>    <P>
What <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> has alluded are some meanings that arise from the asl (foundation) of what was propounded by Muhiy ud-Din <a href='tags/ibn-arabi.html' class='tagLink'><font class='tagLink'>Ibn Arabi</font></a> in his book "Fusoos al-Hikam" of the doctrine of <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a>, and it derives from the emanation philosophies of the likes of Plotinus (270CE). Whilst this is not the place to go into detail, we can refer the reader to the book "<i>Hatk Astaar il-Fusoos</i>" (Removing the Veils [from] the Fusoos) by Shaykh Imaad ud-Deen al-Waasitee (d. 711H), where the great "<i>secret</i>" of Ibn 'Arabi is laid bare.    <P>
Then Shaykh Ahmad addresses Shaykh Ibn Jibreen:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So if you think that I understood from his words that which he didn't intend, then please interpret for me what this statement of his contains religiously and intellectually, other than <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a>.</blockquote>    <P>
And a little later he says:    <P>
<div class='arabic' align='right'>:&#1601;&#1587;&#1617;&#1585; &#1604;&#1610; &#1579;&#1606;&#1575;&#1569;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1585;&#1594;&#1606;&#1610; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601; &#1576;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1608;&#1580;&#1608;&#1583; &#1576;&#1578;&#1601;&#1587;&#1610;&#1585; &#1605;&#1615;&#1585;&#1590;&#1613; &#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1579;&#1605; &#1604;&#1604;&#1605;&#1572;&#1605;&#1606;&#1610;&#1606; &#1594;&#1610;&#1585; &#1575;&#1604;&#1585;&#1590;&#1609; &#1576;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1608;&#1580;&#1608;&#1583; &#1608;&#1575;&#1604;&#1579;&#1606;&#1575;&#1569; &#1593;&#1604;&#1609; &#1571;&#1589;&#1581;&#1575;&#1576;&#1607;&#1575;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Thirdly: Explain to me his praise for al-Mirghanee, the one well known for <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a> with an explanation that would please Allaah and His Messenger and then the believers other than [the explanation] that he [al-Bannaa] was pleased with <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a> and praised those who held that view.</blockquote>    <P>
And there was no response from Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> as Shaykh Ahmad sent this to the Shaykh and allowed him ample time to respond. So when it angers a person that <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> <u>is refuted for this saying</u>, more than it angers them that <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> <u>actually said this saying</u>, then that is a calamity indeed!      <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/ctyzd-bayan-talbis-al-qutbiyyah-part-3---the-allegation-that-shaykh-rabee-made-takfeer-of-shaykh-ibn-jibreen.html">Bayan Talbis al-Qutbiyyah: Part 3 - The Allegation that Shaykh Rabee' Made Takfeer of Shaykh Ibn Jibreen</a><BR>
//www.themadkhalis.com/md/?ctyzd<BR>

<li><a href="articles/oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a><BR>
//www.themadkhalis.com/md/?oyama<BR>

<li><a href="articles/cxjxj-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-3---ayatollah-kaashaani-of-the-rafidi-state-of-iran.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 3 - Ayatollah Kaashaani of the Rafidi State of Iran</a><BR>
//www.themadkhalis.com/md/?cxjxj<BR>

<li><a href="articles/ztutj-hasan-al-banna-and-the-raafidah-shiah-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 2 - Striving for Unification With The Rafidah</a><BR>
//www.themadkhalis.com/md/?ztutj<BR>

<li><a href="articles/mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a><BR>
//www.themadkhalis.com/md/?mgrwe<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/oeinz-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</a><BR>
//www.themadkhalis.com/md/?oeinz<BR>

<li><a href="articles/bguiq-shaykh-ibn-jibreen-making-takfir-upon-the-saying-of-sayyid-qutb-that-islam-is-a-mixture-of-communism-and-christianity.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen Makes Takfir Upon (Declares as Kufr) the Saying of Sayyid Qutb That Islam Is a Mixture of Communism and Christianity</a><BR>
//www.themadkhalis.com/md/?bguiq<BR>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/gbmok-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-4.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 4 - Calling For Unity Between the Rafidah and the Sunnah</a><BR>
//www.themadkhalis.com/md/?gbmok<BR>

<li><a href="articles/lcwli-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-3.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 3 - Witnessing Grave Worship and Travelling Twenty Kilometres to the Tombs of ad-Dusuqi and Sinjar</a><BR>
//www.themadkhalis.com/md/?lcwli<BR>

<li><a href="articles/hkqct-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-2.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 2 - Major Shirk</a><BR>
//www.themadkhalis.com/md/?hkqct<BR>

<li><a href="articles/vdcip-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwid-hasan-al-banna---part-1.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?vdcip<BR>

<li><a href="articles/umssw-shaykh-ibn-jibreen-on-what-is-manifest-clear-kufr-and-ruling-with-the-secular--laws.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen on What is Manifest Clear Kufr and Ruling With the Secular  Laws</a><BR>
//www.themadkhalis.com/md/?umssw<BR>

<li><a href="articles/ocbde-shaykh-muhammad-aamaan-al-jaamee-on-the-dawah-of-hassan-al-bannaa.html">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</a><BR>
//www.themadkhalis.com/md/?ocbde<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?vdcip by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


