




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oeinz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:10 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</span><BR>
Sunday, January 10 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Hasan al-Banna founded his organization "al-Ikhwan al-Muslimeen" upon the principle that anyone who says "<i>Laa ilaaha illallaaha</i>" can join his organization in order to work towards a collective goal - and this includes the <a href='tags/rafidah-shiah.html' class='tagLink'><font class='tagLink'>Rafidah Shi'ah</font></a> - for he strove to bring nearness, cordiality and unity between Ahl us-Sunnah and the Shi'ah.    <P>
<div class='sidebar'>In this article, as well as a clarification of this falsehood, you will also come to realise the true nature of the use of the word "<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a>", it is used as a veil in order to attack the creed and methodology all the Major Scholars of Ahl us-Sunnah, such as Imaam <a href='tags/ibn-baaz.html' class='tagLink'><font class='tagLink'>Ibn Baaz</font></a>, Imaam al-Albani, Imaam <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> and those scholars from Ahl us-Sunnah who are present today. However, as all people will not hesitate to scorn anyone who speaks ill of these scholars, these people, who are in fact subscribers to the manhaj and madhhab of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a>, veil their attack by using the word "<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a>", trying to make out that their problem is only with one particular scholar, when the reality is otherwise.</div>    <P>
In any case, you will come to realise why they focus on this one particular Scholar, <a href='tags/shaykh-rabi-bin-hadi-al-madkhali.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/rabi-bin-hadi-al-madkhali.html" class="tagLink"><font class="tagLink">Rabi bin Hadi al-<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a></font></a></font></a> - it is because of the fact that <a href='tags/shaykh-rabi.html' class='tagLink'><font class='tagLink'>Shaykh Rabi</font></a> gave nasiha to Allaah, to His Book, to His Messenger and to the generality of the Muslims in exposing the falsehood and opposition to Islaam of the likes of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> and <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>. Also because <u>he was supported by the Scholars in that</u>, some of whom even preceded him in some areas of refutation against these Innovators. They lament over the fact that this Shaykh spoke and refuted some of their figureheads, and in fact Imaam <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> <u>has explicitly stated that this</u>, the people only started tarnishing <a href='tags/shaykh-rabi.html' class='tagLink'><font class='tagLink'>Shaykh Rabi</font></a> with faults after he spoke about their rumooz (figureheads)  - <a href=indexb09a.html?epluy>see this article</a>. It is precisely for this reason that many of these rodents went out looking for "controversies" and "scandals" to try and <b>tarnish</b> the Shaykh, far-removed from any <b>knowledge-based discussion</b> of the actual issues.     <P>
So they went searching and found nothing of value to defend the likes of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> except what was of a sensational, and "scandal-type" value to them: "<i>Shaykh Rabi said <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> stabbed Salafiyyah in the back</i>", and "<i>The Mufti warns from Madkhalis</i>" and "<i>Ghudayan does not know Rabi</i>" and "<i>Rabi made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, and <a href='tags/banna.html' class='tagLink'><font class='tagLink'>Banna</font></a> and Jibrin</i>", and so on and so on. Having been refuted <u>on all knowledge-based issues pertaining to the innovated methodologies</u> of al-Ikhwan al-Muslimeen, and the innovations, deviations and misguidance of its figureheads, these people could only hunt for what they saw as sensational, controversial, "scandals" through which to deceive others about the true and real underlying issues. However, people are not as gullible as these fools think, and they can easily discern the fact that these people are bankrupt, <b>and actually have no money in their pockets</b>. That's why all you are going to see is cheap shots, aspersions on personalities, but no discussions about the evidences against the methodologies that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and <a href='tags/banna.html' class='tagLink'><font class='tagLink'>Banna</font></a> innovated and for which all the Scholars refuted them. And this is their actual grievance, it is resentment and hatred that drives these people, little else.    <P>
<font class='titleHeadline'>Hasan al-Banna: Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are the Same, Upon Purity, United by the Kalimah</font>    <P>
Shaykh <a href='tags/rabi-bin-hadi-al-madkhali.html' class='tagLink'><font class='tagLink'>Rabi bin Hadi al-<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a></font></a>, (hafidhahullaah) stated, in the course of his refutation of Abu al-Hasan al-Misri's apologetic defence for al-Ikhwan al-Muslimeen (calling them Ahl ul-Ittibaa'!),  documents Hasan al-Banna's efforts in uniting between the Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a>. The Shaykh wrote, as occurs in (<span class='arb'>&#1571;&#1576;&#1608; &#1575;&#1604;&#1581;&#1587;&#1606; &#1610;&#1583;&#1575;&#1601;&#1593; &#1576;&#1575;&#1604;&#1576;&#1575;&#1591;&#1604; &#1608;&#1575;&#1604;&#1593;&#1583;&#1608;&#1575;&#1606; &#1593;&#1606; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1608;&#1583;&#1593;&#1575;&#1577; &#1581;&#1585;&#1610;&#1577; &#1608;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1571;&#1583;&#1610;&#1575;&#1606;  </span>) "<i>Abu al-Hasan Defends, in Falsehood and Transgression, the Ikhwaan, and the Callers to Freedom (of Belief) and Unity of Religions)</i>", on p.22:    <P>
<div class='arabic' align='right'><b>&#1602;&#1610;&#1575;&#1605; &#1575;&#1604;&#1576;&#1606;&#1575; &#1576;&#1593;&#1605;&#1604; &#1580;&#1575;&#1583; &#1604;&#1604;&#1578;&#1602;&#1585;&#1610;&#1576; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1608;&#1593;&#1604;&#1609; &#1585;&#1571;&#1587;&#1607;&#1575; &#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1585;&#1608;&#1575;&#1601;&#1590;</b>    <P>
&#1608;&#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; &#1575;&#1604;&#1571;&#1582;&#1610;&#1585; (&#1584;&#1603;&#1585;&#1610;&#1575;&#1578; &#1604;&#1575; &#1605;&#1584;&#1603;&#1585;&#1575;&#1578;)&#1591;1- &#1583;&#1575;&#1585; &#1575;&#1604;&#1575;&#1593;&#1578;&#1589;&#1575;&#1605; 1985 &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1593;&#1605;&#1585; &#1575;&#1604;&#1578;&#1604;&#1605;&#1587;&#1575;&#1606;&#1610; &#1589;249 &#1608;250:  <blockquote>    &#1608;&#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1610;&#1606;&#1575;&#1578; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1584;&#1603;&#1585; &#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1610;&#1583; &#1575;&#1604;&#1602;&#1605;&#1610;-&#1608;&#1607;&#1608; &#1588;&#1610;&#1593;&#1610; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576;- &#1610;&#1606;&#1586;&#1604; &#1590;&#1610;&#1601;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1585;&#1603;&#1586; &#1575;&#1604;&#1593;&#1575;&#1605; &#1608;&#1608;&#1602;&#1578;&#1607;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1575;&#1604;&#1588;&#1607;&#1610;&#1583;  &#1610;&#1593;&#1605;&#1604; &#1580;&#1575;&#1583;&#1575;&#1611; &#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1602;&#1585;&#1610;&#1576; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; ,&#1581;&#1578;&#1609; &#1604;&#1575; &#1610;&#1578;&#1582;&#1584; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1605;&#1606;&#1601;&#1584;&#1575; &#1610;&#1593;&#1605;&#1604;&#1608;&#1606; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604;&#1607; &#1593;&#1604;&#1609; &#1578;&#1605;&#1586;&#1610;&#1602; &#1575;&#1604;&#1608;&#1581;&#1583;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; ,&#1608;&#1587;&#1571;&#1604;&#1606;&#1575;&#1607; &#1610;&#1608;&#1605;&#1575;&#1611; &#1593;&#1606; &#1605;&#1583;&#1609; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; ,&#1601;&#1606;&#1607;&#1575;&#1606;&#1575; &#1593;&#1606; &#1575;&#1604;&#1583;&#1582;&#1608;&#1604; &#1601;&#1610; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1575;&#1574;&#1604; &#1575;&#1604;&#1588;&#1575;&#1574;&#1603;&#1577; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1610;&#1604;&#1610;&#1602; &#1576;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606; &#1610;&#1588;&#1594;&#1604;&#1608;&#1575; &#1571;&#1606;&#1601;&#1587;&#1607;&#1605; &#1576;&#1607;&#1575; &#1608;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1575; &#1606;&#1585;&#1609; &#1605;&#1606; &#1578;&#1606;&#1575;&#1576;&#1584; &#1610;&#1593;&#1605;&#1604; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1573;&#1588;&#1593;&#1575;&#1604; &#1606;&#1575;&#1585;&#1607; ,&#1602;&#1604;&#1606;&#1575; &#1604;&#1601;&#1590;&#1610;&#1604;&#1578;&#1607; : &#1606;&#1581;&#1606; &#1604;&#1575; &#1606;&#1587;&#1571;&#1604; &#1593;&#1606; &#1607;&#1584;&#1575; &#1604;&#1604;&#1578;&#1593;&#1589;&#1576; &#1571;&#1608; &#1578;&#1608;&#1587;&#1593;&#1577; &#1604;&#1607;&#1608;&#1577; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1604;&#1603;&#1606;&#1606;&#1575; &#1606;&#1587;&#1571;&#1604; &#1604;&#1604;&#1593;&#1604;&#1605; ,&#1604;&#1571;&#1606;&#1617;&#1614; &#1605;&#1575; &#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1605;&#1584;&#1603;&#1608;&#1585; &#1601;&#1610; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1604;&#1575; &#1581;&#1589;&#1585; &#1604;&#1607;&#1575; &#1608;&#1604;&#1610;&#1587; &#1604;&#1583;&#1610;&#1606;&#1575; &#1605;&#1606; &#1587;&#1593;&#1577; &#1575;&#1604;&#1608;&#1602;&#1578; &#1605;&#1575; &#1610;&#1605;&#1603;&#1606;&#1606;&#1575; &#1605;&#1606; &#1575;&#1604;&#1576;&#1581;&#1579; &#1601;&#1610; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1585;&#1575;&#1580;&#1593; . &#1601;&#1602;&#1575;&#1604; &#1585;&#1590;&#1608;&#1575;&#1606; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; :  <blockquote>   &#1575;&#1593;&#1604;&#1605;&#1608;&#1575; &#1571;&#1606;&#1617;&#1614; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1605;&#1587;&#1604;&#1605;&#1608;&#1606; &#1578;&#1580;&#1605;&#1593;&#1607;&#1605; &#1603;&#1604;&#1605;&#1577; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575;&#1617;&#1614; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1606;&#1617;&#1614; &#1605;&#1581;&#1605;&#1583;&#1575;&#1611; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1607;&#1584;&#1575; &#1571;&#1589;&#1604; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; ,&#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1601;&#1610;&#1607; &#1587;&#1608;&#1575;&#1569; &#1608;&#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1602;&#1575;&#1569; ,&#1571;&#1605;&#1575; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1576;&#1610;&#1606;&#1607;&#1605;&#1575; &#1601;&#1607;&#1608; &#1601;&#1610; &#1571;&#1605;&#1608;&#1585; &#1605;&#1606; &#1575;&#1604;&#1605;&#1605;&#1603;&#1606; &#1575;&#1604;&#1578;&#1602;&#1585;&#1610;&#1576; &#1601;&#1610;&#1607;&#1575; &#1576;&#1610;&#1606;&#1607;&#1605;&#1575;</blockquote>      </blockquote>  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>Al-Banna's Endeavour In Seriously Working For Nearness Between the Madhaahib and At the Head of them, the Raafidah</b>    <P>
And in his latest book, "<i>Dhikriyyaat, Laa Mudhakkaraat</i>" (1st print, Dar al-I'tisaam, 1985), the Ustaadh, Umar at-Tilmisaanee says (pp. 249-250):    <P>
And in the forties from what I recall, Sayyid al-Qummee - and he is Shi'ite in his madhhab - came as a guest of the Ikhwaan at the main headquarters, and at this time, the Imaam, Shaheed (i.e. al-Banna) was [undertaking] serious action in bringing proximity between the madhaahib, so that the enemies of Islaam do not take the splitting between the madhaahib as a means through which they can work to tear apart the Islamic unity. We asked him one day about the extent of the difference between Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a>, but he prohibited us from entering into the likes of these thorny issues which are not befitting for the Muslims to become occupied with, with the Muslims already upon what we see of separation, the enemies of Islaam work to kindle its fire, so we said to his eminence: We do not ask this due to partisanship or to widen the difference between the Muslims, but we ask due to knowledge because what is between the Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> (of difference) is mentioned in the authored books that are innumerable, and we do not have the time that will allow us to investigate all those sources. So he, may Allaah be pleased with him, said:    <P>
<blockquote>Know that Ahl us-Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are Muslims, the kalima "There is none worthy of worship except Allaah and Muhammad is the Messenger of Allaah" unites them. And this is the foundation of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>. And the Sunnah and the <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a> are the same (regarding that), and (they) are upon purity. As for the difference between them both, then it is in matters in which it is possible to bring them together.</blockquote></blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/zdsnn-aaid-al-qarnee--remove-the-fuse-ofthe-fitnah-between-the-sunnah-and-the-shiah.html">Aa'id al-Qarnee:  Remove the Fuse of The Fitnah Between the Sunnah and the Shiah</a><BR>
//www.themadkhalis.com/md/?zdsnn<BR>

<li><a href="articles/oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a><BR>
//www.themadkhalis.com/md/?oyama<BR>

<li><a href="articles/cxjxj-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-3---ayatollah-kaashaani-of-the-rafidi-state-of-iran.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 3 - Ayatollah Kaashaani of the Rafidi State of Iran</a><BR>
//www.themadkhalis.com/md/?cxjxj<BR>

<li><a href="articles/ztutj-hasan-al-banna-and-the-raafidah-shiah-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 2 - Striving for Unification With The Rafidah</a><BR>
//www.themadkhalis.com/md/?ztutj<BR>

<li><a href="articles/mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a><BR>
//www.themadkhalis.com/md/?mgrwe<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/oeinz-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</a><BR>
//www.themadkhalis.com/md/?oeinz<BR>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/gbmok-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-4.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 4 - Calling For Unity Between the Rafidah and the Sunnah</a><BR>
//www.themadkhalis.com/md/?gbmok<BR>

<li><a href="articles/lcwli-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-3.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 3 - Witnessing Grave Worship and Travelling Twenty Kilometres to the Tombs of ad-Dusuqi and Sinjar</a><BR>
//www.themadkhalis.com/md/?lcwli<BR>

<li><a href="articles/vdcip-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwid-hasan-al-banna---part-1.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?vdcip<BR>

<li><a href="articles/ocbde-shaykh-muhammad-aamaan-al-jaamee-on-the-dawah-of-hassan-al-bannaa.html">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</a><BR>
//www.themadkhalis.com/md/?ocbde<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oeinz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:10 GMT -->
</html>


