




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?epluy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</span><BR>
Monday, January 11 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>There occurs in the three cassette series (<span class='arb'>&#1603;&#1588;&#1601; &#1575;&#1604;&#1604;&#1579;&#1575;&#1605; &#1593;&#1606; &#1605;&#1582;&#1575;&#1604;&#1601;&#1575;&#1578; &#1571;&#1581;&#1605;&#1583; &#1587;&#1604;&#1575;&#1605;</span>), a compilation of the refutations of the Major Scholars against the false principles of Ahmad Sallaam, compiled and distributed in July 2000CE, the statement of <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> (rahimahullaah) below. Before we come to it should be pointed out that the Shaykh made this statement shortly after his checking and commendation of the book "<i>Baraa'ah Ulamaa il-Ummah</i>", authored by Isaam bin Abdullaah as-Sinaanee, a compilation of the refutations of the Scholars of Ahl  us-Sunnah against the deviations and methodologies of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>.     <P>
You can learn more about that in these related articles:    <P>
<ul><li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b> (in 1421H): The Tafsirs of Ibn Kathir, Ibn as-Sa'dee, al-Qurtubi Do Away With the Commentary of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> By A Thousand Times, and The Issue of <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a> - (<a href=index2156.html?jufol>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b> Distinguished Between The <a href='tags/salafi-manhaj.html' class='tagLink'><font class='tagLink'>Salafi Manhaj</font></a> and The <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> and Wholeheartedly Reccommended Warning From the <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> After Detailed Study and Consideration - (<a href=index49f2.html?xwcmm>see here</a>)  <li> <b>Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> and Shaykh al-Fawzaan</b>: Between the <a href='tags/salafi-manhaj.html' class='tagLink'><font class='tagLink'>Salafi Manhaj</font></a> and the Qutubi Manhaj - (<a href=index0ec1.html?blaok>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b>: <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a> As a Fourth Category Is the Saying of an Ignorant Strayer - (<a href=index5fb6.html?pmcwq>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b>: <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a> As a Fourth Category Comes from an Ignorant Mubtadi' - (<a href=index6f86.html?prtli>see here</a>)  </ul>    <P>
<font class='titleHeadline'>Shaykh <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a> Explains Why <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> Is Attacked</font>    <P>
The questioner asks:    <P>
<div class='arabic' align='right'>&#1605;&#1575; &#1607;&#1610; &#1606;&#1589;&#1610;&#1581;&#1578;&#1603;&#1605; &#1604;&#1605;&#1606; &#1610;&#1605;&#1606;&#1593; &#1571;&#1588;&#1585;&#1591;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1576;&#1583;&#1593;&#1608;&#1609; &#1571;&#1606;&#1607;&#1575; &#1578;&#1579;&#1610;&#1585; &#1575;&#1604;&#1601;&#1578;&#1606;&#1577; &#1608;&#1601;&#1610;&#1607;&#1575; &#1605;&#1583;&#1581; &#1604;&#1608;&#1604;&#1575;&#1577; &#1575;&#1604;&#1571;&#1605;&#1585; &#1601;&#1610; &#1575;&#1604;&#1605;&#1605;&#1604;&#1603;&#1577; &#1548; &#1608;&#1571;&#1606; &#1605;&#1583;&#1581; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1604;&#1604;&#1581;&#1603;&#1575;&#1605; &#1606;&#1601;&#1575;&#1602; &#1567; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>What is your advice concerning the one who forbids the cassettes of Shaikh Rabee' bin Haadee [from being distributed] with the claim that they cause fitnah and that they contain praise of the Wullaat ul-Umoor of the Kingdom, and that his praise of them emanates from nifaaq (hypocrisy)?</blockquote>    <P>
To which the Shaykh responds:    <P>
<div class='arabic' align='right'>&#1585;&#1571;&#1610;&#1606;&#1575; &#1607;&#1584;&#1575; &#1594;&#1604;&#1591; &#1608;&#1582;&#1591;&#1571; &#1593;&#1592;&#1610;&#1605; &#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1587;&#1606;&#1617;&#1614;&#1577; &#1608;&#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1582;&#1610;&#1585; &#1608;&#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1587;&#1604;&#1610;&#1605;&#1577; &#1608;&#1605;&#1606;&#1607;&#1580;&#1607; &#1602;&#1608;&#1610;&#1605; &#1548; &#1604;&#1603;&#1606; &#1604;&#1605;&#1575; &#1603;&#1575;&#1606; &#1610;&#1578;&#1603;&#1604;&#1605; &#1593;&#1604;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1585;&#1605;&#1608;&#1586; &#1593;&#1606;&#1583; &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1605;&#1578;&#1571;&#1582;&#1585;&#1610;&#1606; &#1608;&#1589;&#1605;&#1608;&#1607; &#1576;&#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1610;&#1608;&#1576; &#1548; &#1571;&#1593;&#1585;&#1601;&#1578; &#1567;</div> .    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>We consider this to be a great error and mistake. Shaikh Rabee' is from the Ulamaa of the Sunnah, and from the people of goodness. His <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> is sound and his manhaj is strong and sound. However, when he began to speak about some of the symbolic figureheads of some of the people, from amongst the latecomers  they began to tarnish him with these faults. Do you know [this] now?</blockquote>    <P>
Those whom <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> criticized were <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> and <a href='tags/mawdudi.html' class='tagLink'><font class='tagLink'>Mawdudi</font></a> all of whom brought foreign, secular methodologies into the Islamic da'wah - all in the name of Islam! So when the Shaykh refuted these people and was supported, commended and vindicated in all of that by the likes of <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> (<a href=index01b7.html?ebhen>see here</a>) and <a href='tags/shaykh-al-albani.html' class='tagLink'><font class='tagLink'>Shaykh al-<a href="tags/albani.html" class="tagLink"><font class="tagLink">Albani</font></a></font></a> (<a href=indexa0fc.html?iosjk>see here</a>) and Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> (<a href=index2099.html?pidmx>see here</a>) - these people became determined to tarnish <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>. It is for this reason you see them today with a fake sense of piety and concern, using gutter press methods to try and tarnish the Shaykhs reputation, so we see their headlines:    <P>
<ul><li> "The Mufti warns from the Madkhalis"  <li> "Rabi says Bin Baz stabbed Salafiyyah in the back"  <li> "Rabi makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Sayyid Qutb"  <li> "The Mufti recommends reading Qutb's commentary"  </ul>    <P>
And the likes. These people are clinging on to shubuhaat for the purpose of creating "controversy" whilst fleeing from <u>the actual knowledge-based issues</u> for which their <b><a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a></b> figureheads were criticized, such as:    <P>
<ul><li>Mockery of the Prophets  <li>Reviling of Uthmaan (radiallaahu anhu)  <li>Reviling of Mu'aawiyah and his parents (radiallaahu anhum)  <li>Takfir of Bani Umayyah  <li>The presence of the innovations of the <u><a href='tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a></u>, <u>Mu'tazilah</u>, <u><a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a></u>, <u>Jabariyyah</u>, <u>Hulooliyyah</u>, <u>Ittihaadiyyah</u>, <u><a href='tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a></u> in their books  <li> Statements of kufr (<a href=indexc811.html?bguiq>see here</a>) and (<a href=index2099.html?pidmx>see here</a>)  <li>Takfir of all societies, without exception and calling for Leninist type revolutions (see   <a href=http://www.takfiris.com/takfir/?lyhev>here</a>, <a href=http://www.takfiris.com/takfir/?xbnsa>here</a>, <a href=http://www.takfiris.com/takfir/?pmjvl>here</a>, <a href=http://www.takfiris.com/takfir/?hulwt>here</a>, <a href=http://www.takfiris.com/takfir/?vdeiu>here</a>, <a href=http://www.takfiris.com/takfir/?ezjol>here</a> and <a href=http://www.takfiris.com/takfir/?wmagi>here</a>)  <li>Calling for unity between Ahl us-Sunnah and the <a href='tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a> <a href='tags/shiah.html' class='tagLink'><font class='tagLink'>Shiah</font></a>, claiming they are all upon the truth and upon purity (<a href=index0950.html?oeinz>see here</a>)  <li>Praising the callers to <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a>, travelling tens of kilometres to the graves and observing the major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> taking place with approval  </ul>    <P>
...and much more. And so these people run around trying to vilify the Shaykh and trying to make others flee from him whilst claiming they are making "jihad" against the people of innovation.    <P>
<font class='titleHeadline'>Shaykh Ibn Uthaymin: <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is Upon Salafiyyah, in His Manhaj and in The Actualizing of the Call to Tawheed</font>    <P>
This statement here is <u>a destruction</u> of the entire da'wah of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> and Ikhwaaniyyah, a corroboration of the correctness of Shaykh Rabee's book "<i>Manhaj al-Anbiyaa Fi ad-Da'wah Ilallaah</i>" (Methodology of the Prophets in Calling to Allaah), and a corroboration that when <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> speaks about <u>Salafiyyah not being a hizb</u>, he is not speaking about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, <b>but those besides Shaykh Rabee'</b> who are upon other than what <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is upon.     <P>
Here is the audio:    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/rabee-bin-uthaymin-praise-a.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<div class='arabic' align='right'>&#1573;&#1606;&#1606;&#1575; &#1606;&#1581;&#1605;&#1583; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1571;&#1606; &#1610;&#1587;&#1585; &#1604;&#1571;&#1582;&#1610;&#1606;&#1575; &#1575;&#1604;&#1583;&#1603;&#1578;&#1608;&#1585; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1571;&#1606; &#1610;&#1586;&#1608;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1591;&#1602;&#1577; &#1581;&#1578;&#1609; &#1610;&#1593;&#1604;&#1605; &#1605;&#1606; &#1610;&#1582;&#1601;&#1609; &#1593;&#1604;&#1610;&#1607; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1571;&#1606; &#1571;&#1582;&#1575;&#1606;&#1575; - &#1608;&#1601;&#1602;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1573;&#1610;&#1575;&#1607; - &#1593;&#1604;&#1609; &#1580;&#1575;&#1606;&#1576; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1587;&#1604;&#1601; &#1548; &#1608;&#1604;&#1587;&#1578; &#1571;&#1593;&#1606;&#1610; &#1576;&#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1571;&#1606;&#1607;&#1575; &#1581;&#1586;&#1576; &#1602;&#1575;&#1574;&#1605; &#1605;&#1590;&#1575;&#1583; &#1604;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1548; &#1604;&#1603;&#1606;&#1610; &#1571;&#1585;&#1610;&#1583; &#1576;&#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1571;&#1606;&#1607; &#1593;&#1604;&#1609; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1587;&#1604;&#1601; &#1601;&#1610; &#1605;&#1606;&#1607;&#1580;&#1607; &#1608;&#1604;&#1575; &#1587;&#1610;&#1605;&#1575; &#1578;&#1581;&#1602;&#1610;&#1602; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1608;&#1605;&#1606;&#1575;&#1576;&#1584;&#1577; &#1605;&#1606; &#1610;&#1590;&#1575;&#1583;&#1607; &#1548; &#1608;&#1606;&#1581;&#1606; &#1606;&#1593;&#1604;&#1605; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1571;&#1606; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1607;&#1608; &#1571;&#1589;&#1604; &#1575;&#1604;&#1576;&#1593;&#1579;&#1577; &#1575;&#1604;&#1578;&#1610; &#1576;&#1593;&#1579; &#1575;&#1604;&#1604;&#1607; &#1576;&#1607;&#1575; &#1585;&#1587;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1548;&#1548;&#1548; &#1586;&#1610;&#1575;&#1585;&#1577; &#1571;&#1582;&#1610;&#1606;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1573;&#1604;&#1609; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1591;&#1602;&#1577; &#1608;&#1576;&#1575;&#1604;&#1571;&#1582;&#1589; &#1573;&#1604;&#1609; &#1576;&#1604;&#1583;&#1606;&#1575; &#1593;&#1606;&#1610;&#1586;&#1577; &#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1587;&#1610;&#1603;&#1608;&#1606; &#1604;&#1607;  &#1571;&#1579;&#1585; &#1548; &#1608;&#1610;&#1578;&#1576;&#1610;&#1606; &#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1575; &#1603;&#1575;&#1606; &#1582;&#1575;&#1601;&#1610;&#1575;&#1611; &#1576;&#1608;&#1575;&#1587;&#1591;&#1577; &#1575;&#1604;&#1578;&#1607;&#1608;&#1610;&#1604; &#1608;&#1575;&#1604;&#1578;&#1585;&#1608;&#1610;&#1580; &#1608;&#1573;&#1591;&#1604;&#1575;&#1602; &#1575;&#1604;&#1593;&#1606;&#1575;&#1606; &#1604;&#1604;&#1587;&#1575;&#1606; .  &#1608;&#1605;&#1575; &#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1606;&#1583;&#1605;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1575; &#1602;&#1575;&#1604;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1573;&#1584;&#1575; &#1578;&#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1571;&#1606;&#1607;&#1605; &#1593;&#1604;&#1609; &#1589;&#1608;&#1575;&#1576; ."</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed we praise Allaah, Free is He from all imperfections, the Most High, that He makes it easy for our brother, the Doctor, Rabee' bin Haadee al-Madkhalee to visit this region. <b>[So that] the one to whom certain matters are not apparent may come to know that our brother, may Allaah grant us and him success, is upon Salafiyyah, the way of the Salaf</b>. </blockquote>    <P>
So this is a corroboration that <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is actually upon the way of the Salaf and not upon other than it, and the Shaykh is praising Allaah for facilitating the visit of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and so the one to whom certain affairs were hidden will become clear to him. Now what were those affairs? Well, affairs of manhaj and the true nature of the call to Allah, the way of the Prophets in actualizing Tawheed - the very same affairs on account of which the Heretical Innovators had spent the previous decade in attacking the Shaykh.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And I do not mean here that Salafiyyah is a hizb (party) which is set up to oppose the Muslims outside of it, <b>but I mean by Salafiyyah, that he (i.e. Shaikh Rabee') is upon the path of the Salaf in his Manhaj. Especially in the field of actualising Tawheed and throwing aside what opposes this [manhaj]</b>. And all of us know tht Tawheed is the basis for which Allaah sent the Messengers upon them be peace and prayers... </blockquote>    <P>
There you go. That pretty much annihilates <u>the misapplication</u> of all those other statements of <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> that were being thrown around in which the Shaykh said that Salafiyyah is not a hizb, <u>rather it is manhaj and a way that is followed and traversed and in shunning and throwing aside whatever oppposes it</u>. One that <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> himself was upon when he warned against the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, the <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> and its doctrines and its figurehead and his works (see   <a href=index0ec1.html?blaok>here</a>, <a href=index5fb6.html?pmcwq>here</a>, <a href=index6f86.html?prtli>here</a>, <a href=index2156.html?jufol>here</a>, <a href=index33d0.html?tjmrl>here</a> and <a href=index49f2.html?xwcmm>here</a>). As for when you claim Salafiyyah and you follow other than it, and you set yourself up with doctrines and methodologies to oppose Salafiyyah and to oppose the Muslims, to split their ranks and their hearts (through what is other than Salafiyyah), then that is the hizb that the Shaykh was warning against.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The visit of our brother, Shaikh Rabee bin Haadee to this region, our city, Unaizah, no doubt will have a good effect and it will also become clear to many of the people what used to be hidden from them <b>due to the scare-mongering and rumour-mongering and also letting loose the tongue [of discord]</b>.</blockquote>     <P>
Just what were these rumours. Who are and where where they coming from? And who are these people, still to this day, trying the same worn out:    <P>
<blockquote><i>Hey Shaykh, there are some real nasty people out there, they are attacking the du'at and the scholars and saying they are misguided, Shaykh, can you give them some advice ... and O by the way, can I just slip in there very quickly as you start your advice, that they are the followers and students of Shaykh Rabee'</i>. </blockquote>    <P>
Don't they know that this is the same type of deception played out by the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> in 1991-1992CE (1412H) with Shaykh Bin Baz, before he blackened their faces and rendered them <u>liars</u> and <u>callers to falsehood</u> who <u>stir in the murky waters</u>, when they claimed that a general piece of advice given by the Shaykh to everyone, was directed against the Shaykhs of Madinah in particular (i.e. Shaykh Rabee') - that fadeehah will be documented shortly! <!---<a href=http://www.themadkhalis.com/md/?qvrrm>see all of that in great detail right here</a>.--->    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And how numerous are those who are remorseful about what they said concerning the Ulamaa, when it becomes clear to them that they (the Ulamaa) are upon the truth. </blockquote>    <P>
We pray that Allaah grants the same success to these people still clinging onto the flotsam in the ocean.    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/rabee-bin-uthaymin-praise-b.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
Then one of those present at the gathering said:    <P>
<div class='arabic' align='right'>&#1579;&#1605; &#1602;&#1575;&#1604; &#1571;&#1581;&#1583; &#1575;&#1604;&#1581;&#1575;&#1590;&#1585;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1610;&#1591; &#1606;&#1601;&#1587;&#1607; : &#1607;&#1575;&#1607;&#1606;&#1575; &#1587;&#1572;&#1575;&#1604; &#1581;&#1608;&#1604; &#1603;&#1578;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There is a question concerning the books of Shaikh Rabee'?</blockquote>    <P>
<div class='arabic' align='right'>&#1601;&#1571;&#1580;&#1575;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1593;&#1579;&#1610;&#1605;&#1610;&#1606; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1602;&#1575;&#1574;&#1604;&#1575;&#1611; : "&#1575;&#1604;&#1592;&#1575;&#1607;&#1585; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1604;&#1575; &#1610;&#1581;&#1578;&#1575;&#1580; &#1604;&#1602;&#1608;&#1604;&#1610; .  &#1608;&#1603;&#1605;&#1575; &#1587;&#1574;&#1604; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; &#1593;&#1606; &#1573;&#1587;&#1581;&#1575;&#1602; &#1576;&#1606; &#1585;&#1575;&#1607;&#1608;&#1610;&#1577; &#1585;&#1581;&#1605;&#1607;&#1605; &#1575;&#1604;&#1604;&#1607; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1601;&#1602;&#1575;&#1604; : &#1605;&#1579;&#1604;&#1610; &#1610;&#1587;&#1571;&#1604; &#1593;&#1606;  &#1573;&#1587;&#1581;&#1575;&#1602; &#1567;! &#1576;&#1604; &#1573;&#1587;&#1581;&#1575;&#1602; &#1610;&#1587;&#1571;&#1604; &#1593;&#1606;&#1610; .  &#1608;&#1571;&#1606;&#1575; &#1578;&#1603;&#1604;&#1605;&#1578; &#1601;&#1610; &#1571;&#1608;&#1604; &#1603;&#1604;&#1575;&#1605;&#1610; &#1593;&#1606; &#1575;&#1604;&#1584;&#1610; &#1571;&#1593;&#1604;&#1605;&#1607; &#1593;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1608;&#1601;&#1602;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1575; &#1586;&#1575;&#1604; &#1605;&#1575; &#1584;&#1603;&#1585;&#1578;&#1607; &#1601;&#1610; &#1606;&#1601;&#1587;&#1610; &#1581;&#1578;&#1609; &#1575;&#1604;&#1570;&#1606; &#1548; &#1608;&#1605;&#1580;&#1610;&#1574;&#1607; &#1573;&#1604;&#1609; &#1607;&#1606;&#1575; &#1608;&#1603;&#1604;&#1605;&#1578;&#1607; &#1575;&#1604;&#1578;&#1610; &#1576;&#1604;&#1594;&#1606;&#1610; &#1593;&#1606;&#1607; &#1605;&#1575; &#1576;&#1604;&#1594;&#1606;&#1610; &#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1605;&#1605;&#1575; &#1610;&#1586;&#1610;&#1583; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1605;&#1581;&#1576;&#1577; &#1604;&#1607; &#1608;&#1583;&#1593;&#1575;&#1569; &#1604;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is apparently clear that this question is not in need of my answer. And just as Imaam Ahmad was asked about Ishaaq bin Raahawaih - rahimahumullaah - and he replied, "<i>Someone like me is asked about Ishaaq! Rather, Ishaaq is to be asked about me</i>." <b>And I spoke at the beginning of my speech about that which I know about Shaikh Rabee', may Allaah grant him success, and what I mentioned has never ceased to be what I hold about him in my soul, up until this time</b>. And his arrival here and his words that have reached me, then no doubt, <b>they are such that they will increase a person in his love for him and in his supplication for him</b>. </blockquote>    <P>
Alhamdulillaah! This is a great praise, if you reflect upon. And it is precisely this (along with Shaykh Ibn Uthaymin's warnings from the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, their cassettes, doctrines and figurheads) that incensed the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> to try and attack <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> through other Scholars by taking the same "rumour-mongering" and "scare-mongering" to them. That's what they have been trying to achieve <u>after the Major Scholars passed away</u>, Imaam al-Albani, Imaam <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a>, Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a>, all these Scholars knew the truth and clarified the truth and were 100% behind <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>. After they passed away, the Hizbiyyeen have not ceased to try and get the other Shaykhs to speak about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, in continuation of their war against the Sunnah and its people, and in defence and support of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>. So beware of their deception!    <P>
<font class='titleHeadline'>Update: Fake Sense of Piety and Concern</font>    <P>
We stated previously in this article:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is for this reason you see them today with a fake sense of piety and concern, using gutter press methods to try and tarnish the Shaykhs reputation</blockquote>    <P>
Everyone who rushed to defend <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, despite his <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Bani Umayyah, and despite his <a href='tags/mockery.html' class='tagLink'><font class='tagLink'>Mockery</font></a> of <a href='tags/moses.html' class='tagLink'><font class='tagLink'>Moses</font></a> and despite his revilement of Uthmaan, Mu'aawiyyah and others (radiallaahu anhum) and who assaulted and attacked <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> because he criticised <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> for this - and thereafter sought to condemn <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> for the types of things that we have listed above is in fact displaying a fake sense of piety and concern, because:    <P>
<blockquote>If it angers you that <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> pointed out and refuted these matters, as had <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> before him - <a href=index2199.html?mslqe>see here</a> -  <b>more than it angers you</b> that <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> <u>actually said these things, had the hujjah established upon him</u>, and then <b>persisted upon this</b>, continuing to have these books published up until his death, without remorse or recantation - then your clamor shown against Rabee' is all a fake sense of piety and concern - and it is exactly as <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> said, this activity (in attacking Shaykh Rabee') is merely because <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> refuted <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>.</blockquote>    <P>
And this is the truth because if they had a genuine concern about the Salafi <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>, then they would have taken a correct, Sunni, Shar'iyy stance towards the books of the Innovators which contain the greatest of innovations and which have led to the destructive movements of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, and they have clear statements from the Scholars besides <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> warning from his books and his deviations. So if they were genuine, we would have seen a correct Shar'iyy stance from them, following the evidences. However, you see them clinging to the shubuhaat, "The Muftee said benefit from Qutb's commentary", "Shaykh al-Albani praised <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> or praise Bannaa" and other such similar things. Why all this fervour and zeal for Soofees, <a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a> ignoramuses, who were mufakkireen and not Scholars?    <P>
So these outward actions allow us to judge that this is all a fake sense of piety and concern.    <P>
And <u>the greatest proof of this</u> is demonstrated by their own actions. What these people began doing is systematically going through Shaykh Rabee's tapes hoping to find something where he speaks ill of one of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>, and so they found some remarks which they used. Now <u>the very fact</u> that these people are spreading this and using it to criticize and revile the Shaykh, <b>is 100% proof</b> that this is <b>a fake sense of piety and concern</b>, because if you were attacking <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> for no other reason except that he authored books like "<i>Mataa'in <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> fis-Sahaabah</i>" (Revilements of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> against the Sahabah),  and then after years and years of scorning and abusing the Shaykh, when you find something from <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and started saying, "<i>Hey look Rabee' is reviling a companion</i>", and then write articles on it and distribute it and use it to show how "concerned" you are about the <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a>, and show how disturbed and alarmed you are, then certainly <u>you are a fake and a fraud</u> and <u>your actions prove it</u>, because previously it angered you more that <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> refuted <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> for his revilement upon the <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> than it angered you that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> actually said what he said, and persisted upon those things until his death (even after being refuted by Shaykh Mahmood Shakir).     <P>
Shaykh <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a> was <b>100% on the mark</b>, when he said (as quoted above):    <P>
  <div class='arabic' align='right'>&#1585;&#1571;&#1610;&#1606;&#1575; &#1607;&#1584;&#1575; &#1594;&#1604;&#1591; &#1608;&#1582;&#1591;&#1571; &#1593;&#1592;&#1610;&#1605; &#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1587;&#1606;&#1617;&#1614;&#1577; &#1608;&#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1582;&#1610;&#1585; &#1608;&#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1587;&#1604;&#1610;&#1605;&#1577; &#1608;&#1605;&#1606;&#1607;&#1580;&#1607; &#1602;&#1608;&#1610;&#1605; &#1548; &#1604;&#1603;&#1606; &#1604;&#1605;&#1575; &#1603;&#1575;&#1606; &#1610;&#1578;&#1603;&#1604;&#1605; &#1593;&#1604;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1585;&#1605;&#1608;&#1586; &#1593;&#1606;&#1583; &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1605;&#1578;&#1571;&#1582;&#1585;&#1610;&#1606; &#1608;&#1589;&#1605;&#1608;&#1607; &#1576;&#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1610;&#1608;&#1576; &#1548; &#1571;&#1593;&#1585;&#1601;&#1578; &#1567;</div> .    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>We consider this to be a great error and mistake. Shaikh Rabee' is from the Ulamaa of the Sunnah, and from the people of goodness. His <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> is sound and his manhaj is strong and sound. However, when he began to speak about some of the symbolic figureheads of some of the people, from amongst the latecomers,  they began to tarnish him with these faults.</blockquote>    <P>
And that really sums up the entire situation. So all this activity we see from these people indicates resentment and spite and the taking of revenge, for if they were sincere, then just one issue would have been enough to disgust them and make them abandon the books of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, if they were truly sincere, which is Qutb's revilements upon the Sahabah and <u>his persistence</u> upon that until his death. If they truly honoured the <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> that's what they would have done.     <P>
So for sure, <b>its all a fake sense of piety</b>, it's not genuine at all, and this is not the eemaan of the Murij'ah where the actions of the heart are expelled from eemaan, where you can have the greatest of hatred and enmity to a man because he refuted your figureheads (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) for cursing and reviling the <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> and making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Bani Umayyah, so you cared more for your <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and the preservation of his ideology (his works) than the honours of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>, and then you come out claiming "<i>We care for <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>, we love Mu'awiyah</i>...".     <P>
So this issue is one eemaan and <a href='tags/irjaa.html' class='tagLink'><font class='tagLink'>Irjaa'</font></a> and the talaazum between the inside and the outside. And just like one who claims he loves Allaah and His Messenger (alayhis salaam) yet he does not pray, and does not fast, rather he shows enmity to the believers is a  liar, then similarly, one who claims to love Mu'aawiyah and defend him, yet at the same time he expends the greatest of efforts to defend a man who cursed Mu'aawiyah, accusing him of ghish, khadeea'ah, nifaaq and the likes (and made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of others) and also reviled Uthmaan (radiallaahu anhu) <b>and persisted in that</b> up until his death <b>after the hujjah was established upon him</b>, and you expend the greatest of efforts to vilify, attack, abuse, revile, and curse the man who defended the honour of <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> and other companions by writing a refutation and because these works containing the poison of the <a href='tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a> continue to be in print and distributed, then it shows you are a liar in your claim - and this is known because of the talaazum between what is in the heart and what shows in outward behaviour. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/pfwuf-muftee-abdul-azeez-aal-al-shaykh-on-the-saying-of-sayyid-qutb-about-muawiyyah-and-amr-bin-al-aas.html">Muftee Abdul-Azeez Aal al-Shaykh on the Saying of Sayyid Qutb About Mu'awiyyah and Amr bin al-Aas: It is the Saying of a Baatinee Khabeeth or a Yahoodee La'een and is the Epitomy of Nifaaq</a><BR>
//www.themadkhalis.com/md/?pfwuf<BR>

<li><a href="articles/udyrx-audio-of-mahmood-shakir-from-march-1976-in-defence-of-the-companions.html">Audio of Shaykh Mahmood Shakir from March 1976 In Defence of the Companions of the Messenger</a><BR>
//www.themadkhalis.com/md/?udyrx<BR>

<li><a href="articles/qpqvs-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-7.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 7 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Seventh Installment</a><BR>
//www.themadkhalis.com/md/?qpqvs<BR>

<li><a href="articles/wumtj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-6.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 6 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Sixth Installment - Attacks upon Mu'awiyah, Hind and Bani Umayyah</a><BR>
//www.themadkhalis.com/md/?wumtj<BR>

<li><a href="articles/sqrfw-sayyid-qutb-and-the-french-connection-the-french-catholic-social-darwinist-doctor-that-influenced-qutbs-jaahiliyyah.html">Sayyid Qutb And The French Connection: The French Catholic, Social Darwinist Doctor That Influenced Qutb's 'Jaahiliyyah'</a><BR>
//www.themadkhalis.com/md/?sqrfw<BR>

<li><a href="articles/iczdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-13.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 13 - Ta'weel of the Arsh, Negation of al-Uluww and Negation of 'Hawaadith' Upon the Way of the Jahmiyyah</a><BR>
//www.themadkhalis.com/md/?iczdi<BR>

<li><a href="articles/dsppw-readings-in-elementary-communism-the-manifesto-of-karl-marx-and-frederick-engels-and-sayyid-qutb.html">Readings in Elementary Communism: Karl Marx, Freidrich Engels, Sayyid Qutb, Capitalism, the State, Social Justice, Revolution and the Communist Manifesto</a><BR>
//www.themadkhalis.com/md/?dsppw<BR>

<li><a href="articles/oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a><BR>
//www.themadkhalis.com/md/?oyama<BR>

<li><a href="articles/cxjxj-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-3---ayatollah-kaashaani-of-the-rafidi-state-of-iran.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 3 - Ayatollah Kaashaani of the Rafidi State of Iran</a><BR>
//www.themadkhalis.com/md/?cxjxj<BR>

<li><a href="articles/ztutj-hasan-al-banna-and-the-raafidah-shiah-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 2 - Striving for Unification With The Rafidah</a><BR>
//www.themadkhalis.com/md/?ztutj<BR>

<li><a href="articles/vckiw-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 2/2</a><BR>
//www.themadkhalis.com/md/?vckiw<BR>

<li><a href="articles/shufz-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 1/2</a><BR>
//www.themadkhalis.com/md/?shufz<BR>

<li><a href="articles/ngbjl-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-5.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 5 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fifth Installment - The Most Distasteful Type of Revilement Against Mu'awiyah, Amr bin al-Aas, Abu Sufyaan and Hind</a><BR>
//www.themadkhalis.com/md/?ngbjl<BR>

<li><a href="articles/krmbd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-12.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 12 - Between al-Ghazali, ar-Razi and Sayyid Qutb - The Texts of the Attributes Are Imaginary Depictions With No Reality Behind Them</a><BR>
//www.themadkhalis.com/md/?krmbd<BR>

<li><a href="articles/lhrbj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-4.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 4 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fourth Installment - Takfir of Abu Sufyan</a><BR>
//www.themadkhalis.com/md/?lhrbj<BR>

<li><a href="articles/exkgz-qutbi-competition-corner-1st-quiz---test-your-knowledge-of-wahdatul-wujood.html">Qutbi Competition Corner: 1st Quiz - Test Your Knowledge of Wahdat ul-Wujood And The Positions of the Scholars Towards Those Who Express It</a><BR>
//www.themadkhalis.com/md/?exkgz<BR>

<li><a href="articles/veuwi-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-3.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 3 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Third Installment - Takfir of Bani Umayyah</a><BR>
//www.themadkhalis.com/md/?veuwi<BR>

<li><a href="articles/dsopw-imaam-muqbil-bin-haadee-al-waadiee-qutb-jamaaat-ut-takfir-zilal-milestones.html">Imaam Muqbil bin Haadee al-Waadi'ee: A Beginner Who Reads the Books of Qutb Will Not Perceive After Only a Few Days that He Has Become Amongst the Jamaa'at ut-Takfir</a><BR>
//www.themadkhalis.com/md/?dsopw<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

<li><a href="articles/qodiy-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-2---mahmood-shakirs-defence-of-the-companions.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 2 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Second Installment - Malices and Resentments of the Idolatrous Western Civilization</a><BR>
//www.themadkhalis.com/md/?qodiy<BR>

<li><a href="articles/mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a><BR>
//www.themadkhalis.com/md/?mgrwe<BR>

<li><a href="articles/umiea-shaykh-saalih-aal-ash-shaykh-the-fikr-of-sayyid-qutb.html">Shaykh Saalih Aal ash-Shaykh: The Role of the  'Fikr' (Ideology) of Sayyid Qutb in Splitting, Disunity and The Emergence of the Jama'aat and the Freedom and Innocence of True Islamic Knowledge (Ilm) From All Of That</a><BR>
//www.themadkhalis.com/md/?umiea<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/oeinz-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</a><BR>
//www.themadkhalis.com/md/?oeinz<BR>

<li><a href="articles/iosjk-imaam-al-albani-to-shaykh-rabee-everything-with-which-you-refuted-qutb-for-is-correct-and-true.html">Imaam al-Albani to Shaykh Rabee: Everything With Which You Refuted Qutb For Is Correct and True and May Allaah Reward You For Fulfilling The Obligation of Exposing His Ignorance and Deviance</a><BR>
//www.themadkhalis.com/md/?iosjk<BR>

<li><a href="articles/hyulz-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-1.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 1 - Introduction and Background</a><BR>
//www.themadkhalis.com/md/?hyulz<BR>

<li><a href="articles/ebhen-shaykh-ibn-uthaymin-on-shaykh-rabi-al-madkhali.html">Shaykh Ibn Uthaymin Defends and Praises Shaykh Rabee' al-Madkhali and Destroys the Doubts of the Qutbiyyah</a><BR>
//www.themadkhalis.com/md/?ebhen<BR>

<li><a href="articles/ezcyb-shaykh-muhammad-bin-jameel-zainoo-i-asked-mohammad-qutb-to-clarify-the-errors-of-his-brother-in-az-zilal.html">Shaykh Muhammad bin Jameel Zainoo: I Asked Mohammad Qutb To Clarify the Errors of His Brother in az-Zilal Regarding Ta'weel and the Doctrine of Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?ezcyb<BR>

<li><a href="articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</a><BR>
//www.themadkhalis.com/md/?mslqe<BR>

<li><a href="articles/waqwg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-11.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 11 - Allaah Speaking to Moses and Allaah's Eternal Kalaam </a><BR>
//www.themadkhalis.com/md/?waqwg<BR>

<li><a href="articles/bguiq-shaykh-ibn-jibreen-making-takfir-upon-the-saying-of-sayyid-qutb-that-islam-is-a-mixture-of-communism-and-christianity.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen Makes Takfir Upon (Declares as Kufr) the Saying of Sayyid Qutb That Islam Is a Mixture of Communism and Christianity</a><BR>
//www.themadkhalis.com/md/?bguiq<BR>

<li><a href="articles/vlffh-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-10---the-quran-is-like-the-rest-of-what-allaah-creates-and-like-the-soul.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 10 - The Qur'an is (Created) Like The Soul and Like The Rest of What Allaah Creates</a><BR>
//www.themadkhalis.com/md/?vlffh<BR>

<li><a href="articles/mslbg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-9.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 9 - Moses and the Speech of Allaah</a><BR>
//www.themadkhalis.com/md/?mslbg<BR>

<li><a href="articles/pgpti-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-8.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 8 - Negating Tahayyuz (Spatial Occupation) From Allaah</a><BR>
//www.themadkhalis.com/md/?pgpti<BR>

<li><a href="articles/taifd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-7----allaah-does-not-have-a-makaan-hayyiz-hadd-jihah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 7 -  Allaah Does Not Have a Makaan, Hayyiz, Hadd, Jihah</a><BR>
//www.themadkhalis.com/md/?taifd<BR>

<li><a href="articles/tkptu-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-5---allaah-does-not-occupy-a-place-makaan.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 5 - Allaah Does Not Occupy a Place (Makaan)</a><BR>
//www.themadkhalis.com/md/?tkptu<BR>

<li><a href="articles/kxsoa-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-4.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 4 - Allaah's Uluww, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?kxsoa<BR>

<li><a href="articles/lalhx-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-3.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 3 - The Use of Aahaad Hadeeth in Aqidah</a><BR>
//www.themadkhalis.com/md/?lalhx<BR>

<li><a href="articles/ebzdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-2.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 2 - Ta'weel of al-Istiwaa and Negation of the Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ebzdi<BR>

<li><a href="articles/ppxmw-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-1---al-uluww-al-istiwaa-and-sifaat-filiyyah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 1 - The Qur'an, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ppxmw<BR>

<li><a href="articles/sxptl-shaykh-saalih-al-fawzaan-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Saalih al-Fawzaan Distinguishes Between The Salafi Manhaj and The Qutbi Manhaj</a><BR>
//www.themadkhalis.com/md/?sxptl<BR>

<li><a href="articles/xwcmm-shaykh-muhammad-bin-saalih-al-uthaymeen-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Muhammad bin Saalih al-Uthaymeen Distinguished Between The Salafi Manhaj and The Qutbi Manhaj and Wholeheartedly Reccommended Warning From the Qutbi Manhaj After Detailed Study and Consideration</a><BR>
//www.themadkhalis.com/md/?xwcmm<BR>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/gbmok-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-4.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 4 - Calling For Unity Between the Rafidah and the Sunnah</a><BR>
//www.themadkhalis.com/md/?gbmok<BR>

<li><a href="articles/pidmx-shaykh-bin-baaz-on-sayyid-qutbs-attacks-upon-muawiyah-and-amr-ibn-al-aas-and-accusing-them-of-hypocrisy-and-treachery.html">Shaykh Bin Baaz on Sayyid Qutb's Attacks Upon Mu'awiyah and Amr Ibn al-Aas and Accusing them of Hypocrisy and Treachery</a><BR>
//www.themadkhalis.com/md/?pidmx<BR>

<li><a href="articles/lcwli-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-3.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 3 - Witnessing Grave Worship and Travelling Twenty Kilometres to the Tombs of ad-Dusuqi and Sinjar</a><BR>
//www.themadkhalis.com/md/?lcwli<BR>

<li><a href="articles/vdcip-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwid-hasan-al-banna---part-1.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?vdcip<BR>

<li><a href="articles/chbqv-shaykh-muhammad-amaan-al-jaamee-there-is-no-doubt-about-sayyid-qutb-being-an-ashari.html">Shaykh Muhammad Amaan al-Jaamee: There Is No Dispute About Sayyid Qutb Being an Ash'ari</a><BR>
//www.themadkhalis.com/md/?chbqv<BR>

<li><a href="articles/rhmeq-sayyid-qutb-establishing-the-haakimiyyah-of-allaah-through-communism-socialism-and-leninism.html">Sayyid Qutb: Establishing the Haakimiyyah of Allaah (By Borrowing The Manifestos of Secular Atheist Jews)</a><BR>
//www.themadkhalis.com/md/?rhmeq<BR>

<li><a href="articles/fiohb-shaykh-salih-al-fawzaan-on-the-tafsir-of-sayyid-qutb-fee-zilaal-il-quran.html">Shaykh Salih al-Fawzaan on the Tafsir of Sayyid Qutb, 'Fee Zilaal il-Quran'</a><BR>
//www.themadkhalis.com/md/?fiohb<BR>

<li><a href="articles/tgdma-imaam-ibn-baaz-on-sayyid-qutbs-mockery-of-the-prophet-moses-and-his-taweel-of-istiwaa-upon-the-way-of-the-jahmiyyah-mutazilah.html">Imaam Ibn Baaz on Sayyid Qutb's Mockery of the Prophet Moses And His Ta'weel of Istiwaa Upon the Way of the Jahmiyyah Mu'tazilah</a><BR>
//www.themadkhalis.com/md/?tgdma<BR>

<li><a href="articles/bhman-shaykh-abdul-muhsin-al-abbaad-on-the-tafseer-of-sayyid-qutb.html">Shaykh Abdul-Muhsin al-Abbaad on the Tafseer of Sayyid Qutb</a><BR>
//www.themadkhalis.com/md/?bhman<BR>

<li><a href="articles/fufhr-shaykh-muhammad-bin-saalih-al-uthaymeen-on-sayyid-qutbs-tafseer.html">Shaykh Muhammad bin Saalih al-Uthaymeen on Sayyid Qutb's Tafseer</a><BR>
//www.themadkhalis.com/md/?fufhr<BR>

<li><a href="articles/ocbde-shaykh-muhammad-aamaan-al-jaamee-on-the-dawah-of-hassan-al-bannaa.html">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</a><BR>
//www.themadkhalis.com/md/?ocbde<BR>

<li><a href="articles/oplui-a-brief-glimpse-into-the-mistakes-innovations-and-calamities-of-sayyid-qutb.html">A Brief Glimpse Into the Mistakes, Innovations and Calamities of Sayyid Qutb</a><BR>
//www.themadkhalis.com/md/?oplui<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?epluy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


