




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?pcihb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 4</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 4</span><BR>
Thursday, February 04 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>More Signs of the Propensity to Defend Baatil at All Costs</font>    <P>
The <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> have brought some quotations from <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> in relation to the issue of his attacks upon <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> and in particular his attacks upon Uthmaan (radiallaahu anhu). The aim behind presenting these quotations is to prove that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> brought a proper Sharee'ah repentance from his attacks upon <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>. In this article we will discuss this latest activity of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>.     <P>
Sayyid <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> wrote in <a href='tags/az-zilal.html' class='tagLink'><font class='tagLink'>az-<a href="tags/zilal.html" class="tagLink"><font class="tagLink">Zilal</font></a></font></a> (6/3414) referring to the verses in Surah an-Najm (53:33-34):    <P>
<div class='arabic' align='right'>&#1608;&#1584;&#1604;&#1603; <<&#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1578;&#1614;&#1608;&#1614;&#1604;&#1617;&#1614;&#1609; &#1548; &#1608;&#1614;&#1571;&#1614;&#1593;&#1618;&#1591;&#1609; &#1602;&#1614;&#1604;&#1616;&#1610;&#1604;&#1611;&#1575; &#1608;&#1614;&#1571;&#1614;&#1603;&#1618;&#1583;&#1609;>> .. &#1575;&#1604;&#1584;&#1610; &#1610;&#1593;&#1580;&#1617;&#1576; &#1575;&#1604;&#1604;&#1617;&#1607; &#1605;&#1606; &#1571;&#1605;&#1585;&#1607; &#1575;&#1604;&#1594;&#1585;&#1610;&#1576; &#1548; &#1578;&#1584;&#1603;&#1585; &#1576;&#1593;&#1590; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1571;&#1606;&#1607; &#1601;&#1585;&#1583; &#1605;&#1593;&#1610;&#1606; &#1605;&#1602;&#1589;&#1608;&#1583; &#1548; &#1571;&#1606;&#1601;&#1602; &#1602;&#1604;&#1610;&#1604;&#1575; &#1601;&#1610; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1604;&#1617;&#1607; &#1548; &#1579;&#1605; &#1575;&#1606;&#1602;&#1591;&#1593; &#1593;&#1606; &#1575;&#1604;&#1576;&#1584;&#1604; &#1582;&#1608;&#1601;&#1575; &#1605;&#1606; &#1575;&#1604;&#1601;&#1602;&#1585;. &#1608;&#1610;&#1581;&#1583;&#1583; &#1575;&#1604;&#1586;&#1605;&#1582;&#1588;&#1585;&#1610; &#1601;&#1610; &#1578;&#1601;&#1587;&#1610;&#1585;&#1607; &#1575;&#1604;&#1603;&#1588;&#1575;&#1601; &#1588;&#1582;&#1589;&#1607; &#1548; &#1571;&#1606;&#1607; &#1593;&#1579;&#1605;&#1575;&#1606; &#1576;&#1606; &#1593;&#1601;&#1575;&#1606; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607; &#1593;&#1606;&#1607; - &#1608;&#1610;&#1584;&#1603;&#1585; &#1601;&#1610; &#1584;&#1604;&#1603; &#1602;&#1589;&#1577; &#1548; &#1604;&#1575; &#1610;&#1587;&#1578;&#1606;&#1583; &#1601;&#1610;&#1607;&#1575; &#1573;&#1604;&#1609; &#1588;&#1610; &#1569; &#1548; &#1608;&#1604;&#1575; &#1610;&#1602;&#1576;&#1604;&#1607;&#1575; &#1605;&#1606; &#1610;&#1593;&#1585;&#1601; &#1593;&#1579;&#1605;&#1575;&#1606; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607; &#1593;&#1606;&#1607; - &#1608;&#1591;&#1576;&#1610;&#1593;&#1578;&#1607; &#1608;&#1576;&#1584;&#1604;&#1607; &#1575;&#1604;&#1603;&#1579;&#1610;&#1585; &#1575;&#1604;&#1591;&#1608;&#1610;&#1604; &#1601;&#1610; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1604;&#1617;&#1607; &#1576;&#1604;&#1575; &#1578;&#1608;&#1602;&#1601; &#1608;&#1576;&#1604;&#1575; &#1581;&#1587;&#1575;&#1576; &#1603;&#1584;&#1604;&#1603; &#1608;&#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1601;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607; &#1608;&#1578;&#1589;&#1608;&#1585;&#1607; &#1604;&#1578;&#1576;&#1593;&#1577; &#1575;&#1604;&#1593;&#1605;&#1604; &#1608;&#1601;&#1585;&#1583;&#1610;&#1578;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And that [is] "...<b>the one who turned away. And gave a little, and then stopped giving</b>", [such is] the one about whose strange affair Allaah is amazed at.    <P>
Some narrations mention that he is a specific individual [that] is intended (in this verse), that he spent a little in the path of Allaah, and then he stopped spending out of fear of poverty. And az-Zamakshari in his tafseer in "al-Kashshaaf" specifies his identity that it is Uthmaan bin Affaan (radiallaahu anhu), and he mentions a story in that regard which has nothing to support it, and the one who knows Uthmaan (radiallaahu anhu) - his character and his abundant and long spending in the path of Allaah without hesitation or counting, and likewise his belief (<a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>) in Allaah, and his conception of the responsibility of action, and his individuality - will not accept it.</blockquote>    <P>
He means here that a person will not accept that Uthmaan (radiallaahu anhu) should all of a sudden stop spending in the path of Allaah after knowing of Uthmaan being very generous and liberal in his spending. Also in <a href='tags/az-zilal.html' class='tagLink'><font class='tagLink'>az-<a href="tags/zilal.html" class="tagLink"><font class="tagLink">Zilal</font></a></font></a> (3/1628) in relation to the fitnahs stirred up by the Yahood:    <P>
<div class='arabic' align='right'>&#1603;&#1584;&#1604;&#1603; &#1575;&#1604;&#1578;&#1610; &#1602;&#1578;&#1604; &#1601;&#1610;&#1607;&#1575; &#1575;&#1604;&#1582;&#1604;&#1610;&#1601;&#1577; &#1575;&#1604;&#1585;&#1575;&#1588;&#1583; &#1593;&#1579;&#1605;&#1575;&#1606; &#1576;&#1606; &#1593;&#1601;&#1575;&#1606; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607; &#1593;&#1606;&#1607; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>...And likewise, the one (i.e. transgression, plot) in which the rightly-guided khalifah Uthman bin Affaan (radiallaahu anhu) was killed ...</blockquote>    <P>
This occurs as part of list of the transgressions and plots of the Yahood, and it is referring to the revolution stirred up against Uthmaan (radiallaahu anhu) by <a href='tags/abdullah-bin-saba.html' class='tagLink'><font class='tagLink'>Abdullah bin Saba'</font></a>. It is the same revolution whose "<i>spirit</i>" <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> praised in his book "<a href="tags/al-adaalah-al-ijtimaaiyyah.html" class="tagLink"><font class="tagLink">al-Adaalah al-Ijtimaa'iyyah</font></a>" alongside acknowledging it was instigated by <a href='tags/abdullah-bin-saba.html' class='tagLink'><font class='tagLink'>Abdullah bin Saba'</font></a> and he continued to publish this until his death in 1966 - refer to <a href=indexc226.html?kjxfr>Part 1</a> of this series.    <P>
Also in <a href='tags/az-zilal.html' class='tagLink'><font class='tagLink'>az-<a href="tags/zilal.html" class="tagLink"><font class="tagLink">Zilal</font></a></font></a> (3/1723)    <P>
<div class='arabic' align='right'>&#1608;&#1603;&#1575;&#1606; &#1601;&#1610; &#1605;&#1602;&#1583;&#1605;&#1577; &#1575;&#1604;&#1605;&#1606;&#1601;&#1602;&#1610;&#1606; &#1575;&#1604;&#1605;&#1581;&#1578;&#1587;&#1576;&#1610;&#1606; &#1548; &#1593;&#1579;&#1605;&#1575;&#1606; &#1576;&#1606; &#1593;&#1601;&#1575;&#1606; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607; &#1593;&#1606;&#1607; - &#1601;&#1571;&#1606;&#1601;&#1602; &#1606;&#1601;&#1602;&#1577; &#1593;&#1592;&#1610;&#1605;&#1577; &#1604;&#1605; &#1610;&#1606;&#1601;&#1602; &#1571;&#1581;&#1583; &#1605;&#1579;&#1604;&#1607;&#1575; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And at the forefront of those who spent, in anticipation of reward, was Uthmaan bin Affaan (radiallaahu anhu) - so he spent a great amount, no one had spent the likes of it.</blockquote>    <P>
The <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> have brought these types of quotations (and there are a handful of others which are similar in meaning, speaking of Uthmaan's generosity in spending) as proof for Qutb's recantation from criticizing Uthman (radiallaahu anhu) and his khilaafah. Qutb's book "<i><a href='tags/al-adaalah-al-ijtimaaiyyah.html' class='tagLink'><font class='tagLink'>al-Adaalah al-Ijtimaa'iyyah</font></a></i>", in which Uthmaan (radiallaahu) is criticized and the revolution against  him considered an uprising of the "Islamic spirit" against what <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> considers mismanagement of the khilaafah, continued to be published reaching six editions until Qutb's death in 1966. Despite making some modifications in wording after <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> refuted <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> in 1952, <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> maintained his ideological position, which is found in all editions reaching the 14th (the last one that we know of) published in 1995CE (1415H).    <P>
These generalized statements do not constitute evidence for Qutb's recantation and repentance from his view that the uprising against Uthmaan, even if the plot of <a href='tags/abdullah-bin-saba.html' class='tagLink'><font class='tagLink'>Abdullah bin Saba'</font></a> was behind it, was one motivated by the "true Islamic spirit" (according to Qutb) on account of what the people saw (in Qutb's view) of what arose during the khilafah of Uthmaan of conferring lots of money to close relatives from the Bayt ul-Maal, of being manipulated by the likes of Marwan bin al-Hakam and the Bani Umayyah, and of giving positions and lots of land and shares in land taxes to close-relatives, and from generally not being able to hold reign, due to the khilafah coming to him in old age and whatever else <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> said in this regard.     <P>
Acknowledging that Uthmaan (radiallaahu anhu) spent abundantly from his wealth in the path of Allaah during the lifetime of the Prophet (alayhis salaam) by negating az-Zamakhshari's tafseer of the verse [the verses in Surah an-Najm were revealed in the lifetime of the Prophet obviously], and that he was amongst the rightly-guided khalifahs <u>does not constitute an acceptable Sharee'ah repentance with all its conditions</u> from that ideological position <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> continued to publish. A proper Sharee'ah repentance requires a bayaan (clarification) as per the aayah in Surah al-Baqarah:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1573;&#1616;&#1604;&#1575;&#1617;&#1614; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1578;&#1614;&#1575;&#1576;&#1615;&#1608;&#1575;&#1618; &#1608;&#1614;&#1571;&#1614;&#1589;&#1618;&#1604;&#1614;&#1581;&#1615;&#1608;&#1575;&#1618; &#1608;&#1614;&#1576;&#1614;&#1610;&#1617;&#1614;&#1606;&#1615;&#1608;&#1575;&#1618; &#1601;&#1614;&#1571;&#1615;&#1608;&#1618;&#1604;&#1614;&#1600;&#1574;&#1616;&#1603;&#1614; &#1571;&#1614;&#1578;&#1615;&#1608;&#1576;&#1615; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1607;&#1616;&#1605;&#1618; &#1608;&#1614;&#1571;&#1614;&#1606;&#1614;&#1575; &#1575;&#1604;&#1578;&#1617;&#1614;&#1608;&#1617;&#1614;&#1575;&#1576;&#1615; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1615; <img src='images/qnend.gif'></div>     <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> Except those who repent, make clarification and rectify.  These, I will accept their repentance. And I am the One Who accepts repentance, the Most Merciful.  (Al-Baqarah 2:160) </b><img src='images/qnend.gif'></blockquote>    <P>
If it is being claimed that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> made tawbah, then a proper Sharee'ah tawbah has to be brought as proof. What makes the deception of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> regarding this matter very clear is what follows - and you have to consider the matter below alongside the current activities of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> in defending <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> as covered above:    <P>
<font class='titleHeadline'>Exposing The Deception of the <a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a></font>    <P>
<div class='sidebar'>When <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> pointed out the revilements of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> against many of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> in the mid-1990s, which was greatly resented by the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> because this would damage their "<i>sahwah</i>" and "<i>harakah</i>", <u>it was not until around 2002</u> that they had managed to trawl through all of Shaykh Rabee's cassettes and writings so that they could find anything about <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> which they could then use to attack <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and defend <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, indicating their nifaaq (hypocrisy in action) and also the <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> of their <a href='tags/irjaa.html' class='tagLink'><font class='tagLink'>Irjaa'</font></a>. <u>For all of this activity was not for the sake of the Companions</u>, but it was for the sake of the honor of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> - to seek vengeance for the fact that Qutb's takfiri, revolutionary, rafidi orientations and methodologies that were derived from a Socialist-Marxist-Communist background, were refuted, and thus the harakah, and sahwah would lose its foundational ideological works and be unable to use them to cultivate future generations  [of the Khawaarij - (<a href=http://www.takfiris.com/takfir/?esjal>see here</a>)]!</div>    <P>
So they found some remarks, a few of which were valid criticisms against what were slips of the tongue, and the rest were just lies and fabrications and had no basis. What makes the deception of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> clear in this whole issue is looking at an illustration of what constitutes a proper Sharee'ah tawbah, and we can take this as an example, from <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> written 25/03/1413H (5th June 2002CE):    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1593;&#1604;&#1609; &#1570;&#1604;&#1607; &#1608;&#1589;&#1581;&#1576;&#1607; &#1608;&#1605;&#1606; &#1575;&#1578;&#1576;&#1593; &#1607;&#1583;&#1575;&#1607;. &#1571;&#1605;&#1575; &#1576;&#1593;&#1583;:     &#1601;&#1610;&#1593;&#1604;&#1605; &#1575;&#1604;&#1604;&#1607; &#1605;&#1606;&#1610; &#1608;&#1571;&#1588;&#1607;&#1583;&#1607; &#1608;&#1603;&#1601;&#1609; &#1576;&#1607; &#1588;&#1607;&#1610;&#1583;&#1575;&#1611; &#1571;&#1606;&#1606;&#1610; &#1571;&#1581;&#1576; &#1571;&#1589;&#1581;&#1575;&#1576; &#1605;&#1581;&#1605;&#1583; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1608;&#1571;&#1593;&#1592;&#1605;&#1607;&#1605; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1608;&#1571;&#1584;&#1576; &#1593;&#1606;&#1607;&#1605; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1591;&#1608;&#1604; &#1581;&#1610;&#1575;&#1578;&#1610; &#1576;&#1575;&#1591;&#1606;&#1575;&#1611; &#1608;&#1592;&#1575;&#1607;&#1585;&#1575;&#1611;&#1548; &#1608;&#1571;&#1601;&#1583;&#1610;&#1607;&#1605; &#1576;&#1606;&#1601;&#1587;&#1610; &#1608;&#1571;&#1608;&#1604;&#1575;&#1583;&#1610; &#1576;&#1604; &#1576;&#1575;&#1604;&#1571;&#1605;&#1577; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1573;&#1606; &#1603;&#1575;&#1606; &#1584;&#1604;&#1603; &#1576;&#1610;&#1583;&#1610;&#1548; &#1608;&#1571;&#1588;&#1607;&#1583; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606;&#1607; &#1605;&#1575; &#1603;&#1575;&#1606; &#1608;&#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1605;&#1579;&#1604;&#1607;&#1605;.    <P>
&#1608;&#1571;&#1593;&#1575;&#1583;&#1610; &#1605;&#1606; &#1610;&#1593;&#1575;&#1583;&#1610;&#1607;&#1605; &#1608;&#1571;&#1608;&#1575;&#1604;&#1610; &#1605;&#1606; &#1610;&#1608;&#1575;&#1604;&#1610;&#1607;&#1605; &#1608;&#1571;&#1576;&#1594;&#1590; &#1605;&#1606; &#1610;&#1576;&#1594;&#1590;&#1607;&#1605; &#1571;&#1608; &#1571;&#1581;&#1583;&#1575;&#1611; &#1605;&#1606;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1602;&#1604;&#1578;&#1607;&#1575; &#1601;&#1610; &#1582;&#1575;&#1604;&#1583; &#1608;&#1587;&#1605;&#1585;&#1577; &#1582;&#1604;&#1575;&#1604; &#1601;&#1578;&#1606;&#1577; &#1607;&#1608;&#1580;&#1575;&#1569; &#1571;&#1583;&#1575;&#1601;&#1593;&#1607;&#1575; &#1608;&#1571;&#1583;&#1601;&#1593;&#1607;&#1575; &#1593;&#1606; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576;.    <P>
&#1601;&#1571;&#1602;&#1608;&#1604; &#1601;&#1610; &#1582;&#1575;&#1604;&#1583;: &#1571;&#1606;&#1607; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1610; &#1575;&#1604;&#1580;&#1604;&#1610;&#1604; &#1608;&#1571;&#1606;&#1607; &#1587;&#1610;&#1601; &#1605;&#1606; &#1587;&#1610;&#1608;&#1601; &#1575;&#1604;&#1604;&#1607; &#1587;&#1604;&#1617;&#1607; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1585;&#1578;&#1583;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1606;&#1575;&#1601;&#1602;&#1610;&#1606; &#1575;&#1604;&#1602;&#1575;&#1574;&#1583; &#1575;&#1604;&#1605;&#1592;&#1601;&#1585; &#1602;&#1575;&#1605;&#1593; &#1575;&#1604;&#1585;&#1583;&#1577; &#1608;&#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1601;&#1578;&#1608;&#1581;&#1575;&#1578; &#1575;&#1604;&#1593;&#1592;&#1605;&#1609; &#1608;&#1607;&#1575;&#1583;&#1605; &#1593;&#1585;&#1608;&#1588; &#1575;&#1604;&#1571;&#1603;&#1575;&#1587;&#1585;&#1577; &#1608;&#1575;&#1604;&#1602;&#1610;&#1575;&#1589;&#1585;&#1577; &#1608;&#1571;&#1601;&#1583;&#1610;&#1607; &#1576;&#1606;&#1601;&#1587;&#1610; &#1608;&#1605;&#1575;&#1604;&#1610; &#1608;&#1571;&#1581;&#1576;&#1607; &#1608;&#1571;&#1587;&#1578;&#1605;&#1610;&#1578; &#1601;&#1610; &#1575;&#1604;&#1584;&#1576; &#1593;&#1606;&#1607; &#1608;&#1571;&#1593;&#1575;&#1583;&#1610; &#1608;&#1571;&#1608;&#1575;&#1604;&#1610; &#1605;&#1606; &#1571;&#1580;&#1604;&#1607;. &#1608;&#1587;&#1605;&#1585;&#1577; &#1576;&#1606; &#1580;&#1606;&#1583;&#1576; &#1571;&#1602;&#1608;&#1604; &#1601;&#1610;&#1607;: &#1571;&#1606;&#1607; &#1589;&#1581;&#1575;&#1576;&#1610; &#1580;&#1604;&#1610;&#1604; &#1608;&#1593;&#1592;&#1610;&#1605; &#1601;&#1610; &#1593;&#1610;&#1606;&#1610; &#1608;&#1571;&#1581;&#1576;&#1607; &#1608;&#1571;&#1608;&#1575;&#1604;&#1610; &#1608;&#1571;&#1593;&#1575;&#1583;&#1610; &#1605;&#1606; &#1571;&#1580;&#1604;&#1607;. &#1608;&#1605;&#1575; &#1589;&#1583;&#1585; &#1605;&#1606;&#1610; &#1605;&#1606; &#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1601;&#1610; &#1581;&#1602;&#1617;&#1607;&#1605;&#1575; &#1601;&#1573;&#1606;&#1607; &#1605;&#1606; &#1587;&#1576;&#1602; &#1575;&#1604;&#1604;&#1587;&#1575;&#1606; &#1602;&#1591;&#1593;&#1575;&#1611; &#1605;&#1579;&#1604; &#1602;&#1608;&#1604;&#1610; &#1601;&#1610; &#1582;&#1575;&#1604;&#1583; -&#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;- &#1610;&#1604;&#1582;&#1576;&#1591;&#1548; &#1571;&#1587;&#1578;&#1594;&#1601;&#1585; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1578;&#1608;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1605;&#1606;&#1607;&#1548; &#1608;&#1605;&#1575; &#1602;&#1604;&#1578;&#1607; &#1601;&#1610; &#1581;&#1602; &#1587;&#1605;&#1585;&#1577; &#1582;&#1604;&#1575;&#1604; &#1575;&#1587;&#1578;&#1606;&#1576;&#1575;&#1591;&#1610; &#1605;&#1606; &#1602;&#1608;&#1604; &#1593;&#1605;&#1585; -&#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;-: <<&#1602;&#1575;&#1578;&#1604; &#1575;&#1604;&#1604;&#1607; &#1587;&#1605;&#1585;&#1577;>>: &#1610;&#1593;&#1606;&#1610; &#1571;&#1606; &#1587;&#1605;&#1585;&#1577; &#1581;&#1589;&#1604;&#1578; &#1593;&#1606;&#1583;&#1607; &#1581;&#1610;&#1604;&#1577; &#1578;&#1588;&#1576;&#1607; &#1581;&#1610;&#1604;&#1577; &#1575;&#1604;&#1610;&#1607;&#1608;&#1583;&#1548; &#1601;&#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1577; &#1605;&#1606;&#1610; &#1587;&#1610;&#1574;&#1577;&#1548; &#1571;&#1587;&#1578;&#1594;&#1601;&#1585; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1578;&#1608;&#1576; &#1573;&#1604;&#1610;&#1607; &#1605;&#1606;&#1607;&#1575;&#1548; &#1608;&#1571;&#1581;&#1584;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606;&#1607;&#1575; &#1608;&#1605;&#1606; &#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1575;.    <P>
&#1608;&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1605;&#1581;&#1605;&#1583; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1582;&#1610;&#1585; &#1571;&#1605;&#1577; &#1571;&#1582;&#1585;&#1580;&#1578; &#1604;&#1604;&#1606;&#1575;&#1587; &#1604;&#1575; &#1603;&#1575;&#1606; &#1608;&#1604;&#1575; &#1610;&#1603;&#1608;&#1606; &#1605;&#1579;&#1604;&#1607;&#1605;&#1548; &#1608;&#1573;&#1606;&#1610; &#1604;&#1593;&#1604;&#1609; &#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1587;&#1604;&#1601; &#1601;&#1610;&#1607;&#1605;&#1548; &#1608;&#1573;&#1606;&#1610; &#1604;&#1593;&#1604;&#1609; &#1605;&#1584;&#1607;&#1576; &#1575;&#1576;&#1606; &#1575;&#1604;&#1605;&#1576;&#1575;&#1585;&#1603; &#1604;&#1605;&#1575; &#1602;&#1610;&#1604; &#1604;&#1607;: &#1571;&#1610;&#1607;&#1605;&#1575; &#1571;&#1601;&#1590;&#1604; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1571;&#1608; &#1593;&#1605;&#1585; &#1576;&#1606; &#1593;&#1576;&#1583;&#1575;&#1604;&#1593;&#1586;&#1610;&#1586;&#1567; &#1601;&#1602;&#1575;&#1604;: &#1604;&#1594;&#1576;&#1575;&#1585; &#1601;&#1610; &#1571;&#1606;&#1601; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1608;&#1607;&#1608; &#1610;&#1580;&#1575;&#1607;&#1583; &#1605;&#1593; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1582;&#1610;&#1585; &#1605;&#1606; &#1593;&#1605;&#1585; &#1576;&#1606; &#1593;&#1576;&#1583;&#1575;&#1604;&#1593;&#1586;&#1610;&#1586;.    <P>
&#1608;&#1571;&#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1576;&#1571;&#1606;&#1607; &#1604;&#1608; &#1571;&#1606;&#1601;&#1602; &#1571;&#1581;&#1583; &#1582;&#1610;&#1575;&#1585; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1579;&#1604; &#1571;&#1581;&#1583; &#1584;&#1607;&#1576;&#1575;&#1611; &#1605;&#1575; &#1576;&#1604;&#1594; &#1605;&#1583; &#1571;&#1581;&#1583;&#1607;&#1605; &#1608;&#1604;&#1575; &#1606;&#1589;&#1610;&#1601;&#1607;. &#1608;&#1573;&#1606; &#1602;&#1604;&#1576;&#1610; &#1604;&#1610;&#1593;&#1578;&#1589;&#1585; &#1571;&#1604;&#1605;&#1575;&#1611; &#1605;&#1606; &#1578;&#1604;&#1603; &#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1608;&#1571;&#1585;&#1580;&#1608; &#1571;&#1606; &#1571;&#1603;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1608;&#1602;&#1575;&#1601;&#1610;&#1606; &#1593;&#1606;&#1583; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1604;&#1607; &#1608;&#1587;&#1606;&#1577; &#1585;&#1587;&#1608;&#1604;&#1607; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;-.  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>All praise is due to Allaah, may the prayers and salutations be upon the Messenger of Allaah, upon his family and companionship and whoever followed his guidance, to proceed:    <P>
Then Allaah knows about me, and I call Him to witness, and sufficient is He as a witness, that I love <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Muhammad (sallallaahu alayhi wasallam) - all of them, I venerate (respect) all of them, and I defend them all for the duration of my life, inwardly and outwardly. I ransom myself, and my children, rather the whole Ummah for them if that was in my  hands (to do so), and I call Allaah to witness that there likes have never existed and will never exist (again).    <P>
And I show enmity to whoever shows enmity towards them, and I hate whoever hates them, or a single one amongst them. And the expressions which I said regarding Khalid [bin Walid] and Samurah [bin Jundub] were during a tornado-like tribulation that I repelled and pushed away from the youth.    <P>
So I say regarding Khalid: That he is a noble companion, that he is a sword amongst the swords of Allaah that Allaah unsheathed against the Mushriks, apostates and hypocrites, a victorious leader, the repeller of the apostacy, the owner of the great victories and the destroyer of the thrones of the Khosroes and Caesars. I ransom myself and my wealth for him, and I love him and I would risk death in defending him. And I show enmity and I show allegiance for his sake.And Samurah bin Jundub I say regarding him: That he is a noble companion, and he is great in my eyes, I love him, and I show allegiance and enmity for his sake.     <P>
And what arose from me of expressions regarding them both, then it is absolutely [as a result] of the slip of the tongue, such as my saying regarding Khalid (radiallaahu anhu) "he stumbles (makes errors, slips up etc.)", I seek forgiveness from Allaah, and repent to Allaah from it, and what I said regarding Samurah, whilst extracting [evidence] from the saying of Umar (radiallaahu anhu), "May Allaah fight Samurah", [my saying] "Meaning that there occured from Samurah a ruse that resembles the ruse of the Jews", then this expression from me is evil, I seek forgiveness from Allaah, and I repent to Him, and I warn the people from it and from its likes.    <P>
And there is no doubt that <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Muhammad (sallallaahu alayhi wasallam) are the best nation brought out for mankind. Their like has never been and will never be. And verily, I am upon the madhhab of the Salaf with respect to them, and indeed I am upon the madhhab of Ibn al-Mubaarak when it was said to him, "Which of the two are superior, <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> or Umar bin Abdil-Aziz?", so he said, "The dust on the nose of <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> whilst he made Jihad along with the Messenger of Allaah (sallallaahu alayhi wasallam) is better than Umar bin Abdil-Aziz".    <P>
And I worship Allaah with [the fact] that if one of the best of the Muslims spent the likes of [Mount] Uhud in gold, it would not reach even a mudd or a half of what they (<a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>) spent. And indeed my heart oozes pain due to those expressions, and I hope that I am amongst those who halt at the Book of Allaah and the Sunnah of His Messenger (sallallaahu alayhi wasallam).</blockquote>    <P>
That's an example of what a proper Sharee'ah tawbah looks like and it contains each and every single element of an accepted tawbah and we will use this as <u>the standard or criterion</u> for a true Sharee'ah repentance. Now, when the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> have taken upon themselves to try and present a so-called Sharee'ah repentance for Qutb's attacks against many of the <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> from his Marxist-Socialist ideological background, alongside their knowledge that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> continued publishing his books until he died and made no bayaan (clarification) and the likes, and you know how they try to present only generalized statements (like those above) through which they try to claim a specific repentance for <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, and then at the same time <u>you see how they behave with Shaykh Rabee'</u>, then you know that this is vile hizbiyyah and hypocrisy (in action) in broad daylight, it is certainly not the action of a people seeking truth.    <P>
<font class='titleHeadline'>Update 5th February 2010</font>    <P>
The brazenness of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> continues to show no limits. Here is latest from Abu Zubair Saleem Beg al-Azzami (<a href=http://www.takfiris.com/takfir/?esjal>learn more about him here</a>):    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>We will accept Rabi's repentance when he accepts Qutb's. Fair enough deal, I would think.</blockquote>    <P>
A number of points:    <P>
<blockquote><b>First</b>: This is the action of an immature 9 year old child who has not yet reached puberty. It is not from the conduct of grown men.    <P>
<b>Second</b>: Allaah is the one who accepts repentance from His servants, when they fulfil the requirements of a correct repentance which is a) cessation b) remorse c) resolving to withhold from that transgression d) where it involves transgression against others, restoring their rights e) where it involves transgression against the religion, making bayan (clarification) of the truth and refuting one's error f) seeking forgiveness and g) expressing one's tawbah. These are the components of a correct and acceptable Sharee'ah repentance, and where they are brought together, Allaah turns to His servants and accepts them.    <P>
<b>Third</b>: We judge upon the dhaahir, and what we see from <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> is no sign of a Sharee'ah repentance, rather he continued publishing his book "al-Adaalah" along with what it contained - even after Mahmood Sharkir refuted in in 1952 - right until his death in 1966, and it is still published with the same material decades later.    <P>
<b>Fourth</b>: Making acceptance of the truth conditional in this manner is a clear sign that one is upon <u>the most evil and repugnant</u> type of hizbiyyah, in fact it is a sickening type of hizbiyyah, and you can now see first-hand this extreme <a href='tags/irjaa.html' class='tagLink'><font class='tagLink'>Irjaa'</font></a> of these people towards the Ahl ul-Bid'ah, the Jahmite <a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a> Khawaarij of the 20th century.    <P>
<b>Fifth</b>: The affairs of the religion are not bargaining chips such that we bargain with each other regarding repentance on major issues of belief. How are these people going to make bargains regarding Qutb's Khaarijiyyah and <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the whole Ummah, which he published in his final works?    <P>
<b>Sixth</b>: Exposition and uncovering of the kind of mentality we are dealing with here. This mentality <u>is not concerned about loving and hating for the sake of Allaah</u> as much as it is concerned about loving and hating for the sake of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and defending him at all costs and you can see that clearly in the quote above. Offering "deals" like, "<i>Rabee's repentance is accepted only if he accepts Qutb's</i>", shows the repugnance of that <a href='tags/irjaa.html' class='tagLink'><font class='tagLink'>Irjaa'</font></a> that these people are upon.  </blockquote>    <P>
This is the state and condition of these people, and we prove once more that they are spurious, fake, insincere (in this matter) and do not desire the truth. Everything they do is centred around defending the person, works and ideology (20th century <i><a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a></i>) of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> which has its roots in the secular atheistic western  materialist philosophies.    <P>
<div class='sidebar'><ul> <li> <b>Salaah al-Khaalidee</b>: <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> Drank Heavily From the Western Materialist Philosophies Which Led Him To Doubt Islam for 15 Years - (<a href=indexb832.html?edera>see here</a>)  <li> <b>Sayyid <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> And The French Connection</b>: <a href='tags/alexis-carrel.html' class='tagLink'><font class='tagLink'>Alexis Carrel</font></a> - The French Catholic, Social Darwinist Doctor That Influenced Qutb's 'Jaahiliyyah' - (<a href=http://www.takfiris.com/takfir/?rgbql>see here</a>)  <li> <b>The Leninist Revolutionary Manifesto of Sayyid Qutb</b>: Lenin's 'What Is To Be Done?' In Qutb's 'Milestones' - (<a href=http://www.takfiris.com/takfir/?qyowp>see here</a>)  <li> <b>Readings in Elementary Communism</b>: <a href='tags/karl-marx.html' class='tagLink'><font class='tagLink'>Karl Marx</font></a>, Freidrich Engels, <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, Capitalism, the State, <a href='tags/social-justice.html' class='tagLink'><font class='tagLink'>Social Justice</font></a>, Revolution and the <a href='tags/communist-manifesto.html' class='tagLink'><font class='tagLink'>Communist Manifesto</font></a> - (<a href=indexbee3.html?dsppw>see here</a>)  </ul></div>    <P>
The actions you are seeing from these people show that they would be prepared to ransom themselves for the sake of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, and the behavior we see from them proves that they are not concerned about the honors of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> as much as they are interested in and concerned about protecting the reputation and standing of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>.     <P>
    <P>
   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/pcihb-did-sayyid-qutb-repent-from-abusing-and-attacking-the-companions-part-4.html">Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 4</a><BR>
//www.themadkhalis.com/md/?pcihb<BR>

<li><a href="articles/alkbq-did-sayyid-qutb-repent-from-abusing-and-attacking-the-companions-part-3.html">Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 3</a><BR>
//www.themadkhalis.com/md/?alkbq<BR>

<li><a href="articles/fhmqo-did-sayyid-qutb-repent-from-abusing-and-attacking-the-companions---part-2.html">Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 2</a><BR>
//www.themadkhalis.com/md/?fhmqo<BR>

<li><a href="articles/kjxfr-did-sayyid-qutb-repent-from-abusing-and-attacking-the-companions---part-1.html">Did Sayyid Qutb Repent From Abusing and Attacking the Companions? Refuting the Intellectual Fraud of the Extremist Qutbiyyah - Part 1</a><BR>
//www.themadkhalis.com/md/?kjxfr<BR>

<li><a href="articles/iczdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-13.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 13 - Ta'weel of the Arsh, Negation of al-Uluww and Negation of 'Hawaadith' Upon the Way of the Jahmiyyah</a><BR>
//www.themadkhalis.com/md/?iczdi<BR>

<li><a href="articles/waqwg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-11.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 11 - Allaah Speaking to Moses and Allaah's Eternal Kalaam </a><BR>
//www.themadkhalis.com/md/?waqwg<BR>

<li><a href="articles/vlffh-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-10---the-quran-is-like-the-rest-of-what-allaah-creates-and-like-the-soul.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 10 - The Qur'an is (Created) Like The Soul and Like The Rest of What Allaah Creates</a><BR>
//www.themadkhalis.com/md/?vlffh<BR>

<li><a href="articles/mslbg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-9.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 9 - Moses and the Speech of Allaah</a><BR>
//www.themadkhalis.com/md/?mslbg<BR>

<li><a href="articles/pgpti-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-8.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 8 - Negating Tahayyuz (Spatial Occupation) From Allaah</a><BR>
//www.themadkhalis.com/md/?pgpti<BR>

<li><a href="articles/taifd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-7----allaah-does-not-have-a-makaan-hayyiz-hadd-jihah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 7 -  Allaah Does Not Have a Makaan, Hayyiz, Hadd, Jihah</a><BR>
//www.themadkhalis.com/md/?taifd<BR>

<li><a href="articles/tkptu-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-5---allaah-does-not-occupy-a-place-makaan.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 5 - Allaah Does Not Occupy a Place (Makaan)</a><BR>
//www.themadkhalis.com/md/?tkptu<BR>

<li><a href="articles/jufol-shaykh-muhammad-bin-saalih-al-uthaymeen-in-1421h-the-tafsirs-of-ibn-kathir-ibn-as-sadee-al-qurtubi.html">Shaykh Muhammad bin Saalih al-Uthaymeen (in 1421H): The Tafsirs of Ibn Kathir, Ibn as-Sa'dee, al-Qurtubi Do Away With the Commentary of Sayyid Qutb By A Thousand Times, and The Issue of Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?jufol<BR>

<li><a href="articles/kxsoa-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-4.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 4 - Allaah's Uluww, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?kxsoa<BR>

<li><a href="articles/lalhx-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-3.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 3 - The Use of Aahaad Hadeeth in Aqidah</a><BR>
//www.themadkhalis.com/md/?lalhx<BR>

<li><a href="articles/ebzdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-2.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 2 - Ta'weel of al-Istiwaa and Negation of the Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ebzdi<BR>

<li><a href="articles/ppxmw-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-1---al-uluww-al-istiwaa-and-sifaat-filiyyah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 1 - The Qur'an, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ppxmw<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?pcihb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
</html>


