




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?nkckz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</span><BR>
Tuesday, October 08 2013 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
In his book (<span class='arb'>&#1578;&#1581;&#1601;&#1577; &#1575;&#1604;&#1602;&#1585;&#1610;&#1576; &#1608;&#1575;&#1604;&#1605;&#1580;&#1610;&#1576;</span>) <a href='tags/shaykh-muqbil-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/muqbil-bin-haadee.html" class="tagLink"><font class="tagLink">Muqbil bin Haadee</font></a></font></a> (rahimahullaah) in answer to question no. 75, stated about <a href='tags/shaykh-rabee-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee bin Haadee</font></a>, when asked about which Scholars to refer back to:    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610;&#1548; &#1601;&#1607;&#1608; &#1570;&#1610;&#1577; &#1605;&#1606; &#1570;&#1610;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1610;&#1606;&#1548; &#1604;&#1603;&#1606; &#1604;&#1575; &#1603;&#1570;&#1610;&#1575;&#1578; &#1573;&#1610;&#1585;&#1575;&#1606; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604;&#1610;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And <a href='tags/shaykh-rabee-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee bin Haadee</font></a> al-Madkhaliee, for he is a sign amongst the signs (<i>aayaat</i>) of Allaah in knowledge of the Hizbiyyeen, but not like the <i>aayaat</i> of Iraan, the Dajjaaleen.</blockquote>    <P>
<b>Source:</b> From the Shaykh's book as indicated and compiled in (<span class='arb'>&#1575;&#1604;&#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1576;&#1583;&#1610;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593;</span>) by Shaykh Khalid al-Dhufayree. Some of the Hajaawirah have attempted to justify <a href='tags/ghuluww.html' class='tagLink'><font class='tagLink'>Ghuluww</font></a> in Yahya al-Hajuri (made by the ignorant students of Yahya al-Hajuri and his poets) by claiming that Ahl al-Sunnah also make <a href='tags/ghuluww.html' class='tagLink'><font class='tagLink'>Ghuluww</font></a> in <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>, but the difference is that these commendations are coming from genuine, deeply-rooted Scholars who are in a position to know the true worth of a Scholar, such as Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a>, <a href='tags/shaykh-al-albani.html' class='tagLink'><font class='tagLink'>Shaykh al-<a href="tags/albani.html" class="tagLink"><font class="tagLink">Albani</font></a></font></a>, Shaykh Ibn al-Uthaymeen, Shaykh Muqbil and others.    <P>
And in his introduction to the book of Shaykh Muhammad al-Imaam, "<i>Tanweer al-Dhulumaat</i>", Shaykh Muqbil says (p. 6):    <P>
<div class='arabic' align='right'>&#1601;&#1603;&#1605; &#1605;&#1606; &#1581;&#1586;&#1576;&#1610; &#1603;&#1575;&#1606;&#1578; &#1604;&#1607; &#1589;&#1608;&#1604;&#1577; &#1608;&#1580;&#1608;&#1604;&#1577;&#1548; &#1576;&#1604; &#1578;&#1591;&#1604;&#1602; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1571;&#1604;&#1602;&#1575;&#1576; &#1575;&#1604;&#1590;&#1582;&#1605;&#1577;&#1548; &#1608;&#1576;&#1593;&#1583; &#1576;&#1610;&#1575;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1617;&#1577; &#1581;&#1575;&#1604;&#1607;&#1548; &#1605;&#1575;&#1578; &#1608;&#1605;&#1575;&#1578;&#1578; &#1601;&#1603;&#1585;&#1578;&#1607;.  &#1608;&#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1617;&#1577; &#1575;&#1604;&#1571;&#1601;&#1575;&#1590;&#1604; &#1575;&#1604;&#1605;&#1593;&#1575;&#1589;&#1585;&#1610;&#1606; &#1575;&#1604;&#1608;&#1575;&#1602;&#1601;&#1610;&#1606; &#1601;&#1610; &#1608;&#1580;&#1607; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604;: &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1606;&#1575;&#1589;&#1585; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1571;&#1604;&#1576;&#1575;&#1606;&#1610; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583;&#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606; &#1576;&#1575;&#1586; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610;&#1548; &#1608;&#1570;&#1582;&#1585;&#1608;&#1606;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And how many a Hizbee (has there been) who had some sway (power, strength, stronghold), rather exaggerated titles would be applied to him, yet after Ahl al-Sunnah clarified his condition he died and his ideology died with him. And from the esteemed contemporary Scholars of Ahl al-Sunnah who stand in the face of the people of falsehood are Shaykh Muhammad Nasir al-Din al-Albani (rahimahullaah) and Shaykh Abd al-Azeez bin Baz (rahimahullaah) and <a href='tags/shaykh-rabee-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee bin Haadee</font></a> and others.</blockquote>    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/nkckz-shaykh-muqbil-bin-haadee-shaykh-rabee-is-an-ayah-sign-in-knowledge-of-the-hizbiyyeen.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nkckz<BR>

<li><a href="articles/rlbec-shaykh-muqbil-bin-haadee-shaykh-rabee-brings-out-hizbiyyah-with-chisels.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</a><BR>
//www.themadkhalis.com/md/?rlbec<BR>

<li><a href="articles/nblim-shaykh-muqbil-bin-haadee-shaykh-rabee-is-from-the-taaifah-mansoorah.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nblim<BR>

<li><a href="articles/lznpg-shaykh-muqbil-bin-haadee-on-shaykh-rabee.html">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</a><BR>
//www.themadkhalis.com/md/?lznpg<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?nkckz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
</html>


