




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?lznpg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</span><BR>
Tuesday, October 08 2013 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Shaykh <a href='tags/muqbil-bin-haadee.html' class='tagLink'><font class='tagLink'>Muqbil bin Haadee</font></a> (rahimahullaah) stated about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> bin Haadee:    <P>
<div class='arabic' align='right'>&#1605;&#1616;&#1606;&#1618; &#1571;&#1576;&#1589;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1608;&#1576;&#1583;&#1582;&#1606; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1589;&#1585; &#1575;&#1604;&#1571;&#1582; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; - &#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; - &#1605;&#1614;&#1606; &#1602;&#1575;&#1604; &#1604;&#1607; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1573;&#1606;&#1607; &#1581;&#1586;&#1576;&#1610; &#1601;&#1587;&#1610;&#1606;&#1603;&#1588;&#1601; &#1604;&#1603;&#1605; &#1576;&#1593;&#1583; &#1571;&#1610;&#1575;&#1605; &#1573;&#1606;&#1607; &#1581;&#1586;&#1576;&#1610;&#1548; &#1587;&#1578;&#1584;&#1603;&#1585;&#1608;&#1606; &#1584;&#1604;&#1603;&#1548; &#1601;&#1602;&#1591; &#1575;&#1604;&#1588;&#1582;&#1589; &#1610;&#1603;&#1608;&#1606; &#1601;&#1610; &#1576;&#1583;&#1569; &#1571;&#1605;&#1585;&#1607; &#1605;&#1578;&#1587;&#1578;&#1585;&#1575;&#1611; &#1605;&#1575; &#1610;&#1581;&#1576; &#1571;&#1606; &#1610;&#1606;&#1603;&#1588;&#1601; &#1571;&#1605;&#1585;&#1607; &#1604;&#1603;&#1606; &#1573;&#1584;&#1575; &#1602;&#1608;&#1610; &#1608;&#1571;&#1589;&#1576;&#1581; &#1604;&#1607; &#1571;&#1578;&#1576;&#1575;&#1593;&#1548; &#1608;&#1604;&#1575;&#1610;&#1590;&#1585;&#1607; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610;&#1607; &#1571;&#1592;&#1607;&#1585; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607;&#1548; &#1601;&#1571;&#1606;&#1575; &#1571;&#1606;&#1589;&#1581; &#1576;&#1602;&#1585;&#1575;&#1569;&#1577; &#1603;&#1578;&#1576;&#1607; &#1608; &#1575;&#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1577; &#1605;&#1606;&#1607;&#1575; -&#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>From the most insightful of people of the jamaa'aat (partisan groups) and the taint (dakhan) of the jamaa'aat in this era, is the brother, the Shaykh, Rabee' bin Haadee (may Allaah protect him). To whomever <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> says that he is a hizbee, then after the passing of days it will be uncovered to you that he is hizbee, you will remember that. At the beginning of his affair, a man may conceal himself (in terms of what he is upon), he does not like to be uncovered, however when he becomes strong and gains followers and (he is certain that any) speech about him will not harm him if he  now openly manifests what he has with him, so I advise the reading of his books (Shaykh Rabee's) and benefiting from them - may Allaah protect him.</blockquote>    <P>
<b>Source:</b> In the cassette (<span class='arb'>&#1575;&#1604;&#1571;&#1587;&#1574;&#1604;&#1577; &#1575;&#1604;&#1587;&#1606;&#1610;&#1577; &#1604;&#1593;&#1604;&#1575;&#1617;&#1605;&#1577; &#1575;&#1604;&#1583;&#1610;&#1575;&#1585; &#1575;&#1604;&#1610;&#1605;&#1606;&#1610;&#1577;&#1548; &#1571;&#1587;&#1574;&#1604;&#1577; &#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1591;&#1575;&#1574;&#1601;</span>) and as published in (<span class='arb'>&#1575;&#1604;&#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1576;&#1583;&#1610;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593;</span>) by Shaykh Khalid al-Dhufayree. Shaykh Muqbil has described perfectly how these people behave, those who are from the jamaa'aat or sympathetic towards them, then they infiltrate the ranks of Ahl al-Sunnah, pretend to be upon the way of the Salaf, show apparent love for the Scholars, appear to defend the Sunnah, and then once they have gathered followers, or have got on the kursee (chair), they bring out into the open what they may have been concealing of false principles and hatred and resentment of the Scholars. Ironically, this speech of Shaykh Muqbil is not far off in describing al-Ma'ribee and al-Hajuri (<a href=http://www.alhajuri.com/>website</a>), both of whom <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> described with <i>inhiraaf</i>. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/nkckz-shaykh-muqbil-bin-haadee-shaykh-rabee-is-an-ayah-sign-in-knowledge-of-the-hizbiyyeen.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nkckz<BR>

<li><a href="articles/rlbec-shaykh-muqbil-bin-haadee-shaykh-rabee-brings-out-hizbiyyah-with-chisels.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</a><BR>
//www.themadkhalis.com/md/?rlbec<BR>

<li><a href="articles/nblim-shaykh-muqbil-bin-haadee-shaykh-rabee-is-from-the-taaifah-mansoorah.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nblim<BR>

<li><a href="articles/lznpg-shaykh-muqbil-bin-haadee-on-shaykh-rabee.html">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</a><BR>
//www.themadkhalis.com/md/?lznpg<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?lznpg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
</html>


