




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?nblim by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</span><BR>
Tuesday, October 08 2013 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Shaykh <a href='tags/muqbil-bin-haadee.html' class='tagLink'><font class='tagLink'>Muqbil bin Haadee</font></a> (rahimahullaah) stated about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> bin Haadee:    <P>
<div class='arabic' align='right'>&#1576;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1610;&#1594;&#1585;&#1576;&#1604;&#1608;&#1606; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; &#1594;&#1585;&#1576;&#1604;&#1577;&#1548; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593;&#1548; &#1604;&#1575; &#1578;&#1586;&#1575;&#1604; &#1591;&#1575;&#1574;&#1601;&#1577; &#1605;&#1606; &#1571;&#1605;&#1578;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1581;&#1602; &#1592;&#1575;&#1607;&#1585;&#1610;&#1606;  (&#1604;&#1575; &#1610;&#1590;&#1585;&#1607;&#1605;) &#1605;&#1606; &#1582;&#1575;&#1604;&#1601;&#1607;&#1605; &#1608;&#1604;&#1575; &#1605;&#1606; &#1582;&#1584;&#1604;&#1607;&#1605; &#1581;&#1578;&#1609; &#1610;&#1571;&#1578;&#1610; &#1571;&#1605;&#1585; &#1575;&#1604;&#1604;&#1607; &#1608;&#1607;&#1605; &#1593;&#1604;&#1609; &#1584;&#1604;&#1603;&#1548; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1601;&#1610; &#1571;&#1585;&#1590; &#1575;&#1604;&#1581;&#1585;&#1605;&#1610;&#1606; &#1608;&#1606;&#1580;&#1583;&#1548; &#1606;&#1593;&#1605; &#1576;&#1581;&#1605;&#1583; &#1575;&#1604;&#1604;&#1607; &#1610;&#1594;&#1585;&#1576;&#1604; &#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1610;&#1606; &#1594;&#1585;&#1576;&#1604;&#1607; &#1608;&#1610;&#1576;&#1610;&#1617;&#1606; &#1605;&#1575; &#1607;&#1605; &#1593;&#1604;&#1610;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>By the praise of Allaah, Ahl al-Sunnah filter out the society with a filtering. <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>, "<i>There will never cease to be a faction from y Ummah, manifestly upon the truth. They will not be harmed by those who oppose them, nor abandone them, until the command of Allaah arrives and they are upon that</i>." <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> [is from amongst these] in the land of the Haramayn and Najd, yes, by the praise of Allaah, he filters out the Hizbiyyeen with a filtering and he makes clear what they are upon.</blockquote>    <P>
<b>Source:</b> In the cassette (<span class='arb'>&#1588;&#1585;&#1610;&#1591; &#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; - &#1578;&#1587;&#1580;&#1610;&#1604;&#1575;&#1578; &#1605;&#1606;&#1607;&#1575;&#1580; &#1575;&#1604;&#1587;&#1606;&#1617;&#1577;</span>) and as published in (<span class='arb'>&#1575;&#1604;&#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1576;&#1583;&#1610;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593;</span>) by Shaykh Khalid al-Dhufayree. This is why <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> is hated by the  Hizbiyyeen. They have taken a leaf out of the book of the <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a> of 8th century Shaam and <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a> with respect to Shaykh al-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a>, they tried to malign him, attack him, revile him, slander him and even portray  him as a kaafir. And we find that a portion of this has been set aside for <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> by the Hizbiyyeen, for no other reason except that he is caller to the way of the Salaf in creed and methodology and refuting and shunning whatever opposes it from innovated methodologies, the jamaa'aat upon them and the figureheads leading them. <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> has exposed the jamaa'aat of hizbiyyah of the 20th century and the great evil they have brought upon the Ummah with their innovated <i><a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a></i> (thought, ideology) by which they clash with methodology of the Prophets in da'wah to Allaah. It is for this reason alone that he is maligned and attacked as Shaykh Ibn al-Uthaymeen made clear (<a href=indexb09a.html?epluy>see here</a>). <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/nkckz-shaykh-muqbil-bin-haadee-shaykh-rabee-is-an-ayah-sign-in-knowledge-of-the-hizbiyyeen.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nkckz<BR>

<li><a href="articles/rlbec-shaykh-muqbil-bin-haadee-shaykh-rabee-brings-out-hizbiyyah-with-chisels.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</a><BR>
//www.themadkhalis.com/md/?rlbec<BR>

<li><a href="articles/nblim-shaykh-muqbil-bin-haadee-shaykh-rabee-is-from-the-taaifah-mansoorah.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nblim<BR>

<li><a href="articles/lznpg-shaykh-muqbil-bin-haadee-on-shaykh-rabee.html">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</a><BR>
//www.themadkhalis.com/md/?lznpg<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?nblim by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
</html>


