




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ebhen by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Ibn Uthaymin Defends and Praises Shaykh Rabee' al-Madkhali and Destroys the Doubts of the Qutbiyyah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ibn Uthaymin Defends and Praises Shaykh Rabee' al-Madkhali and Destroys the Doubts of the Qutbiyyah</span><BR>
Wednesday, January 06 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>The Visit of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> to Unayzah</font>    <P>
Shaykh Rabee' bin Haadee al-Madkhali (hafidhahullaah) visited Unayzah, the place of residence of Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> (rahimahullaah) this was in the year before the Shaykh passed away (he passed away in January 2001CE). This was <u>after a period of around a decade</u> in which the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> (see Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> on their manhaj <a href=index33d0.html?tjmrl >in this article</a>, <a href=index49f2.html?xwcmm >this article</a> and <a href=index0ec1.html?blaok>this article</a>) had tried to cause confusion with their attempts to bring the doctrines of <a href='tags/soofee.html' class='tagLink'><font class='tagLink'>Soofee</font></a> <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a> and Mu'tazilis (Bannaa, <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, Mawdudi) into the ranks of Ahl us-Sunnah and to turn the rest of the Scholars away from <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> through lies, rumour-mongering and scaremongering.     <P>
<b>The reason?</b>     <P>
<div class='sidebar'>Because after the Ikhwanis issued a boycott against Imaam al-Albani for criticizing <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> for corroborating the doctrine of the Sufis of <a href='tags/wahdat-ul-wujood.html' class='tagLink'><font class='tagLink'>Wahdat ul-Wujood</font></a> at the later part of his life (even if he negated it in the earlier part) - <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and other scholars like Shaykh Abdullaah ad-Dawaish, stood to refute the great errors, innovations, misguidances and his <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the whole Ummah. Follow these articles one by one and see the truth for yourself on just one of the evil legacies of Qutb: (see   <a href=http://www.takfiris.com/takfir/?jqpkg>here</a>, <a href=http://www.takfiris.com/takfir/?lyhev>here</a>, <a href=http://www.takfiris.com/takfir/?xbnsa>here</a>, <a href=http://www.takfiris.com/takfir/?pmjvl>here</a>, <a href=http://www.takfiris.com/takfir/?hulwt>here</a>, <a href=http://www.takfiris.com/takfir/?vdeiu>here</a>, <a href=http://www.takfiris.com/takfir/?ezjol>here</a>, and <a href=http://www.takfiris.com/takfir/?wmagi>here</a>)</div>    <P>
By the year 2000, <b>most of the Major Scholars alive had warned against this sect of the Khawaarij called the Qutbiyyah</b>, and from its doctrines, and methodologies - even if there occurred from these Scholars something of praise and defense of the heads of these <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> many years earlier. The truth was later established, and you can just go and <a href=index33d0.html?tjmrl >listen to this audio</a> from <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> on <a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a> and <a href='tags/safar-al-hawali.html' class='tagLink'><font class='tagLink'>Safar al-Hawali</font></a> and the people of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, and also Shaykh Ibn Uthaymin's agreement, sanctioning and recommendation of the warning from <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, his books, and the "<a href="tags/qutbi.html" class="tagLink"><font class="tagLink">Qutbi</font></a>" Manhaj (<a href=index49f2.html?xwcmm >see here</a>). And see Shaykh Salih <a href='tags/al-fawzan.html' class='tagLink'><font class='tagLink'>al-<a href="tags/fawzan.html" class="tagLink"><font class="tagLink">Fawzan</font></a></font></a> who also refuted their mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> - following <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> in that - see   <a href=http://www.takfiris.com/takfir/?qyrnf>here</a> and<a href=http://www.takfiris.com/takfir/?aorjc>here</a> just by way of example.    <P>
Naturally, <u>these truths enraged the Qutbiyyah</u>, and from that time, to this day of ours, <b>they have not ceased trying, just like the typical cowards they are, of trying to elicit statements from the other Scholars, against <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, through loaded questions that do not conform to the true realities</b> and we shall address some of them in due course inshaa'Allaah, such as what they are propagating these days of the statement of the muftee Shaykh Abdul-Aziz Aal ash-Shaykh (hafidhahullaah).    <P>
<font class='titleHeadline'>Shaykh Ibn Uthaymin: <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is Upon Salafiyyah, in His Manhaj and in The Actualizing of the Call to Tawheed</font>    <P>
This statement here is <u>a destruction</u> of the entire da'wah of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> and Ikhwaaniyyah, a corroboration of the correctness of Shaykh Rabee's book "<i>Manhaj al-Anbiyaa Fi ad-Da'wah Ilallaah</i>" (Methodology of the Prophets in Calling to Allaah), and a corroboration that when <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> speaks about <u>Salafiyyah not being a hizb</u>, he is not speaking about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, <b>but those besides Shaykh Rabee'</b> who are upon other than what <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is upon.     <P>
Here is the audio:    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/rabee-bin-uthaymin-praise-a.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<div class='arabic' align='right'>&#1573;&#1606;&#1606;&#1575; &#1606;&#1581;&#1605;&#1583; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609; &#1571;&#1606; &#1610;&#1587;&#1585; &#1604;&#1571;&#1582;&#1610;&#1606;&#1575; &#1575;&#1604;&#1583;&#1603;&#1578;&#1608;&#1585; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1571;&#1606; &#1610;&#1586;&#1608;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1591;&#1602;&#1577; &#1581;&#1578;&#1609; &#1610;&#1593;&#1604;&#1605; &#1605;&#1606; &#1610;&#1582;&#1601;&#1609; &#1593;&#1604;&#1610;&#1607; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1571;&#1606; &#1571;&#1582;&#1575;&#1606;&#1575; - &#1608;&#1601;&#1602;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1573;&#1610;&#1575;&#1607; - &#1593;&#1604;&#1609; &#1580;&#1575;&#1606;&#1576; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1587;&#1604;&#1601; &#1548; &#1608;&#1604;&#1587;&#1578; &#1571;&#1593;&#1606;&#1610; &#1576;&#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1571;&#1606;&#1607;&#1575; &#1581;&#1586;&#1576; &#1602;&#1575;&#1574;&#1605; &#1605;&#1590;&#1575;&#1583; &#1604;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1548; &#1604;&#1603;&#1606;&#1610; &#1571;&#1585;&#1610;&#1583; &#1576;&#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1571;&#1606;&#1607; &#1593;&#1604;&#1609; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1587;&#1604;&#1601; &#1601;&#1610; &#1605;&#1606;&#1607;&#1580;&#1607; &#1608;&#1604;&#1575; &#1587;&#1610;&#1605;&#1575; &#1578;&#1581;&#1602;&#1610;&#1602; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1608;&#1605;&#1606;&#1575;&#1576;&#1584;&#1577; &#1605;&#1606; &#1610;&#1590;&#1575;&#1583;&#1607; &#1548; &#1608;&#1606;&#1581;&#1606; &#1606;&#1593;&#1604;&#1605; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1571;&#1606; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1607;&#1608; &#1571;&#1589;&#1604; &#1575;&#1604;&#1576;&#1593;&#1579;&#1577; &#1575;&#1604;&#1578;&#1610; &#1576;&#1593;&#1579; &#1575;&#1604;&#1604;&#1607; &#1576;&#1607;&#1575; &#1585;&#1587;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1548;&#1548;&#1548; &#1586;&#1610;&#1575;&#1585;&#1577; &#1571;&#1582;&#1610;&#1606;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1573;&#1604;&#1609; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1591;&#1602;&#1577; &#1608;&#1576;&#1575;&#1604;&#1571;&#1582;&#1589; &#1573;&#1604;&#1609; &#1576;&#1604;&#1583;&#1606;&#1575; &#1593;&#1606;&#1610;&#1586;&#1577; &#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1587;&#1610;&#1603;&#1608;&#1606; &#1604;&#1607;  &#1571;&#1579;&#1585; &#1548; &#1608;&#1610;&#1578;&#1576;&#1610;&#1606; &#1604;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1575; &#1603;&#1575;&#1606; &#1582;&#1575;&#1601;&#1610;&#1575;&#1611; &#1576;&#1608;&#1575;&#1587;&#1591;&#1577; &#1575;&#1604;&#1578;&#1607;&#1608;&#1610;&#1604; &#1608;&#1575;&#1604;&#1578;&#1585;&#1608;&#1610;&#1580; &#1608;&#1573;&#1591;&#1604;&#1575;&#1602; &#1575;&#1604;&#1593;&#1606;&#1575;&#1606; &#1604;&#1604;&#1587;&#1575;&#1606; .  &#1608;&#1605;&#1575; &#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1606;&#1583;&#1605;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1575; &#1602;&#1575;&#1604;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1573;&#1584;&#1575; &#1578;&#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1571;&#1606;&#1607;&#1605; &#1593;&#1604;&#1609; &#1589;&#1608;&#1575;&#1576; ."</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed we praise Allaah, Free is He from all imperfections, the Most High, that He makes it easy for our brother, the Doctor, Rabee' bin Haadee al-Madkhalee to visit this region. <b>[So that] the one to whom certain matters are not apparent may come to know that our brother, may Allaah grant us and him success, is upon Salafiyyah, the way of the Salaf</b>. </blockquote>    <P>
So this is a corroboration that <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> is actually upon the way of the Salaf and not upon other than it, and the Shaykh is praising Allaah for facilitating the visit of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and so the one to whom certain affairs were hidden will become clear to him. Now what were those affairs? Well, affairs of manhaj and the true nature of the call to Allah, the way of the Prophets in actualizing Tawheed - the very same affairs on account of which the Heretical Innovators had spent the previous decade in attacking the Shaykh.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And I do not mean here that Salafiyyah is a hizb (party) which is set up to oppose the Muslims outside of it, <b>but I mean by Salafiyyah, that he (i.e. Shaikh Rabee') is upon the path of the Salaf in his Manhaj. Especially in the field of actualising Tawheed and throwing aside what opposes this [manhaj]</b>. And all of us know tht Tawheed is the basis for which Allaah sent the Messengers upon them be peace and prayers... </blockquote>    <P>
There you go. That pretty much annihilates <u>the misapplication</u> of all those other statements of <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> that were being thrown around in which the Shaykh said that Salafiyyah is not a hizb, <u>rather it is manhaj and a way that is followed and traversed and in shunning and throwing aside whatever oppposes it</u>. One that <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> himself was upon when he warned against the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, the <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> and its doctrines and its figurehead and his works (see   <a href=index0ec1.html?blaok>here</a>, <a href=index5fb6.html?pmcwq>here</a>, <a href=index6f86.html?prtli>here</a>, <a href=index2156.html?jufol>here</a>, <a href=index33d0.html?tjmrl>here</a> and <a href=index49f2.html?xwcmm>here</a>). As for when you claim Salafiyyah and you follow other than it, and you set yourself up with doctrines and methodologies to oppose Salafiyyah and to oppose the Muslims, to split their ranks and their hearts (through what is other than Salafiyyah), then that is the hizb that the Shaykh was warning against.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The visit of our brother, Shaikh Rabee bin Haadee to this region, our city, Unaizah, no doubt will have a good effect and it will also become clear to many of the people what used to be hidden from them <b>due to the scare-mongering and rumour-mongering and also letting loose the tongue [of discord]</b>.</blockquote>     <P>
Just what were these rumours. Who are and where where they coming from? And who are these people, still to this day, trying the same worn out:    <P>
<blockquote><i>Hey Shaykh, there are some real nasty people out there, they are attacking the du'at and the scholars and saying they are misguided, Shaykh, can you give them some advice ... and O by the way, can I just slip in there very quickly as you start your advice, that they are the followers and students of Shaykh Rabee'</i>. </blockquote>    <P>
Don't they know that this is the same type of deception played out by the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> in 1991-1992CE (1412H) with Shaykh Bin Baz, before he blackened their faces and rendered them <u>liars</u> and <u>callers to falsehood</u> who <u>stir in the murky waters</u>, when they claimed that a general piece of advice given by the Shaykh to everyone, was directed against the Shaykhs of Madinah in particular (i.e. Shaykh Rabee') - that fadeehah will be documented shortly! <!---<a href=http://www.themadkhalis.com/md/?qvrrm>see all of that in great detail right here</a>.--->    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And how numerous are those who are remorseful about what they said concerning the Ulamaa, when it becomes clear to them that they (the Ulamaa) are upon the truth. </blockquote>    <P>
We pray that Allaah grants the same success to these people still clinging onto the flotsam in the ocean.    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/rabee-bin-uthaymin-praise-b.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
Then one of those present at the gathering said:    <P>
<div class='arabic' align='right'>&#1579;&#1605; &#1602;&#1575;&#1604; &#1571;&#1581;&#1583; &#1575;&#1604;&#1581;&#1575;&#1590;&#1585;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1610;&#1591; &#1606;&#1601;&#1587;&#1607; : &#1607;&#1575;&#1607;&#1606;&#1575; &#1587;&#1572;&#1575;&#1604; &#1581;&#1608;&#1604; &#1603;&#1578;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There is a question concerning the books of Shaikh Rabee'?</blockquote>    <P>
<div class='arabic' align='right'>&#1601;&#1571;&#1580;&#1575;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1593;&#1579;&#1610;&#1605;&#1610;&#1606; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1602;&#1575;&#1574;&#1604;&#1575;&#1611; : "&#1575;&#1604;&#1592;&#1575;&#1607;&#1585; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1604;&#1575; &#1610;&#1581;&#1578;&#1575;&#1580; &#1604;&#1602;&#1608;&#1604;&#1610; .  &#1608;&#1603;&#1605;&#1575; &#1587;&#1574;&#1604; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; &#1593;&#1606; &#1573;&#1587;&#1581;&#1575;&#1602; &#1576;&#1606; &#1585;&#1575;&#1607;&#1608;&#1610;&#1577; &#1585;&#1581;&#1605;&#1607;&#1605; &#1575;&#1604;&#1604;&#1607; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1601;&#1602;&#1575;&#1604; : &#1605;&#1579;&#1604;&#1610; &#1610;&#1587;&#1571;&#1604; &#1593;&#1606;  &#1573;&#1587;&#1581;&#1575;&#1602; &#1567;! &#1576;&#1604; &#1573;&#1587;&#1581;&#1575;&#1602; &#1610;&#1587;&#1571;&#1604; &#1593;&#1606;&#1610; .  &#1608;&#1571;&#1606;&#1575; &#1578;&#1603;&#1604;&#1605;&#1578; &#1601;&#1610; &#1571;&#1608;&#1604; &#1603;&#1604;&#1575;&#1605;&#1610; &#1593;&#1606; &#1575;&#1604;&#1584;&#1610; &#1571;&#1593;&#1604;&#1605;&#1607; &#1593;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1608;&#1601;&#1602;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1575; &#1586;&#1575;&#1604; &#1605;&#1575; &#1584;&#1603;&#1585;&#1578;&#1607; &#1601;&#1610; &#1606;&#1601;&#1587;&#1610; &#1581;&#1578;&#1609; &#1575;&#1604;&#1570;&#1606; &#1548; &#1608;&#1605;&#1580;&#1610;&#1574;&#1607; &#1573;&#1604;&#1609; &#1607;&#1606;&#1575; &#1608;&#1603;&#1604;&#1605;&#1578;&#1607; &#1575;&#1604;&#1578;&#1610; &#1576;&#1604;&#1594;&#1606;&#1610; &#1593;&#1606;&#1607; &#1605;&#1575; &#1576;&#1604;&#1594;&#1606;&#1610; &#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1605;&#1605;&#1575; &#1610;&#1586;&#1610;&#1583; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1605;&#1581;&#1576;&#1577; &#1604;&#1607; &#1608;&#1583;&#1593;&#1575;&#1569; &#1604;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is apparently clear that this question is not in need of my answer. And just as Imaam Ahmad was asked about Ishaaq bin Raahawaih - rahimahumullaah - and he replied, "<i>Someone like me is asked about Ishaaq! Rather, Ishaaq is to be asked about me</i>." <b>And I spoke at the beginning of my speech about that which I know about Shaikh Rabee', may Allaah grant him success, and what I mentioned has never ceased to be what I hold about him in my soul, up until this time</b>. And his arrival here and his words that have reached me, then no doubt, <b>they are such that they will increase a person in his love for him and in his supplication for him</b>. </blockquote>    <P>
Alhamdulillaah! This is a great praise, if you reflect upon. And it is precisely this (along with Shaykh Ibn Uthaymin's warnings from the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, their cassettes, doctrines and figurheads) that incensed the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> to try and attack <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> through other Scholars by taking the same "rumour-mongering" and "scare-mongering" to them. That's what they have been trying to achieve <u>after the Major Scholars passed away</u>, Imaam al-Albani, Imaam <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a>, Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a>, all these Scholars knew the truth and clarified the truth and were 100% behind <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>. After they passed away, the Hizbiyyeen have not ceased to try and get the other Shaykhs to speak about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, in continuation of their war against the Sunnah and its people, and in defence and support of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>. So beware of their deception!   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/vckiw-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 2/2</a><BR>
//www.themadkhalis.com/md/?vckiw<BR>

<li><a href="articles/shufz-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 1/2</a><BR>
//www.themadkhalis.com/md/?shufz<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/iosjk-imaam-al-albani-to-shaykh-rabee-everything-with-which-you-refuted-qutb-for-is-correct-and-true.html">Imaam al-Albani to Shaykh Rabee: Everything With Which You Refuted Qutb For Is Correct and True and May Allaah Reward You For Fulfilling The Obligation of Exposing His Ignorance and Deviance</a><BR>
//www.themadkhalis.com/md/?iosjk<BR>

<li><a href="articles/hyulz-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-1.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 1 - Introduction and Background</a><BR>
//www.themadkhalis.com/md/?hyulz<BR>

<li><a href="articles/ebhen-shaykh-ibn-uthaymin-on-shaykh-rabi-al-madkhali.html">Shaykh Ibn Uthaymin Defends and Praises Shaykh Rabee' al-Madkhali and Destroys the Doubts of the Qutbiyyah</a><BR>
//www.themadkhalis.com/md/?ebhen<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ebhen by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


