




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?fyfxl by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:06 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 4 - Shaykh Salih al-Luhaydaan's Praise of Shaykh Rabee 1433H</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 4 - Shaykh Salih al-Luhaydaan's Praise of Shaykh Rabee 1433H</span><BR>
Friday, January 13 2012 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>This is part of a series: Please refer to the <a href=indexf6e4.html?hyulz>introductory article here</a>, for important background information. Today, we have many fake claimants to Salafiyyah, claiming attachment to its <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and manhaj. From them are those who pretend to refute the Ash'arites, yet, out of <i>nifaq al-'amali</i> (hypocrisy of action) ally with and defend the Ash'arites of <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a> (callers to <i>ta'teel</i>, denial of <i><a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-Uluww</font></a></i>, the saying the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is created, denial of the <i><a href='tags/sifaat-filiyyah.html' class='tagLink'><font class='tagLink'>Sifaat Fi'liyyah</font></a></i>, and callers to <i><a href='tags/tafweed.html' class='tagLink'><font class='tagLink'>Tafweed</font></a></i> - <a href=series/misguiding-the-ummah-through-propaganda-for-qutbs-books-an-encyclopedia-of-the-innovations-and-deviations-they-contain.html>see here</a>), those innovators who entered the distillations of the secular methodologies of political reform into Islam. These people defend those Egyptian Jahmite <a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a> innovators against the People of the Sunnah, loving and hating for the sake of those Jahmites of 20th century <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a>.     <P>
The <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> of today assuming the label of "<a href="tags/ashariyyah.html" class="tagLink"><font class="tagLink">Ash'ariyyah</font></a>" scapegoat and attack <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> (rahimahullaah) whilst their real intent is to hinder the people from the way of the Salaf that he supported and defended, because he connected the Ummah to the actual way of the Salaf in creed. <u>In exactly the same way</u>,  these <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, Takfiriyyah scapegoat <a href='tags/shaykh-rabee-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee bin Haadee</font></a> for the very same objectives, wishing to hinder the people from the generality of the scholars of Ahl al-Sunnah, the Salafi scholars of today, none of whom are with these Harakiyyeen in their false methodologies, rather, they advocate the methodologies which the Salaf were upon in rectification of the servant and the land. But in order to deceive the people (just like those Jahmite <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a> do with Ibn Taymiyyah), the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, Takfiriyyah make it appear as if the various positions that the Salafis hold, emanate only from one man (<a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>), when in reality, all of these Scholars are united in the generality of the usool and manaahij in which the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> and Takfiriyyah contend with Ahl al-Sunnah. At the same time, these same people, as they have been declared by the people of knowledge, are <i><a href='tags/ghulaat-al-murjiah.html' class='tagLink'><font class='tagLink'>Ghulaat al-<a href="tags/murjiah.html" class="tagLink"><font class="tagLink">Murji'ah</font></a></font></a></i>, in that they expel the actions of the heart from eemaan as testified to by their actions in practice, even if they may contend otherwise in utterance (<a href=index84cf.html?rtfaa>see this article for a detailed elaboration</a>).    <P>
From the ways of the Jahmite <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a> these <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> continue to follow in attacking the Shaykhs who call to the Sunnah (away from "<i><a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a></i>" and "<i>harakah</i>") is to spread rumours that this Shaykh and that Shaykh "spoke ill" of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, or "hardly knows him" and so on, all childish antics from a bankrupt people whose entire Haraki manhaj was laid to waste by Shaykh al-Albaani, Shaykh <a href='tags/ibn-baaz.html' class='tagLink'><font class='tagLink'>Ibn Baaz</font></a> and Shaykh Ibn al-Uthaymeen before they passed away (rahimahumullaah) right at the end of the 20th century, ten years after these <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> Kharijiyyah  made their debut following the Gulf War. Today these same <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> declare those same scholars (despite having tried to use them and some of their statements to prop up and support their own figureheads and methodologies) as being "<i>revisionists</i>" after it finally dawned on these  newly-arisen foolish-minded deviants that none of these Scholars are with their figureheads, nor do they support their methodologies, rather their <b>final position</b> was to warn from their figureheads and their methodologies. Thus, these deviants took a new position which was to label all of the Scholars of Ahl al-Sunnah as "revisionists", and they did this after they realized, or at least some of them, that <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> is not alone in opposing them, but simply tha the was the first, and as time progressed and things became clearer to other scholars, they also spoke and took the same positions.</blockquote></div>    <P>
This was a conversation with a link-up in a mosque in <a href='tags/libya.html' class='tagLink'><font class='tagLink'>Libya</font></a> on 10th Safar 1433H. The audio is here:    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/luhaydan-1433-rabee.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<b>Text:</b>    <P>
<div class='arabic' align='right'>&#1587;&#1575;&#1574;&#1604; &#1610;&#1587;&#1571;&#1604; &#1608; &#1610;&#1602;&#1608;&#1604; :&#1610;&#1575; &#1588;&#1610;&#1582; &#1606;&#1585;&#1610;&#1583; &#1605;&#1606;&#1603;&#1605; &#1606;&#1589;&#1610;&#1581;&#1577; &#1604;&#1605;&#1606; &#1610;&#1591;&#1593;&#1606; &#1608;&#1610;&#1578;&#1603;&#1604;&#1605; &#1601;&#1610; &#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;  &#1603;&#1571;&#1605;&#1579;&#1575;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1608; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1610;&#1583; &#1575;&#1604;&#1580;&#1575;&#1576;&#1585;&#1610; &#1581;&#1601;&#1592;&#1607;&#1605;&#1575; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;.&#1567;    <P>
&#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1604;&#1581;&#1610;&#1583;&#1575;&#1606; : &#1605;&#1606;  &#1610;&#1591;&#1593;&#1606; &#1601;&#1610;&#1607;&#1605;&#1567;    <P>
&#1576;&#1593;&#1590; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1584;&#1610; &#1602;&#1583; &#1594;&#1585;&#1585; &#1576;&#1607; &#1608; &#1610;&#1578;&#1603;&#1604;&#1605;&#1608;&#1606; &#1593;&#1604;&#1609; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1585;&#1580;&#1604;&#1610;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610;&#1606; &#1576;&#1571;&#1606;&#1607;&#1605;&#1575;   &#1583;&#1593;&#1575;&#1577; &#1604;&#1604;&#1581;&#1586;&#1576;&#1610;&#1577; &#1608; &#1583;&#1593;&#1575;&#1577; &#1573;&#1604;&#1610; &#1578;&#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;     <P>
&#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1604;&#1581;&#1610;&#1583;&#1575;&#1606; : &#1571;&#1608;&#1604; &#1588;&#1610;&#1569; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1571;&#1606;&#1575; &#1571;&#1593;&#1585;&#1601;&#1607; &#1571;&#1603;&#1579;&#1585; &#1608; &#1571;&#1605;&#1575; &#1584;&#1575;&#1603;   &#1601;&#1605;&#1593;&#1585;&#1601;&#1578;&#1610; &#1576;&#1607; &#1605;&#1581;&#1583;&#1608;&#1583;&#1577; &#1604;&#1603;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1571;&#1593;&#1585;&#1601; &#1571;&#1606;&#1607; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1587;&#1604;&#1610;&#1605; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608; &#1578;&#1582;&#1585;&#1580; &#1605;&#1606; &#1575;&#1604;&#1580;&#1575;&#1605;&#1593;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1571;&#1610;&#1575;&#1605; &#1585;&#1574;&#1575;&#1587;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606;   &#1575;&#1586; &#1588;&#1610;&#1582;&#1606;&#1575; &#1585;&#1581;&#1605;&#1577; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1604;&#1604;&#1580;&#1575;&#1605;&#1593;&#1577;  &#1601;&#1607;&#1608; &#1608;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1605;&#1583; &#1605;&#1581;&#1604; &#1579;&#1602;&#1577; &#1608; &#1601;&#1610;&#1607; &#1582;&#1610;&#1585; &#1603;&#1579;&#1610;&#1585;&#1548; &#1608; &#1593;&#1604;&#1609; &#1601;&#1585;&#1590; &#1571;&#1606; &#1571;&#1610; &#1573;&#1606;&#1587;&#1575;&#1606; &#1610;&#1603;&#1608;&#1606; &#1601;&#1610;&#1607; &#1593;&#1610;&#1576; &#1605;&#1575; &#1601;&#1610;&#1607; &#1571;&#1581;&#1583; &#1605;&#1593;&#1589;&#1608;&#1605; &#1587;&#1608;&#1609; &#1605;&#1581;&#1605;&#1583;  &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1548; &#1608; &#1573;&#1606;&#1605;&#1575; &#1603;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604; &#1584;&#1575;&#1603; : &#1603;&#1601;&#1609; &#1575;&#1604;&#1605;&#1585;&#1569; &#1606;&#1576;&#1604;&#1575; &#1571;&#1606; &#1578;&#1593;&#1583; &#1605;&#1593;&#1575;&#1574;&#1576;&#1607;  &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1601;&#1571;&#1606;&#1575; &#1604;&#1575; &#1571;&#1593;&#1585;&#1601; &#1604;&#1607; &#1608; &#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1605;&#1583; &#1593;&#1610;&#1608;&#1576;.&#1575;.&#1607;&#1600;</div>    <P>
<b>Translation:</b>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>A questioner asks and says: O Shaykh, we desire advice from you for the one who reviles and speaks about the Scholars of Ahl al-Sunnah wal-Jamaa'ah such as the likes of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> bin Haadee al-Madkhalee and Shaykh Ubayd al-Jaabiree, may Allaah preserve them both.    <P>
<b>Shaykh al-Luhaydaan:</b> Who reviles them?    <P>
Some of the youth who have been deceived, they speak about those two notable men (and say) that they are callers to Hizbiyyah and callers to separation of the Muslims.    <P>
<b>Shaykh al-Luhaydaan:</b> First thing, <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> I know him more, as for the other (Shaykh), my acquaintance with him is limited, but <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>, I know that he is from the people of sound knowledge and <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, he graduated from the University of Madinah in the days Shaykh Abd al-Aziz  bin Baz was president, our Shaykh (may Allaah's mercy be upon him). He, and all praise is due to Allaah, takes the place of a thiqah (trustworthy one) and he has a lot of goodness. And accepting for argument's sake that a particular person has a particular fault, there is none who is infallible but Muhammad (sallallaahu alayhi wasallam), but (the affair) is like the one who says, "Sufficient nobility is it for a man that his faults can be counted." As for <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>, then I do not know of any faults for him, and all praise is due to Allaah.</blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/tpiqg-shaykh-al-luhaydan-they-harbour-malice-towards-shaykh-rabee.html">Shaykh al-Luhaydan: They Harbour Malice Towards Shaykh Rabee Because He Refutes the Opposers</a><BR>
//www.themadkhalis.com/md/?tpiqg<BR>

<li><a href="articles/fyfxl-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-4---shaykh-salih-al-luhaydaans-praise-of-shaykh-rabee-1433h.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 4 - Shaykh Salih al-Luhaydaan's Praise of Shaykh Rabee 1433H</a><BR>
//www.themadkhalis.com/md/?fyfxl<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?fyfxl by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:06 GMT -->
</html>


