




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ugyiy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:05 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | A Gift to Salman al-Awdah and Safar al-Hawali: Shaykh Salih al-Fawzan: Being Labelled with 'Jaamiyyah' is a Praise and a Tazkiyah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">A Gift to Salman al-Awdah and Safar al-Hawali: Shaykh Salih al-Fawzan: Being Labelled with 'Jaamiyyah' is a Praise and a Tazkiyah</span><BR>
Sunday, August 11 2013 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>  Shaykh Muhammad Amaan al-Jaamee (rahimahullaah) was one of the first of the Scholars of Madeenah to expose and stand up the Extremist <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> who emerged after the Gulf War attempting to bring the <a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a> of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> (<b>both <a href='tags/ashari.html' class='tagLink'><font class='tagLink'>Ash'ari</font></a> Sufis</b>) to the <a href='tags/saudi.html' class='tagLink'><font class='tagLink'>Saudi</font></a> masses. The Shaykh is a mountain in the field of the explanation of the Salafi <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and his explanations of the basic texts, are an absolute must for every student of knowledge who wants understanding and solid grounding.      <P>
When the Shaykh stood up to these Ikhwani stooges and opposition was shown to these mischief-makers by other Shaykhs and by Ahl al-Sunnah in general, they invented the label of 'Jaamiyyah' meaning followers of this Shaykh, and this was intended as a derogatory label. They did the same with <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> bin Haadee al-Madkhali, he was also instrumental, in fact the most instrumental, in exposing these Ikhwani stooges and their evil plots and designs for the <a href='tags/saudi.html' class='tagLink'><font class='tagLink'>Saudi</font></a> society (takfir and revolution). Alhamdulillaah, due to the efforts of these scholars, these Ikhwani stooges were apprehended and some of them spent a stretch in prison upon the recommendation of <a href='tags/shaykh-abd-al-aziz-bin-baz.html' class='tagLink'><font class='tagLink'>Shaykh Abd al-Aziz bin Baz</font></a> (rahimahullaah).  These two terms 'Jaamiyyah' (Jaamis) and 'Madkhaliyyah" (<a href='tags/madkhalis.html' class='tagLink'><font class='tagLink'>Madkhalis</font></a>) are used negatively to malign and attack the people of the Sunnah. These people have simply followed the way of the Ahl al-Bid'ah throughout history who attack Ahl al-Sunnah with names they devise themselves in order hinder people from the truth.    <P>
Below is a gift to the two Ikhwani stooges, <a href='tags/safar-al-hawali.html' class='tagLink'><font class='tagLink'>Safar al-Hawali</font></a> and <a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a> who were behind the invention of these labels to attack Ahl al-Sunnah, and also to their followers.   </blockquote></div>    <P>
<font class='titleHeadline'>Shaykh Salih al-Fawzan: Being Labelled with 'Jaamiyyah' is a Praise and a Tazkiyah</font>    <P>
Shaykh Salih <a href='tags/al-fawzaan.html' class='tagLink'><font class='tagLink'>al-Fawzaan</font></a> was asked a question about this label of 'Jaamiyyah' and his response is translated below (<a href=assets/audio/fawzan-jamia.mp3>audio file here</a>):     <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/fawzan-jamia.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<blockquote><div class='arabic' align='right'>&#1575;&#1604;&#1587;&#1575;&#1574;&#1604;: &#1610;&#1602;&#1608;&#1604; &#1571;&#1581;&#1587;&#1606; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1610;&#1603;&#1605; &#1604;&#1610; &#1586;&#1605;&#1610;&#1604; &#1604;&#1575; &#1610;&#1584;&#1603;&#1585; &#1581;&#1602;&#1608;&#1602; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1608;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1582;&#1608;&#1601;&#1575; &#1605;&#1606; &#1571;&#1606; &#1610;&#1587;&#1605;&#1610;&#1607; &#1575;&#1604;&#1591;&#1604;&#1575;&#1576; &#1576;&#1571;&#1606;&#1607; &#1580;&#1575;&#1605;&#1610; &#1605;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; &#1575;&#1604;&#1580;&#1575;&#1605;&#1610;&#1577; &#1601;&#1607;&#1604; &#1601;&#1593;&#1604;&#1607; &#1607;&#1584;&#1575; &#1589;&#1581;&#1610;&#1581; &#1593;&#1604;&#1605;&#1575; &#1571;&#1606;&#1607; &#1610;&#1602;&#1608;&#1604; &#1604;&#1575; &#1571;&#1585;&#1610;&#1583; &#1571;&#1606; &#1610;&#1578;&#1593;&#1585;&#1590; &#1571;&#1581;&#1583; &#1604;&#1593;&#1585;&#1590;&#1610;&#1567;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>Questioner:</b> He says, may Allaah be benevolent to you - "I have a companion who does not mention the ahaadeeth of the rights of the rulers and the ahaadeeth of hearing and obeying out of fear that the students might label him that he is a 'Jaami' from the sect of the 'Jaamiyyah'." So is this action of his correct with the knowledge that he says "I do not want anyone to attack my honour."</blockquote>    <P>
<blockquote><div class='arabic' align='right'>&#1575;&#1604;&#1588;&#1610;&#1582;: &#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1607;&#1584;&#1607; &#1605;&#1583;&#1581;&#1577; &#1604;&#1605;&#1606; &#1610;&#1587;&#1605;&#1608;&#1606;&#1607;&#1605; &#1576;&#1575;&#1604;&#1580;&#1575;&#1605;&#1610;&#1577; &#1571;&#1606;&#1607;&#1605; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1581;&#1579;&#1608;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1608;&#1575;&#1578;&#1576;&#1575;&#1593; &#1587;&#1606;&#1577; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1610;&#1606;&#1607;&#1608;&#1606; &#1593;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; ... &#1607;&#1584;&#1607; &#1578;&#1586;&#1603;&#1610;&#1577; &#1604;&#1605;&#1606; &#1610;&#1587;&#1605;&#1608;&#1606;&#1607;&#1605; &#1576;&#1575;&#1604;&#1580;&#1575;&#1605;&#1610;&#1577; &#1601;&#1571;&#1606;&#1578; &#1575;&#1587;&#1578;&#1605;&#1585; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1608;&#1604;&#1575; &#1593;&#1604;&#1610;&#1603; &#1605;&#1606; &#1575;&#1604;&#1571;&#1604;&#1602;&#1575;&#1576; &#1575;&#1578;&#1585;&#1603; &#1575;&#1604;&#1571;&#1604;&#1602;&#1575;&#1576; &#1575;&#1578;&#1585;&#1603; &#1575;&#1604;&#1578;&#1606;&#1575;&#1576;&#1586; &#1576;&#1575;&#1604;&#1571;&#1604;&#1602;&#1575;&#1576; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605; &#1608;&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1608;&#1587;&#1604;&#1605; &#1593;&#1604;&#1609; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1608;&#1593;&#1604;&#1609; &#1570;&#1604;&#1607; &#1608;&#1589;&#1581;&#1576;&#1607; &#1608;&#1587;&#1604;&#1605;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>The Shaykh:</b> All praise is due to Allaah, this is a praise for those whom they label as 'Jaamiyyah' in that they are the ones who encourage hearing and obeying and following the Sunnah of the Messenger (sallallaahu alayhi wasallam) and they prohibit from separation (splitting) ... this is a tazkiyah (commendation) for those whom they label as Jaamiyyah. So you should continue upon this and you should have nothing to do with labels, leave the labels, leave the use of condescending labels and Allah knows best, and may the prayers and salutations be upon Muhammad, his family and his companions.</blockquote>    <P>
So we say if commanding the people with the Sunnah in times of tribulations makes one a 'Jaami' then alhamdulillah, we are Jaamiyyah and if defending the honour of Mu'aawiyah, <a href='tags/abu-sufyan.html' class='tagLink'><font class='tagLink'>Abu Sufyan</font></a>,  and <a href='tags/hind.html' class='tagLink'><font class='tagLink'>Hind</font></a> (radiallaahu anhum) makes one a 'Madkhali' then alhamdulillaah we are Madkhalis! These Ikhwanis intend to revile the Sunnah in reality when they revile those whom they label as 'Jaamiyyah' because the 'Jaamiyyah' simply encourage with the Sunnah. And likewise, these people are lifting the veil (sitr) behind which <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> lie. Mu'aawiyah is the veil for <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>, whoever attacks <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> has opened the door for the rest of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a>. They do this by declaring anyone who refutes <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and defends Mu'aawiyah from being expelled from Islaam as being a 'Madkhali' hating and resenting that this Rafidi poison should be brought out  and made known to the Ummah and hating that his books should be abandoned!    <P>
    <P>
    <P>
    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/ugyiy-a-gift-to-salman-al-awdah-and-safar-al-hawali-shaykh-al-fawzan-on-the-jaamiyyah.html">A Gift to Salman al-Awdah and Safar al-Hawali: Shaykh Salih al-Fawzan: Being Labelled with 'Jaamiyyah' is a Praise and a Tazkiyah</a><BR>
//www.themadkhalis.com/md/?ugyiy<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ugyiy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:05 GMT -->
</html>


