




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ocbde by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</span><BR>
Saturday, December 19 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>The noble Shaykh, Muhammad Amaan al-Jaamee (rahimahullaah) was asked the following question regarding the da'wah of al-Ikhwaan al-Muslimeen, and <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> in particular:    <P>
<div class='arabic' align='right'>&#1601;&#1590;&#1610;&#1604;&#1577; &#1575;&#1604;&#1593;&#1604;&#1575;&#1605;&#1577; &#1583;. &#1605;&#1581;&#1605;&#1583; &#1570;&#1605;&#1575;&#1606; &#1576;&#1606; &#1593;&#1604;&#1610; &#1575;&#1604;&#1580;&#1575;&#1605;&#1610; : &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; : &#1584;&#1603;&#1585;&#1578; &#1583;&#1593;&#1608;&#1577; " &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; " &#1590;&#1605;&#1606; &#1575;&#1604;&#1583;&#1593;&#1608;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1601;&#1588;&#1604;&#1578; &#1605;&#1606;&#1584; &#1602;&#1610;&#1575;&#1605;&#1607;&#1575; &#1548; &#1608;&#1571;&#1606; &#1583;&#1593;&#1608;&#1577; " &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; " &#1604;&#1607;&#1575; &#1571;&#1603;&#1579;&#1585; &#1605;&#1606; &#1606;&#1589;&#1601; &#1602;&#1585;&#1606; &#1608;&#1607;&#1610; &#1601;&#1575;&#1588;&#1604;&#1577; ! &#1608;&#1604;&#1603;&#1606; &#1575;&#1587;&#1578;&#1605;&#1593;&#1578; &#1573;&#1604;&#1609; &#1571;&#1588;&#1585;&#1591;&#1577; &#1576;&#1593;&#1606;&#1608;&#1575;&#1606; : " &#1604;&#1602;&#1575;&#1569; &#1605;&#1593; &#1605;&#1580;&#1604;&#1577; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; " &#1548; &#1571;&#1580;&#1585;&#1610; &#1604;&#1602;&#1575;&#1569; &#1605;&#1606; &#1585;&#1574;&#1610;&#1587; &#1575;&#1604;&#1605;&#1580;&#1604;&#1577; &#1605;&#1593; &#1591;&#1575;&#1604;&#1576; &#1593;&#1604;&#1605; &#1548; &#1601;&#1580;&#1575;&#1569; &#1601;&#1610; &#1575;&#1604;&#1578;&#1581;&#1602;&#1610;&#1602; &#1548; &#1571;&#1608; &#1601;&#1610; &#1575;&#1604;&#1605;&#1602;&#1575;&#1576;&#1604;&#1577; : &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1593;&#1606; &#1583;&#1593;&#1608;&#1577; " &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; " . &#1608;&#1602;&#1575;&#1604; &#1591;&#1575;&#1604;&#1576; &#1575;&#1604;&#1593;&#1604;&#1605; - &#1575;&#1604;&#1584;&#1610; &#1610;&#1615;&#1606;&#1575;&#1602;&#1588; &#1605;&#1593; &#1607;&#1584;&#1575; &#1575;&#1604;&#1584;&#1610; &#1587;&#1574;&#1604; &#1593;&#1606; &#1583;&#1593;&#1608;&#1577; " &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; " - &#1548; &#1602;&#1575;&#1604; &#1593;&#1606; &#1583;&#1593;&#1608;&#1577; " &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; " &#1608;&#1605;&#1572;&#1587;&#1587;&#1607;&#1575; : ( &#1604;&#1608; &#1604;&#1605; &#1610;&#1603;&#1606; &#1604;&#1604;&#1588;&#1610;&#1582; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; - &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; - &#1605;&#1606; &#1575;&#1604;&#1601;&#1590;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1587;&#1608;&#1609; &#1571;&#1606;&#1607; &#1571;&#1582;&#1585;&#1580;&#1607;&#1605; &#1605;&#1606; &#1583;&#1608;&#1585; &#1575;&#1604;&#1605;&#1604;&#1575;&#1607;&#1610; &#1548; &#1608;&#1575;&#1604;&#1587;&#1610;&#1606;&#1605;&#1575; &#1548; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1548; &#1603;&#1575;&#1604;&#1605;&#1602;&#1575;&#1607;&#1610; &#1548; &#1608;&#1603;&#1578;&#1604;&#1607;&#1605; &#1608;&#1580;&#1605;&#1593;&#1607;&#1605; &#1593;&#1604;&#1609; &#1583;&#1593;&#1608;&#1577; &#1608;&#1575;&#1581;&#1583;&#1577; &#1571;&#1604;&#1575; &#1608;&#1607;&#1610; &#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1548; &#1604;&#1608; &#1604;&#1605; &#1610;&#1603;&#1606; &#1605;&#1606; &#1575;&#1604;&#1601;&#1590;&#1604; &#1573;&#1604;&#1575; &#1607;&#1584;&#1575; &#1604;&#1603;&#1601;&#1575;&#1607; &#1601;&#1590;&#1604;&#1575;&#1611; &#1608;&#1588;&#1585;&#1601;&#1611;&#1575; ) . &#1607;&#1584;&#1575; &#1605;&#1575; &#1589;&#1585;&#1581; &#1576;&#1607; &#1591;&#1575;&#1604;&#1576; &#1593;&#1604;&#1605; &#1603;&#1576;&#1610;&#1585; &#1604;&#1600; " &#1605;&#1580;&#1604;&#1577; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; " &#1567;</div>    <P>
The questioner is saying that he listened to a tape of a prominent student of knowledge associated with the Ikhaawnee magazine called "al-Mujtama'" in which this student of knowledge mentioned that had there not been any virtue of Shaykh <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> except that he removed them from the amusement centers and cinemas, that would have been enough as a virtue and excellence.    <P>
The Shaykh (rahimahullaah) responded:    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1580;&#1608;&#1575;&#1576; : &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1588;&#1582;&#1589; &#1593;&#1588;&#1578; &#1605;&#1593;&#1607; &#1601;&#1578;&#1585;&#1577; &#1605;&#1606; &#1575;&#1604;&#1586;&#1605;&#1606; &#1605;&#1578;&#1580;&#1575;&#1608;&#1585;&#1610;&#1606; &#1548; &#1608;&#1605;&#1578;&#1586;&#1575;&#1605;&#1604;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1593;&#1605;&#1604; &#1548; &#1575;&#1604;&#1584;&#1610; &#1571;&#1593;&#1585;&#1601;&#1607; &#1605;&#1606;&#1607; : &#1582;&#1604;&#1575;&#1601; &#1605;&#1575; &#1584;&#1603;&#1585; &#1575;&#1604;&#1570;&#1606; ! &#1606;&#1578;&#1585;&#1603;&#1607; &#1607;&#1608; ! &#1601;&#1603;&#1604;&#1606;&#1575; &#1606;&#1593;&#1604;&#1605; &#1583;&#1593;&#1608;&#1577; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; : &#1589;&#1581;&#1610;&#1581; &#1571;&#1606;&#1607; &#1571;&#1582;&#1585;&#1580; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1575;&#1574;&#1607;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1605;&#1602;&#1575;&#1607;&#1610; &#1548; &#1608;&#1605;&#1606; &#1583;&#1608;&#1585; &#1575;&#1604;&#1587;&#1610;&#1606;&#1605;&#1575; &#1607;&#1584;&#1575; &#1588;&#1610;&#1569; &#1604;&#1575; &#1610;&#1615;&#1606;&#1603;&#1585; &#1548; &#1610;&#1584;&#1603;&#1585;&#1607; &#1603;&#1604; &#1605;&#1606; &#1610;&#1593;&#1585;&#1601; &#1548; &#1604;&#1603;&#1606; &#1576;&#1593;&#1583; &#1571;&#1606; &#1571;&#1582;&#1585;&#1580;&#1607;&#1605; &#1605;&#1606; &#1578;&#1604;&#1603; &#1575;&#1604;&#1571;&#1605;&#1603;&#1606;&#1577; &#1548; &#1605;&#1606; &#1578;&#1604;&#1603; &#1575;&#1604;&#1571;&#1605;&#1575;&#1603;&#1606; &#1605;&#1575;&#1584;&#1575; &#1601;&#1593;&#1604; &#1605;&#1593;&#1607;&#1605; !&#1567; &#1607;&#1604; &#1583;&#1593;&#1575;&#1607;&#1605; &#1576;&#1571;&#1587;&#1604;&#1608;&#1576; &#1608;&#1576;&#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569; !&#1567; &#1571;&#1605; &#1606;&#1602;&#1604;&#1607;&#1605; &#1548; &#1601;&#1580;&#1605;&#1593;&#1607;&#1605; &#1548; &#1601;&#1578;&#1601;&#1585;&#1602;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1591;&#1585;&#1602; &#1575;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577; : &#1603;&#1571;&#1606;&#1607;&#1605; &#1606;&#1602;&#1604;&#1607;&#1605; &#1605;&#1606; &#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1573;&#1604;&#1609; &#1580;&#1575;&#1607;&#1604;&#1610;&#1577; ! &#1604;&#1605; &#1610;&#1606;&#1602;&#1604;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1605;&#1601;&#1607;&#1608;&#1605; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1548; &#1608;&#1603;&#1575;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1606;&#1601;&#1587;&#1607; &#1604;&#1607; &#1591;&#1585;&#1610;&#1602;&#1577; &#1548; &#1591;&#1585;&#1610;&#1602;&#1577; &#1589;&#1608;&#1601;&#1610;&#1577; ! &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1606;&#1602;&#1604;&#1607;&#1605; &#1605;&#1606; &#1583;&#1608;&#1585; &#1575;&#1604;&#1587;&#1610;&#1606;&#1605;&#1575; &#1548; &#1573;&#1605;&#1575; &#1575;&#1593;&#1578;&#1606;&#1602;&#1608;&#1575; &#1591;&#1585;&#1610;&#1602;&#1578;&#1607; &#1548; &#1571;&#1608; &#1591;&#1585;&#1602; &#1571;&#1582;&#1585;&#1609; ! &#1608;&#1607;&#1604; &#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1581;&#1587;&#1606; &#1575;&#1604;&#1576;&#1606;&#1575; &#1602;&#1590;&#1578; &#1593;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1577; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1606;&#1611;&#1575; &#1601;&#1610; &#1576;&#1604;&#1583;&#1607; !&#1567; &#1608;&#1607;&#1604; &#1571;&#1582;&#1585;&#1580; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1591;&#1608;&#1575;&#1601; &#1576;&#1575;&#1604;&#1571;&#1590;&#1585;&#1581;&#1577; : &#1601;&#1610; &#1590;&#1585;&#1610;&#1581; &#1575;&#1604;&#1581;&#1587;&#1610;&#1606; &#1548; &#1608;&#1586;&#1610;&#1606;&#1576; &#1548; &#1608;&#1575;&#1604;&#1576;&#1583;&#1608;&#1610; !&#1567; &#1608;&#1607;&#1604; &#1571;&#1582;&#1585;&#1580; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1581;&#1603;&#1605; &#1575;&#1604;&#1583;&#1610;&#1605;&#1602;&#1585;&#1575;&#1591;&#1610; &#1573;&#1604;&#1609; &#1581;&#1603;&#1605; &#1575;&#1604;&#1604;&#1607; !&#1567; &#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1588;&#1585;&#1593; &#1548; &#1604;&#1608; &#1603;&#1575;&#1606;&#1578; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1580;&#1575;&#1569;&#1578; &#1607;&#1603;&#1584;&#1575; &#1548; &#1578;&#1603;&#1608;&#1606; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1577; .    <P>
&#1571;&#1605;&#1575; &#1575;&#1604;&#1578;&#1580;&#1605;&#1593; &#1575;&#1604;&#1587;&#1610;&#1575;&#1587;&#1610; &#1548; &#1608;&#1575;&#1604;&#1581;&#1585;&#1603;&#1575;&#1578; &#1575;&#1604;&#1605;&#1606;&#1575;&#1601;&#1587;&#1577; &#1604;&#1604;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; &#1548; &#1608;&#1575;&#1604;&#1571;&#1581;&#1586;&#1575;&#1576; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; &#1548; &#1608;&#1610;&#1603;&#1578;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1594;&#1604;&#1575;&#1601; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; !! &#1608;&#1604;&#1610;&#1587; &#1601;&#1610; &#1583;&#1575;&#1582;&#1604; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1588;&#1610;&#1569; &#1570;&#1582;&#1585; !! &#1581;&#1585;&#1603;&#1577; &#1587;&#1610;&#1575;&#1587;&#1610;&#1577; &#1605;&#1586;&#1585;&#1603;&#1588;&#1577; . &#1604;&#1610;&#1587;&#1578; &#1607;&#1584;&#1607; &#1583;&#1593;&#1608;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; . &#1610;&#1593;&#1604;&#1605; &#1603;&#1604; &#1591;&#1575;&#1604;&#1576; &#1593;&#1604;&#1605; &#1583;&#1585;&#1587; &#1605;&#1584;&#1603;&#1585;&#1578;&#1607; &#1548; &#1608;&#1605;&#1575; &#1578;&#1581;&#1583;&#1579; &#1601;&#1610;&#1607; &#1593;&#1606; &#1606;&#1601;&#1587;&#1607; &#1605;&#1606; &#1578;&#1580;&#1608;&#1604;&#1607; &#1605;&#1606; &#1590;&#1585;&#1610;&#1581; &#1573;&#1604;&#1609; &#1590;&#1585;&#1610;&#1581; &#1548; &#1607;&#1608; &#1606;&#1601;&#1587;&#1607; &#1610;&#1581;&#1583;&#1579; &#1593;&#1606; &#1606;&#1601;&#1587;&#1607; &#1578;&#1585;&#1583;&#1583;&#1607; &#1573;&#1604;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1590;&#1585;&#1581;&#1577; !!    <P>
&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1607;&#1608; &#1606;&#1601;&#1587;&#1607; &#1604;&#1605; &#1610;&#1589;&#1604; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1605;&#1601;&#1607;&#1608;&#1605; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1573;&#1604;&#1609; &#1605;&#1602;&#1575;&#1591;&#1593;&#1577; &#1575;&#1604;&#1571;&#1590;&#1585;&#1581;&#1577; &#1548; &#1608;&#1605;&#1581;&#1575;&#1585;&#1576;&#1577; &#1605;&#1606; &#1610;&#1591;&#1608;&#1601; &#1576;&#1607;&#1575; &#1548; &#1608;&#1583;&#1593;&#1608;&#1578;&#1607;&#1605; &#1608;&#1575;&#1585;&#1588;&#1575;&#1583;&#1607;&#1605; &#1548; &#1576;&#1604; &#1607;&#1608; &#1606;&#1601;&#1587;&#1607; &#1610;&#1601;&#1593;&#1604; &#1603;&#1605;&#1575; &#1610;&#1601;&#1593;&#1604; &#1575;&#1604;&#1593;&#1608;&#1575;&#1605; !! &#1605;&#1575;&#1584;&#1575; &#1601;&#1593;&#1604; &#1576;&#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1605;&#1604;&#1575;&#1607;&#1610; !&#1567;    <P>
&#1607;&#1584;&#1575; &#1610;&#1584;&#1603;&#1585;&#1606;&#1610; &#1605;&#1575; &#1578;&#1583;&#1593;&#1610; &#1575;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577; : " &#1571;&#1606;&#1607;&#1605; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1571;&#1583;&#1582;&#1604;&#1608;&#1575; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1601;&#1610; &#1575;&#1604;&#1602;&#1575;&#1585;&#1577; &#1575;&#1604;&#1573;&#1601;&#1585;&#1610;&#1602;&#1610;&#1577; " ! &#1608;&#1604;&#1610; &#1585;&#1583; &#1601;&#1610; &#1576;&#1593;&#1590; &#1605;&#1581;&#1575;&#1590;&#1585;&#1575;&#1578;&#1610; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; !  &#1575;&#1604;&#1580;&#1608;&#1575;&#1576; : &#1571;&#1606;&#1607;&#1605; &#1606;&#1602;&#1604;&#1608;&#1575; &#1576;&#1593;&#1590; &#1575;&#1604;&#1608;&#1579;&#1606;&#1610;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1571;&#1601;&#1575;&#1585;&#1601;&#1577; &#1605;&#1606; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1588;&#1580;&#1575;&#1585; &#1608;&#1575;&#1604;&#1571;&#1581;&#1580;&#1575;&#1585; &#1573;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1576;&#1588;&#1585; !! &#1571;&#1582;&#1585;&#1580;&#1608;&#1607;&#1605; &#1605;&#1606; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1580;&#1605;&#1575;&#1583;&#1575;&#1578; &#1573;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1577; &#1605;&#1588;&#1575;&#1610;&#1582; &#1575;&#1604;&#1591;&#1585;&#1602; !! &#1604;&#1575; &#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1605;&#1593;&#1576;&#1608;&#1583; &#1581;&#1580;&#1585;&#1611;&#1575; &#1548; &#1571;&#1608;&#1588;&#1580;&#1585;&#1611;&#1575; &#1548; &#1571;&#1608; &#1575;&#1606;&#1587;&#1575;&#1606;&#1611;&#1575; &#1548; &#1571;&#1608; &#1580;&#1606;&#1610;&#1611;&#1575; &#1548; &#1571;&#1608; &#1605;&#1604;&#1603;&#1611;&#1575; . &#1604;&#1571;&#1606; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1575; &#1578;&#1603;&#1608;&#1606; &#1573;&#1604;&#1575; &#1604;&#1604;&#1607; .  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>The Answer:</b> And this individual, I lived close to him for a period of time, and we were companions together in work and that which I know from him is different to what is mentioned now. Let's leave him!     <P>
For all of us know the da'wah of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a>. It is correct that he removed the straying youth from the cafes, and from the cinemas, this is not rejected. Everyone who knows mentions this. However, after he took them out of those places, from those places, what did he do with them? Did he invite them with the manner, with the da'wah of the Prophets?! Or did he just transfer them, gather them, and then separated into the <a href='tags/soofee.html' class='tagLink'><font class='tagLink'>Soofee</font></a> Tariqahs. It is as if he transferred them from one <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>jaahiliyyah</font></a> to another jaahiliyyah! He did not transfer them to the correct understanding of Islaam. And the Shaykh himself used to have a tariqah, a <a href='tags/soofee.html' class='tagLink'><font class='tagLink'>Soofee</font></a> tariqah! And those ones that he transfered from the cinemans, they either adopted his tariqah or other tariqahs!     <P>
And did the da'wah of Shaykh <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> judge against the worship of other than Allaah, openly in his town?! And did he take the people away from making tawaaf around the tombs, the tomb of al-Husain, and Zaynab and al-Badawi?! And did he take the people away from the democratic rule to the rule of Allaah?! This is the legislation (i.e. the call to Tawheed). If the da'wah had come like this it would have been a correct Islamic da'wah.    <P>
As for political gathering, and movements competing with other jamaa'aat, and other parties, and then writing Islam on the book cover, yet it is not inside the book. This Islaam is something else! It is an embroidered (embellished) political movement, this is not the call to Islaam. Every student of knowledge who has studied his Mudhakkirah knows, and what he says about himself of his excursion from one tomb to another tomb, he himself speaks about his frequenting some of the tombs!    <P>
If he himself did not reach [that] level of knowledge and knowing the correct understanding of Islaam leading to cutting off [attachment to] the tombs, and warring against those who make tawaaf around them, calling them and guiding them, rather, he himself does just as the common-people do!! Then what did he do with the people [frequenting] amusement centers?!    <P>
This reminds me of what the Soofees claim: That they are the onees who entered Islaam into the African peninsula! And I have a reply to them in some of my lectures to this question. The answer is that they transfered some of the idol-worshippers of Africa, from worshipping trees and stones to worshipping men!! They removed them from worshipping inanimate things to the worship of the Mashaayikh of the Tariqahs! There is no difference between a deity being a stone, or a tree, or a person, or a jinn, or an angel. Because worship is not [for any] but Allaah [alone].</blockquote>    <P>
From the cassette "<i>Twenty-Seven Question About the Salafi Da'wah</i>", posted on <a href=http://www.sahab.net/>Sahab.Net</a>.   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a><BR>
//www.themadkhalis.com/md/?oyama<BR>

<li><a href="articles/cxjxj-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-3---ayatollah-kaashaani-of-the-rafidi-state-of-iran.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 3 - Ayatollah Kaashaani of the Rafidi State of Iran</a><BR>
//www.themadkhalis.com/md/?cxjxj<BR>

<li><a href="articles/ztutj-hasan-al-banna-and-the-raafidah-shiah-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 2 - Striving for Unification With The Rafidah</a><BR>
//www.themadkhalis.com/md/?ztutj<BR>

<li><a href="articles/mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a><BR>
//www.themadkhalis.com/md/?mgrwe<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/oeinz-hasan-al-banna-and-unity-with-the-rafidi-shiites-part-1.html">Hasan al-Banna and Unity With the Rafidi Shi'ites: Part 1 - Ahl us-Sunnah and the Shiah are the Same, Upon Purity, United by the Kalimah</a><BR>
//www.themadkhalis.com/md/?oeinz<BR>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/gbmok-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-4.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 4 - Calling For Unity Between the Rafidah and the Sunnah</a><BR>
//www.themadkhalis.com/md/?gbmok<BR>

<li><a href="articles/lcwli-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-3.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 3 - Witnessing Grave Worship and Travelling Twenty Kilometres to the Tombs of ad-Dusuqi and Sinjar</a><BR>
//www.themadkhalis.com/md/?lcwli<BR>

<li><a href="articles/hkqct-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-2.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 2 - Major Shirk</a><BR>
//www.themadkhalis.com/md/?hkqct<BR>

<li><a href="articles/vdcip-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwid-hasan-al-banna---part-1.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?vdcip<BR>

<li><a href="articles/ocbde-shaykh-muhammad-aamaan-al-jaamee-on-the-dawah-of-hassan-al-bannaa.html">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</a><BR>
//www.themadkhalis.com/md/?ocbde<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?ocbde by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


