




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oquxs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Abdul-Lateef bin Abdur-Rahmaan Aal ash-Shaykh: It Is Forbidden To Pass a Judgement Based Upon Other Than the Sharee'ah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Abdul-Lateef bin Abdur-Rahmaan Aal ash-Shaykh: It Is Forbidden To Pass a Judgement Based Upon Other Than the Sharee'ah</span><BR>
Saturday, December 19 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>The Allaamah, Shaikh Abdul-Lateef bin Abdur-Rahmaan Aal ash-Shaikh, saidL    <P>
<div class='arabic' align='right'>&#1608;&#1573;&#1606;&#1605;&#1575; &#1610;&#1581;&#1585;&#1605; &#1575;&#1604;&#1578;&#1581;&#1603;&#1610;&#1605; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1578;&#1606;&#1583; &#1573;&#1604;&#1609; &#1588;&#1585;&#1610;&#1593;&#1577; &#1576;&#1575;&#1591;&#1604;&#1577; &#1578;&#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577;&#1548; &#1603;&#1571;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1610;&#1608;&#1606;&#1575;&#1606; &#1608;&#1575;&#1604;&#1573;&#1601;&#1585;&#1606;&#1580; &#1608;&#1575;&#1604;&#1578;&#1578;&#1585; &#1608;&#1602;&#1608;&#1575;&#1606;&#1610;&#1606;&#1607;&#1605; &#1575;&#1604;&#1578;&#1610; &#1605;&#1589;&#1583;&#1585;&#1607;&#1575; &#1570;&#1585;&#1575;&#1572;&#1607;&#1605; &#1608;&#1571;&#1607;&#1608;&#1575;&#1572;&#1607;&#1605;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1587;&#1608;&#1575;&#1604;&#1601; &#1575;&#1604;&#1576;&#1575;&#1583;&#1610;&#1577; &#1608;&#1593;&#1575;&#1583;&#1575;&#1578;&#1607;&#1605; &#1575;&#1604;&#1580;&#1575;&#1585;&#1610;&#1577;. &#1601;&#1605;&#1606; &#1575;&#1587;&#1578;&#1581;&#1604; &#1575;&#1604;&#1581;&#1603;&#1605; &#1576;&#1607;&#1584;&#1575; &#1601;&#1610; &#1575;&#1604;&#1583;&#1605;&#1575;&#1569; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607;&#1575; &#1601;&#1607;&#1608; &#1603;&#1575;&#1601;&#1585;. &#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;: {&#1608;&#1614;&#1605;&#1614;&#1606;&#1618; &#1604;&#1614;&#1605;&#1618; &#1610;&#1614;&#1581;&#1618;&#1603;&#1615;&#1605;&#1618; &#1576;&#1616;&#1605;&#1614;&#1575; &#1571;&#1614;&#1606;&#1618;&#1586;&#1614;&#1604;&#1614; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1615; &#1601;&#1614;&#1571;&#1615;&#1608;&#1604;&#1614;&#1574;&#1616;&#1603;&#1614; &#1607;&#1615;&#1605;&#1615; &#1575;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1615;&#1608;&#1606;&#1614;} [&#1575;&#1604;&#1605;&#1575;&#1574;&#1583;&#1577;: &#1605;&#1606; &#1575;&#1604;&#1570;&#1610;&#1577;44]&#1548; &#1608;&#1607;&#1584;&#1607; &#1575;&#1604;&#1570;&#1610;&#1577; &#1584;&#1603;&#1585; &#1601;&#1610;&#1607;&#1575; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1601;&#1587;&#1585;&#1610;&#1606;: &#1571;&#1606; &#1575;&#1604;&#1603;&#1601;&#1585; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1607;&#1606;&#1575; &#1603;&#1601;&#1585; &#1583;&#1608;&#1606; &#1575;&#1604;&#1603;&#1601;&#1585; &#1575;&#1604;&#1571;&#1603;&#1576;&#1585;&#1548; &#1604;&#1571;&#1606;&#1607;&#1605; &#1601;&#1607;&#1605;&#1608;&#1575; &#1571;&#1606;&#1607;&#1575; &#1578;&#1578;&#1606;&#1575;&#1608;&#1604; &#1605;&#1606; &#1581;&#1603;&#1605; &#1576;&#1594;&#1610;&#1585; &#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1607;&#1608; &#1594;&#1610;&#1585; &#1605;&#1587;&#1578;&#1581;&#1604; &#1604;&#1584;&#1604;&#1603;&#1548; &#1604;&#1603;&#1606;&#1607;&#1605; &#1610;&#1578;&#1606;&#1575;&#1586;&#1593;&#1608;&#1606; &#1601;&#1610; &#1593;&#1605;&#1608;&#1605;&#1607;&#1575; &#1604;&#1604;&#1605;&#1587;&#1578;&#1581;&#1604;&#1548; &#1608;&#1571;&#1606; &#1603;&#1601;&#1585;&#1607; &#1605;&#1582;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Tahkeem (judgement) is unlawful when [the judgement] is based upon a false (baatil) Sharee'ah which opposes the Book and the Sunnah, such as the laws of the Greeks (Ahkaam Yoonaan) and those of Europe, and those of the Tartars, and their various legislative codes (<a href='tags/qawaaneen.html' class='tagLink'><font class='tagLink'>Qawaaneen</font></a>) the source of which are their own opinions and desires. Similar to this are the various cultural and customary practices of the Bedouins. Hence, whoever made it lawful to judge (istahalla) by [any of] this in the issues pertaining to blood, or other than it is a Kaafir. Allaah the Most High said, "<b>And whosoever does not judge by what Allaah has revealed, they are the Unbelievers</b>" (5:44). And concerning this verse, some of the Mufassiroon have said that the kufr intended here is the kufr that is lesser than the Major kufr (kufr doona kufr al-akbar), because they understood that this verse applies to whoever judges by other than what Allaah has revealed but does not make that lawful (ghayr mustahill). But they dispute amongst themselves regarding its application in general to the mustahill (one who makes it lawful), and that the kufr in this case is the one that expels from the religion.</blockquote>    <P>
Source: <i>Minhaaj ut-Ta'sees wat-Taqdees Fi ar-Radd alaa Shubuhaat Daawud bin Jarjees</i>, (p.71).    <P>
<b>Note:</b> In the various statements of the scholars on this subject it is important to note that in their speech they cover and describe many different situations, including:    <P>
<ul><li> Judging in an issue with other than what Allaah revealed out of hawaa (desire)  <li>Ruling by <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> to varying degrees (in one issue, a few issues or numerous issues)  <li> Removing the Sharee'ah as a whole, completely, or the vast majority of it, and replacing it with secular laws</ul>    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/hcjdf-shaykh-abdul-azeez-ar-raajihee-on-ruling-by-other-than-what-allaah-revealed-and-the-secular-laws.html">Shaykh Abdul-Azeez ar-Raajihee on Ruling By Other Than What Allaah Revealed and The Secular Laws</a><BR>
//www.themadkhalis.com/md/?hcjdf<BR>

<li><a href="articles/umssw-shaykh-ibn-jibreen-on-what-is-manifest-clear-kufr-and-ruling-with-the-secular--laws.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen on What is Manifest Clear Kufr and Ruling With the Secular  Laws</a><BR>
//www.themadkhalis.com/md/?umssw<BR>

<li><a href="articles/tlafh-shaykh-abdul-azeez-ar-raajihee-on-ruling-by-the-secular-laws-and-altering-the-entire-religion-deen.html">Shaykh Abdul-Azeez ar-Raajihee on Ruling by the Secular Laws and Altering the Entire Religion (Deen)</a><BR>
//www.themadkhalis.com/md/?tlafh<BR>

<li><a href="articles/oquxs-abdul-lateef-bin-abdur-rahmaan-aal-ash-shaykh-it-is-forbidden-to-pass-a-judgement-based-upon-a-baatil-shareeah.html">Abdul-Lateef bin Abdur-Rahmaan Aal ash-Shaykh: It Is Forbidden To Pass a Judgement Based Upon Other Than the Sharee'ah</a><BR>
//www.themadkhalis.com/md/?oquxs<BR>

<li><a href="articles/gvyyn-shaykh-salih-al-fawzaan-on-removing-the-shareeah-in-its-entirety-and-placing-secular-law-in-its-place.html">Shaykh Salih al-Fawzaan on Removing the Sharee'ah In Its Entirety and Placing Secular Law in Its Place</a><BR>
//www.themadkhalis.com/md/?gvyyn<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oquxs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
</html>


