




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?akaka by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Words of Ibn Taymiyyah In Refutation of the Extremism of Mawdudi and Sayyid Qutb on the Issue of Taa'ah (Obedience)</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Words of Ibn Taymiyyah In Refutation of the Extremism of Mawdudi and Sayyid Qutb on the Issue of Taa'ah (Obedience)</span><BR>
Saturday, December 19 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Refer to <a href=index25d5.html?zlzrg>the previous article</a> regarding the <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> in making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> on the issue of obedience, and Abu A'laa <a href='tags/mawdudi.html' class='tagLink'><font class='tagLink'>Mawdudi</font></a> had a similar type of exaggeration in his speech regarding taa'ah (obedience).    <P>
Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> clarified the issue of obedience in "Kitaab ul-Eemaan" (p. 70):    <P>
<div class='arabic' align='right'>&#1608;&#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1571;&#1581;&#1576;&#1575;&#1585;&#1607;&#1605; &#1608;&#1585;&#1607;&#1576;&#1575;&#1606;&#1607;&#1605; &#1571;&#1585;&#1576;&#1575;&#1576;&#1575; - &#1581;&#1610;&#1579; &#1571;&#1591;&#1575;&#1593;&#1608;&#1607;&#1605; &#1601;&#1610; &#1578;&#1581;&#1604;&#1610;&#1604; &#1605;&#1575; &#1581;&#1585;&#1605; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1581;&#1585;&#1610;&#1605; &#1605;&#1575; &#1571;&#1581;&#1604; &#1575;&#1604;&#1604;&#1607; &#1610;&#1603;&#1608;&#1606;&#1608;&#1606; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607;&#1610;&#1606; : ( &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; ) : &#1571;&#1606; &#1610;&#1593;&#1604;&#1605;&#1608;&#1575; &#1571;&#1606;&#1607;&#1605; &#1576;&#1583;&#1604;&#1608;&#1575; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610;&#1578;&#1576;&#1593;&#1608;&#1606;&#1607;&#1605; &#1593;&#1604;&#1609; &#1575;&#1604;&#1578;&#1576;&#1583;&#1610;&#1604; &#1601;&#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1606; &#1578;&#1581;&#1604;&#1610;&#1604; &#1605;&#1575; &#1581;&#1585;&#1605; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1581;&#1585;&#1610;&#1605; &#1605;&#1575; &#1571;&#1581;&#1604; &#1575;&#1604;&#1604;&#1607; &#1575;&#1578;&#1576;&#1575;&#1593;&#1575; &#1604;&#1585;&#1572;&#1587;&#1575;&#1574;&#1607;&#1605; &#1605;&#1593; &#1593;&#1604;&#1605;&#1607;&#1605; &#1571;&#1606;&#1607;&#1605; &#1582;&#1575;&#1604;&#1601;&#1608;&#1575; &#1583;&#1610;&#1606; &#1575;&#1604;&#1585;&#1587;&#1604; &#1601;&#1607;&#1584;&#1575; &#1603;&#1601;&#1585; &#1608;&#1602;&#1583; &#1580;&#1593;&#1604;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1588;&#1585;&#1603;&#1575; - &#1608;&#1573;&#1606; &#1604;&#1605; &#1610;&#1603;&#1608;&#1606;&#1608;&#1575; &#1610;&#1589;&#1604;&#1608;&#1606; &#1604;&#1607;&#1605; &#1608;&#1610;&#1587;&#1580;&#1583;&#1608;&#1606; &#1604;&#1607;&#1605; - &#1601;&#1603;&#1575;&#1606; &#1605;&#1606; &#1575;&#1578;&#1576;&#1593; &#1594;&#1610;&#1585;&#1607; &#1601;&#1610; &#1582;&#1604;&#1575;&#1601; &#1575;&#1604;&#1583;&#1610;&#1606; &#1605;&#1593; &#1593;&#1604;&#1605;&#1607; &#1571;&#1606;&#1607; &#1582;&#1604;&#1575;&#1601; &#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1575;&#1593;&#1578;&#1602;&#1583; &#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1584;&#1604;&#1603; &#1583;&#1608;&#1606; &#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; ; &#1605;&#1588;&#1585;&#1603;&#1575; &#1605;&#1579;&#1604; &#1607;&#1572;&#1604;&#1575;&#1569; . &#1608; ( &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; ) : &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607;&#1605; &#1608;&#1573;&#1610;&#1605;&#1575;&#1606;&#1607;&#1605; &#1576;&#1578;&#1581;&#1585;&#1610;&#1605; &#1575;&#1604;&#1581;&#1604;&#1575;&#1604; &#1608;&#1578;&#1581;&#1604;&#1610;&#1604; &#1575;&#1604;&#1581;&#1585;&#1575;&#1605; &#1579;&#1575;&#1576;&#1578;&#1575; &#1604;&#1603;&#1606;&#1607;&#1605; &#1571;&#1591;&#1575;&#1593;&#1608;&#1607;&#1605; &#1601;&#1610; &#1605;&#1593;&#1589;&#1610;&#1577; &#1575;&#1604;&#1604;&#1607; &#1603;&#1605;&#1575; &#1610;&#1601;&#1593;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1605;&#1575; &#1610;&#1601;&#1593;&#1604;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1593;&#1575;&#1589;&#1610; &#1575;&#1604;&#1578;&#1610; &#1610;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606;&#1607;&#1575; &#1605;&#1593;&#1575;&#1589; ; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1604;&#1607;&#1605; &#1581;&#1603;&#1605; &#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1584;&#1606;&#1608;&#1576; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And those who have taken their priests and rabbis as lords, when they obeyed them in their making lawful what Allaah had made unlawful, and making unlawful what Allaah had made lawful, then they are of two types:     <P>
<u>The first of them:</u> that they know that they (the priests and rabbis) have made <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>Tabdeel</font></a> (baddaloo) the religion of Allaah and hence they follow them in this <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>Tabdeel</font></a> believing (ya'taqidoona) in the lawfulness of what Allaah had made unlawful and in the unlawfulness of what Allaah had made lawful, following their leaders in that, alongside their knowledge that they have opposed the religion of the Messengers, then this is kufr (disbelief), and Allaah and His Messenger have also made it <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> - even if they (the followers) do not prayer or prostrate to them. Hence, whoever followed someone else in something that opposes the religion while knowing that it opposes the religion, and believes (i'taqada) in what he said, as opposed to what Allaah and His Messenger said, then such a one is a Mushrik, just like them.     <P>
<u>And the second type:</u> that their belief (i'tiqaad) and <a href='tags/faith.html' class='tagLink'><font class='tagLink'>Faith</font></a> (<a href='tags/imaan.html' class='tagLink'><font class='tagLink'>Imaan</font></a>) in the lawfulness of what is lawful and the unlawfulness of what is unlawful is established, however, the follow them (the priests and rabbis) in disobedience to Allaah, just as a Muslim does when he commits a sin and believes that he is a sinner, so these ones have the same ruling as those like them from the people of sin.</blockquote>    <P>
And this is one of the many doubts used by the followers, allies and defenders of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, in eliciting <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/nsvug-sayyid-qutb-and-cultivation-upon-sufism-tasawwuf-and-its-works-part-2.html">Sayyid Qutb and Cultivation Upon Sufism, Tasawwuf and Its Works: Part 2</a><BR>
//www.themadkhalis.com/md/?nsvug<BR>

<li><a href="articles/weevg-sayyid-qutb-and-the-sufi-family-cultivation.html">Sayyid Qutb and Cultivation Upon Sufism, Tasawwuf and Its Works: Part 1</a><BR>
//www.themadkhalis.com/md/?weevg<BR>

<li><a href="articles/dsopw-imaam-muqbil-bin-haadee-al-waadiee-qutb-jamaaat-ut-takfir-zilal-milestones.html">Imaam Muqbil bin Haadee al-Waadi'ee: A Beginner Who Reads the Books of Qutb Will Not Perceive After Only a Few Days that He Has Become Amongst the Jamaa'at ut-Takfir</a><BR>
//www.themadkhalis.com/md/?dsopw<BR>

<li><a href="articles/iywsi-shaykh-salih-al-fawzan-demolishes-the-doubts-of-the-qutbiyyah-kharijiyyah-regarding-obedience-takfir-and-revolt.html">Shaykh Salih al-Fawzan Demolishes the Doubts of the Qutbiyyah Kharijiyyah Regarding Obedience, Takfir and Revolt</a><BR>
//www.themadkhalis.com/md/?iywsi<BR>

<li><a href="articles/pewxy-do-sayyid-qutb-and-hasan-al-banna-compare-to-the-great-hadith-scholars-ibn-hajar-al-asqalani-and-an-nawawi-part-2.html">Do Sayyid Qutb and Hasan al-Banna Compare to the Great Hadith Scholars Ibn Hajar al-Asqalani and an-Nawawi? Part 2</a><BR>
//www.themadkhalis.com/md/?pewxy<BR>

<li><a href="articles/rangs-do-sayyid-qutb-and-hasan-al-banna-compare-to-ibn-hajr-al-asqalani-and-an-nawawi.html">Do Sayyid Qutb and Hasan al-Banna Compare to the Great Hadith Scholars Ibn Hajar al-Asqalani and an-Nawawi? Part 1</a><BR>
//www.themadkhalis.com/md/?rangs<BR>

<li><a href="articles/fiohb-shaykh-salih-al-fawzaan-on-the-tafsir-of-sayyid-qutb-fee-zilaal-il-quran.html">Shaykh Salih al-Fawzaan on the Tafsir of Sayyid Qutb, 'Fee Zilaal il-Quran'</a><BR>
//www.themadkhalis.com/md/?fiohb<BR>

<li><a href="articles/akaka-ibn-taymiyyahs-refutation-of-the-extremism-of-mawdudi-and-sayyid-qutb-on-the-issue-of-taaah-obedience.html">Words of Ibn Taymiyyah In Refutation of the Extremism of Mawdudi and Sayyid Qutb on the Issue of Taa'ah (Obedience)</a><BR>
//www.themadkhalis.com/md/?akaka<BR>

<li><a href="articles/zlzrg-shaykh-salih-aal-ash-shaykh-the-ghuluww-extremism-of-sayyid-qutb-in-takfir-of-the-sinners.html">Shaykh Salih Aal ash-Shaykh: The Ghuluww (Extremism) of Sayyid Qutb in Takfir of the Sinners</a><BR>
//www.themadkhalis.com/md/?zlzrg<BR>

<li><a href="articles/fufhr-shaykh-muhammad-bin-saalih-al-uthaymeen-on-sayyid-qutbs-tafseer.html">Shaykh Muhammad bin Saalih al-Uthaymeen on Sayyid Qutb's Tafseer</a><BR>
//www.themadkhalis.com/md/?fufhr<BR>

<li><a href="articles/oplui-a-brief-glimpse-into-the-mistakes-innovations-and-calamities-of-sayyid-qutb.html">A Brief Glimpse Into the Mistakes, Innovations and Calamities of Sayyid Qutb</a><BR>
//www.themadkhalis.com/md/?oplui<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?akaka by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
</html>


