




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?rlbec by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</span><BR>
Tuesday, October 08 2013 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Shaykh <a href='tags/muqbil-bin-haadee.html' class='tagLink'><font class='tagLink'>Muqbil bin Haadee</font></a> (rahimahullaah) stated about <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> bin Haadee:    <P>
<div class='arabic' align='right'>&#1608;&#1571;&#1606;&#1575; &#1571;&#1606;&#1589;&#1581; &#1575;&#1604;&#1571;&#1582;&#1608;&#1577; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1577; &#1605;&#1606; &#1603;&#1578;&#1576; &#1571;&#1582;&#1610;&#1606;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610;  - &#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; -  &#1601;&#1607;&#1608; &#1573;&#1606; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; [&#1576;&#1589;&#1610;&#1585;] &#1576;&#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1610;&#1606;&#1548; &#1608;&#1610;&#1582;&#1585;&#1580; &#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1577; &#1576;&#1575;&#1604;&#1605;&#1606;&#1575;&#1602;&#1610;&#1588;&#1548; &#1602;&#1575;&#1604; &#1576;&#1593;&#1590;&#1607;&#1605;: &#1573;&#1606;&#1617; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1581;&#1588;&#1610;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1588;&#1575;&#1601; &#1610;&#1582;&#1585;&#1580; &#1575;&#1604;&#1575;&#1593;&#1578;&#1586;&#1575;&#1604; &#1576;&#1575;&#1604;&#1605;&#1606;&#1575;&#1602;&#1610;&#1588;&#1548; &#1607;&#1584;&#1575; - &#1571;&#1610;&#1590;&#1575;&#1611; -  &#1610;&#1582;&#1585;&#1580; &#1575;&#1604;&#1581;&#1586;&#1576;&#1610;&#1577; &#1576;&#1575;&#1604;&#1605;&#1606;&#1575;&#1602;&#1610;&#1588;&#1548; &#1571;&#1606;&#1575; &#1571;&#1606;&#1589;&#1581; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1577; &#1605;&#1606; &#1603;&#1578;&#1576;&#1607;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1577; &#1605;&#1606; &#1571;&#1588;&#1585;&#1591;&#1578;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And I advise the brothers to benefit from the books of our brother <a href='tags/shaykh-rabee-bin-haadee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee bin Haadee</font></a> - may Allaah protect him - for he is, if Allaah wills, insightful with respect to the Hizbiyyeen and he brings out this Hizbiyyah (present with people) with chisels, one of them said, "One of the commentators upon al-Kashshaaf brings out al-I'tizaal through chisels" and this one also (<a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>), he brings out Hizbiyyah through chisels. I advise with benefiting from his books and likewise benefiting from his cassettes.</blockquote>    <P>
<b>Source:</b>  In the cassette (<span class='arb'>&#1575;&#1604;&#1571;&#1587;&#1574;&#1604;&#1577; &#1575;&#1604;&#1587;&#1606;&#1610;&#1577; &#1604;&#1593;&#1604;&#1575;&#1617;&#1605;&#1577; &#1575;&#1604;&#1583;&#1610;&#1575;&#1585; &#1575;&#1604;&#1610;&#1605;&#1606;&#1610;&#1577;&#1548; &#1571;&#1587;&#1574;&#1604;&#1577; &#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1591;&#1575;&#1574;&#1601;</span>) and as published in (<span class='arb'>&#1575;&#1604;&#1579;&#1606;&#1575;&#1569; &#1575;&#1604;&#1576;&#1583;&#1610;&#1593; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593;</span>) by Shaykh Khalid al-Dhufayree. The book al-Kashshaaf is one of the tafseer books of the Mu'tazilah written by al-Zamakhsharee, who put in a lot of <i>I'tizaal</i> (madhhab of the Mu'tazilah) but in ways that are very subtle, involving the subtleties of language. And Shaykh Muqbil is indicating how one of the commentators (who wrote footnotes to it) was able to '<i>chisel out</i>' all of the <i>i'tizaal</i> (due to his insight). In the same way, he described <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a>, whose insight into the jamaa'aat and hizbiyyeen, allows him to '<i>chisel out</i>' hizbiyyah. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/nkckz-shaykh-muqbil-bin-haadee-shaykh-rabee-is-an-ayah-sign-in-knowledge-of-the-hizbiyyeen.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nkckz<BR>

<li><a href="articles/rlbec-shaykh-muqbil-bin-haadee-shaykh-rabee-brings-out-hizbiyyah-with-chisels.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</a><BR>
//www.themadkhalis.com/md/?rlbec<BR>

<li><a href="articles/nblim-shaykh-muqbil-bin-haadee-shaykh-rabee-is-from-the-taaifah-mansoorah.html">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</a><BR>
//www.themadkhalis.com/md/?nblim<BR>

<li><a href="articles/lznpg-shaykh-muqbil-bin-haadee-on-shaykh-rabee.html">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</a><BR>
//www.themadkhalis.com/md/?lznpg<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?rlbec by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:04 GMT -->
</html>


