




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?hkqct by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 2 - Major Shirk</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 2 - Major Shirk</span><BR>
Sunday, December 20 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>Introduction</font>    <P>
The Noble Shaykh, Ahmad an-Najmee (rahimahullaah) wrote a book called: (<span class='arb'>&#1575;&#1604;&#1605;&#1608;&#1585;&#1583; &#1575;&#1604;&#1593;&#1584;&#1576; &#1575;&#1604;&#1586;&#1604;&#1575;&#1604; &#1601;&#1610;&#1605; &#1575;&#1606;&#1578;&#1602;&#1583; &#1593;&#1604;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1606;&#1575;&#1607;&#1580; &#1575;&#1604;&#1583;&#1593;&#1608;&#1610;&#1577; &#1605;&#1606; &#1575;&#1604;&#1593;&#1602;&#1575;&#1574;&#1583; &#1608;&#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604;</span>) - <b>The Sweet Cool [Water] Spring Regarding What Has Been Criticized of Beliefs and Actions of Some of the Methodologies of Da'wah</b>" in which he covered the mistakes, innovations and deviation of many groups and movements including al-Ikhwaan al-Muslimeen and Jamaa'at ut-Tableegh.    <P>
Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> sent a letter to Shaykh Ahmad an-Najmee requesting him not to print the book, and he said, as quoted by Shaykh an-Najmee in his response to him (p. 3):    <P>
<div class='arabic' align='right'>&#1608;&#1604;&#1605;&#1617;&#1575; &#1608;&#1589;&#1604;&#1578;&#1615; &#1573;&#1604;&#1609; &#1575;&#1604;&#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1575;&#1587;&#1593; &#1608;&#1602;&#1593;&#1578; &#1593;&#1604;&#1609; &#1605;&#1575;&#1604;&#1605; &#1571;&#1603;&#1606; &#1571;&#1578;&#1608;&#1602;&#1593;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And when I reached the ninth chapter, I came upon what I did not expect...</blockquote>    <P>
Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was surprised at the criticisms and pointing out of the errors of <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a>. In this series we want to mention some of what <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> was criticised for by Shaykh Ahmad an-Najmee, by quoting from Shaykh Najmee's response to Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a>.    <P>
<font class='titleHeadline'>Associating Partners with Allaah with the Major <a href="tags/shirk.html" class="tagLink"><font class="tagLink">Shirk</font></a></font>    <P>
Shaykh Ahmad an-Najmee (rahimahullaah) said, addressing Ibn Jibreen:    <P>
<div class='arabic' align='right'> &#1601;&#1603;&#1617;&#1585; &#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1581;&#1605;&#1604;&#1606;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610; &#1585;&#1580;&#1604; &#1602;&#1583; &#1605;&#1575;&#1578; &#1608;&#1571;&#1606;&#1575; &#1601;&#1610; &#1587;&#1606; &#1575;&#1604;&#1591;&#1601;&#1608;&#1604;&#1577; &#1608;&#1604;&#1605; &#1610;&#1587;&#1601;&#1603; &#1604;&#1610; &#1583;&#1605;&#1575;&#1611; &#1608;&#1604;&#1605; &#1610;&#1606;&#1578;&#1607;&#1603; &#1604;&#1610; &#1593;&#1585;&#1590;&#1575;&#1611; &#1608;&#1604;&#1605; &#1610;&#1571;&#1582;&#1584; &#1593;&#1604;&#1610;&#1617;&#1614; &#1605;&#1575;&#1604;&#1575;&#1611;  , &#1601;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1605;&#1604;&#1606;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610;&#1607; &#1608;&#1604;&#1605; &#1610;&#1592;&#1604;&#1605;&#1606;&#1610; &#1571;&#1606;&#1575; &#1588;&#1582;&#1589;&#1610;&#1575;&#1611; &#1576;&#1588;&#1610;&#1569; , &#1573;&#1606; &#1603;&#1606;&#1578; &#1578;&#1603;&#1604;&#1605;&#1578;&#1615; &#1601;&#1610;&#1607; &#1605;&#1606; &#1594;&#1610;&#1585; &#1587;&#1575;&#1576;&#1602; &#1592;&#1604;&#1605; &#1605;&#1606;&#1607; &#1604;&#1610; &#1608;&#1604;&#1575; &#1605;&#1589;&#1604;&#1581;&#1577; &#1583;&#1610;&#1606;&#1610;&#1577; &#1578;&#1603;&#1604;&#1605;&#1578; &#1601;&#1610;&#1607;&#1575; &#1605;&#1606; &#1571;&#1580;&#1604;&#1607;&#1575; &#1601;&#1571;&#1606;&#1575; &#1592;&#1575;&#1604;&#1605; &#1605;&#1593;&#1578;&#1583;&#1610; &#1608;&#1587;&#1610;&#1571;&#1582;&#1584; &#1575;&#1604;&#1604;&#1607; &#1604;&#1607; &#1576;&#1581;&#1602;&#1607; &#1605;&#1606;&#1610;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Reflect upon what has carried me to speak about a man who died whilst I was only young in age, and he did not shed any blood of mine, and nor violate my honour and nor take wealth from me. So what has carried me to speak about him when he personally has not wronged me? If I had spoken about him without him having previously wronged me, and it was not for any religious benefit that I spoke about him, then I am an oppressor, transgressor, and Allaah will soon take from me his right.</blockquote>    <P>
And thereafter, he gives him an example of the criticism, on account of which he spoke against him:    <P>
<div class='arabic' align='right'>&#1608;&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1603;&#1575;&#1606; &#1610;&#1606;&#1588;&#1583;</div>    <P>
<img src=assets/images/bannaa-poetry-prophet-forgiveness.gif border=0>    <P>
<div class='arabic' align='right'>  &#1601;&#1587;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1576;&#1610;&#1575;&#1578; &#1576;&#1578;&#1601;&#1587;&#1610;&#1585; &#1610;&#1581;&#1578;&#1605;&#1604;&#1607; &#1607;&#1584;&#1575; &#1575;&#1604;&#1604;&#1601;&#1592; &#1594;&#1610;&#1585; &#1575;&#1604;&#1588;&#1585;&#1603; &#1575;&#1604;&#1571;&#1603;&#1576;&#1585; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607;  "&#1608;&#1587;&#1575;&#1605;&#1581; &#1575;&#1604;&#1603;&#1604; &#1601;&#1610;&#1605;&#1575; &#1602;&#1583; &#1605;&#1590;&#1609; &#1608;&#1580;&#1585;&#1609;" &#1608;&#1594;&#1610;&#1585; &#1575;&#1604;&#1603;&#1584;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1601;&#1610; &#1608;&#1602;&#1608;&#1604;&#1607; "&#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1576;&#1610;&#1576; &#1605;&#1593; &#1575;&#1604;&#1571;&#1581;&#1576;&#1575;&#1576; &#1602;&#1583; &#1581;&#1590;&#1585;&#1575;"  &#1608;&#1578;&#1589;&#1583;&#1610;&#1602; &#1601;&#1585;&#1610;&#1577; &#1575;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1571;&#1606;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1581;&#1590;&#1585; &#1581;&#1601;&#1604;&#1607;&#1605; &#1575;&#1604;&#1576;&#1583;&#1593;&#1610; &#1571;&#1604;&#1575; &#1608;&#1607;&#1608; &#1575;&#1604;&#1573;&#1581;&#1578;&#1601;&#1575;&#1604; &#1576;&#1575;&#1604;&#1605;&#1608;&#1604;&#1583; .  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He is the one who would recite the following poetry:    <P>
<div align=center><i>May the Divine (Al-Ilaah) send prayers over the light (i.e. Muhammad) that appeared<BR>  To the creation and surpassed the sun and the moon (in his light)<BR>  This beloved one (i.e. Muhammad) along with his loved ones has indeed attended (i.e. this gathering)<BR>  And pardoned everyone of what has passed and bygone (of their sins)</i></div>    <P>
Explain these verses with an explanation that this wording contains other than [the explanation of it being] Major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>, as in his statement "<i>And pardoned everyone of what has passed and bygone (of their sins)</i>" and other than that of a lie against Allaahýs Messenger, as in his statement: "<i>This beloved one (i.e. Muhammad) along with his loved ones has indeed attended</i>", as well as what these words contain from affirming the fabrication of the Soofees who say that he (sallallaahu alayhi wasallam) attends their innovated celebration gathering which is the celebration of the [Prophet's] Birthday.</blockquote>    <P>
And there was no response from Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> as Shaykh Ahmad sent this to the Shaykh and allowed him ample time to respond. So when it angers a person that <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> <u>is refuted for this saying</u>, more than it angers them that <a href='tags/hasan-al-banna.html' class='tagLink'><font class='tagLink'>Hasan al-<a href="tags/banna.html" class="tagLink"><font class="tagLink">Banna</font></a></font></a> <u>actually said this saying</u>, then that is a calamity indeed!      <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/fhain-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-6.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 6 - Challenge to Shaykh Ibn Jibreen If He Is Speaking the Truth</a><BR>
//www.themadkhalis.com/md/?fhain<BR>

<li><a href="articles/auyrj-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-5.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 5 - Legislating Hizbiyyah Into Islaam</a><BR>
//www.themadkhalis.com/md/?auyrj<BR>

<li><a href="articles/gbmok-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-4.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 4 - Calling For Unity Between the Rafidah and the Sunnah</a><BR>
//www.themadkhalis.com/md/?gbmok<BR>

<li><a href="articles/lcwli-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-3.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 3 - Witnessing Grave Worship and Travelling Twenty Kilometres to the Tombs of ad-Dusuqi and Sinjar</a><BR>
//www.themadkhalis.com/md/?lcwli<BR>

<li><a href="articles/hkqct-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwidh-hasan-al-banna---part-2.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 2 - Major Shirk</a><BR>
//www.themadkhalis.com/md/?hkqct<BR>

<li><a href="articles/vdcip-shaykh-ahmad-an-najmees-refutation-of-ibn-jibreens-defence-of-the-soofee-mufawwid-hasan-al-banna---part-1.html">Shaykh Ahmad an-Najmee's Refutation of Ibn Jibreen's Defence of the Soofee Mufawwidh Hasan al-Banna - Part 1 - Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?vdcip<BR>

<li><a href="articles/ocbde-shaykh-muhammad-aamaan-al-jaamee-on-the-dawah-of-hassan-al-bannaa.html">Shaykh Muhammad Aamaan al-Jaamee on the Da'wah of Hasan al-Bannaa and Grave Worship</a><BR>
//www.themadkhalis.com/md/?ocbde<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?hkqct by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


