




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?zvrzr by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:06 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Saalih al-Fawzan on Using the Labels of 'Jaamiyyah' and 'Madaakhilah'</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Saalih al-Fawzan on Using the Labels of 'Jaamiyyah' and 'Madaakhilah'</span><BR>
Sunday, March 04 2012 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><object type="application/x-shockwave-flash" data="http://kiwi6.com/swf/player.swf" id="audioplayer" height="24" width="290" allowscriptaccess="always">  	<param name="movie" value="http://kiwi6.com/swf/player.swf" /><param name="FlashVars" value="playerID=audioplayer&soundFile=http://k004.kiwi6.com/uploads/hotlink/5203x66d69&titles=&#1575;&#1604;&#1601;&#1608;&#1586;&#1575;&#1606;- &#1575;&#1604;&#1606;&#1576;&#1586; &#1576;&#1575;&#1604;&#1580;&#1575;&#1605;&#1610;&#1577; &#1608;&#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610;&#1577; &#1605;&#1603;&#1610;&#1583;&#1577; &#1608;&#1583;&#1587;&#1610;&#1587;&#1577; (&#1580;&#1583;&#1610;&#1583;).mp3" />  	<param name="quality" value="high" /><param name="menu" value="false" /><param name="allowscriptaccess" value="always" /><param name="wmode" value="transparent" /></object>  	    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1585;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1608;&#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1608;&#1593;&#1604;&#1609; &#1575;&#1604;&#1607; &#1608;&#1589;&#1581;&#1576;&#1607; &#1608;&#1576;&#1593;&#1583;    <P>
&#1606;&#1591;&#1604;&#1576; &#1605;&#1606; &#1588;&#1610;&#1582;&#1606;&#1575; &#1575;&#1604;&#1601;&#1575;&#1590;&#1604; &#1575;&#1604;&#1578;&#1606;&#1576;&#1610;&#1607; &#1593;&#1604;&#1609; &#1575;&#1605;&#1585; &#1605;&#1575; &#1602;&#1583; &#1575;&#1606;&#1578;&#1588;&#1585; &#1601;&#1610; &#1575;&#1604;&#1575;&#1608;&#1606;&#1577; &#1575;&#1604;&#1575;&#1582;&#1610;&#1585;&#1577; &#1576;&#1610;&#1606; &#1575;&#1604;&#1591;&#1604;&#1575;&#1576; &#1575;&#1604;&#1575; &#1608;&#1607;&#1608; &#1606;&#1576;&#1586; &#1576;&#1593;&#1590; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1575;&#1601;&#1575;&#1590;&#1604; &#1593;&#1604;&#1609; &#1605;&#1606; &#1610;&#1587;&#1578;&#1605;&#1593; &#1575;&#1604;&#1610;&#1607;&#1605; &#1576;&#1575;&#1606;&#1607;&#1605; &#1607;&#1572;&#1604;&#1575;&#1569; &#1580;&#1575;&#1605;&#1610;&#1608;&#1606; &#1608;&#1607;&#1572;&#1604;&#1575;&#1569; &#1605;&#1583;&#1575;&#1582;&#1604;&#1577; &#1608;&#1610;&#1602;&#1589;&#1583;&#1608;&#1606; &#1576;&#1607; &#1588;&#1610;&#1582;&#1606;&#1575; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1605;&#1581;&#1605;&#1583; &#1575;&#1605;&#1575;&#1606; &#1575;&#1604;&#1580;&#1575;&#1605;&#1610; &#1608;&#1588;&#1610;&#1582;&#1606;&#1575; &#1575;&#1604;&#1601;&#1575;&#1590;&#1604; &#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1587;&#1583;&#1583; &#1582;&#1591;&#1575;&#1607; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1608;&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1567; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>We request from our esteemed Shaykh to make notification about an affair that has spread in recent times between the students (of knowledge) which is to use insulting names for some of the esteemed scholars by declaring those who listen to them as "Jaamiyyoon" and "<a href="tags/madaakhilah.html" class="tagLink"><font class="tagLink">Madaakhilah</font></a>", and they intend our Shaykh, the Scholar (rahimahullaah), Muhammad Amaan al-Jaamee, and our esteemed Shaykh (hafidhahullaah wa saddada khattaah), Rabee' bin Haadee al-Madkhalee, and may Allaah send salaat and salaam upon our Prophet Muhammad.</blockquote>    <P>
<div class='arabic' align='right'>&#1607;&#1584;&#1575; &#1583;&#1575;&#1582;&#1604; &#1601;&#1610; &#1575;&#1604;&#1580;&#1608;&#1575;&#1576; &#1575;&#1604;&#1584;&#1610; &#1575;&#1606;&#1578;&#1607;&#1610;&#1578; &#1605;&#1606;&#1607; &#1602;&#1585;&#1610;&#1576;&#1575;&#1611; &#1548; &#1575;&#1578;&#1585;&#1603;&#1608;&#1575; &#1607;&#1584;&#1607; &#1575;&#1604;&#1575;&#1605;&#1608;&#1585; &#1608;&#1575;&#1604;&#1578;&#1606;&#1575;&#1576;&#1586; (&#1608;&#1604;&#1575; &#1578;&#1606;&#1575;&#1576;&#1586;&#1608;&#1575; &#1576;&#1575;&#1604;&#1575;&#1604;&#1602;&#1575;&#1576;) &#1575;&#1604;&#1604;&#1607; &#1580;&#1604; &#1608;&#1593;&#1604;&#1575; &#1602;&#1575;&#1604; &#1604;&#1603;&#1605; (&#1608;&#1604;&#1575; &#1578;&#1606;&#1575;&#1576;&#1586;&#1608;&#1575; &#1576;&#1575;&#1604;&#1575;&#1604;&#1602;&#1575;&#1576;) &#1603;&#1604;&#1603;&#1605; &#1575;&#1582;&#1608;&#1577; &#1548; &#1603;&#1604;&#1603;&#1605; &#1575;&#1607;&#1604; &#1583;&#1610;&#1606; &#1608;&#1575;&#1581;&#1583; &#1548; &#1603;&#1604;&#1603;&#1605; &#1586;&#1605;&#1604;&#1575;&#1569; &#1608;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1605;&#1583; &#1548; &#1601;&#1575;&#1606;&#1576;&#1584;&#1608;&#1575; &#1607;&#1584;&#1607; &#1575;&#1604;&#1575;&#1605;&#1608;&#1585; &#1608;&#1575;&#1581;&#1578;&#1585;&#1605;&#1608;&#1575; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1548; &#1575;&#1581;&#1578;&#1585;&#1605;&#1608;&#1575; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1606; &#1604;&#1605; &#1610;&#1581;&#1578;&#1585;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1601;&#1575;&#1606;&#1607; &#1610;&#1581;&#1585;&#1605; &#1605;&#1606; &#1593;&#1604;&#1605;&#1607;&#1605; &#1610;&#1581;&#1585;&#1605; &#1605;&#1606; &#1575;&#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1577; &#1605;&#1606;&#1607;&#1605; &#1601;&#1575;&#1578;&#1585;&#1603;&#1608;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1575;&#1605;&#1585; &#1575;&#1604;&#1578;&#1606;&#1575;&#1576;&#1586; &#1576;&#1610;&#1606;&#1603;&#1605; &#1608;&#1578;&#1606;&#1575;&#1608;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1604;&#1607;&#1605; &#1575;&#1604;&#1601;&#1590;&#1604; &#1608;&#1604;&#1607;&#1605; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1575;&#1604;&#1605;&#1606;&#1586;&#1604;&#1577; &#1575;&#1604;&#1578;&#1610; &#1575;&#1606;&#1586;&#1604;&#1607;&#1575; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610;&#1607;&#1575; (&#1610;&#1585;&#1601;&#1593; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610;&#1606; &#1575;&#1605;&#1606;&#1608;&#1575; &#1605;&#1606;&#1603;&#1605; &#1608;&#1575;&#1604;&#1584;&#1610;&#1606; &#1575;&#1608;&#1578;&#1608;&#1575; &#1575;&#1604;&#1593;&#1604;&#1605; &#1583;&#1585;&#1580;&#1575;&#1578;) &#1601;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1604;&#1607;&#1605; &#1605;&#1603;&#1575;&#1606;&#1578;&#1607;&#1605; &#1608;&#1604;&#1607;&#1605; &#1602;&#1583;&#1585;&#1607;&#1605; &#1608;&#1575;&#1581;&#1578;&#1585;&#1575;&#1605;&#1607;&#1605; &#1608;&#1575;&#1584;&#1575; &#1604;&#1605; &#1610;&#1608;&#1579;&#1602; &#1576;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1601;&#1576;&#1605;&#1606; &#1610;&#1608;&#1579;&#1602; &#1567; &#1575;&#1584;&#1575; &#1606;&#1586;&#1593;&#1578; &#1575;&#1604;&#1579;&#1602;&#1577; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1601;&#1575;&#1604;&#1609; &#1605;&#1606; &#1610;&#1585;&#1580;&#1593; &#1575;&#1604;&#1606;&#1575;&#1587; &#1567; &#1601;&#1607;&#1584;&#1607; &#1605;&#1603;&#1610;&#1583;&#1577; &#1604;&#1575; &#1588;&#1603; &#1608;&#1583;&#1587;&#1610;&#1587;&#1577; &#1604;&#1575; &#1588;&#1603; &#1576;&#1610;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1601;&#1610;&#1580;&#1576; &#1575;&#1604;&#1578;&#1606;&#1576;&#1607; &#1604;&#1607;&#1575; &#1548; &#1610;&#1580;&#1576; &#1606;&#1576;&#1584;&#1607;&#1575; &#1608;&#1575;&#1604;&#1575;&#1576;&#1578;&#1593;&#1575;&#1583; &#1593;&#1606;&#1607;&#1575; &#1608;&#1575;&#1604;&#1606;&#1607;&#1610; &#1593;&#1606;&#1607;&#1575; &#1606;&#1593;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This enters into the answer which I have just finished (answering) a short while ago. Leave these affairs and using insulting names, "<b>And do not insult one another with names</b>" (49:11), Allaah the Mighty and Majestic said to you, "<b>And do not insult one another with names</b>" (49:11). All of your are associates and all praise is due to Allaah. So abandon these affairs, and respect the Scholars, respect the Scholars. Whoever does not respect the Scholars, their knowledge will be withheld from him, he will be prevented from benefiting from them. So leave these affairs, using insulting names for each other and attacking the scholars who have an excellence. They (the scholars) have a position over the people which Allaah put them in, "<b>Allaah raises those who believe amongst you and those who have been given knowledge in ranks</b>" (58:11). Hence, the Scholars have their position, their status and their respect. When no trust is held in the Scholars, then in whom will trust be held? When trust towards the scholars is taken away then to whom will the people turn? This is a plot without a doubt and an infiltration without a doubt between the people. Hence it is obligatory to be aware of it. It is obligatory to shun it and keep away from it and to prohibit from it, yes. </blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/zvrzr-shaykh-saalih-al-fawzan-on-using-the-labels-of-jaamiyyah-and-madaakhilah.html">Shaykh Saalih al-Fawzan on Using the Labels of 'Jaamiyyah' and 'Madaakhilah'</a><BR>
//www.themadkhalis.com/md/?zvrzr<BR>

<li><a href="articles/hyulz-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-1.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 1 - Introduction and Background</a><BR>
//www.themadkhalis.com/md/?hyulz<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?zvrzr by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:06 GMT -->
</html>


