




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?bqouy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 2 - Shaykh Rabee' Visiting the Mufti Shaykh Abdul-Aziz in Riyadh and Makkah in 1427H</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 2 - Shaykh Rabee' Visiting the Mufti Shaykh Abdul-Aziz in Riyadh and Makkah in 1427H</span><BR>
Sunday, January 10 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><div class='sidebar'>This is part of a series: Please refer to the <a href=indexf6e4.html?hyulz>introductory article here</a>, for important background information.</div>    <P>
The brother, Ahmad bin Yahyaa az-Zahraanee, who frequently travels with the noble <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, narrates, in his article (<span class='arb'>&#1607;&#1604; &#1576;&#1610;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1582;&#1604;&#1575;&#1601; &#1567;</span>), numerous occasions in which there took place meetings and encounters between the various Shaykhs and <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>. And from them is the meeting that took place in Riyaadh 20/8/1427H.    <P>
Ahmad az-Zahraanee writes:    <P>
<div class='arabic' align='right'>&#1608;&#1601;&#1610; &#1575;&#1604;&#1585;&#1610;&#1575;&#1590; &#1610;&#1608;&#1605; 20/8/1427&#1607;&#1600; &#1586;&#1575;&#1585; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1587;&#1605;&#1575;&#1581;&#1577; &#1575;&#1604;&#1605;&#1601;&#1578;&#1610; &#1601;&#1610; &#1575;&#1604;&#1585;&#1610;&#1575;&#1590; &#1601;&#1610; &#1605;&#1603;&#1578;&#1576;&#1607; &#1576;&#1575;&#1604;&#1580;&#1575;&#1605;&#1593; &#1575;&#1604;&#1603;&#1576;&#1610;&#1585; (1) &#1608;&#1578;&#1603;&#1604;&#1605; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1593;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569; &#1608;&#1605;&#1575; &#1610;&#1590;&#1605;&#1585;&#1608;&#1606;&#1607; &#1605;&#1606; &#1588;&#1585; &#1604;&#1604;&#1587;&#1606;&#1577; &#1608;&#1571;&#1607;&#1604;&#1607;&#1575; &#1608;&#1583;&#1575;&#1585; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1593;&#1606; &#1575;&#1604;&#1575;&#1606;&#1578;&#1585;&#1606;&#1578; &#1608;&#1575;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569; &#1601;&#1610; &#1606;&#1588;&#1585; &#1587;&#1605;&#1608;&#1605;&#1607;&#1605; &#1601;&#1602;&#1575;&#1604; &#1575;&#1604;&#1605;&#1601;&#1578;&#1610; :    <P>
&#1610;&#1575;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1571;&#1589;&#1576;&#1585; &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1605;&#1593; &#1575;&#1604;&#1589;&#1575;&#1576;&#1585;&#1610;&#1606; &#1608;&#1571;&#1606;&#1578; &#1580;&#1576;&#1604; &#1608;&#1605;&#1593;&#1585;&#1608;&#1601; &#1604;&#1575; &#1610;&#1607;&#1605;&#1608;&#1606;&#1603; &#1610;&#1575;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1607;&#1572;&#1604;&#1575;&#1569; &#1580;&#1607;&#1575;&#1604; &#1587;&#1601;&#1607;&#1575;&#1569; &#1575;&#1604;&#1571;&#1581;&#1604;&#1575;&#1605;    <P>
(1) &#1608;&#1605;&#1605;&#1606; &#1581;&#1590;&#1585; &#1575;&#1604;&#1604;&#1602;&#1575;&#1569; &#1601;&#1590;&#1610;&#1604;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1604;&#1610; &#1576;&#1606; &#1610;&#1581;&#1610;&#1609; &#1581;&#1583;&#1575;&#1583;&#1610; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583;&#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1593;&#1576;&#1583;&#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1575;&#1604;&#1571;&#1581;&#1605;&#1583; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in Riyaadh on 20/8/1427H <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> visited the esteemed Mufti (Abdul-Aziz Aal ash-Shaykh) in Riyaadh, in his office at al-Jaamii' al-Kabeer (1) and <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> spoke about the Ahl ul-Bid'ah wal-Ahwaa (People of Innovations and Desires) and what they conceal of [intending] evil towards the Sunnah and its people. Discussion took place about the Internet and hte people of desires using it to spread their poison. So the Muftee said:    <P>
<blockquote>O <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>. Have patience. Indeed Allaah is with those who are patient, and you are a well-known mountain. Let them not concern O <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>. Those are ignorant, foolish-minded ones.</blockquote>    <P>
(1) And from those who were present in this meeting were the esteemed Shaykh, Alee bin Yahyaa al-Haddaadee, and Shaykh Abdullaah bin Abdur-Rahmaan al-Ahmad and others.  </blockquote>    <P>
And az-Zahraanee documents two other occasions in the same year in which the two Shaykhs met:    <P>
<div class='arabic' align='right'>&#1608;&#1607;&#1584;&#1575; &#1605;&#1601;&#1578;&#1610; &#1575;&#1604;&#1605;&#1605;&#1604;&#1603;&#1577; &#1575;&#1604;&#1593;&#1585;&#1576;&#1610;&#1577; &#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1593;&#1604;&#1575;&#1605;&#1577; &#1593;&#1576;&#1583;&#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1570;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1602;&#1576;&#1604; &#1585;&#1571;&#1587; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1610;&#1608;&#1605; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1575;&#1569; 4/12/1423&#1607;&#1600; &#1601;&#1610; &#1606;&#1575;&#1583;&#1610; &#1605;&#1603;&#1577; &#1575;&#1604;&#1579;&#1602;&#1575;&#1601;&#1610; &#1608;&#1610;&#1591;&#1604;&#1576; &#1605;&#1606;&#1607; &#1587;&#1605;&#1575;&#1581;&#1577; &#1575;&#1604;&#1605;&#1601;&#1578;&#1610; &#1584;&#1604;&#1603; &#1608;&#1610;&#1602;&#1608;&#1604; &#1604;&#1607; : &#1571;&#1606;&#1578; &#1588;&#1610;&#1582;&#1606;&#1575; &#1608;&#1602;&#1575;&#1604;&#1607;&#1575; &#1571;&#1610;&#1590;&#1575;&#1611; &#1601;&#1610; &#1575;&#1604;&#1591;&#1575;&#1574;&#1601; - &#1593;&#1575;&#1605; 1427&#1607;    <P>
&#1608;&#1601;&#1610; &#1610;&#1608;&#1605; &#1575;&#1604;&#1571;&#1579;&#1606;&#1610;&#1606; 19-12-1427&#1607;&#1600; &#1601;&#1610; &#1605;&#1603;&#1577; &#1586;&#1575;&#1585; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1575;&#1604;&#1605;&#1583;&#1582;&#1604;&#1610; &#1587;&#1605;&#1575;&#1581;&#1577; &#1575;&#1604;&#1605;&#1601;&#1578;&#1610; - &#1601;&#1610; &#1605;&#1603;&#1578;&#1576;&#1607; &#1601;&#1587;&#1604;&#1605; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1601;&#1602;&#1575;&#1604; &#1575;&#1604;&#1605;&#1601;&#1578;&#1610; : &#1608;&#1593;&#1604;&#1610;&#1603;&#1605; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1608;&#1585;&#1581;&#1605;&#1577; &#1575;&#1604;&#1604;&#1607; &#1608;&#1576;&#1585;&#1603;&#1575;&#1578;&#1607; &#1581;&#1610;&#1575; &#1575;&#1604;&#1604;&#1607; &#1588;&#1610;&#1582;&#1606;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; .   </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the Muftee of the Kingdom of <a href='tags/saudi-arabia.html' class='tagLink'><font class='tagLink'>Saudi Arabia</font></a>, the Shaykh, Allaamah, Abdul-Aziz Aal ash-Shaykh kissed the forehead of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> al-Madkhali on Wednesday 4/12/1423H at the Makkah Cultural Centre, and the esteemed Muftee requested this from him, saying to him, "<i>You are our Shaykh</i>". And he also said this in Taa'if in 1427H.    <P>
And on Monday, <b>19/12/1427H</b> in Makkah, <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> al-Madkhalee  visited the esteemed Muftee in his office, and <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> gave salaams, and the Muftee said: "<i>Wa alaykum as-salaam warahmatullaahi wa barakaatuh - welcome O our Shaykh, Shaykh Rabee'</i>".</blockquote>    <P>
So we see here the type of relationship between <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee</font></a> and Shaykh Abdul-Aziz Aal ash-Shaykh. However, the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> and the people of desires use very crude and cheap methods, whose dishonesty is very apparent to any person who is truthful, honest and possesses justice. One such example used by the rodents who have nothing better to do that than to spread these types of doubts is covered below.    <P>
<font class='titleHeadline'>An Example of The Deception of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> in Trying to Attack <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> Through Cheap Methods</font>    <P>
The <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> make use of some general advice the Muftee, Shaykh Abdul-Aziz Aal ash-Shaykh gave on 15/11/1427H in response to a (loaded) question over the telephone broadcast on television, and here is the question:    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/muftee-question-rabee.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><b>Questioner:</b> "O Shaykh there is a group, who claim Salafiyyah...</blockquote>    <P>
Note that this "group" he is talking about are those who are upon what Imaam al-Albaani, Imaam <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> and Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a> are upon of having convicted the likes of Safar and Salman of calling to a "<i><a href='tags/revolutionary-ideology.html' class='tagLink'><font class='tagLink'>Revolutionary Ideology</font></a></i>" and being "<i>Khaarijiyyah  Asriyyah</i>" and the likes - and you can see this is clearly a loaded question through what comes next.     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>... and they revile the Du'aat and the Mashaayikh ... and they revile Shaykh <a href='tags/aaid-al-qarnee.html' class='tagLink'><font class='tagLink'>Aa'id al-Qarnee</font></a>, and they revile Shaykh <a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a>, and some of them say that they are astray, leading others astray..." <b>Presenter:</b> [interjecting] "You request some advice..." <b>Questioner:</b> "Yes some advice for them..."  Immediately, <b>the Muftee</b> begins to answer: "O my brothers ...", then the questioner drops in at the very end (after the Shaykh has commenced his speech) "...most of them are the students of Shaykh <a href='tags/rabi-al-madkhali.html' class='tagLink'><font class='tagLink'>Rabi al-<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a></font></a>..." </blockquote>    <P>
Note in the recording that as the Muftee was commencing his advice, the questioner dropped in his statement "...most of them are the students of Shaykh <a href='tags/rabi-al-madkhali.html' class='tagLink'><font class='tagLink'>Rabi al-<a href="tags/madkhali.html" class="tagLink"><font class="tagLink">Madkhali</font></a></font></a>...". The Muftee advised the questioner at the beginning that these types of things ought not to be brought out openly but can be resolved in other ways without publicizing them to the people in this manner.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Muftee: My brothers, I hope we fear Allaah with respect to ourselves, and that we do not publicize these types of affairs, when we know of their existence, we strive to rectify them, as for making them publicizing them and making them open, then this is not befitting...</blockquote>    <P>
After this, the Shaykh gives a general naseehah (advice) which is not directed at anyone in particular, but is a general naseehah to everyone. As for the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> mentioned by the questioner, (al-Qarnee, al-Awdah etc.) then <u>the Major Scholars</u> already refuted them for their <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> and mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Ummah. <b>Shaykh Salih al-Fawzaan</b> refuted the statements of both al-Qarnee and al-Awdah, as found in the book al-Ajwibah al-Mufidah - <a href=http://www.takfiris.com/takfir/?aorjc>see this article</a>, and also <a href=http://www.takfiris.com/takfir/?qyrnf>this article</a> for his refutations upon statements of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of <a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a>. and <b>Shaykh Ibn Uthaymeen</b> warned from the cassettes of <a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a> and <a href='tags/safar-al-hawali.html' class='tagLink'><font class='tagLink'>Safar al-Hawali</font></a> and from their "<b><a href='tags/revolutionary-ideology.html' class='tagLink'><font class='tagLink'>Revolutionary Ideology</font></a></b>" (see   <a href=index33d0.html?tjmrl>here</a>), and <b>Imaam al-Albani</b> called them "<i>Khaarijiyyah Asriyyah</i> (the Khawaarij of the Era)", as is too well known and famous to even mention, and <b>Shaykh Ibn Uthaymeen</b> and <b>Shaykh al-Fawzaan</b> both corroborate the existence of a "<a href="tags/qutbi.html" class="tagLink"><font class="tagLink">Qutbi</font></a>" manhaj, and its followers the they both commend and authorize warning from it (see   <a href=index0ec1.html?blaok>here</a>, <a href=index7e0b.html?sxptl>here</a> and <a href=index49f2.html?xwcmm>here</a>) ... and so on, and so on, and so on, and so on. All that is from close to ten years ago.     <P>
So you can see that this is just a cheap attempt by these people to cast aspersions upon the people of knowledge. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/vckiw-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 2/2</a><BR>
//www.themadkhalis.com/md/?vckiw<BR>

<li><a href="articles/shufz-bayan-talbis-al-qutbiyyah-part-2.html">Bayan Talbis al-Qutbiyyah: Part 2 - Concerning the General Advice of the Muftee Shaykh Abdul-Aziz Aal ash-Shaykh - Part 1/2</a><BR>
//www.themadkhalis.com/md/?shufz<BR>

<li><a href="articles/ztcvm-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-3.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 3 - Imaam Ibn Baz Requesting Shaykh Rabee in Writing To Refute a Denier of Allaah's Attributes</a><BR>
//www.themadkhalis.com/md/?ztcvm<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

<li><a href="articles/bqouy-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-2.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 2 - Shaykh Rabee' Visiting the Mufti Shaykh Abdul-Aziz in Riyadh and Makkah in 1427H</a><BR>
//www.themadkhalis.com/md/?bqouy<BR>

<li><a href="articles/hyulz-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-1.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 1 - Introduction and Background</a><BR>
//www.themadkhalis.com/md/?hyulz<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?bqouy by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:11 GMT -->
</html>


