




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?qpqvs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Sayyid Qutb and the Aqidah of the Raafidah: Part 7 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Seventh Installment</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Sayyid Qutb and the Aqidah of the Raafidah: Part 7 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Seventh Installment</span><BR>
Saturday, January 30 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<font class='titleHeadline'>Mahmood Shakir Refuting and Establishing the Hujjah Upon The Propounders of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of the <a href='tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a> of Hatred and Revilement of <a href="tags/the-companions.html" class="tagLink"><font class="tagLink">the Companions</font></a></font>    <P>
Mahmood Shakir wrote five articles in defence of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger (sallallaahu alayhi wasallam). Four of them appeared in the magazine "<i>al-Muslimoon</i>" which was edited by Sa'eed Ramadan al-Misree, who was one of the prominent figureheads of al-Ikhwaan al-Muslimeen, and the fifth was published in "<i>ar-Risaalah</i>", a magazine by Ahmad Hasan az-Zayyaat. These are the five articles:    <P>
<ul><li>(<span class='arb'>&#1581;&#1603;&#1605; &#1576;&#1604;&#1575; &#1576;&#1610;&#1606;&#1577;</span>) "<i>Hukmum bilaa Bayyinah</i>" (Judgement without proof), published in the first edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1578;&#1575;&#1585;&#1610;&#1582; &#1576;&#1604;&#1575; &#1573;&#1610;&#1605;&#1575;&#1606;</span>) "<i>Taareekh bilaa Eemaan</i>" (History Without Faith), published in the second edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610;</span>) "<i>Laa Tasubboo Ashaabee</i>" (Do not Revile My Companions), published in the third edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1571;&#1604;&#1587;&#1606;&#1577; &#1575;&#1604;&#1605;&#1601;&#1578;&#1585;&#1610;&#1606;</span>) "<i>Alsinat al-Muftareen</i>" (Tongues of the Liars), published in the fourth edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1584;&#1608; &#1575;&#1604;&#1593;&#1602;&#1604; &#1610;&#1588;&#1602;&#1609;</span>) "<i>Dhul-Aql Yashqaa</i>" (Possessor of Intellect Becomes Miserable), published in "ar-Risaalah" in 1952</ul>    <P>
<div class='sidebar'><b>Go to:</b> <a href=index2199.html?mslqe>Part 1</a>, <a href=index0657.html?qodiy>Part 2</a>, <a href=index959c.html?veuwi>Part 3</a>, <a href=index4be1.html?lhrbj>Part 4</a>, <a href=indexeda2.html?ngbjl>Part 5</a>, <a href=index4215.html?wumtj>Part 6</a>, <a href=index1182.html?qpqvs>Part 7</a> </div>   <P> 


<p><font class='titleHeadline'>Do Not Revile My Companions! Seventh Installment</font>    <P>
<div class='arabic' align='right'>&#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610; &#1604;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1605;&#1581;&#1605;&#1608;&#1583; &#1605;&#1581;&#1605;&#1583; &#1588;&#1575;&#1603;&#1585;</div>    <P>
<b>"Do Not Revile my Companions" by Mahmood Muhammad Shakir  [A Refutation of Sayyid Qutb] </b>    <P>
After documenting ten instances of Qutb's revilement upon four of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> - <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a>, <a href='tags/abu-sufyan.html' class='tagLink'><font class='tagLink'>Abu Sufyan</font></a>, <a href='tags/hind.html' class='tagLink'><font class='tagLink'>Hind</font></a>, and Amr bin al-Aas (radiallaahu anhum) - <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> then continues and says:    <P>
<div class='arabic' align='right'>&#1607;&#1572;&#1604;&#1575;&#1569; &#1571;&#1585;&#1576;&#1593;&#1577; &#1605;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1548; &#1610;&#1584;&#1603;&#1585;&#1607;&#1605; &#1603;&#1575;&#1578;&#1576; &#1605;&#1587;&#1604;&#1605; &#1576;&#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1594;&#1585;&#1610;&#1576;&#1577; &#1575;&#1604;&#1606;&#1575;&#1576;&#1610;&#1577; &#1548; &#1576;&#1604; &#1586;&#1575;&#1583; &#1548; &#1601;&#1604;&#1605; &#1610;&#1593;&#1589;&#1605; &#1603;&#1579;&#1585;&#1577; &#1576;&#1606;&#1610; &#1571;&#1605;&#1610;&#1577; &#1605;&#1606; &#1602;&#1604;&#1605;&#1607; &#1548; &#1601;&#1591;&#1585;&#1581; &#1593;&#1604;&#1610;&#1607;&#1605; &#1603;&#1604; &#1605;&#1575; &#1575;&#1587;&#1578;&#1591;&#1575;&#1593; &#1605;&#1606; &#1589;&#1601;&#1575;&#1578; &#1578;&#1580;&#1593;&#1604;&#1607;&#1605; &#1580;&#1605;&#1604;&#1577; &#1608;&#1575;&#1581;&#1583;&#1577; &#1576;&#1585;&#1575;&#1569; &#1605;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1548; &#1610;&#1606;&#1575;&#1601;&#1602;&#1608;&#1606; &#1601;&#1610; &#1573;&#1587;&#1604;&#1575;&#1605;&#1607;&#1605; &#1548; &#1608;&#1606;&#1601;&#1608;&#1606; &#1605;&#1606; &#1581;&#1610;&#1575;&#1578;&#1607;&#1605; &#1603;&#1604; &#1593;&#1606;&#1589;&#1585; &#1571;&#1582;&#1604;&#1575;&#1602;&#1610; - &#1603;&#1605;&#1575; &#1587;&#1605;&#1575;&#1607; - &#1608;&#1571;&#1606;&#1575; &#1604;&#1606; &#1571;&#1606;&#1575;&#1602;&#1588; &#1575;&#1604;&#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582;&#1610; &#1563; &#1601;&#1573;&#1606; &#1603;&#1604; &#1605;&#1583;&#1593; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604;: &#1607;&#1584;&#1575; &#1605;&#1606;&#1607;&#1580;&#1610; &#1548; &#1608;&#1607;&#1584;&#1607; &#1583;&#1585;&#1575;&#1587;&#1578;&#1610;!! &#1576;&#1604; &#1594;&#1575;&#1610;&#1577; &#1605;&#1575; &#1571;&#1606;&#1575; &#1601;&#1575;&#1593;&#1604; &#1571;&#1606; &#1571;&#1606;&#1592;&#1585; &#1603;&#1610;&#1601; &#1603;&#1575;&#1606; &#1571;&#1607;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1583;&#1610;&#1606; &#1610;&#1606;&#1592;&#1585;&#1608;&#1606; &#1573;&#1604;&#1609; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; &#1576;&#1571;&#1593;&#1610;&#1575;&#1606;&#1607;&#1605; &#1548; &#1608;&#1603;&#1610;&#1601; &#1603;&#1575;&#1606;&#1608;&#1575; - &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; - &#1593;&#1606;&#1583; &#1605;&#1606; &#1593;&#1575;&#1589;&#1585;&#1607;&#1605; &#1608;&#1605;&#1606; &#1580;&#1575;&#1569; &#1576;&#1593;&#1583;&#1607;&#1605; &#1605;&#1606; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1593;&#1604;&#1605;&#1575;&#1574;&#1607;&#1605;.    <P>
&#1608;&#1571;&#1610;&#1590;&#1575; &#1548; &#1601;&#1573;&#1606;&#1610; &#1604;&#1606; &#1571;&#1581;&#1602;&#1602; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1604;&#1605;&#1577; &#1601;&#1587;&#1575;&#1583; &#1605;&#1575; &#1576;&#1615;&#1606;&#1610; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1603;&#1605; &#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582;&#1610; &#1575;&#1604;&#1593;&#1580;&#1610;&#1576; &#1548; &#1575;&#1604;&#1584;&#1610; &#1575;&#1587;&#1578;&#1581;&#1583;&#1579;&#1607; &#1604;&#1606;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1575;&#1578;&#1576; &#1548; &#1576;&#1604; &#1571;&#1583;&#1593;&#1607; &#1573;&#1604;&#1609; &#1581;&#1610;&#1606;&#1607;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>These are four from <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger (sallallaahu alayhi wasallam), a Muslim writer [Qutb] mentions them with the likes of these strange distasteful expressions. Rather, he added (more to that), for much of the Bani Umayyah were not secure against his pen. For he threw upon them whatever he was able [to throw at them] of characteristics which in their entirety rendered them [Bani Umayyah] free of the deen of Allaah, having hypocrisy in their Islaam, and negating any moral element - as he calls it - from their lives.    <P>
And I am not going to debate right now this methodology (approach) [towards] history, for every claimant is able to say, "This is my methodology, and this is my study"!! Rather, the most that I am going to do is to look at who the people of this religion looked towards those four specifically, and how these four were with those contemporary to them and those who came after them from the leaders and scholars of the Muslims.    <P>
And also I am not going to corroborate [through this] word, the corruption upon which [this] strange, historical judgement is built, which this writer has introduced, rather I will leave it for due course.</blockquote>    <P>
After this <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> spends six pages or so in mentioning the status of these four Companions from the Sunnah. We will simply summarize what he has brought of these texts and statements, since the point here is simply to outline Mahmood Shakir's perspective in refuting <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and how <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> subsequently responded to him.    <P>
From what <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> wrote:    <P>
<ul><li>He mentions that when <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> (radiallaahu anhu) accepted Islam, he fought in the wars of Riddah (apostasy) against the murtaddeen, despite them being only a small group (against those murtaddeen, and he was subsequently in the armies prepared by Abu Bakr (radiallaahu anhu) for Shaam where he came together with his brother Yazid bin <a href='tags/abu-sufyan.html' class='tagLink'><font class='tagLink'>Abu Sufyan</font></a>. Later Umar placed <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> in charge of Damascus, and then Shaam.    <P>
<li>He then mentions numerous ahaadeeth which outline the virtues of <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a>, quoting them from the Musnad, and amongst them are the supplication of the Messenger for Mu'aawiyah (<span class='arb'>&#1575;&#1604;&#1604;&#1607;&#1605; &#1575;&#1580;&#1593;&#1604;&#1607; &#1607;&#1575;&#1583;&#1610;&#1575;&#1611; &#1605;&#1607;&#1583;&#1610;&#1575;&#1611; &#1548; &#1608;&#1575;&#1607;&#1583; &#1576;&#1607;</span>) "<i>O Allaah make him a guide (for others), guided, and guide (others) through him</i>", and also the saying of the Messenger (alayhis salaam) to Mu'aawiyah (<span class='arb'>&#1610;&#1575; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; ! &#1573;&#1606; &#1608;&#1604;&#1610;&#1578; &#1571;&#1605;&#1585;&#1575;&#1611;&#1563; &#1601;&#1575;&#1578;&#1602; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; &#1608;&#1575;&#1593;&#1583;&#1604;</span>) "O Mu'awiyah! If you take authority (over an affair), then have taqwa of Allaah the Mighty and Majestic and be just", and also the saying of Ibn 'Abbaas in relation to <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> (<span class='arb'>&#1605;&#1575; &#1603;&#1575;&#1606; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1593;&#1604;&#1609; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1605;&#1578;&#1607;&#1605;&#1575;</span>) "Mu'awiyah was never suspected in relation to Allaah's Messenger (sallallaahu alayhi wasallam", meaning in what he narrated or took from the Messenger.</ul>    <P>
After bringing such narrations, <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> says:    <P>
<div class='arabic' align='right'>&#1607;&#1584;&#1575; &#1576;&#1593;&#1590; &#1605;&#1575; &#1602;&#1610;&#1604; &#1601;&#1610; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; &#1548; &#1608;&#1601;&#1610; &#1583;&#1610;&#1606;&#1607; &#1608;&#1573;&#1587;&#1604;&#1575;&#1605;&#1607;.  &#1601;&#1573;&#1606; &#1603;&#1575;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1575;&#1578;&#1576; &#1602;&#1583; &#1593;&#1585;&#1601; &#1608;&#1575;&#1587;&#1578;&#1610;&#1602;&#1606; &#1571;&#1606; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1604;&#1602;&#1601;&#1577; &#1605;&#1606; &#1571;&#1591;&#1585;&#1575;&#1601; &#1575;&#1604;&#1603;&#1578;&#1576; &#1578;&#1606;&#1602;&#1590; &#1607;&#1584;&#1575; &#1606;&#1602;&#1590;&#1575;&#1611; &#1548; &#1581;&#1578;&#1609; &#1610;&#1602;&#1608;&#1604;: &#1573;&#1606; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1576;&#1585;&#1610;&#1569; &#1605;&#1606;&#1607;! &#1601;&#1607;&#1608; &#1608;&#1605;&#1575; &#1593;&#1585;&#1601;!!.  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This is some of what has been said about <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> (radiallahu anhu) and about his religion and his Islaam. So if this writer [Qutb] knows and is certain that the narrations [he] snatched from sections of the books [he used] invalidate all of this with a [complete] invalidation, such that he says, "Indeed Islaam is free of him", then its him and whatever he knows!!</blockquote>    <P>
Then he says:    <P>
<div class='arabic' align='right'>&#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1571;&#1581;&#1587;&#1606; &#1606;&#1592;&#1585;&#1575;&#1611; &#1608;&#1605;&#1593;&#1585;&#1601;&#1577; &#1576;&#1602;&#1585;&#1610;&#1588; &#1605;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1581;&#1610;&#1606; &#1608;&#1604;&#1617;&#1610; &#1610;&#1586;&#1610;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1587;&#1601;&#1610;&#1575;&#1606; &#1548; &#1608;&#1607;&#1608; &#1605;&#1606; &#1576;&#1606;&#1610; &#1571;&#1605;&#1610;&#1577; &#1548; &#1608;&#1571;&#1606;&#1601;&#1584; &#1576;&#1589;&#1585;&#1575;&#1611; &#1605;&#1606; &#1593;&#1605;&#1585; &#1581;&#1610;&#1606; &#1608;&#1604;&#1610; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577;&#1563; &#1601;&#1607;&#1608; &#1608;&#1605;&#1575; &#1593;&#1604;&#1605; !!  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And if he knows that he (Qutb, himself) is better in view and in  acquaintance of the Quraish than Abu Bakr when he gave authority to Yazid bin Abi Sufyan, and he is from Bani Umayyah, and more penetrative in his insight than Umar, when he gave authority to <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a>, then its him and whatever he knows!!</blockquote>    <P>
And then he says:    <P>
<div class='arabic' align='right'>&#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1604;&#1605; &#1610;&#1602;&#1575;&#1578;&#1604; &#1601;&#1610; &#1581;&#1585;&#1608;&#1576; &#1575;&#1604;&#1585;&#1583;&#1577; &#1573;&#1604;&#1575; &#1608;&#1607;&#1608; &#1610;&#1590;&#1605;&#1585; &#1575;&#1604;&#1606;&#1601;&#1575;&#1602; &#1608;&#1575;&#1604;&#1594;&#1583;&#1585;&#1563; &#1601;&#1604;&#1607; &#1605;&#1575; &#1593;&#1604;&#1605; !!</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And if he knows that <a href='tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a> did not fight in the wars of apostasy (against the murtaddoon) except whilst concealing nifaaq (hypocrisy) and ghadar (treachery, double-crossing) then to him is whatever he knows.</blockquote>    <P>
And then he says:    <P>
<div class='arabic' align='right'>&#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1585;&#1609; &#1605;&#1575; &#1607;&#1608; &#1571;&#1593;&#1592;&#1605; &#1605;&#1606; &#1584;&#1604;&#1603; &#1563; &#1571;&#1606;&#1607; &#1571;&#1593;&#1585;&#1601; &#1576;&#1589;&#1581;&#1575;&#1576;&#1577; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1605;&#1606; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610; &#1603;&#1575;&#1606; &#1610;&#1571;&#1578;&#1610;&#1607; &#1575;&#1604;&#1582;&#1576;&#1585; &#1605;&#1606; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1576;&#1571;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1605;&#1606;&#1575;&#1601;&#1602;&#1610;&#1606; &#1576;&#1571;&#1593;&#1610;&#1575;&#1606;&#1607;&#1605; &#1563; &#1601;&#1584;&#1604;&#1603; &#1605;&#1575; &#1571;&#1593;&#1610;&#1584;&#1607; &#1605;&#1606;&#1607; &#1571;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583;&#1607; &#1571;&#1608; &#1610;&#1602;&#1608;&#1604;&#1607; !!</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And if he holds what is greater than that (i.e. what has preceded), that he is  more knowledgeable of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger (sallallaahu alayhi wasallam) than Allaah's Messenger (himself) to whom the information used to come from the heaven of the names of the specific, individual Munafiqeen (hypocrites). And that is what I seek refuge in for him from that he should believe this or say it!!</blockquote>    <P>
Inshaa'Allaah we will continue with the rest in the next article.    <P>
<font class='titleHeadline'>Notes on the Above</font>    <P>
It is important here that we understand the significance of what is going on. You should know and understand that <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> did not recant from this evil and wicked orientation, despite being refuted, and whilst he altered and changed some expressions, he never abandoned his orientation and ideological conviction, that for which <a href='tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> is actually criticizing him for.     <P>
You can also refer to these articles that prove <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> maintained his doctrine towards those Companions:    <P>
<div class='sidebar'>  <ul><li> <b>Did <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> Repent From Abusing and Attacking the Companions?</b> Refuting the Intellectual Fraud of the Extremist <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> - Part 2 - (<a href=indexa2d2.html?fhmqo>see here</a>)  <li> <b>Did <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> Repent From Abusing and Attacking the Companions?</b> Refuting the Intellectual Fraud of the Extremist <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> - Part 1 - (<a href=indexc226.html?kjxfr>see here</a>)</ul>  </div>    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/pfwuf-muftee-abdul-azeez-aal-al-shaykh-on-the-saying-of-sayyid-qutb-about-muawiyyah-and-amr-bin-al-aas.html">Muftee Abdul-Azeez Aal al-Shaykh on the Saying of Sayyid Qutb About Mu'awiyyah and Amr bin al-Aas: It is the Saying of a Baatinee Khabeeth or a Yahoodee La'een and is the Epitomy of Nifaaq</a><BR>
//www.themadkhalis.com/md/?pfwuf<BR>

<li><a href="articles/udyrx-audio-of-mahmood-shakir-from-march-1976-in-defence-of-the-companions.html">Audio of Shaykh Mahmood Shakir from March 1976 In Defence of the Companions of the Messenger</a><BR>
//www.themadkhalis.com/md/?udyrx<BR>

<li><a href="articles/qpqvs-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-7.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 7 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Seventh Installment</a><BR>
//www.themadkhalis.com/md/?qpqvs<BR>

<li><a href="articles/wumtj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-6.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 6 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Sixth Installment - Attacks upon Mu'awiyah, Hind and Bani Umayyah</a><BR>
//www.themadkhalis.com/md/?wumtj<BR>

<li><a href="articles/sqrfw-sayyid-qutb-and-the-french-connection-the-french-catholic-social-darwinist-doctor-that-influenced-qutbs-jaahiliyyah.html">Sayyid Qutb And The French Connection: The French Catholic, Social Darwinist Doctor That Influenced Qutb's 'Jaahiliyyah'</a><BR>
//www.themadkhalis.com/md/?sqrfw<BR>

<li><a href="articles/iczdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-13.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 13 - Ta'weel of the Arsh, Negation of al-Uluww and Negation of 'Hawaadith' Upon the Way of the Jahmiyyah</a><BR>
//www.themadkhalis.com/md/?iczdi<BR>

<li><a href="articles/dsppw-readings-in-elementary-communism-the-manifesto-of-karl-marx-and-frederick-engels-and-sayyid-qutb.html">Readings in Elementary Communism: Karl Marx, Freidrich Engels, Sayyid Qutb, Capitalism, the State, Social Justice, Revolution and the Communist Manifesto</a><BR>
//www.themadkhalis.com/md/?dsppw<BR>

<li><a href="articles/oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a><BR>
//www.themadkhalis.com/md/?oyama<BR>

<li><a href="articles/ngbjl-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-5.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 5 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fifth Installment - The Most Distasteful Type of Revilement Against Mu'awiyah, Amr bin al-Aas, Abu Sufyaan and Hind</a><BR>
//www.themadkhalis.com/md/?ngbjl<BR>

<li><a href="articles/krmbd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-12.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 12 - Between al-Ghazali, ar-Razi and Sayyid Qutb - The Texts of the Attributes Are Imaginary Depictions With No Reality Behind Them</a><BR>
//www.themadkhalis.com/md/?krmbd<BR>

<li><a href="articles/lhrbj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-4.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 4 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fourth Installment - Takfir of Abu Sufyan</a><BR>
//www.themadkhalis.com/md/?lhrbj<BR>

<li><a href="articles/exkgz-qutbi-competition-corner-1st-quiz---test-your-knowledge-of-wahdatul-wujood.html">Qutbi Competition Corner: 1st Quiz - Test Your Knowledge of Wahdat ul-Wujood And The Positions of the Scholars Towards Those Who Express It</a><BR>
//www.themadkhalis.com/md/?exkgz<BR>

<li><a href="articles/veuwi-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-3.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 3 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Third Installment - Takfir of Bani Umayyah</a><BR>
//www.themadkhalis.com/md/?veuwi<BR>

<li><a href="articles/dsopw-imaam-muqbil-bin-haadee-al-waadiee-qutb-jamaaat-ut-takfir-zilal-milestones.html">Imaam Muqbil bin Haadee al-Waadi'ee: A Beginner Who Reads the Books of Qutb Will Not Perceive After Only a Few Days that He Has Become Amongst the Jamaa'at ut-Takfir</a><BR>
//www.themadkhalis.com/md/?dsopw<BR>

<li><a href="articles/romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a><BR>
//www.themadkhalis.com/md/?romka<BR>

<li><a href="articles/qodiy-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-2---mahmood-shakirs-defence-of-the-companions.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 2 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Second Installment - Malices and Resentments of the Idolatrous Western Civilization</a><BR>
//www.themadkhalis.com/md/?qodiy<BR>

<li><a href="articles/mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a><BR>
//www.themadkhalis.com/md/?mgrwe<BR>

<li><a href="articles/umiea-shaykh-saalih-aal-ash-shaykh-the-fikr-of-sayyid-qutb.html">Shaykh Saalih Aal ash-Shaykh: The Role of the  'Fikr' (Ideology) of Sayyid Qutb in Splitting, Disunity and The Emergence of the Jama'aat and the Freedom and Innocence of True Islamic Knowledge (Ilm) From All Of That</a><BR>
//www.themadkhalis.com/md/?umiea<BR>

<li><a href="articles/epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a><BR>
//www.themadkhalis.com/md/?epluy<BR>

<li><a href="articles/iosjk-imaam-al-albani-to-shaykh-rabee-everything-with-which-you-refuted-qutb-for-is-correct-and-true.html">Imaam al-Albani to Shaykh Rabee: Everything With Which You Refuted Qutb For Is Correct and True and May Allaah Reward You For Fulfilling The Obligation of Exposing His Ignorance and Deviance</a><BR>
//www.themadkhalis.com/md/?iosjk<BR>

<li><a href="articles/ezcyb-shaykh-muhammad-bin-jameel-zainoo-i-asked-mohammad-qutb-to-clarify-the-errors-of-his-brother-in-az-zilal.html">Shaykh Muhammad bin Jameel Zainoo: I Asked Mohammad Qutb To Clarify the Errors of His Brother in az-Zilal Regarding Ta'weel and the Doctrine of Wahdat ul-Wujood</a><BR>
//www.themadkhalis.com/md/?ezcyb<BR>

<li><a href="articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</a><BR>
//www.themadkhalis.com/md/?mslqe<BR>

<li><a href="articles/waqwg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-11.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 11 - Allaah Speaking to Moses and Allaah's Eternal Kalaam </a><BR>
//www.themadkhalis.com/md/?waqwg<BR>

<li><a href="articles/bguiq-shaykh-ibn-jibreen-making-takfir-upon-the-saying-of-sayyid-qutb-that-islam-is-a-mixture-of-communism-and-christianity.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen Makes Takfir Upon (Declares as Kufr) the Saying of Sayyid Qutb That Islam Is a Mixture of Communism and Christianity</a><BR>
//www.themadkhalis.com/md/?bguiq<BR>

<li><a href="articles/vlffh-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-10---the-quran-is-like-the-rest-of-what-allaah-creates-and-like-the-soul.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 10 - The Qur'an is (Created) Like The Soul and Like The Rest of What Allaah Creates</a><BR>
//www.themadkhalis.com/md/?vlffh<BR>

<li><a href="articles/mslbg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-9.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 9 - Moses and the Speech of Allaah</a><BR>
//www.themadkhalis.com/md/?mslbg<BR>

<li><a href="articles/pgpti-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-8.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 8 - Negating Tahayyuz (Spatial Occupation) From Allaah</a><BR>
//www.themadkhalis.com/md/?pgpti<BR>

<li><a href="articles/taifd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-7----allaah-does-not-have-a-makaan-hayyiz-hadd-jihah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 7 -  Allaah Does Not Have a Makaan, Hayyiz, Hadd, Jihah</a><BR>
//www.themadkhalis.com/md/?taifd<BR>

<li><a href="articles/tkptu-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-5---allaah-does-not-occupy-a-place-makaan.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 5 - Allaah Does Not Occupy a Place (Makaan)</a><BR>
//www.themadkhalis.com/md/?tkptu<BR>

<li><a href="articles/kxsoa-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-4.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 4 - Allaah's Uluww, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?kxsoa<BR>

<li><a href="articles/lalhx-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-3.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 3 - The Use of Aahaad Hadeeth in Aqidah</a><BR>
//www.themadkhalis.com/md/?lalhx<BR>

<li><a href="articles/ebzdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-2.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 2 - Ta'weel of al-Istiwaa and Negation of the Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ebzdi<BR>

<li><a href="articles/ppxmw-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-1---al-uluww-al-istiwaa-and-sifaat-filiyyah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 1 - The Qur'an, al-Istiwaa and Sifaat Fi'liyyah</a><BR>
//www.themadkhalis.com/md/?ppxmw<BR>

<li><a href="articles/sxptl-shaykh-saalih-al-fawzaan-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Saalih al-Fawzaan Distinguishes Between The Salafi Manhaj and The Qutbi Manhaj</a><BR>
//www.themadkhalis.com/md/?sxptl<BR>

<li><a href="articles/xwcmm-shaykh-muhammad-bin-saalih-al-uthaymeen-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Muhammad bin Saalih al-Uthaymeen Distinguished Between The Salafi Manhaj and The Qutbi Manhaj and Wholeheartedly Reccommended Warning From the Qutbi Manhaj After Detailed Study and Consideration</a><BR>
//www.themadkhalis.com/md/?xwcmm<BR>

<li><a href="articles/pidmx-shaykh-bin-baaz-on-sayyid-qutbs-attacks-upon-muawiyah-and-amr-ibn-al-aas-and-accusing-them-of-hypocrisy-and-treachery.html">Shaykh Bin Baaz on Sayyid Qutb's Attacks Upon Mu'awiyah and Amr Ibn al-Aas and Accusing them of Hypocrisy and Treachery</a><BR>
//www.themadkhalis.com/md/?pidmx<BR>

<li><a href="articles/chbqv-shaykh-muhammad-amaan-al-jaamee-there-is-no-doubt-about-sayyid-qutb-being-an-ashari.html">Shaykh Muhammad Amaan al-Jaamee: There Is No Dispute About Sayyid Qutb Being an Ash'ari</a><BR>
//www.themadkhalis.com/md/?chbqv<BR>

<li><a href="articles/rhmeq-sayyid-qutb-establishing-the-haakimiyyah-of-allaah-through-communism-socialism-and-leninism.html">Sayyid Qutb: Establishing the Haakimiyyah of Allaah (By Borrowing The Manifestos of Secular Atheist Jews)</a><BR>
//www.themadkhalis.com/md/?rhmeq<BR>

<li><a href="articles/fiohb-shaykh-salih-al-fawzaan-on-the-tafsir-of-sayyid-qutb-fee-zilaal-il-quran.html">Shaykh Salih al-Fawzaan on the Tafsir of Sayyid Qutb, 'Fee Zilaal il-Quran'</a><BR>
//www.themadkhalis.com/md/?fiohb<BR>

<li><a href="articles/tgdma-imaam-ibn-baaz-on-sayyid-qutbs-mockery-of-the-prophet-moses-and-his-taweel-of-istiwaa-upon-the-way-of-the-jahmiyyah-mutazilah.html">Imaam Ibn Baaz on Sayyid Qutb's Mockery of the Prophet Moses And His Ta'weel of Istiwaa Upon the Way of the Jahmiyyah Mu'tazilah</a><BR>
//www.themadkhalis.com/md/?tgdma<BR>

<li><a href="articles/bhman-shaykh-abdul-muhsin-al-abbaad-on-the-tafseer-of-sayyid-qutb.html">Shaykh Abdul-Muhsin al-Abbaad on the Tafseer of Sayyid Qutb</a><BR>
//www.themadkhalis.com/md/?bhman<BR>

<li><a href="articles/fufhr-shaykh-muhammad-bin-saalih-al-uthaymeen-on-sayyid-qutbs-tafseer.html">Shaykh Muhammad bin Saalih al-Uthaymeen on Sayyid Qutb's Tafseer</a><BR>
//www.themadkhalis.com/md/?fufhr<BR>

<li><a href="articles/oplui-a-brief-glimpse-into-the-mistakes-innovations-and-calamities-of-sayyid-qutb.html">A Brief Glimpse Into the Mistakes, Innovations and Calamities of Sayyid Qutb</a><BR>
//www.themadkhalis.com/md/?oplui<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?qpqvs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
</html>


