




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oyyln by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:09 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 6 - Imaan is a Single Entity It Is Not Divisible and the Madhhab of the Khawaarij and Murji'ah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 6 - Imaan is a Single Entity It Is Not Divisible and the Madhhab of the Khawaarij and Murji'ah</span><BR>
Monday, December 28 2009 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>The Saying that <a href='tags/imaan.html' class='tagLink'><font class='tagLink'>Imaan</font></a> is a Single Entity That Is Not Subject to Divisibility Is the Foundation of the Bid'ahs of the Khawaarij and the <a href="tags/murjiah.html" class="tagLink"><font class="tagLink">Murji'ah</font></a></font>    <P>
Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> said (Majmoo' al-Fataawaa 7/223):    <P>
<div class='arabic' align='right'>&#1608;&#1571;&#1605;&#1575; &#1602;&#1608;&#1604; &#1575;&#1604;&#1602;&#1575;&#1574;&#1604; : &#1573;&#1606; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1573;&#1584;&#1575; &#1584;&#1607;&#1576; &#1576;&#1593;&#1590;&#1607; &#1584;&#1607;&#1576; &#1603;&#1604;&#1607; &#1601;&#1607;&#1584;&#1575; &#1605;&#1605;&#1606;&#1608;&#1593; &#1608;&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1571;&#1589;&#1604; &#1575;&#1604;&#1584;&#1610; &#1578;&#1601;&#1585;&#1593;&#1578; &#1593;&#1606;&#1607; &#1575;&#1604;&#1576;&#1583;&#1593; &#1601;&#1610; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1601;&#1573;&#1606;&#1607;&#1605; &#1592;&#1606;&#1608;&#1575; &#1571;&#1606;&#1607; &#1605;&#1578;&#1609; &#1584;&#1607;&#1576; &#1576;&#1593;&#1590;&#1607; &#1584;&#1607;&#1576; &#1603;&#1604;&#1607; &#1604;&#1605; &#1610;&#1576;&#1602; &#1605;&#1606;&#1607; &#1588;&#1610;&#1569; . &#1579;&#1605; &#1602;&#1575;&#1604;&#1578; " &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1608;&#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; " : &#1607;&#1608; &#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1575; &#1571;&#1605;&#1585; &#1575;&#1604;&#1604;&#1607; &#1576;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1608;&#1607;&#1608; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1575;&#1604;&#1605;&#1591;&#1604;&#1602; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1571;&#1607;&#1604; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; ; &#1602;&#1575;&#1604;&#1608;&#1575; : &#1601;&#1573;&#1584;&#1575; &#1584;&#1607;&#1576; &#1588;&#1610;&#1569; &#1605;&#1606;&#1607; &#1604;&#1605; &#1610;&#1576;&#1602; &#1605;&#1593; &#1589;&#1575;&#1581;&#1576;&#1607; &#1605;&#1606; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1588;&#1610;&#1569; &#1601;&#1610;&#1582;&#1604;&#1583; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; &#1608;&#1602;&#1575;&#1604;&#1578; " &#1575;&#1604;&#1605;&#1585;&#1580;&#1574;&#1577; " &#1593;&#1604;&#1609; &#1575;&#1582;&#1578;&#1604;&#1575;&#1601; &#1601;&#1585;&#1602;&#1607;&#1605; : &#1604;&#1575; &#1578;&#1584;&#1607;&#1576; &#1575;&#1604;&#1603;&#1576;&#1575;&#1574;&#1585; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576;&#1575;&#1578; &#1575;&#1604;&#1592;&#1575;&#1607;&#1585;&#1577; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1573;&#1584; &#1604;&#1608; &#1584;&#1607;&#1576; &#1588;&#1610;&#1569; &#1605;&#1606;&#1607; &#1604;&#1605; &#1610;&#1576;&#1602; &#1605;&#1606;&#1607; &#1588;&#1610;&#1569; &#1601;&#1610;&#1603;&#1608;&#1606; &#1588;&#1610;&#1574;&#1575; &#1608;&#1575;&#1581;&#1583;&#1575; &#1610;&#1587;&#1578;&#1608;&#1610; &#1601;&#1610;&#1607; &#1575;&#1604;&#1576;&#1585; &#1608;&#1575;&#1604;&#1601;&#1575;&#1580;&#1585; &#1608;&#1606;&#1589;&#1608;&#1589; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1607; &#1578;&#1583;&#1604; &#1593;&#1604;&#1609; &#1584;&#1607;&#1575;&#1576; &#1576;&#1593;&#1590;&#1607; &#1608;&#1576;&#1602;&#1575;&#1569; &#1576;&#1593;&#1590;&#1607; ; &#1603;&#1602;&#1608;&#1604;&#1607; : " { &#1610;&#1582;&#1585;&#1580; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1585; &#1605;&#1606; &#1603;&#1575;&#1606; &#1601;&#1610; &#1602;&#1604;&#1576;&#1607; &#1605;&#1579;&#1602;&#1575;&#1604; &#1584;&#1585;&#1577; &#1605;&#1606; &#1573;&#1610;&#1605;&#1575;&#1606; } " . &#1608;&#1604;&#1607;&#1584;&#1575; &#1603;&#1575;&#1606; " &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1581;&#1583;&#1610;&#1579; " &#1593;&#1604;&#1609; &#1571;&#1606;&#1607; &#1610;&#1578;&#1601;&#1575;&#1590;&#1604; &#1608;&#1580;&#1605;&#1607;&#1608;&#1585;&#1607;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; : &#1610;&#1586;&#1610;&#1583; &#1608;&#1610;&#1606;&#1602;&#1589;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for the saying of the sayer [that]: "<i>If something of eemaan disappears, then all of it disappears, and this is prohibited</i>." And this is the foundation uopn which the innovations regarding eemaan branched off from. For they thought that when some of it (eemaan) goes, then all of it goes, [that] nothing remains from it.     <P>
Then the "<u>Khawaarij and Mu'tazilah</u>" said: It (eemaan) is the entirety of what Allaah and His Messenger have commanded, and it is the absolute eemaan, just as Ahl al-Hadeeth have said. They (the Khawaarij, Mu'tazilah) said, "<i>So when something of it goes, nothing of eemaan remains at all in its [former] possessor, and thus he will remain eternally in the Fire</i>".    <P>
And the <u><a href='tags/murjiah.html' class='tagLink'><font class='tagLink'>Murji'ah</font></a></u>, upon all of their varying factions, said: "<i>Major sins and abandoning the obligations do not take anything away from eemaan, since if something of it went, then nothing of it would remain, and thus it is a single entity, the righteous and sinful are equal with respect to it</i>".     <P>
And the texts of the Messenger and his companions indicate the departing of some of it and the remaining of some of it, such as [in] his saying, "<i>There will leave from the Hellfire one in whose heart is an seed's weight of eemaan</i>", and it is for this reason that Ahl us-Sunnah wal-Hadeeth were upon [the belief] the [the believers in their] eemaan can excel [over each other], and they say, "It (eemaan) increases and decreases".</blockquote>    <P>
And this is clear in explaining the creed of Ahl us-Sunnah wal-Hadeeth.    <P>
<font class='titleHeadline'>The Foundations of the Bid'ah of the Khawaarij in the Works of <a href="tags/sayyid-qutb.html" class="tagLink"><font class="tagLink">Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a></font>    <P>
There are many places in the works of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> where we see the origins of the bid'ah of Khawaarij, but one of the most foundational ones, is this statement here in az-Zilaal (2/798):    <P>
<div class='arabic' align='right'>&#1573;&#1606; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1608;&#1581;&#1583;&#1577; &#1604;&#1575; &#1578;&#1578;&#1580;&#1586;&#1571;</div>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>Indeed, eemaan is a singular (entity), it is not divisible (into parts).</blockquote>    <P>
To see this principle at work in the ideology of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> is in his exaggeration in the issue of <a href='tags/haakimiyyah.html' class='tagLink'><font class='tagLink'>Haakimiyyah</font></a>, leading to <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all Muslim societies upon the earth and calling for a violent revolutionary (Leninist) Jihaad against them. This has been noted about him by the Scholars of Ahl us-Sunnah, as well as prominent figureheads in al-Ikhwaan al-Muslimeen, and also Muhammad Abdul-Lateef as-Subkee, the head of the Committee of Verdicts of the University of al-Azhar, wrote a refutation of "<a href="tags/milestones.html" class="tagLink"><font class="tagLink">Milestones</font></a>" in 1965 (will be documented in a separate article). He (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) says (az-Zilaal 2/887-888):    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1604;&#1617;&#1607; - &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; - &#1610;&#1602;&#1608;&#1604; : &#1573;&#1606; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577; - &#1601;&#1610; &#1607;&#1584;&#1575; &#1603;&#1604;&#1607; - &#1605;&#1587;&#1571;&#1604;&#1577; &#1573;&#1610;&#1605;&#1575;&#1606; &#1571;&#1608; &#1603;&#1601;&#1585; &#1571;&#1608; &#1573;&#1587;&#1604;&#1575;&#1605; &#1571;&#1608; &#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1608;&#1588;&#1585;&#1593; &#1571;&#1608; &#1607;&#1608;&#1609;. &#1608;&#1573;&#1606;&#1607; &#1604;&#1575; &#1608;&#1587;&#1591; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1604;&#1575; &#1607;&#1583;&#1606;&#1577; &#1608;&#1604;&#1575; &#1589;&#1604;&#1581;! &#1601;&#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1608;&#1606; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1581;&#1603;&#1605;&#1608;&#1606; &#1576;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1617;&#1607; - &#1604;&#1575; &#1610;&#1582;&#1585;&#1605;&#1608;&#1606; &#1605;&#1606;&#1607; &#1581;&#1585;&#1601;&#1575; &#1608;&#1604;&#1575; &#1610;&#1576;&#1583;&#1604;&#1608;&#1606; &#1605;&#1606;&#1607; &#1588;&#1610;&#1574;&#1575; - &#1608;&#1575;&#1604;&#1603;&#1575;&#1601;&#1585;&#1608;&#1606; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605;&#1608;&#1606; &#1575;&#1604;&#1601;&#1575;&#1587;&#1602;&#1608;&#1606; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606;  &#1604;&#1575; &#1610;&#1581;&#1603;&#1605;&#1608;&#1606; &#1576;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1617;&#1607;. &#1608;&#1571;&#1606;&#1607; &#1573;&#1605;&#1575; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1602;&#1575;&#1574;&#1605;&#1610;&#1606; &#1593;&#1604;&#1609; &#1588;&#1585;&#1610;&#1593;&#1577; &#1575;&#1604;&#1604;&#1617;&#1607; &#1603;&#1575;&#1605;&#1604;&#1577; &#1601;&#1607;&#1605; &#1601;&#1610; &#1606;&#1591;&#1575;&#1602; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606;. &#1608;&#1573;&#1605;&#1575; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606;&#1608;&#1575; &#1602;&#1575;&#1574;&#1605;&#1610;&#1606; &#1593;&#1604;&#1609; &#1588;&#1585;&#1610;&#1593;&#1577; &#1571;&#1582;&#1585;&#1609; &#1605;&#1605;&#1575; &#1604;&#1605; &#1610;&#1571;&#1584;&#1606; &#1576;&#1607; &#1575;&#1604;&#1604;&#1617;&#1607; &#1548; &#1601;&#1607;&#1605; &#1575;&#1604;&#1603;&#1575;&#1601;&#1585;&#1608;&#1606; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605;&#1608;&#1606; &#1575;&#1604;&#1601;&#1575;&#1587;&#1602;&#1608;&#1606;. &#1608;&#1571;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1573;&#1605;&#1575; &#1571;&#1606; &#1610;&#1602;&#1576;&#1604;&#1608;&#1575; &#1605;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1608;&#1575;&#1604;&#1602;&#1590;&#1575;&#1577; &#1581;&#1603;&#1605; &#1575;&#1604;&#1604;&#1617;&#1607; &#1608;&#1602;&#1590;&#1575;&#1569;&#1607; &#1601;&#1610; &#1571;&#1605;&#1608;&#1585;&#1607;&#1605; &#1601;&#1607;&#1605; &#1605;&#1572;&#1605;&#1606;&#1608;&#1606; .. &#1608;&#1573;&#1604;&#1575; &#1601;&#1605;&#1575; &#1607;&#1605; &#1576;&#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1610;&#1606; .. &#1608;&#1604;&#1575; &#1608;&#1587;&#1591; &#1576;&#1610;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602; &#1608;&#1584;&#1575;&#1603; &#1608;&#1604;&#1575; &#1581;&#1580;&#1577; &#1608;&#1604;&#1575; &#1605;&#1593;&#1584;&#1585;&#1577; &#1548; &#1608;&#1604;&#1575; &#1575;&#1581;&#1578;&#1580;&#1575;&#1580; &#1576;&#1605;&#1589;&#1604;</div>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>And Allaah, the Sublime, says: Certainly, the [underlying] issue in all of this is the issue of [either] <a href='tags/imaan.html' class='tagLink'><font class='tagLink'>Imaan</font></a> or kufr, Islaam or <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>jaahiliyyah</font></a>, and the legislation or the desire. <b>And certainly there is no in-between state in this affair</b>. There is no truce or any treaty (in this affair)! The believers are those who judge by what Allaah has revealed - they do not distort a single letter from it, and nor do they replace any of it whatsoever. And the disbelievers, the oppressors and sinners, they are the ones who do not judge by what Allaah has revealed. <b>Either the rulers are upholding the Sharee'ah in its complete entirety (kaamilatan), and hence they are within the confines of <a href='tags/imaan.html' class='tagLink'><font class='tagLink'>Imaan</font></a>, or they are upholding other legislations, those for which Allaah has not given any authority</b>. Hence, they are disbelievers, oppressors, and sinners. And either the people [those ruled over] accept the law and decision of Allaah from the rulers and judges in their affairs, so that they are believers ... and if not then they are not believers. <b>And there is no middle path between this path or that path</b>, and nor is their any evidence and <u>nor is there any excuse (ma'dhirah)</u> and <u>nor any seeking to use the excuse of an attainable benefit (maslaha)</u>...</blockquote>     <P>
In this quote we see statements which are correct, namely, the obligation to judge by what Allaah has revealed, and to accept it and so on, but mixed with such absolutions and exaggerations that led the Leninist-Takfiris who emerged in the 60s, to make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all Muslim societies, nations and governments, and all the people within those societies who fall into major sins - see <a href=index25d5.html?zlzrg>this article</a> from Shaykh Saalih Aal ash-Shaykh on Qutb's exaggeration in that regard.    <P>
Regarding what <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> said right at the very end of negating any excuse, or the excuse of considering a maslahah, where he said, "<i>And there is no middle path between this path or that path, and nor is their any evidence and nor is there any excuse (ma'dhirah) and nor any seeking to use the excuse of an attainable benefit (maslaha)</i>", then <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> considers this legitimate and applicable in a saying of his which can be <a href=_a.html href=index59f5.html?umssw>found here</a>, and it is a statement that on its own has invalidated, demolished and laid to waste the very foundation of <s>Vladimir Lenin's</s> Qutb's revolutionary manhaj by contradicting the very premise upon which <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all societies. <a href=index59f5.html?umssw>Go and read that article her</a>e, it is a must read. Whilst the Takfiri-Leninists hold onto the speech of Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> in defence of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, he certainly did not agree with their corruption, <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> and exaggeration in this particular issue of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>. This is a hujjah against them. He considers "<b>the majority of rulers of today</b>" to be upon ruling by some of the <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> through ijtihaad, on account of which he considers them in error, but not guilty of kufr. This same meaning has also been stated by other Scholars such as Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> where they withhold from <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> on the basis that the rulers are making ijtihaad in some of these issues and may also be misled by ignorant scholars who are around them.    <P>
<div class='sidebar'>As for this issue of ruling by other than what Allaah has revealed, then based upon these texts in Qutb's works, the Takfiri-Leninists that emerged in the 60s with the ideology of localized and worldwide revolutions, their basis was <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> upon the situation predominant in most of the Muslim lands of the presence of <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> to varying degrees - and in which the rulers, as individuals, who happened to be in power, were not really responsible for these body of laws being present in those lands. However, to justify this <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, these <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> made attachments to what is found in the sayings of the Scholars that a Muslim ruler who abolishes the entire Sharee'ah from top to bottom in all of the affairs of the state, and institutes another law its place is a kaafir. So they mis-applied these statements to all Muslim countries without exception, and this is what they continue to do today, using that to make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of <a href='tags/saudi-arabia.html' class='tagLink'><font class='tagLink'>Saudi Arabia</font></a>, the Gulf countries and all other lands, alongside the fact that these Scholars whose words they use do not even agree with them, refute them, and label them as <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> and khawaarij! Such is the blindness, misguidance and hypocrisy of these people!</div>    <P>
Coming back to Qutb's quote, we can see that to him, eemaan can only exist if every single element of the Sharee'ah is in place and the ruler is ruling by it all. A situation that has not existed for 1400 years, ever since kingship appeared in the Ummah.     <P>
Abu Umaamah relates that the Prophet (sallallaahu alayhi wasallam) said:    <P>
<div class='arabic' align='right'>&#1604;&#1578;&#1606;&#1602;&#1590;&#1606; &#1593;&#1585;&#1609; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1593;&#1585;&#1608;&#1577; &#1593;&#1585;&#1608;&#1577; &#1601;&#1603;&#1604;&#1605;&#1575; &#1575;&#1606;&#1578;&#1602;&#1590;&#1578; &#1593;&#1585;&#1608;&#1577; &#1578;&#1588;&#1576;&#1579; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1575;&#1604;&#1578;&#1610; &#1578;&#1604;&#1610;&#1607;&#1575; &#1601;&#1571;&#1608;&#1604;&#1607;&#1606; &#1606;&#1602;&#1590;&#1575; &#1575;&#1604;&#1581;&#1603;&#1605; &#1608; &#1570;&#1582;&#1585;&#1607;&#1606; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The handholds of Islaam will be annulled, one by one, and every time a handhold is annulled the people will hold fast to the one that follows it. The first of them to be annulled is the rule (al-hukm), and the last of them is the prayer (as-salaat).</blockquote>    <P>
Reported by Ahmad in his Musnad, Ibn Hibbaan and al-Haakim. Saheeh al-Jaami' as-Sagheer (no. 5057) of Shaykh al-Albaanee who declared it <b>Saheeh</b>.    <P>
And Shaykh Abdul-Azeez bin Baz (rahimahullaah) commented, upon the previous hadeeth (as occurs in Majmoo' ul-Fataawa wa Maqaalaat al-Mutanawwi'ah):    <P>
<div class='arabic' align='right'>&#1608;&#1605;&#1593;&#1606;&#1609; &#1602;&#1608;&#1604;&#1607; &#1601;&#1610; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579;: "&#1608;&#1571;&#1608;&#1604;&#1607;&#1575; &#1606;&#1602;&#1590;&#1575;&#1611; &#1575;&#1604;&#1581;&#1603;&#1605;" &#1605;&#1593;&#1606;&#1575;&#1607; &#1592;&#1575;&#1607;&#1585; &#1608;&#1607;&#1608;: &#1593;&#1583;&#1605; &#1575;&#1604;&#1581;&#1603;&#1605; &#1576;&#1588;&#1585;&#1593; &#1575;&#1604;&#1604;&#1607; &#1608;&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1608;&#1575;&#1602;&#1593; &#1575;&#1604;&#1610;&#1608;&#1605; &#1601;&#1610; &#1594;&#1575;&#1604;&#1576; &#1575;&#1604;&#1583;&#1608;&#1604; &#1575;&#1604;&#1605;&#1606;&#1578;&#1587;&#1576;&#1577; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;. &#1608;&#1605;&#1593;&#1604;&#1608;&#1605; &#1571;&#1606; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1580;&#1605;&#1610;&#1593; &#1607;&#1608; &#1575;&#1604;&#1581;&#1603;&#1605; &#1576;&#1588;&#1585;&#1610;&#1593;&#1577; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1575;&#1604;&#1581;&#1584;&#1585; &#1605;&#1606; &#1575;&#1604;&#1581;&#1603;&#1605; &#1576;&#1575;&#1604;&#1602;&#1608;&#1575;&#1606;&#1610;&#1606; &#1608;&#1575;&#1604;&#1571;&#1593;&#1585;&#1575;&#1601; &#1575;&#1604;&#1605;&#1582;&#1575;&#1604;&#1601;&#1577; &#1604;&#1604;&#1588;&#1585;&#1593; &#1575;&#1604;&#1605;&#1591;&#1607;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the meaning of his saying in the hadeeth: "<b>The first of them to be anulled is the rule (al-hukm)</b>", its meaning is apparent, and it is the absence of ruling by the legislation of Allaah, and this is what is present today in most of the states ascribing to Islaam. And it is known that what is obligatory upon all is to judge by the Sharee'ah of Allaah in all things and to beware of judging by the <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a>, and the customs that oppose the pure legislation.</blockquote>    <P>
Whilst Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> states the obligation to rule by what Allaah has revealed in all affairs, he along with the scholars of Ahl us-Sunnah, do not make unrestricted <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> on account of the presence of <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> in greater or lesser amounts, except with the well-known tafseel (detail) that is found in many of his verdicts.    <P>
As for <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, if there is no complete rule, then it is kufr. The ruler is a kaafir. The government is kaafirah. And all associatead govermental bodies are kaafirah. And if the people obey the government, even if its out of disobedience, and acknowledgment of sin, they are kaafirs too - (<a href=index25d5.html?zlzrg>see here</a>). Its' black or white and there is no in-between state. This extremely dangerous doctrine, coupled with the Leninist-Marxist <a href='tags/revolutionary-ideology.html' class='tagLink'><font class='tagLink'>Revolutionary Ideology</font></a> upon which <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> wrote <i><a href='tags/milestones.html' class='tagLink'><font class='tagLink'>Milestones</font></a></i> and <i>az-Zilaal</i> (alongside the doctrines of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, Mu'tazilah, and As'hariyyah), is why many prominent figureheads from al-Ikhwaan al-Muslimeen themselves as well as the Scholars of Ahl us-Sunnah have pointed to <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> as the reviver of the Khawaarij in the 20th century, and we shall document these statements in other articles inshaa'Allaah.    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/mcsfd-shaykh-al-fawzan-defends-imaams-ibn-baz-and-ibn-uthaymin-from-the-accusation-of-irjaa.html">Shaykh al-Fawzan Defends Imaams Ibn Baz and Ibn Uthaymin From the Accusation of Irjaa' </a><BR>
//www.themadkhalis.com/md/?mcsfd<BR>

<li><a href="articles/knggw-shaykh-al-albani-shaykh-ibn-uthaymin-shart-kamal-and-shart-sihhah-irjaa-and-the-hawaalian-menace.html">Shaykh al-Albani, Shaykh Ibn Uthaymin, Shart Kamal and Shart Sihhah, Irjaa and the Gormless Hawalian Qutbis</a><BR>
//www.themadkhalis.com/md/?knggw<BR>

<li><a href="articles/oyyln-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-6---imaan-is-a-single-entity-it-is-not-divisible.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 6 - Imaan is a Single Entity It Is Not Divisible and the Madhhab of the Khawaarij and Murji'ah</a><BR>
//www.themadkhalis.com/md/?oyyln<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?oyyln by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:10 GMT -->
</html>


