




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?iywsi by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Shaykh Salih al-Fawzan Demolishes the Doubts of the Qutbiyyah Kharijiyyah Regarding Obedience, Takfir and Revolt</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Salih al-Fawzan Demolishes the Doubts of the Qutbiyyah Kharijiyyah Regarding Obedience, Takfir and Revolt</span><BR>
Friday, January 08 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Shaykh Salih <a href='tags/al-fawzan.html' class='tagLink'><font class='tagLink'>al-<a href="tags/fawzan.html" class="tagLink"><font class="tagLink">Fawzan</font></a></font></a> Addressing Some Doubts of the "Revolutionaries" And Aspects of Their Ideology</font>    <P>
In this short but very powerful statement the Shaykh has addressed and rebutted some of the major doubts of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> regarding the issue of revolting and tyrannical rulers and he has hinted that the people only deviated in this regard when they started taking their knowledge from "mufakkirs" and "adeebs" and threw the inheritance of the Salaf, in knowledge and action, behind their backs.    <P>
This statement is in the Shaykh's book "<i>Lumhah an Firaq ad-Dalaalah</i>", under the section on the Khawaarij, as a footnote (on page 21):    <P>
<div class='arabic' align='right'>&#1608;&#1601;&#1610; &#1593;&#1589;&#1585;&#1606;&#1575; &#1585;&#1576;&#1605;&#1575; &#1587;&#1605;&#1617;&#1608;&#1575; &#1605;&#1606; &#1610;&#1585;&#1609; &#1575;&#1604;&#1587;&#1605;&#1593;&#1614; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577;&#1614; &#1604;&#1571;&#1608;&#1604;&#1610;&#1575;&#1569; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1601;&#1610; &#1594;&#1610;&#1585; &#1605;&#1575; &#1605;&#1593;&#1589;&#1610;&#1577; &#1593;&#1605;&#1610;&#1604;&#1575;&#1611;&#1548; &#1571;&#1608; &#1605;&#1583;&#1575;&#1607;&#1606;&#1611;&#1575;&#1548; &#1571;&#1608; &#1605;&#1594;&#1601;&#1604;&#1575;&#1611;&#8207;.&#8207; &#1601;&#1578;&#1585;&#1575;&#1607;&#1605; &#1610;&#1602;&#1583;&#1581;&#1608;&#1606; &#1601;&#1610; &#1608;&#1614;&#1604;&#1610;&#1617;&#1614; &#1571;&#1605;&#1585;&#1607;&#1605;&#1548; &#1608;&#1610;&#1588;&#1617;&#1616;&#1607;&#1585;&#1608;&#1606; &#1576;&#1593;&#1610;&#1608;&#1576;&#1607; &#1605;&#1606; &#1601;&#1608;&#1602; &#1575;&#1604;&#1605;&#1606;&#1575;&#1576;&#1585;&#1548; &#1608;&#1601;&#1610; &#1578;&#1580;&#1605;&#1593;&#1575;&#1578;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1585;&#1587;&#1608;&#1604;&#1615; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604;&#1615;&#8207;:&#8207; &#8207;(&#8207;&#1605;&#1606; &#1571;&#1585;&#1575;&#1583;&#1614; &#1571;&#1606; &#1610;&#1606;&#1589;&#1581;&#1614; &#1604;&#1587;&#1604;&#1591;&#1575;&#1606; &#1576;&#1571;&#1605;&#1585;&#1563; &#1601;&#1604;&#1575; &#1610;&#1576;&#1583;&#1616; &#1604;&#1607; &#1593;&#1604;&#1575;&#1606;&#1610;&#1577;&#1611; &#1608;&#1604;&#1603;&#1606; &#1604;&#1610;&#1571;&#1582;&#1584;&#1618; &#1576;&#1610;&#1583;&#1616;&#1607;&#1548; &#1601;&#1610;&#1582;&#1604;&#1608;&#1575; &#1576;&#1607;&#1548; &#1601;&#1573;&#1606; &#1602;&#1614;&#1576;&#1616;&#1604;&#1614; &#1605;&#1606;&#1607; &#1601;&#1584;&#1617;&#1614;&#1575;&#1603;&#1614;&#1548; &#1608;&#1573;&#1604;&#1575; &#1603;&#1575;&#1606; &#1602;&#1583; &#1571;&#1583;&#1617;&#1614;&#1609; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1610;&#1607;&#8207;)&#8207; &#1585;&#1608;&#1575;&#1607; &#1571;&#1581;&#1605;&#1583;&#8207;:&#8207; &#8207;(&#8207;3/404&#8207;)&#8207; &#1605;&#1606; &#1581;&#1583;&#1610;&#1579; &#1593;&#1610;&#1575;&#1590; &#1576;&#1606; &#1594;&#1606;&#1605; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; -&#1548; &#1608;&#1585;&#1608;&#1575;&#1607; - &#1571;&#1610;&#1590;&#1611;&#1575; - &#1575;&#1576;&#1606; &#1571;&#1576;&#1610; &#1593;&#1575;&#1589;&#1605; &#1601;&#1610; &#8207;"&#8207;&#1575;&#1604;&#1587;&#1606;&#1577;&#8207;"&#8207;&#8207;:&#8207; &#8207;(&#8207;2/522&#8207;)&#8207;&#8207;.&#8207;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in our time, perhaps they will label the one who holds the [obligation] of hearing and obeying those in authority in whatever is other than disobedience to be a [paid] worker, a compromiser or a simpleton. You will see them reviling the one in authority over them, publicising his faults from the pulpits and in their gatherings, and the Messenger of Allaah (sallallaahu alayhi wasallam) says, "<i>Whoever wishes to advices the ruler with a matter, then let him not proclaim it openly, but let him take him by the hand, take him into seclusion [and advise him], so if he accepts it from him [then so be it], and if not, then he has fulfilled that which is upon him</i>." Reported by Ahmad (3/404) from the hadeeth of Iyaad bin Ghunm (radiallaahu anhu) and it was also reported by Ibn Abi Aasim in "as-Sunnah" (2/522)</blockquote>    <P>
<div class='arabic' align='right'>&#1571;&#1608; &#1573;&#1584;&#1575; &#1585;&#1571;&#1609; &#1608;&#1604;&#1610;&#1617;&#1615; &#1575;&#1604;&#1571;&#1605;&#1585;&#1616; &#1573;&#1610;&#1602;&#1575;&#1601;&#1614; &#1571;&#1581;&#1583;&#1616;&#1607;&#1605; &#1593;&#1606; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610; &#1575;&#1604;&#1605;&#1580;&#1575;&#1605;&#1593; &#1575;&#1604;&#1593;&#1575;&#1605;&#1577;&#1563; &#1578;&#1580;&#1605;&#1593;&#1608;&#1575; &#1608;&#1587;&#1575;&#1585;&#1608;&#1575; &#1601;&#1610; &#1605;&#1592;&#1575;&#1607;&#1585;&#1575;&#1578;&#1548; &#1610;&#1592;&#1606;&#1608;&#1606;&#1614; - &#1580;&#1607;&#1604;&#1575;&#1611; &#1605;&#1606;&#1607;&#1605; - &#1571;&#1606;&#1617;&#1614; &#1573;&#1610;&#1602;&#1575;&#1601;&#1614; &#1571;&#1581;&#1583;&#1616;&#1607;&#1605; &#1571;&#1608; &#1587;&#1580;&#1606;&#1614;&#1607;&#1615; &#1610;&#1587;&#1608;&#1594;&#1615; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580;&#1548; &#1571;&#1608;&#1614;&#1604;&#1614;&#1605;&#1618; &#1610;&#1587;&#1605;&#1593;&#1608;&#1575; &#1602;&#1608;&#1604;&#1614; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1601;&#1610; &#1581;&#1583;&#1610;&#1579; &#1593;&#1608;&#1601; &#1576;&#1606; &#1605;&#1575;&#1604;&#1603; &#1575;&#1604;&#1571;&#1588;&#1580;&#1593;&#1610; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; -&#1548; &#1593;&#1606;&#1583; &#1605;&#1587;&#1604;&#1605; &#8207;(&#8207;1855&#8207;)&#8207;&#8207;:&#8207; &#8207;(&#8207;&#1604;&#1575;&#8207;.&#8207; &#1605;&#1575; &#1571;&#1602;&#1575;&#1605;&#1608;&#1575; &#1601;&#1610;&#1603;&#1605; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577;&#8207;)&#8207;&#8207;.&#8207;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And when the wali ul-amr (one in authority) considers the prevention of one of them from making speeches in public gatherings, they gather together and participate in demonstrations, thinking - out of ignorance on their behalf - that the prevention of one of them, or imprisonment of one of them permits revolt. Have they  not heard the saying of the Prophet (sallallaahu alayhi wasallam) in the hadeeth of Awf bin Malik al-Ashja'ee (radiallaahu anhu) - which is in [the Saheeh] of Muslim (no. 1855), "<i>No [do not contend with them] so long as they establish the prayer amongst you</i>".</blockquote>    <P>
<div class='arabic' align='right'>&#1608;&#1601;&#1610; &#1581;&#1583;&#1610;&#1579; &#1593;&#1576;&#1575;&#1583;&#1577; &#1576;&#1606; &#1575;&#1604;&#1589;&#1575;&#1605;&#1578; - &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; - &#1601;&#1610; &#8207;"&#8207;&#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1610;&#1606;&#8207;"&#8207;&#8207;:&#8207; &#8207;(&#8207;&#1573;&#1604;&#1575; &#1571;&#1606; &#1578;&#1585;&#1608;&#1575; &#1603;&#1601;&#1585;&#1611;&#1575; &#1576;&#1608;&#1575;&#1581;&#1611;&#1575;&#1548; &#1593;&#1606;&#1583;&#1603;&#1605; &#1601;&#1610;&#1607; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607; &#1576;&#1585;&#1607;&#1575;&#1606;&#8207;)&#8207; &#1608;&#1584;&#1604;&#1603; &#1593;&#1606;&#1583; &#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1608;&#1575;&#1587;&#1578;&#1574;&#1584;&#1575;&#1606;&#1607;&#1605; &#1604;&#1607; &#1576;&#1602;&#1578;&#1575;&#1604; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605;&#1610;&#1606;&#8207;.</div>&#8207;    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in the hadeeth of Ubaadah bin as-Saamit (radiallaahu anhu) in the Two Saheehs, "<i>Unless you see clear kufr for which you have a proof from Allaah</i>", and this was [in response to] the question of <a href='tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> and their seeking permission to fight the oppressive rulers.</blockquote>    <P>
<div class='arabic' align='right'>&#1571;&#1604;&#1575; &#1610;&#1593;&#1604;&#1605;&#1615; &#1607;&#1572;&#1604;&#1575;&#1569; &#1603;&#1605; &#1604;&#1576;&#1579;&#1614; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605;&#1615; &#1571;&#1581;&#1605;&#1583;&#1615; &#1601;&#1610; &#1575;&#1604;&#1587;&#1580;&#1606;&#1616;&#1548; &#1608;&#1571;&#1610;&#1606;&#1614; &#1605;&#1575;&#1578;&#1614; &#1588;&#1610;&#1582;&#1615; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1616; &#1575;&#1576;&#1606;&#1615; &#1578;&#1610;&#1605;&#1610;&#1577;&#8207;&#1567;&#8207;&#8207;!&#8207;&#8207;.&#8207; &#1571;&#1604;&#1605; &#1610;&#1587;&#1580;&#1606; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; &#1576;&#1590;&#1593; &#1587;&#1606;&#1610;&#1606;&#1548; &#1608;&#1610;&#1580;&#1604;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1602;&#1608;&#1604; &#1576;&#1582;&#1604;&#1602; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606;&#1548; &#1601;&#1604;&#1616;&#1605;&#1614; &#1604;&#1614;&#1605;&#1618; &#1610;&#1571;&#1605;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1575;&#1604;&#1582;&#1604;&#1610;&#1601;&#1577;&#8207;&#1567;&#8207;&#8207;!&#8207;&#8207;. &#1608;&#1571;&#1604;&#1605; &#1610;&#1593;&#1604;&#1605;&#1608;&#1575; &#1571;&#1606; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1603;&#1579; &#1601;&#1610; &#1575;&#1604;&#1587;&#1580;&#1606; &#1605;&#1575; &#1610;&#1585;&#1576;&#1608; &#1593;&#1604;&#1609; &#1587;&#1606;&#1578;&#1610;&#1606;&#1548; &#1608;&#1605;&#1575;&#1578; &#1601;&#1610;&#1607;&#1548; &#1604;&#1616;&#1605;&#1614; &#1604;&#1614;&#1605;&#1618; &#1610;&#1571;&#1605;&#1585;&#1616; &#1575;&#1604;&#1606;&#1575;&#1587;&#1614; &#1576;&#1575;&#1604;&#1582;&#1585;&#1608;&#1580;&#1616; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1575;&#1604;&#1610; - &#1605;&#1593; &#1571;&#1606;&#1617;&#1614;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1601;&#1590;&#1604;&#1616; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1616; &#1594;&#1575;&#1610;&#1577;&#1615;&#1612;&#1548; &#1601;&#1610;&#1603;&#1601; &#1576;&#1605;&#1606; &#1583;&#1608;&#1606;&#1607;&#1605; -&#8207;&#1567;&#8207;&#8207;&#1567;&#8207;&#8207;!&#8207;&#8207;.&#8207;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>To those people not know how long Imaam Ahmad spent in the prison, and [do they not know] where Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> died? Was not Imaam Ahmad imprisoned for numerous years, and flogged in relation to the saying of the creation of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a>. Why did he not order the people to revolt against the khalifah?! Do they not know that Shaykh ul-Islaam spent what exceeds two years in prison and died therein. Why did he not order the people to revolt against the ruler - [and all of this] whilst they [Imaam Ahmad and Shaykh ul-Islaam] are in the extremity of excellence and knowledge. So how about those besides them?</blockquote>    <P>
<div class='arabic' align='right'>&#1573;&#1606;&#1617;&#1614; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1601;&#1603;&#1575;&#1585;&#1614; &#1608;&#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604;&#1614; &#1604;&#1605; &#1578;&#1571;&#1578;&#1616; &#1573;&#1604;&#1610;&#1606;&#1575; &#1573;&#1604;&#1575; &#1576;&#1593;&#1583;&#1605;&#1575; &#1571;&#1589;&#1576;&#1581;&#1614; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576;&#1615; &#1610;&#1571;&#1582;&#1584;&#1608;&#1606; &#1593;&#1604;&#1605;&#1614;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1605;&#1601;&#1603;&#1617;&#1616;&#1585;&#1616; &#1575;&#1604;&#1605;&#1593;&#1575;&#1589;&#1585;&#1616; &#1601;&#1604;&#1575;&#1606;&#1548; &#1608;&#1605;&#1606; &#1575;&#1604;&#1571;&#1583;&#1610;&#1576; &#1575;&#1604;&#1588;&#1575;&#1593;&#1585;&#1616; &#1601;&#1604;&#1575;&#1606;&#1548; &#1608;&#1605;&#1606; &#1575;&#1604;&#1603;&#1575;&#1578;&#1576;&#1616; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610; &#1601;&#1604;&#1575;&#1606;&#1548; &#1608;&#1610;&#1578;&#1585;&#1603;&#1608;&#1606;&#1614; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1616;&#1548; &#1608;&#1603;&#1578;&#1576;&#1614; &#1571;&#1587;&#1604;&#1575;&#1601;&#1616;&#1607;&#1605; &#1582;&#1604;&#1601;&#1614;&#1607;&#1605; &#1592;&#1607;&#1585;&#1610;&#1611;&#1575;&#1563; &#1601;&#1604;&#1575; &#1581;&#1608;&#1604;&#1614; &#1608;&#1604;&#1575; &#1602;&#1608;&#1617;&#1577;&#1614; &#1573;&#1604;&#1575; &#1576;&#1575;&#1604;&#1604;&#1607;</div>&#8207;.    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed these ideologies and [courses of] action did not come to us except after the youth started to take their knowledge from so and so "mufakkir" (thinker) and from so and so "adeeb" (literary write) and from so and so "Islamic writer", and they abandon the people of knowledge, and the books of their Salaf behind their back, and there is no might or power except by Allaah.</blockquote>    <P>
<font class='titleHeadline'>Further Reading</font>    <P>
You can learn more, especially about this last remark of the Shaykh, in these articles:    <P>
<ul><li> <b>Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> and Shaykh al-Fawzaan</b>: Between the <a href='tags/salafi-manhaj.html' class='tagLink'><font class='tagLink'>Salafi Manhaj</font></a> and the Qutubi Manhaj - (<a href=index0ec1.html?blaok>see here</a>)  <li> <b>Shaykh Saalih al-Fawzaan</b> Distinguishes Between The <a href='tags/salafi-manhaj.html' class='tagLink'><font class='tagLink'>Salafi Manhaj</font></a> and The <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> - (<a href=index7e0b.html?sxptl>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b> Distinguished Between The <a href='tags/salafi-manhaj.html' class='tagLink'><font class='tagLink'>Salafi Manhaj</font></a> and The <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> and Wholeheartedly Reccommended Warning From the <a href='tags/qutbi-manhaj.html' class='tagLink'><font class='tagLink'>Qutbi Manhaj</font></a> After Detailed Study and Consideration - (<a href=index49f2.html?xwcmm>see here</a>)  </ul>    <P>
   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/dsopw-imaam-muqbil-bin-haadee-al-waadiee-qutb-jamaaat-ut-takfir-zilal-milestones.html">Imaam Muqbil bin Haadee al-Waadi'ee: A Beginner Who Reads the Books of Qutb Will Not Perceive After Only a Few Days that He Has Become Amongst the Jamaa'at ut-Takfir</a><BR>
//www.themadkhalis.com/md/?dsopw<BR>

<li><a href="articles/iywsi-shaykh-salih-al-fawzan-demolishes-the-doubts-of-the-qutbiyyah-kharijiyyah-regarding-obedience-takfir-and-revolt.html">Shaykh Salih al-Fawzan Demolishes the Doubts of the Qutbiyyah Kharijiyyah Regarding Obedience, Takfir and Revolt</a><BR>
//www.themadkhalis.com/md/?iywsi<BR>

<li><a href="articles/tzogk-imaam-al-albaanee-on-the-kharijites-in-egypt-syria-algeria-and-saudi-arabia.html">Imaam al-Albaanee on the Kharijites in Egypt, Syria, Algeria and Saudi Arabia</a><BR>
//www.themadkhalis.com/md/?tzogk<BR>

<li><a href="articles/hyulz-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-1.html">The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 1 - Introduction and Background</a><BR>
//www.themadkhalis.com/md/?hyulz<BR>

<li><a href="articles/qawut-shaykh-hammaad-al-ansaaree-shaykh-saalih-al-fawzaan-shaykh-abdul-azeez-ar-raajihee-on-the-saudi-state-and-its-dissenters.html">Shaykh Hammaad al-Ansaaree, Shaykh Saalih al-Fawzaan, Shaykh Abdul-Azeez ar-Raajihee on the Saudi State And Its Dissenters</a><BR>
//www.themadkhalis.com/md/?qawut<BR>

<li><a href="articles/ddvwu-shaykh-saalih-al-fawzaan-on-ruling-by-the-secular-laws-and-a-rebuttal-of-the-people-of-takfir.html">Shaykh Saalih al-Fawzaan on Ruling by the Secular Laws and a Rebuttal of the People of Takfir</a><BR>
//www.themadkhalis.com/md/?ddvwu<BR>

<li><a href="articles/akaka-ibn-taymiyyahs-refutation-of-the-extremism-of-mawdudi-and-sayyid-qutb-on-the-issue-of-taaah-obedience.html">Words of Ibn Taymiyyah In Refutation of the Extremism of Mawdudi and Sayyid Qutb on the Issue of Taa'ah (Obedience)</a><BR>
//www.themadkhalis.com/md/?akaka<BR>

<li><a href="articles/zlzrg-shaykh-salih-aal-ash-shaykh-the-ghuluww-extremism-of-sayyid-qutb-in-takfir-of-the-sinners.html">Shaykh Salih Aal ash-Shaykh: The Ghuluww (Extremism) of Sayyid Qutb in Takfir of the Sinners</a><BR>
//www.themadkhalis.com/md/?zlzrg<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?iywsi by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
</html>


