




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?tyxdc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Sayyid Qutb, the Revolution Against the Caliph Uthmaan and the Revolution of the Baatiniyyah Raafidah Qaraamitah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Sayyid Qutb, the Revolution Against the Caliph Uthmaan and the Revolution of the Baatiniyyah Raafidah Qaraamitah</span><BR>
Wednesday, June 30 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Sayyid <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and the Revolution of <a href='tags/abdullah-bin-saba.html' class='tagLink'><font class='tagLink'>Abdullah bin Saba'</font></a> Against Uthmaan and the Revolution of the Qaraamitah Baatiniyah Shi'ah</font>    <P>
We have documented in other articles that <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> praised and lauded the revolution against Uthmaan (radiallaahu anhu) as "an outburst of the Islamic spirit", and that those "who had drunk from the spirit of the religion" were the ones behind it. This is how <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> described the vagabonds who revolted against Uthmaan (radiallaahu), acknowledging at the same time that it was instigated by Abdullaah bin Saba'. Refer to <a href=index4d9d.html?elmbe>this article</a> for more information.    <P>
<div class='sidebar'>We should also bear in mind that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> evaluated early Islamic history upon his Marxist-Communist nurturing which he received in the early years of his life, and he came from an anti-Capitalist, pro-Marxist Communist perspective when speaking against Uthmaan (radiallaahu anhu) - that's bearing in mind that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> considered Islam to be composed in part, of <a href='tags/communism.html' class='tagLink'><font class='tagLink'>Communism</font></a>. Read about that in more detail in <a href=indexbee3.html?dsppw>this article here</a>.</div>    <P>
It should then come as no surprise to us that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> also praises the revolutions of the Qaraamitah Baatiniyah <a href='tags/raafidah.html' class='tagLink'><font class='tagLink'>Raafidah</font></a> Shi'ah, who as Shaykh ul-Islam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> explains (in al-Majmoo'13/209-210) are the most disbelieving of people and the greatest in their enmity and harm to Islam and the Muslims:     <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1575;&#1587;&#1578;&#1578;&#1576;&#1593;&#1608;&#1575; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1605;&#1604;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1604;&#1575;&#1581;&#1583;&#1577; &#1608;&#1575;&#1604;&#1576;&#1575;&#1591;&#1606;&#1610;&#1577; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1608;&#1604;&#1607;&#1584;&#1575; &#1571;&#1608;&#1589;&#1578; &#1575;&#1604;&#1605;&#1604;&#1575;&#1581;&#1583;&#1577; - &#1605;&#1579;&#1604; &#1575;&#1604;&#1602;&#1585;&#1575;&#1605;&#1591;&#1577; &#1575;&#1604;&#1584;&#1610;&#1606; &#1603;&#1575;&#1606;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1576;&#1581;&#1585;&#1610;&#1606; &#1608;&#1607;&#1605; &#1605;&#1606; &#1571;&#1603;&#1601;&#1585; &#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1605;&#1579;&#1604; &#1602;&#1585;&#1575;&#1605;&#1591;&#1577; &#1575;&#1604;&#1605;&#1594;&#1585;&#1576; &#1608;&#1605;&#1589;&#1585; &#1608;&#1607;&#1605; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1587;&#1578;&#1578;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1578;&#1588;&#1610;&#1593; - &#1571;&#1608;&#1589;&#1608;&#1575; &#1576;&#1571;&#1606; &#1610;&#1583;&#1582;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1605;&#1606; &#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1588;&#1610;&#1593; &#1601;&#1573;&#1606;&#1607;&#1605; &#1610;&#1601;&#1578;&#1581;&#1608;&#1606; &#1575;&#1604;&#1576;&#1575;&#1576; &#1604;&#1603;&#1604; &#1593;&#1583;&#1608; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1606; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1608;&#1571;&#1607;&#1604; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1605;&#1606;&#1575;&#1601;&#1602;&#1610;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>...and the Shi'ah entice the enemies of the religion, amongst the atheists, the Baatiniyyah and others besides them. For this reason they counsel the atheists - such as the Qaraamitah who used to be in Bahrain, and they are the most disbelieving of the creation, and the likes of the Qaraamitah of the Maghreb and <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a>, and they used to conceal themselves behind Tashayyu' (beliefs of the Shi'ah) - they counseled them to enter upon the Muslims from the door of Shi'ism, for they (the Shi'ites) open up the door to every enemy of Islaam, amongst the Mushriks, the people of the Book, and the Hypocrites</blockquote>    <P>
So after lauding and validating the revolution against the Islamic authority of Uthmaan (radiallaahu anhu), he lauds the revolutions of the most disbelieving of mankind against the Islamic authorities, so lets take a look at what he has written.     <P>
Sayyid <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> wrote in "<a href="tags/al-adaalah-al-ijtimaaiyyah.html" class="tagLink"><font class="tagLink">al-Adaalah al-Ijtimaa'iyyah</font></a>":    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1608;&#1575;&#1602;&#1593; &#1571;&#1606; &#1575;&#1578;&#1607;&#1575;&#1605; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610; &#1576;&#1571;&#1606;&#1607; &#1604;&#1575; &#1610;&#1581;&#1605;&#1604; &#1590;&#1605;&#1575;&#1606;&#1575;&#1578;&#1607;&#1548; &#1573;&#1594;&#1601;&#1575;&#1604; &#1604;&#1604;&#1605;&#1605;&#1603;&#1606;&#1575;&#1578; &#1575;&#1604;&#1608;&#1575;&#1602;&#1593;&#1577; &#1601;&#1610; &#1603;&#1604; &#1606;&#1592;&#1575;&#1605; &#1603;&#1605;&#1575; &#1571;&#1606; &#1601;&#1610;&#1607; &#1573;&#1594;&#1601;&#1575;&#1604;&#1575;&#1611; &#1604;&#1581;&#1602;&#1575;&#1574;&#1602; &#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610; &#1575;&#1604;&#1584;&#1610; &#1588;&#1607;&#1583; &#1575;&#1604;&#1579;&#1608;&#1585;&#1577; &#1575;&#1604;&#1603;&#1576;&#1585;&#1609; &#1593;&#1604;&#1609; &#1593;&#1579;&#1605;&#1575;&#1606;&#1548; &#1608;&#1588;&#1607;&#1583; &#1579;&#1608;&#1585;&#1577; &#1575;&#1604;&#1581;&#1580;&#1575;&#1586; &#1593;&#1604;&#1609; &#1610;&#1586;&#1610;&#1583;&#1548; &#1603;&#1605;&#1575; &#1588;&#1607;&#1583; &#1579;&#1608;&#1585;&#1577; &#1575;&#1604;&#1602;&#1585;&#1575;&#1605;&#1591;&#1577; &#1608;&#1587;&#1608;&#1575;&#1607;&#1575; &#1590;&#1583; &#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1604;&#1575;&#1604; &#1608;&#1575;&#1604;&#1587;&#1604;&#1591;&#1577; &#1575;&#1604;&#1580;&#1575;&#1574;&#1585;&#1577; &#1608;&#1601;&#1608;&#1575;&#1585;&#1602; &#1575;&#1604;&#1591;&#1576;&#1602;&#1575;&#1578; &#1608;&#1605;&#1575; &#1610;&#1586;&#1575;&#1604; &#1575;&#1604;&#1585;&#1608;&#1581; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610; &#1610;&#1589;&#1575;&#1585;&#1593; &#1590;&#1583; &#1607;&#1584;&#1607; &#1575;&#1604;&#1575;&#1593;&#1578;&#1576;&#1575;&#1585;&#1575;&#1578; &#1580;&#1605;&#1610;&#1593;&#1575;&#1611; &#1593;&#1604;&#1609; &#1575;&#1604;&#1585;&#1594;&#1605; &#1605;&#1606; &#1575;&#1604;&#1590;&#1585;&#1576;&#1575;&#1578; &#1575;&#1604;&#1602;&#1575;&#1589;&#1605;&#1577; &#1575;&#1604;&#1578;&#1610; &#1608;&#1580;&#1607;&#1578; &#1573;&#1604;&#1610;&#1607; &#1601;&#1610; &#1579;&#1604;&#1575;&#1579;&#1605;&#1575;&#1574;&#1577; &#1608;&#1571;&#1604;&#1601; &#1593;&#1575;&#1605;</div>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>The reality is that accusing the Islamic system of not fulfilling its guarantees is ignoring the possibilities taking place in every system, just as it is ignoring the realities of Islamic history which has witnessed <b>the great revolution against Uthmaan</b>, and witnessed the revolution of al-Hijaz against Yazeed, <b>just as it witnessed the revolution of the Qaraamitah</b>, and (revolutions) besides them, against exploitation and oppressive leadership and class differences. And <u>the Islamic spirit</u> has not ceased to wrestle against all of these expressions (i.e. of injustice), despite all the crushing blows that have been directed towards it in 1300 years.</blockquote>    <P>
Shaykh Alee bin Yahyaa al-Haddaadi, after citing the above from Qutb's "al-Adaalah", writes the following note <a href=http://www.haddady.com/files/411725safahat-gotb.doc>in his short treatise</a>:    <P>
<div class='arabic' align='right'>&#1605;&#1605;&#1575; &#1601;&#1593;&#1604;&#1607; &#1575;&#1604;&#1602;&#1585;&#1575;&#1605;&#1591;&#1577;  &#1601;&#1610; &#1579;&#1608;&#1585;&#1578;&#1607;&#1605; &#1575;&#1604;&#1578;&#1610; &#1610;&#1588;&#1610;&#1583; &#1576;&#1607;&#1575; &#1587;&#1610;&#1583; &#1602;&#1591;&#1576; &#1602;&#1578;&#1604; &#1575;&#1604;&#1581;&#1580;&#1575;&#1580; &#1601;&#1610; &#1576;&#1610;&#1578; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1585;&#1575;&#1605; &#1601;&#1610; &#1610;&#1608;&#1605; &#1575;&#1604;&#1578;&#1585;&#1608;&#1610;&#1577; &#1587;&#1606;&#1577; 317&#1607;&#1600; &#1576;&#1602;&#1610;&#1575;&#1583;&#1577; &#1586;&#1593;&#1610;&#1605;&#1607;&#1605; &#1575;&#1604;&#1576;&#1575;&#1591;&#1606;&#1610; &#1575;&#1604;&#1586;&#1606;&#1583;&#1610;&#1602; &#1571;&#1576;&#1610; &#1591;&#1575;&#1607;&#1585; &#1604;&#1593;&#1606;&#1607; &#1575;&#1604;&#1604;&#1607;&#1548; &#1579;&#1605; &#1587;&#1604;&#1576; &#1575;&#1604;&#1576;&#1610;&#1578; &#1575;&#1604;&#1581;&#1580;&#1585; &#1575;&#1604;&#1571;&#1587;&#1608;&#1583;&#1548; &#1608;&#1587;&#1604;&#1576; &#1575;&#1604;&#1581;&#1580;&#1575;&#1580; &#1571;&#1605;&#1608;&#1575;&#1604;&#1607;&#1605; &#1608;&#1607;&#1608; &#1610;&#1602;&#1608;&#1604;: &#1571;&#1610;&#1606; &#1575;&#1604;&#1591;&#1610;&#1585; &#1575;&#1604;&#1571;&#1576;&#1575;&#1576;&#1610;&#1604;&#1567; &#1571;&#1610;&#1606; &#1575;&#1604;&#1581;&#1580;&#1575;&#1585;&#1577; &#1605;&#1606; &#1587;&#1580;&#1610;&#1604;&#1567; &#1608;&#1605;&#1603;&#1579; &#1575;&#1604;&#1581;&#1580;&#1585; &#1575;&#1604;&#1571;&#1587;&#1608;&#1583; &#1593;&#1606;&#1583; &#1575;&#1604;&#1602;&#1585;&#1575;&#1605;&#1591;&#1577; &#1581;&#1578;&#1609; &#1571;&#1593;&#1575;&#1583;&#1608;&#1607; &#1576;&#1593;&#1583; &#1575;&#1579;&#1606;&#1578;&#1610;&#1606; &#1608;&#1593;&#1588;&#1585;&#1610;&#1606; &#1587;&#1606;&#1577; . &#1575;&#1606;&#1592;&#1585; &#1578;&#1575;&#1585;&#1610;&#1582; &#1575;&#1576;&#1606; &#1603;&#1579;&#1610;&#1585; &#1581;&#1608;&#1575;&#1583;&#1579; &#1587;&#1606;&#1577; 317&#1607;&#1600; &#1608;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1605;&#1587;&#1578;&#1593;&#1575;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>From that which the Qaraamitah did in their revolution which <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> praises is the killing of the pilgrims in the Bayt Allaah al-Haraam on the day of tarwiyah in the year 317H under the leadership of their heretical Baatinee leader, Abu Taahir, may Allaah curse him. Then (they) removed the Black Stone from the Bayt, and kidnapped the pilgrims, taking their wealth, whilst saying, "Where are the birds of abaabeel? Where are the pebbles made of sijjeel (clay)." And the Black Stone remained with the Qaraamitah until they returned it after 22 years. Refer to Taareekh Ibn Katheer, the occurrences of the year 317H, and from Allaah is aid sought.</blockquote>    <P>
Note how <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> puts the revolution of the Qaraamitah Baatiniyyah alongside the "great revolution" against Uthmaan (radiallaahu anhu) and he lauds these revolutions as manifestations of "the Islamic spirit" which has never ceased to battle "social injustice" throughout the centuries. This <a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a> is something that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> continued upon right till the end of his life, as evidenced by his publications of his books <i><a href='tags/al-adaalah-al-ijtimaaiyyah.html' class='tagLink'><font class='tagLink'>al-Adaalah al-Ijtimaa'iyyah</font></a></i> and <i>Ma'rakat al-Islam wal-Ra'samaaliyyah</i>.    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?tyxdc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:07 GMT -->
</html>


