




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?qvrrm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:09 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | The Words of Imaam Ibn Baz Falling on Those (Qutbiyyah) Who Lied Upon Him (Safar al-Hawali, Salman al-Awdah, Muhammad Sa'eed al-Qahtani, Aa'id al-Qarnee, Abdur-Razzaq ash-Shayijee): Callers of Falsehood and Stirrers of the Murky Waters</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Words of Imaam Ibn Baz Falling on Those (Qutbiyyah) Who Lied Upon Him (Safar al-Hawali, Salman al-Awdah, Muhammad Sa'eed al-Qahtani, Aa'id al-Qarnee, Abdur-Razzaq ash-Shayijee): Callers of Falsehood and Stirrers of the Murky Waters</span><BR>
Wednesday, January 06 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Background and Introduction</font>    <P>
The presence in <a href='tags/saudi-arabia.html' class='tagLink'><font class='tagLink'>Saudi Arabia</font></a> of Manaa' al-Qattaan (as the Ikhwani recruiter) and his activities of organizing a "vanguard", upon the doctrines and methodologies of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, along with the presence of <a href='tags/mohammad-qutb.html' class='tagLink'><font class='tagLink'>Mohammad <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, and Mohammad Suroor and their types all led to the nurturing of some of the indigenous upon these ideologies of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, Leninist revolutions as the means of "giving <a href='tags/haakimiyyah.html' class='tagLink'><font class='tagLink'>Haakimiyyah</font></a> back to Allaah", and working to establish the  khilafah, as they claimed, despite the fact that they were living in a land that was established upon <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and in which the law of Allah was established, and the Scholars of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and the Sunnah were present in abundance.     <P>
There occurs in the book "al-Qutbiyyah", first published in the mid-90s, on page 27 of the 2004 print (Majaalis al-Hudaa):    <P>
<div class='arabic' align='right'> &#1575;&#1593;&#1604;&#1605; &#1600; &#1571;&#1582;&#1610; &#1575;&#1604;&#1602;&#1575;&#1585;&#1574; &#1600; &#1576;&#1571;&#1606;&#1617; &#1593;&#1604;&#1610; &#1593;&#1588;&#1605;&#1575;&#1608;&#1610; <&#1570;&#1582;&#1585; &#1602;&#1575;&#1583;&#1577; &#1575;&#1604;&#1578;&#1606;&#1592;&#1610;&#1605; &#1575;&#1604;&#1582;&#1575;&#1589;> &#1602;&#1575;&#1604; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607; <&#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582; &#1575;&#1604;&#1587;&#1585;&#1617;&#1616;&#1610; &#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;> &#1589; (62) &#1593;&#1606; &#1605;&#1606;&#1575;&#1593; &#1575;&#1604;&#1602;&#1591;&#1575;&#1606;: <&#1602;&#1610;&#1575;&#1583;&#1575;&#1578; &#1575;&#1604;&#1605;&#1607;&#1580;&#1585;>: &#1608;&#1576;&#1593;&#1583; &#1571;&#1606; &#1587;&#1605;&#1593;&#1578; &#1602;&#1589;&#1578;&#1607; &#1593;&#1606; &#1581;&#1575;&#1604; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1601;&#1571;&#1580;&#1575;&#1576;: &#1573;&#1606;&#1617; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577; &#1602;&#1583; &#1575;&#1582;&#1578;&#1575;&#1585;&#1608;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; <&#1605;&#1606;&#1575;&#1593; &#1602;&#1591;&#1575;&#1593;> &#1600; &#1603;&#1584;&#1575; &#1601;&#1610; &#1575;&#1604;&#1571;&#1589;&#1604; &#1600; &#1605;&#1587;&#1574;&#1608;&#1604;&#1575;&#1611; &#1593;&#1606;&#1607;&#1605; &#1600; &#1608;&#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1601;&#1610; &#1573;&#1605;&#1575;&#1585;&#1575;&#1578; &#1575;&#1604;&#1582;&#1604;&#1610;&#1580; &#1575;&#1582;&#1578;&#1575;&#1585;&#1608;&#1575; <&#1587;&#1593;&#1583; &#1575;&#1604;&#1583;&#1610;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605;> &#1605;&#1587;&#1574;&#1608;&#1604;&#1575;&#1611;... &#1608;&#1610;&#1580;&#1583;&#1585; &#1576;&#1606;&#1575; &#1571;&#1606; &#1606;&#1615;&#1593;&#1585;&#1617;&#1616;&#1601; &#1576;&#1603;&#1604;&#1617; &#1588;&#1582;&#1589;&#1610;&#1577; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1588;&#1582;&#1589;&#1610;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1584;&#1603;&#1585;&#1578;&#1607;&#1575;.  &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1606;&#1575;&#1593; &#1575;&#1604;&#1602;&#1591;&#1575;&#1606; &#1607;&#1608; &#1571;&#1581;&#1583; &#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1606;&#1608;&#1601;&#1610;&#1577;&#1548; &#1608;&#1602;&#1583; &#1607;&#1575;&#1580;&#1585; &#1608;&#1602;&#1610;&#1604; &#1573;&#1606;&#1617;&#1607; &#1571;&#1608;&#1617;&#1604; &#1605;&#1589;&#1585;&#1610; &#1610;&#1580;&#1585;&#1571; &#1593;&#1604;&#1609; &#1578;&#1580;&#1606;&#1610;&#1583; &#1587;&#1593;&#1608;&#1583;&#1610;&#1610;&#1606; &#1601;&#1610; &#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1576;&#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577;&#1548; &#1583;&#1608;&#1606; &#1575;&#1587;&#1578;&#1588;&#1575;&#1585;&#1577; &#1571;&#1581;&#1583;&#1548; &#1581;&#1578;&#1609; &#1571;&#1606;&#1617;&#1606;&#1610; &#1581;&#1610;&#1606;&#1605;&#1575; &#1593;&#1583;&#1578; &#1605;&#1606; &#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577; &#1576;&#1593;&#1583; &#1586;&#1610;&#1575;&#1585;&#1577; &#1604;&#1607;&#1575; &#1593;&#1575;&#1605; 1964&#1605;&#1548; &#1575;&#1587;&#1578;&#1602;&#1576;&#1604;&#1606;&#1610; &#1575;&#1604;&#1571;&#1582; &#1605;&#1581;&#1605;&#1617;&#1583; &#1607;&#1604;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1605;&#1591;&#1575;&#1585; &#1608;&#1587;&#1571;&#1604;&#1606;&#1610;: &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1574;&#1608;&#1604; &#1607;&#1606;&#1575; &#1567;  &#1601;&#1602;&#1604;&#1578; &#1604;&#1607;: &#1573;&#1606;&#1617;&#1607; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1606;&#1575;&#1593; &#1575;&#1604;&#1602;&#1591;&#1575;&#1606;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Know - dear brother reader - that Alee Ashmawi (one of the unique, special leaders of the organization - said in his book "The Secret History of the Jamaa'ah of al-Ikhwaan al-Muslimeen" (p. 62), about Manaa' al-Qattaan (in "Qiyaadaat al-Mahjar" Leaderships of the Places of Emigration - [meaning the Ikhwani leadership in those areas to which the Egyptian Ikhwanis fled to from Nasserite Egypt])... The Ikhwaan (Muslim Brotherhood) in Saudiyyah have chosen Shaykh Manaa' al-Qattaan as the responsible leader for them, and in the Gulf Emirates they have chosen Sa'd ad-Deen Ibrahim as the responsible leader ... and it is worthy that we are familiarize with each of these personalities which I have mentioned.    <P>
Shaykh Manaa' al-Qattaan is one of the Ikhwaan from al-Monovia (a region in Egypt), and he emigrated, and it is said that he was the first Egyptian who dared to started recruiting Saudis into the da'wah of the Ikhwaan (Muslim Brotherhood) in Saudiyyah, without consultation with anyone. When I returned from <a href='tags/saudi.html' class='tagLink'><font class='tagLink'>Saudi</font></a> after visiting it in 1964CE, the brother Muhammad Hilaal came to me in the airport and asked me, "Who is responsible there?". I said to him, "It is Shaykh Manaa' al-Qattaan".</blockquote>    <P>
With this type of presence and this type of secretive call in nurturing Saudis upon the <a href='tags/qutbi.html' class='tagLink'><font class='tagLink'>Qutbi</font></a> Leninist doctrines of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and the mass-populist political ideologies of <a href='tags/banna.html' class='tagLink'><font class='tagLink'>Banna</font></a> starting from the sixties, it was inevitable that a generation be produced 20 years later that would represent these ideologies, preaching and calling to them. The activities of these people were to show the face of Salafiyyah (displaying a Salafi <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, refuting the <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a> etc.) to gain the confidence of others, whilst calling to <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, the doctrines of the Khawaarij, of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, and revolutionary manifestos of secular atheist Jews, all in the name of "opposing secularism". Thus, upon the doctrines of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, they considered the complete absence of any Muslim state in the entire world. Due to the presence of major sins (like usury) in the Muslim lands, these "<a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a>" made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all Muslim nations and claimed the banners being raised in the whole world (including <a href='tags/saudi.html' class='tagLink'><font class='tagLink'>Saudi</font></a> Arabia) are secular banners - upon Qutb's notion that <u>any deviation</u> from <u>complete and total rule</u> by the Sharee'ah in <u>all affairs</u> is kufr and apostasy that warrants snatching the "<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a>" and giving it back to Allaah -  and they hoped that "Afghanistan" would become <u>the first Islamic State</u>. This way of thinking came to them from the Ash'arites of <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a>, the likes of Hassan al-Banna and <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, and through the Ikhwanis who settled in <a href='tags/saudi.html' class='tagLink'><font class='tagLink'>Saudi</font></a> and began their call.    <P>
<div class='sidebar'>This call was not made open until after the first Gulf War in 1990, when the "<a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a>" came out and used this War as a means to belittle and attack the Scholars, this being a stage through which to call to themselves and their own ideologies. This would not become apparent to the Major Scholars  like <a href='tags/shaykh-ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Shaykh <a href="tags/ibn-uthaymin.html" class="tagLink"><font class="tagLink">Ibn Uthaymin</font></a></font></a> and Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> until the latter part of the 1990s. However, the Shaykhs of Madinah, at the head of the <u>Shaykh Rabee' bin Haadee al-Madkhali</u> - due to their being grounded in the actualization of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, and da'wah to it, upon the methodology of the Prophets  figured out these people (<a href=index01b7.html?ebhen>see this article right here!</a>), and knowing the vileness of their way, and the core of what they were upon and working towards, they began to warn from these "<a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a>". From this point (just after the Gulf War, 1991) many years of confusion set in, when these individuals - <u><a href='tags/safar-al-hawali.html' class='tagLink'><font class='tagLink'>Safar al-Hawali</font></a></u>, <u><a href='tags/salman-al-awdah.html' class='tagLink'><font class='tagLink'>Salman al-Awdah</font></a></u>, <u><a href='tags/muhammad-saeed-al-qahtani.html' class='tagLink'><font class='tagLink'>Muhammad Sa'eed al-Qahtani</font></a></u>, <u>Nasir al-'Umar</u>, <u><a href='tags/aaid-al-qarnee.html' class='tagLink'><font class='tagLink'>Aa'id al-Qarnee</font></a></u> and their likes, knowing that they had been figured out, went on a campaign of slander and defamation against those Scholars who had first tried to advise them (to no avail) and then decided to correct their errors to protect the society from the evil that they were upon.</div>    <P>
So the same old slogans were hear today, "<i>making jarh of the du'at, and slandering them and backbiting them</i>", these were carried to the  Scholars at that time, like Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a>, as a means of getting these Scholars to speak about the likes of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> in particular and others in general. A lot happened during those five or six years. By the end of the decade however, their affair was made manifest, and the truth prevailed, and their flag-ship "<i>the Qutbiyyah</i>" which set sail after the Gulf War, was pulverised, in ruins - by the collective statements of the Scholars in which there was a vindication for <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and conviction of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, and all these sayings are the ones being document systematically on this website, through which this picture will emerge very clearly.    <P>
In this article, <u>and for the historical record</u>, we want to cover an historical incident that took place within that period of time. In the early 1990s (1412CE), Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> issued <u>a general statement of advice</u>, after the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> were trying to cause trouble and get the Shaykh to "attack" the other Scholars, like <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>. When the Shaykh gave a generalised advice, they began to interpret it and claim it was directed specifically at the Shaykhs of Madinah (i.e. <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and those with him). After a while, the Shaykh was asked to clarify his naseehah, because of the commotion that was being spread, and so the Shaykh established the truth, and made a clarification which <u>blackened the faces</u> of the liars, because he defended the honour of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> by name.    <P>
<font class='titleHeadline'>The Audio Files</font>    <P>
In the link below, is a compilation of the audio of the various statements that you will find translated below, as well as the clarification of Imaam <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> at the end of the audio file.    <P>
<b>Download the recording of all the statements.</b><BR>  <a href=assets/audio/bin-baz-lie-of-qutbiyyah.ram>Download Realaudio file here</a>    <P>
<font class='titleHeadline'>The Claims of the <a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a></font>    <P>
Here we will present the words of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, what appears below is just part of what is in the actual audio, you can listen to the complete audio for their statements in full.    <P>
<u>The Lie of Salman al-Awdah</u>    <P>
Salman al-Awdah in the lecture (<span class='arb'>&#1578;&#1581;&#1585;&#1610;&#1585; &#1575;&#1604;&#1571;&#1585;&#1590; &#1571;&#1605; &#1578;&#1581;&#1585;&#1610;&#1585; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606;</span>) "<i>Tahrir ul-Ard Am Tahrir ul-Insan</i>":    <P>
<div class='arabic' align='right'>&#1610;&#1575; &#1571;&#1582;&#1610;: &#1575;&#1604;&#1582;&#1591;&#1575;&#1576; &#1575;&#1604;&#1584;&#1610; &#1602;&#1585;&#1571;&#1578;&#1607; &#1593;&#1604;&#1610;&#1603;&#1605;&#1548; &#1606;&#1581;&#1606; &#1575;&#1602;&#1578;&#1585;&#1581;&#1606;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1573;&#1582;&#1585;&#1575;&#1580;&#1607; &#1605;&#1606;&#1584; &#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1588;&#1607;&#1585;&#1548; &#1608;&#1603;&#1575;&#1606; &#1605;&#1602;&#1578;&#1606;&#1593;&#1611;&#1575; &#1576;&#1573;&#1582;&#1585;&#1575;&#1580;&#1607;&#1548; &#1604;&#1603;&#1606;&#1617;&#1614; &#1603;&#1579;&#1585;&#1577; &#1605;&#1588;&#1575;&#1594;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1581;&#1575;&#1604;&#1578; &#1583;&#1608;&#1606; &#1584;&#1604;&#1603;... &#1608;&#1575;&#1604;&#1608;&#1575;&#1602;&#1593; &#1571;&#1606;&#1617;&#1607; &#1571;&#1576;&#1583;&#1611;&#1575; &#1575;&#1604;&#1605;&#1608;&#1590;&#1608;&#1593; &#1576;&#1603;&#1575;&#1605;&#1604;&#1607; &#1571;&#1606;&#1575; &#1593;&#1604;&#1609; &#1593;&#1604;&#1605; &#1576;&#1607;&#1548; &#1605;&#1606;&#1584; &#1571;&#1606; &#1603;&#1575;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1582;&#1591;&#1575;&#1576; &#1601;&#1603;&#1585;&#1577;&#1548; &#1608;&#1605;&#1588;&#1585;&#1608;&#1593;&#1548; &#1608;&#1603;&#1610;&#1601;&#1610;&#1577; &#1589;&#1610;&#1575;&#1594;&#1578;&#1607;&#1548; &#1608;&#1578;&#1608;&#1602;&#1610;&#1593; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1604;&#1610;&#1607;&#1548; &#1608;&#1605;&#1575; &#1610;&#1578;&#1593;&#1604;&#1617;&#1602; &#1576;&#1607; &#1608;&#1571;&#1576;&#1593;&#1575;&#1583;&#1607; !!! &#1608;&#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1576;&#1607; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1585;&#1580;&#1601;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577;...    <P>
&#1610;&#1603;&#1601;&#1610;&#1603; &#1605;&#1575; &#1587;&#1608;&#1617;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1607; &#1608;&#1580;&#1608;&#1607;&#1607;&#1605; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1582;&#1591;&#1575;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586;  </div>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>My dear brother! The statement which I have just read to you, we have been proposing to <a href='tags/shaykh-abdul-aziz-bin-baz.html' class='tagLink'><font class='tagLink'>Shaykh Abdul-Aziz Bin Baz</font></a> for three months (to make this statement) and he was happy to issue it. However, the Shaikh's various engagements made this very difficult. I have full knowledge of it, from the time that this statement was just merely an idea, when it was given the go ahead, how it was composed, when the Shaikh actually made it, and what is related and not related to it!!! And those who were intended by it are the sedition makers in Madinah</blockquote>    <P>
And a person then asked:     <P>
<blockquote class='quote'><img src='images/quote-start.gif'><div class='arabic' align='right'>&#1604;&#1616;&#1605;&#1614; &#1604;&#1575; &#1610;&#1578;&#1605;&#1617;... &#1601;&#1590;&#1581; &#1575;&#1604;&#1571;&#1588;&#1582;&#1575;&#1589; &#1575;&#1604;&#1584;&#1610;&#1606; &#1578;&#1603;&#1604;&#1617;&#1605;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1583;&#1593;&#1575;&#1577; &#1605;&#1575; &#1583;&#1575;&#1605; &#1571;&#1606;&#1617;&#1614;&#1607;&#1605; &#1593;&#1604;&#1609; &#1576;&#1575;&#1591;&#1604; &#1567;!!</div>    <P>
Why did he not complete it - exposing the individuals [i.e. by name] who have spoken against the Ulamaa and the Du'at so long as they are upon this falsehood?! </blockquote>    <P>
To which Awdah replied,     <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>It is sufficient for you that Allaah has blackened their faces in light of this statement of Shaikh Abdul-Aziz...</blockquote>    <P>
<u>The Lie of Muhammad Sa'eed al-Qahtani</u>    <P>
Muhammad Sa'eed al-Qahtani said in his lesson (<span class='arb'>&#1588;&#1585;&#1581; &#1605;&#1582;&#1578;&#1589;&#1585; &#1605;&#1593;&#1575;&#1585;&#1580; &#1575;&#1604;&#1602;&#1576;&#1608;&#1604;</span>), "<i>Sharh Mukhtasar Ma'aarij il-Qubool</i>", in the city of Jeddah:    <P>
<div class='arabic' align='right'>&#1610;&#1571;&#1578;&#1610; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1587;&#1601;&#1607;&#1575;&#1569; &#1601;&#1610;&#1585;&#1608;&#1617;&#1616;&#1580;&#1608;&#1606; &#1576;&#1571;&#1588;&#1585;&#1591;&#1577; &#1605;&#1571;&#1580;&#1608;&#1585;&#1577; &#1604;&#1604;&#1591;&#1593;&#1606;&#1548; &#1608;&#1610;&#1580;&#1610;&#1583;&#1608;&#1606; &#1603;&#1578;&#1575;&#1576;&#1577; &#1575;&#1604;&#1578;&#1602;&#1575;&#1585;&#1610;&#1585; &#1601;&#1610; &#1575;&#1604;&#1582;&#1604;&#1601; &#1593;&#1604;&#1609; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569;.. &#1608;&#1607;&#1605; &#1588;&#1585;&#1584;&#1605;&#1577; &#1600; &#1608;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1605;&#1583; &#1600; &#1608;&#1605;&#1593;&#1585;&#1608;&#1601;&#1610;&#1606; &#1600; &#1607;&#1603;&#1584;&#1575; &#1600; &#1608;&#1604;&#1575; &#1606;&#1606;&#1580;&#1617;&#1616;&#1587; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1580;&#1604;&#1587; &#1576;&#1584;&#1603;&#1585; &#1571;&#1587;&#1605;&#1575;&#1574;&#1607;&#1605;.  &#1607;&#1605; &#1605;&#1593;&#1585;&#1608;&#1601;&#1610;&#1606; (&#1607;&#1603;&#1584;&#1575; !!)&#1548; &#1601;&#1585;&#1601;&#1590;&#1608;&#1575; &#1606;&#1589;&#1610;&#1581;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582;&#1548; &#1579;&#1605;&#1617; &#1578;&#1603;&#1585;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1571;&#1605;&#1585; &#1605;&#1606;&#1607;&#1605; &#1600; &#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; &#1600; &#1605;&#1593;&#1607;&#1605; &#1600; &#1601;&#1571;&#1576;&#1608;&#1575; &#1573;&#1604;&#1575;&#1617; &#1575;&#1604;&#1593;&#1606;&#1575;&#1583;&#1548; &#1608;&#1575;&#1604;&#1578;&#1588;&#1607;&#1610;&#1585;&#1548; &#1608;&#1575;&#1604;&#1578;&#1588;&#1603;&#1610;&#1603;&#1548; &#1601;&#1603;&#1578;&#1576; &#1600; &#1581;&#1601;&#1592;&#1607; &#1575;&#1604;&#1604;&#1607; &#1600; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1589;&#1610;&#1581;&#1577;  </div>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>Those foolish ones come along and they circulate cassettes filled with revilementý and they are only a small band - and all praise is due to Allaah - and they are known as such, but we will not make this gathering impure by mentioning their names. They are well known. And they rejected the Shaikh's advice and the Shaikh - may Allaah protect him - continued in this matter with them (i.e. continued to advise them), but they only persisted in their obstinacy, and their publicising of faults, and causing doubts. So he wrote - may Allaah protect him - this advice.</blockquote>    <P>
<u>The Lie of Safar al-Hawali</u>    <P>
Safar al-Hawali's is a lengthy statement, its on the recording above, and also amongst those who lied upon Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> were Abdur-Razzaaq ash-Shayijee. In his book, "<i>Adwaa alaa <a href='tags/fikr.html' class='tagLink'><font class='tagLink'>fikr</font></a> Du'aat as-Salafiyyah al-Jadeedah</i>" (p10), ash-Shayijee states that the statement of Shaikh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> was specifically intended for the Shaikhs of Madinah and <a href='tags/shaikh-rabi.html' class='tagLink'><font class='tagLink'>Shaikh Rabi</font></a> bin Hadi in particular. And likewise, <a href='tags/aaid-al-qarnee.html' class='tagLink'><font class='tagLink'>Aa'id al-Qarnee</font></a> was amongst the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> who lied upon Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> (rahimahullaah).    <P>
<font class='titleHeadline'>Shaykh Ibn Baz's Clarification</font>    <P>
Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> issued a clarification (on 28/7/1412H), and it is in the audio file above:    <P>
<div class='arabic' align='right'>&#1576;&#1587;&#1605; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1575;&#1604;&#1585;&#1581;&#1610;&#1605;&#1548; &#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1608;&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1585;&#1587;&#1608;&#1604;&#1607;&#1548; &#1608;&#1593;&#1604;&#1609; &#1570;&#1604;&#1607; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1607;&#1548; &#1571;&#1605;&#1617;&#1614;&#1575; &#1576;&#1593;&#1583;:    <P>
&#1601;&#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1589;&#1583;&#1585; &#1605;&#1606;&#1575;&#1548; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1605;&#1606;&#1607; &#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1580;&#1605;&#1610;&#1593;&#1548; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1583;&#1593;&#1575;&#1577; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569;&#1548; &#1573;&#1604;&#1609; &#1575;&#1604;&#1606;&#1602;&#1583; &#1575;&#1604;&#1576;&#1606;&#1575;&#1569;&#1548; &#1608;&#1593;&#1583;&#1605; &#1575;&#1604;&#1578;&#1593;&#1585;&#1590; &#1576;&#1575;&#1604;&#1578;&#1580;&#1585;&#1610;&#1581; &#1604;&#1571;&#1588;&#1582;&#1575;&#1589; &#1605;&#1593;&#1610;&#1606;&#1610;&#1606; &#1605;&#1606; &#1573;&#1582;&#1608;&#1575;&#1606;&#1607;&#1605; &#1575;&#1604;&#1583;&#1593;&#1575;&#1577;&#1548; &#1576;&#1604; &#1603;&#1604;&#1617; &#1608;&#1575;&#1581;&#1583; &#1610;&#1606;&#1589;&#1581; &#1604;&#1604;&#1607; &#1608;&#1604;&#1593;&#1576;&#1575;&#1583;&#1607;&#1548; &#1608;&#1573;&#1584;&#1575; &#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1582;&#1610;&#1607; &#1582;&#1591;&#1571; &#1606;&#1575;&#1589;&#1581;&#1607; &#1576;&#1575;&#1604;&#1604;&#1607; &#1593;&#1586;&#1617; &#1608;&#1580;&#1604;&#1617;&#1548; &#1576;&#1575;&#1604;&#1605;&#1603;&#1575;&#1578;&#1576;&#1577;&#1548; &#1571;&#1608; &#1576;&#1575;&#1604;&#1605;&#1588;&#1575;&#1601;&#1607;&#1577;&#1548; &#1605;&#1606; &#1583;&#1608;&#1606; &#1578;&#1580;&#1585;&#1610;&#1581; &#1601;&#1610; &#1571;&#1588;&#1585;&#1591;&#1577;&#1548; &#1571;&#1608; &#1589;&#1581;&#1575;&#1601;&#1577;&#1548; &#1571;&#1608; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603;&#1548; &#1581;&#1578;&#1609; &#1578;&#1576;&#1602;&#1609; &#1575;&#1604;&#1602;&#1604;&#1608;&#1576; &#1605;&#1587;&#1578;&#1602;&#1610;&#1605;&#1577;&#1548; &#1608;&#1605;&#1587;&#1578;&#1605;&#1585;&#1617;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1581;&#1576;&#1617;&#1614;&#1577;&#1548; &#1608;&#1575;&#1604;&#1608;&#1604;&#1575;&#1569;&#1548; &#1608;&#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1576;&#1585;&#1617; &#1608;&#1575;&#1604;&#1578;&#1602;&#1608;&#1609;&#1548; &#1608;&#1604;&#1610;&#1587; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1573;&#1582;&#1608;&#1575;&#1606;&#1606;&#1575; &#1571;&#1607;&#1604; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577; &#1605;&#1606; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1605;&#1583;&#1585;&#1587;&#1610;&#1606; &#1608;&#1575;&#1604;&#1583;&#1593;&#1575;&#1577;&#1548; &#1608;&#1604;&#1610;&#1587; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1594;&#1610;&#1585;&#1607;&#1605; &#1601;&#1610; &#1605;&#1603;&#1577; &#1571;&#1608; &#1575;&#1604;&#1585;&#1610;&#1575;&#1590; &#1571;&#1608; &#1601;&#1610; &#1580;&#1583;&#1577;&#1548;     <P>
&#1608;&#1573;&#1606;&#1617;&#1614;&#1605;&#1575; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1575;&#1604;&#1593;&#1605;&#1608;&#1605;.  &#1608;&#1573;&#1582;&#1608;&#1575;&#1606;&#1606;&#1575; &#1575;&#1604;&#1605;&#1588;&#1575;&#1610;&#1582; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577; &#1604;&#1610;&#1587; &#1593;&#1606;&#1583;&#1606;&#1575; &#1601;&#1610;&#1607;&#1605; &#1588;&#1603;&#1617;&#1548; &#1607;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1575;&#1604;&#1591;&#1610;&#1617;&#1616;&#1576;&#1577;&#1548; &#1608;&#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1617;&#1614;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1617;&#1614;&#1583; &#1571;&#1605;&#1575;&#1606; &#1576;&#1606; &#1593;&#1604;&#1610;&#1548; &#1608;&#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1585;&#1576;&#1610;&#1593; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610;&#1548; &#1608;&#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1589;&#1575;&#1604;&#1581; &#1576;&#1606; &#1587;&#1593;&#1583; &#1575;&#1604;&#1587;&#1581;&#1610;&#1605;&#1610;&#1548; &#1608;&#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1601;&#1575;&#1604;&#1581; &#1576;&#1606; &#1606;&#1575;&#1601;&#1593;&#1548; &#1608;&#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1617;&#1583; &#1576;&#1606; &#1607;&#1575;&#1583;&#1610;&#1548; &#1603;&#1604;&#1617;&#1607;&#1605; &#1605;&#1593;&#1585;&#1608;&#1601;&#1608;&#1606; &#1604;&#1583;&#1610;&#1606;&#1575; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1602;&#1575;&#1605;&#1577;&#1548; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1608;&#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1575;&#1604;&#1591;&#1610;&#1617;&#1616;&#1576;&#1577;&#1548; &#1606;&#1587;&#1571;&#1604; &#1575;&#1604;&#1604;&#1607; &#1604;&#1607;&#1605; &#1575;&#1604;&#1605;&#1586;&#1610;&#1583; &#1605;&#1606; &#1582;&#1610;&#1585;&#1548;     <P>
&#1608;&#1575;&#1604;&#1578;&#1608;&#1601;&#1610;&#1602; &#1604;&#1616;&#1605;&#1614;&#1575; &#1610;&#1585;&#1590;&#1610;&#1607;.  &#1608;&#1604;&#1603;&#1606; &#1583;&#1593;&#1575;&#1577; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604;&#1548; &#1608;&#1571;&#1607;&#1604; &#1575;&#1604;&#1589;&#1610;&#1583; &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1593;&#1603;&#1585;&#1548; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610; &#1610;&#1588;&#1608;&#1617;&#1588;&#1608;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587;&#1548; &#1608;&#1610;&#1578;&#1603;&#1604;&#1617;&#1605;&#1608;&#1606; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1588;&#1610;&#1575;&#1569;&#1548; &#1608;&#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1603;&#1584;&#1575;&#1548; &#1608;&#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1603;&#1584;&#1575; !! &#1608;&#1607;&#1584;&#1575; &#1604;&#1610;&#1587; &#1576;&#1580;&#1610;&#1617;&#1616;&#1583;&#1548; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1581;&#1605;&#1604; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1593;&#1604;&#1609; &#1571;&#1581;&#1587;&#1606; &#1575;&#1604;&#1605;&#1581;&#1575;&#1605;&#1604;&#1548; &#1608;&#1571;&#1606;&#1617; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583;: &#1575;&#1604;&#1578;&#1593;&#1575;&#1608;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1576;&#1585;&#1617; &#1608;&#1575;&#1604;&#1578;&#1602;&#1608;&#1609;&#1548; &#1608;&#1589;&#1601;&#1575;&#1569; &#1575;&#1604;&#1602;&#1604;&#1608;&#1576;&#1548; &#1608;&#1575;&#1604;&#1581;&#1584;&#1585; &#1605;&#1606; &#1575;&#1604;&#1594;&#1610;&#1576;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1615;&#1587;&#1576;&#1617;&#1616;&#1576; &#1575;&#1604;&#1588;&#1581;&#1606;&#1575;&#1569; &#1608;&#1575;&#1604;&#1593;&#1583;&#1575;&#1608;&#1577;.    <P>
&#1606;&#1587;&#1571;&#1604; &#1575;&#1604;&#1604;&#1607; &#1604;&#1604;&#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1578;&#1608;&#1601;&#1610;&#1602; &#1608;&#1575;&#1604;&#1607;&#1583;&#1575;&#1610;&#1577;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>In the Name of Allaah, Full of Mercy, Ever-Merciful (to His Believing Servants). All Praise is due to Allaah and may Allaah send prayers upon His Messenger, his family and his companions. To proceed:    <P>
The statement that was issued by me, the intent behind it was to invite everybody, all of the du'at and the scholars, to make constructive criticism and not to criticise specific individuals amongst their brothers from the du'at. Rather everyone should offer sincerity of purpose to Allaah and His servants. And when he comes to know of an error of his brother, he should advise him for the sake of Allaah, the Mighty and Majestic, by writing or orally, without criticising him on cassettes or printed media and their likes. So that the hearts may remain upright and continue to have love and loyalty and that there may be co-operation upon righteousness and piety. However, the statement was not intended for our brothers, the people of Madinah, amongst the students of knowledge, teachers and du'at. And nor were those besides them in Makkah, Riyadh or Jeddah intended. Rather the advice was general.    <P>
And our Brothers, the well known Scholars in Madeenah, <b>we do not have a doubt about them</b>. They are possessors of <b>a sound aqeedah</b> and they are from Ahl us-Sunnah wal-Jamaa'ah, such as <b>Shaikh Muhammad Amaan bin Alee, Shaikh Rabee' bin Haadee, Shaikh Saalih bin Sa'd as-Suhaimee, Shaikh Faalih bin Naafi', Shaikh Muhammad bin Haadee [al-Madkhalee]</b> - all of them are known to us to have <b>Istiqaamah, knowledge and sound aqeedah</b>. We ask increase in every good for them from Allaah and success in what pleases Him. However <font style='font-size:17px;'><b>the callers of falsehood (du'aat ul-baatil) and the people who hunt (others) in murky waters</b></font>, they are the ones who cause confusion amongst the people and who speak in these matters and they say: "<i>The intent was this and that</i>", and this is not good. It is necessary to take the words in their best possible light. And the intent [behind the advice] was co-operation upon birr and taqwaa, and to purify the hearts and to warn against backbiting which causes rancour and enmity. We ask Allaah for guidance and success for all</blockquote>    <P>
And walhamdulillaah, it wasn't the faces of the Shaykhs of Madinah that were blackened, may Allaah illuminate them even more, but rather it was the faces of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> that were blackened - those who abandoned the light of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and the Sunnah in their da'wah and manhaj and turned instead to the darknesses of the Soofees, <a href='tags/asharis.html' class='tagLink'><font class='tagLink'>Ash'aris</font></a>, the promulgators of the doctrines, ideologies, and manifestos of the non-Muslims, the atheist secular Jews and others, of demonstrations, revolutions, mass-political movements and the likes.    <P>
<font class='titleHeadline'>Lessons From the Above</font>    <P>
<img src=assets/images/shipwreck-qutbiyyah.gif align=right border=1 hspace=8 vspace=6 border=0>This needs little comment except that this same type of cowardly, opportunistic behaviour is what is being continued today by the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> who have not ceased to cling onto the flotsam (debris, ruins) of their flag-ship, "<i>the Qutbiyyah</i>" that was battered, tossed, turned, and left in ruins on the shore all those years ago. So they continue to go to the likes of the Mufti, Shaykh Abdul-Aziz Aal ash-Shaykh with loaded questions, and the same type of <b>rumour mongerin</b>g and <b>scare-mongering</b> that Shaykh <a href='tags/ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Ibn Uthaymeen</font></a> mentioned about them <a href=index01b7.html?ebhen >in this statement here</a>, and walhamdulillaah, all people who are aware of the realities can see that they do nothing by these actions of theirs except to testify upon themselves as "<i>du'aat of baatil</i>" and "<i>stirrers of the murky waters</i>".    <P>
<font class='titleHeadline'>Misconception</font>    <P>
Some have argued that how can you apply these words of Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> to specific people when the Shaykh intended by both his first advice and his subsequent advice no one in particular, but just a general advice to all. So aren't you doing the same thing by applying this statement of Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> to specific people?    <P>
The answer is that within his advice he made a specific judgement that it is the "<i>callers of falsehood</i>" and "<i>stirrers in murky waters</i>" who interpreted his first statement. Thus, even if the advice was general and was not to anyone in particular, then whoever fell into the action that the Shaykh spoke of, by the Shaykh's own words, receives that judgement.     <P>
There are two situations.     <P>
<ul><li>Either Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> knew of all the statements made by those specific individuals and with this knowledge, in his follow up clarification he said that is the "<i>callers of falsehood</i>" and "<i>stirrers in murky waters</i>" who say this is the intent and that is the intent - then clearly his saying applies to them with his full knowledge and intent.     <P>
<li> The first scenario is obviously not the case. It is clear that the Shaykh was not aware that those individuals were doing this and lying upon him in this manner and deceiving the youth about the statement he issued, and he issued a general advice. In fact many of the nefarious activities of this faction of <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> were unknown to many of the Scholars until it all came to light much later. </ul>    <P>
Now, you have to understand the true nature of the deception of the people bringing this doubt. You see, the Shaykh issued his clarification, <b>specifically defending by name</b>, the very notable Shaykhs whom those <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> had been slandering and backbiting using the Shaykh's general advice. Have these people not noticed the Shaykh's praise and defence of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> by name in this statment? What is the actual significance of this? You see that's the real crux of the issue, but this is like hot coals for them so they won't go there. We will come back to this issue shortly below.    <P>
But to illustrate the reality, here are two examples:    <P>
<ul><li>If you address a congregation in Jumu'ah and say "All thieves will be punished in Hell, if they don't stop and repent", you are not directing that and nor intending that to anyone in particular, but for sure, if anyone in the congregation is guilty of those acts, that judgement will be applied to him as a matter of fact, whether you intended fulaan or fulaan in the audience or not. Here we are speaking about a religious truth and a religious ruling. It applies upon whoever falls into that action.    <P>
<li>If you have a group of twenty people to whom you say, "Be kind, and generous and don't be cowardly", and you intend this advice for everyone, generally, and then it transpires that <u>three specific individuals</u> started saying that you specifically meant fulaan and fulaan, and then you were asked to clarify your statement and you said, "<i>It is the callers of falsehood and the stirrers of murky waters who say that the intent was this and the intent was that</i>", then you are not directing this to anyone in particular - but whoever fell into that action, comes under your judgement and whoever did not fall into it, does not come under it. So in this scenario, <u>as a matter of fact</u>, by virtue of the judgement you made in your speech, those <u>three specific individuals</u>, on account of having done what you mentioned, are subject to the description, or characterization you mentioned, as a matter of fact, even though you only spoke generally and did not intend anyone in particular.</ul>    <P>
So it is <u>factually correct</u> that all those people lied upon the Shaykh. <b>Try to refute this factually correct assertion</b>.     <P>
And the truth was distinguished from falsehood and the Shaykh defended <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> and the honour of the other Madinah Shaykhs, <b>by mentioning them specifically by name</b>! Why don't these people address that part of the Shaykh's statement - <b>which is like the elephant sitting in the room and they are pretending to be blind to</b>. Instead try to deceive the audience by trying to divert their attention away from the elephant to something else? What is the significance of the above statement of Shaykh Ibn Baz? He has just demolished, annihilated and destroyed your baseless hatred and attacks upon <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a> <b>and silenced you and muzzled you</b> through these words of his. He made a specific defense of <a href='tags/shaykh-rabee.html' class='tagLink'><font class='tagLink'>Shaykh Rabee'</font></a>, and made a point of mentioning his name and that of the other Scholars. He rebutted specifically the rumors spread about them saying, "<i>We do not have a doubt about them</i>", "<i>they are from Ahl us-Sunnah</i>", "<i>they have istiqaamah</i>", and he defended them by name against who? "<b>The callers of falsehood and stirrers of the murky waters</b>" - and even if he intended this generally, without his knowledge of who had been saying what - then as <u>a matter of fact</u>, it was the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>.    <P>
So you can see the trickery and deception of these people. The attempt to defend the action of these people (the Qutbiyyah) by bringing a counter-argument and trying to say, "<i>Hey, your'e doing the same thing with Shaykh Ibn Baz's clarification</i>" is just a red-herring to divert away from the established facts. This does nothing to absolve those individuals (the Qutbiyyah) and their activities from blame and censure. This article and its content was published <u>as a matter of historical record</u> as part of of a broad documentation of the nefarious activities of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> as a whole, their doctrines, methodologies, the scholars subsequent refutations of them and the Scholars convicting their doctrines, ideologies and their figureheads (Qutb, <a href='tags/banna.html' class='tagLink'><font class='tagLink'>Banna</font></a> etc.) with innovation and misguidance. All of this is part of a bigger picture, as a matter of historical record.    <P>
  <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/ncprf-sayyid-qutb-al-rafidee-nawab-safawi-al-rafidee-abu-zubayr-saleem-begg-al-ikhwani-and-abu-fatimah-salman-awan.html">Sayyid Qutb and Nawab Safawi (Both Rafidees), Abu Zubayr Saleem Begg al-Ikhwani and Abu Fatimah Salman Awan (Both Practical Ghulaat al-Murji'ah), Defenders of Raafidees and Lickers of their Boots</a><BR>
//www.themadkhalis.com/md/?ncprf<BR>

<li><a href="articles/uzkhr-abdullaah-al-farsee-sajid-kayum-slanderhouse-master-salman-al-awdah--muhammad-al-areefee.html">Abdullaah al-Farsee, Sajid Kayum (Slanderhouse Master), Salman al-Awdah al-Ikhwaanee, Muhammad al-Areefee al-Ikhwaanee and Shaykh Saalih al-Fawzaan al-Salafee and Ta'weel of the Hadeeth of Hudhayfah bin al-Yamaan</a><BR>
//www.themadkhalis.com/md/?uzkhr<BR>

<li><a href="articles/qizzj-flashback-abdullaah-al-farsee-from-1996-refuting-abdur-rahmaan-abdul-khaaliq-safar-al-hawali-and-salman-al-awdah.html">Flashback: Abdullaah al-Farsee From 1996 Refuting Abdur-Rahmaan Abdul-Khaaliq, Safar al-Hawali and Salman al-Awdah Before He Flipped, Rejected the Truth He Previously Knew and Chose Misguidance After Guidance</a><BR>
//www.themadkhalis.com/md/?qizzj<BR>

<li><a href="articles/knggw-shaykh-al-albani-shaykh-ibn-uthaymin-shart-kamal-and-shart-sihhah-irjaa-and-the-hawaalian-menace.html">Shaykh al-Albani, Shaykh Ibn Uthaymin, Shart Kamal and Shart Sihhah, Irjaa and the Gormless Hawalian Qutbis</a><BR>
//www.themadkhalis.com/md/?knggw<BR>

<li><a href="articles/brqlm-salman-al-awdah-aaid-al-qarnee-habib-ali-al-jifree-and-amr-khalid.html">Salman al-Awdah, Aa'id al-Qarnee, Habib Ali al-Jifree and Amr Khalid: The Ikhwani Bannaawi Manhaj in Practice</a><BR>
//www.themadkhalis.com/md/?brqlm<BR>

<li><a href="articles/zdsnn-aaid-al-qarnee--remove-the-fuse-ofthe-fitnah-between-the-sunnah-and-the-shiah.html">Aa'id al-Qarnee:  Remove the Fuse of The Fitnah Between the Sunnah and the Shiah</a><BR>
//www.themadkhalis.com/md/?zdsnn<BR>

<li><a href="articles/exkgz-qutbi-competition-corner-1st-quiz---test-your-knowledge-of-wahdatul-wujood.html">Qutbi Competition Corner: 1st Quiz - Test Your Knowledge of Wahdat ul-Wujood And The Positions of the Scholars Towards Those Who Express It</a><BR>
//www.themadkhalis.com/md/?exkgz<BR>

<li><a href="articles/qvrrm-imaam-ibn-baz-on-the-qutbiyyah-who-lied-upon-him-safar-al-hawali-salman-al-awdah-muhammad-saeed-al-qahtani.html">The Words of Imaam Ibn Baz Falling on Those (Qutbiyyah) Who Lied Upon Him (Safar al-Hawali, Salman al-Awdah, Muhammad Sa'eed al-Qahtani, Aa'id al-Qarnee, Abdur-Razzaq ash-Shayijee): Callers of Falsehood and Stirrers of the Murky Waters</a><BR>
//www.themadkhalis.com/md/?qvrrm<BR>

<li><a href="articles/tnuzl-women-and-children-of-iraq-say-thank-you-to-dr-hawali---he--brought-you-freedom-and-democracy.html">Women and Children of Iraq: Say Thank You To Dr. Safar Hawali - He  Brought You Freedom and Democracy</a><BR>
//www.themadkhalis.com/md/?tnuzl<BR>

<li><a href="articles/sxptl-shaykh-saalih-al-fawzaan-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Saalih al-Fawzaan Distinguishes Between The Salafi Manhaj and The Qutbi Manhaj</a><BR>
//www.themadkhalis.com/md/?sxptl<BR>

<li><a href="articles/tjmrl-shaykh-muhammad-bin-saalih-al-uthaymeen-warning-from-the-takfiris-the-cassettes-of-safar-and-salman.html">Shaykh Muhammad bin Saalih al-Uthaymeen Warning From the Takfiris, the Cassettes of Safar and Salman  and Their Revolutionary Ideology</a><BR>
//www.themadkhalis.com/md/?tjmrl<BR>

<li><a href="articles/xwcmm-shaykh-muhammad-bin-saalih-al-uthaymeen-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Muhammad bin Saalih al-Uthaymeen Distinguished Between The Salafi Manhaj and The Qutbi Manhaj and Wholeheartedly Reccommended Warning From the Qutbi Manhaj After Detailed Study and Consideration</a><BR>
//www.themadkhalis.com/md/?xwcmm<BR>

<li><a href="articles/qawut-shaykh-hammaad-al-ansaaree-shaykh-saalih-al-fawzaan-shaykh-abdul-azeez-ar-raajihee-on-the-saudi-state-and-its-dissenters.html">Shaykh Hammaad al-Ansaaree, Shaykh Saalih al-Fawzaan, Shaykh Abdul-Azeez ar-Raajihee on the Saudi State And Its Dissenters</a><BR>
//www.themadkhalis.com/md/?qawut<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?qvrrm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:09 GMT -->
</html>


