




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?szskl by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Permanent Committee: Making Haakimiyyah as a Separate Category is an Innovation. And The Danger of Shirk and Negation of the Attributes Has Only Increased In These Times, The Need to Address Them Comes First and Is Greater</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Permanent Committee: Making Haakimiyyah as a Separate Category is an Innovation. And The Danger of Shirk and Negation of the Attributes Has Only Increased In These Times, The Need to Address Them Comes First and Is Greater</span><BR>
Thursday, January 07 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">

Following the <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>Extremism</font></a> of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, the likes of Abdur-Rahman Abdul-Khaliq and others innovated a new category for Tawheed, called "<i>Tawheed al-Haakimiyyah</i>", and this was simply a stratagem through which the doctrines of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> could be made palatable to a Salafi audience. When they started to propagandize for Sayyid Qutb's exaggerated doctrine of "al-Haakimiyyah", Ahl us-Sunnah took the issue to the Major Scholars. The verdicts of the Scholars started to appear from around 1996-1997, and prior to this time, many speakers in the West were propagandizing for this "fourth" category of Tawheed and explicitly stating it to be an independent fourth category of Tawheed. Ali al-Timimi was one of the movers and shakers in this regard and in 1996, he said in his theatrical performance:    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.themadkhalis.com/md/assets/audio/timimi-tawhid-al-haakimiyyah.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>Now somebody might ask, <b>of the four types of Tawhid</b> that they mentioned, <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> ur-Ruboobiyyah, <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> ul-Ibaadah, <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> ul-Asmaa' was-Sifaat and <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a>, why did they pay so much attention to <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> ul-Haakimiyyah. What's the secret behind this. The secret behind this is because those who have falsely attributed these ideas to Salafiyyah have tried to argue that <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a> is not from <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, and that to state <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a>, <b>some of them have said that this is a bid'ah</b> and some of them have said that this should be reduced to the principles of fiqh.</blockquote>    <P>
Here, Ali al-Timimi was commenting on a small treatise written by some Kuwaitis in which certain issues and their importance were being highlighted. Now, you have to understand what is going on here, and let us illustrate.     <P>
<blockquote>A Tablighi in <a href='tags/saudi-arabia.html' class='tagLink'><font class='tagLink'>Saudi Arabia</font></a> can write a treatise in which he brings evidences for and emphasizes the importance of the kalimah, khushoo' in the prayer, knowledge and remembrance, honouring the Muslims, being sincere in one's intentions, and going out and striving in the path of Allaah, providing evidence for each issue from the texts and sayings of the Scholars of Ahl us-Sunnah. He can then take it to a Shaykh and say, "What do you say about this advice" and any Shaykh will say, "This is great advice, it contains benefit for the Muslims". Then the Tablighi can go and explain those generalized subjects upon his particular innovation and call to his innovation through this by claiming that the Shaykh supports him in both the general and specific details of what he is calling to.</blockquote>     <P>
And what Ali al-Timimi was reading from was precisely this, a generalized advice which no two Muslims would disagree upon. There is no mention of the label "<i><a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a></i>" in the tract he was reading from, but just quotations from the Scholars, like Imaam ash-Shanqiti, and Shaykh Ibn Ibraaheem, emphasizing the importance of ruling by what Allaah has revealed, and its being a part of Tawheed. With the audience unawares, he brought his own speech with certain particulars, and the audience left with the understanding, "<i>Hey <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> speaks with <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a>, as a separate category of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and so do those other scholars</i>". And of course, Ali al-Timimi was explaining these generalized points (which no two Muslims would disagree over in their generality), <u>upon the methodologies of al-Ikhwaan al-Muslimeen</u>, upon the doctrines and methodologies of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and Hassan al-Banna, which came to him from the likes of Abdur-Rahman Abdul-Khaliq and others. The proof for this is extensive and firmly established and will be dealt with elsewhere, as we cannot digress here. However, it is important that the reader understand the context and what was going on here. The <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> (see <a href=http://www.takfiris.com/takfir/?jqpkg //>here</a>, <a href=http://www.takfiris.com/takfir/?hulwt >here</a>, <a href=index49f2.html?xwcmm >here</a>, <a href=index7e0b.html?sxptl >here</a> and <a href=index0ec1.html?blaok >here</a>) were responded to by the Scholars in the following verdicts:    <P>
<div class='sidebar'><ul><li> <b>Shaykh Saalih al-Fawzaan</b>: Isolating <a href='tags/haakimiyyah.html' class='tagLink'><font class='tagLink'>Haakimiyyah</font></a> As a Separate Category of Tawheed Comes From a 20th Century Ignoramus - (<a href=indexf9e0.html?nspvn>see here</a>)  <li> <b>Shaykh al-Albaani</b> on <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> al-Haakimiyyah: A Political Tool Used to Make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Rulers - (<a href=indexebe5.html?tjxlr>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b>: <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a> As a Fourth Category Is the Saying of an Ignorant Strayer - (<a href=index5fb6.html?pmcwq>see here</a>)  <li> <b>Shaykh Muhammad bin Saalih al-Uthaymeen</b>: <a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a> As a Fourth Category Comes from an Ignorant Mubtadi' - (<a href=index6f86.html?prtli>see here</a>)  <li> <b><a href='tags/shaykh-abdul-aziz-bin-baz.html' class='tagLink'><font class='tagLink'>Shaykh Abdul-Aziz Bin Baz</font></a></b>: The Categories of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> are Not Four In Number, They Are Three - (<a href=index1b08.html?ucvlc>see here</a>)</ul></div>    <P>
When the Major Scholars<b> declared such people to be Innovators</b>, they quickly <u>retreated</u> to teaching just "two categories" of Tawheed <u>and denied</u> ever having even spoken of a fourth category of Tawheed called "<i>Tawheed al-Haakimiyyah</i>". This is why the more shrewd amongst the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> made a hasty retreat and backed off, even if some of them continued their deception by trying to use the issue of Shaykh <a href='tags/ibn-baz.html' class='tagLink'><font class='tagLink'>Ibn Baz</font></a> writing an introduction for a book of Abdur-Rahman Abdul-Khaliq in which the latter makes reference to "Tawheed al-Hukm", as justification for their innovation of making "<i><a href='tags/tawhid-al-haakimiyyah.html' class='tagLink'><font class='tagLink'>Tawhid al-<a href="tags/haakimiyyah.html" class="tagLink"><font class="tagLink">Haakimiyyah</font></a></font></a></i>" into <u>an independent fourth category</u>. There is a difference between speaking of a certain notion and its importance (i.e. you could emphasize the importance of tawheed udh-dhabh, tawheed al-isti'aanah), and dedicating a few pages to it, and between making it <u>an independent fourth category of Tawheed in addition to the three agreed upon by ijmaa' which comprise every aspect of Tawheed already</u>. But this was just one of many types of deceptions of these people which will be covered elsewhere.  <P> 


<p><font class='titleHeadline'>Fatwa of the Permanent Committee That Repels the Doubts and Assumptions of the Harakiyyeen (Activists)</font>    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1582;&#1575;&#1605;&#1587; &#1605;&#1606; &#1575;&#1604;&#1601;&#1578;&#1608;&#1609; &#1585;&#1602;&#1605; 18870 </div>    <P>
<div class='arabic' align='right'> &#1576;&#1583;&#1571; &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587;- &#1605;&#1606; &#1575;&#1604;&#1583;&#1593;&#1575;&#1577;- &#1610;&#1607;&#1578;&#1605; &#1576;&#1584;&#1603;&#1585; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605;&#1610;&#1577; &#1548; &#1576;&#1575;&#1604;&#1573;&#1590;&#1575;&#1601;&#1577; &#1573;&#1604;&#1609; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1577; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601;&#1577; .  &#1601;&#1607;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1602;&#1587;&#1605; &#1575;&#1604;&#1585;&#1575;&#1576;&#1593; &#1610;&#1583;&#1582;&#1604; &#1601;&#1610; &#1571;&#1581;&#1583; &#1575;&#1604;&#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1605; &#1604;&#1575; &#1610;&#1583;&#1582;&#1604; &#1548; &#1601;&#1606;&#1580;&#1593;&#1604;&#1607; &#1602;&#1587;&#1605;&#1575; &#1605;&#1587;&#1578;&#1602;&#1604;&#1575; &#1581;&#1578;&#1609; &#1610;&#1580;&#1576; &#1571;&#1606; &#1606;&#1607;&#1578;&#1605; &#1576;&#1607; &#1567;  &#1608;&#1610;&#1602;&#1575;&#1604; : &#1573;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1575;&#1607;&#1578;&#1605; &#1576;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1601;&#1610; &#1586;&#1605;&#1606;&#1607; &#1548; &#1581;&#1610;&#1579; &#1585;&#1571;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1602;&#1589;&#1585;&#1608;&#1606; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1575;&#1581;&#1610;&#1577; &#1548; &#1608;&#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; &#1601;&#1610; &#1586;&#1605;&#1606;&#1607; &#1601;&#1610; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1548; &#1581;&#1610;&#1579; &#1585;&#1571;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1602;&#1589;&#1585;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1575;&#1581;&#1610;&#1577; &#1548; &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1570;&#1606; &#1601;&#1576;&#1583;&#1571; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1602;&#1589;&#1585;&#1608;&#1606; &#1606;&#1581;&#1608; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605;&#1610;&#1577; &#1548; &#1601;&#1604;&#1584;&#1604;&#1603; &#1610;&#1580;&#1576; &#1571;&#1606; &#1606;&#1607;&#1578;&#1605; &#1576;&#1607; &#1548; &#1601;&#1605;&#1575; &#1605;&#1583;&#1609; &#1589;&#1581;&#1577; &#1607;&#1584;&#1575; &#1575;&#1604;&#1602;&#1608;&#1604; &#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Some people, from the callers, have begun giving importance to mentioning "<i>Tawheedul-Haakimiyyah</i>" in addition to the three well-known categories of Tawheed. So does this fourth category enter within the three categories? or not ý such that we make it a separate category which we must give (extra) importance to?    <P>
And it is said that Shaikh Muhammad ibn Abdul-Wahhaab gave attention to Tawheedul-Uloohiyyah in his time when he saw that the people fell short of Tawheed in that aspect, and that Imaam Ahmad in his time gave attention to Tawheedul-Asmaa was-Sifaat when he saw the people falling short of Tawheed in that aspect. But as for today then the people fall short with regard to Tawheedul-Haakimiyyah, so therefore we must give attention to it. So how correct is this saying?  </blockquote>    <P>
<div class='arabic' align='right'> &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1579;&#1604;&#1575;&#1579;&#1577; : &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1548; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1548; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1548;&#1608;&#1604;&#1610;&#1587; &#1607;&#1606;&#1575;&#1603; &#1602;&#1587;&#1605; &#1585;&#1575;&#1576;&#1593;  &#1608;&#1575;&#1604;&#1581;&#1603;&#1605; &#1576;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1607; &#1610;&#1583;&#1582;&#1604; &#1601;&#1610; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1548; &#1604;&#1571;&#1606;&#1607; &#1605;&#1606; &#1571;&#1606;&#1608;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1548; &#1608;&#1603;&#1604; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1583;&#1575;&#1582;&#1604; &#1601;&#1610; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1563; &#1608;&#1580;&#1593;&#1604; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605;&#1610;&#1577; &#1606;&#1608;&#1593;&#1575; &#1605;&#1587;&#1578;&#1602;&#1604;&#1575; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1593;&#1605;&#1604; &#1605;&#1581;&#1583;&#1579; &#1548; &#1604;&#1605; &#1610;&#1602;&#1604; &#1576;&#1607; &#1571;&#1581;&#1583; &#1605;&#1606; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1601;&#1610;&#1605;&#1575; &#1606;&#1593;&#1604;&#1605; &#1548; &#1604;&#1603;&#1606; &#1605;&#1606;&#1607;&#1605; &#1605;&#1606; &#1571;&#1580;&#1605;&#1604; &#1608;&#1580;&#1593;&#1604; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1606;&#1608;&#1593;&#1610;&#1606; : &#1578;&#1608;&#1581;&#1610;&#1583; &#1601;&#1610; &#1575;&#1604;&#1605;&#1593;&#1585;&#1601;&#1577; &#1608;&#1575;&#1604;&#1573;&#1579;&#1576;&#1575;&#1578; &#1563; &#1608;&#1607;&#1608; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; . &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1601;&#1610; &#1575;&#1604;&#1591;&#1604;&#1576; &#1608;&#1575;&#1604;&#1602;&#1589;&#1583; &#1563; &#1608;&#1607;&#1608; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1548; &#1608;&#1605;&#1606;&#1607;&#1605; &#1605;&#1606; &#1601;&#1589;&#1604; &#1601;&#1580;&#1593;&#1604; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1606;&#1608;&#1575;&#1593; &#1603;&#1605;&#1575; &#1587;&#1576;&#1602; . &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605; .    <P>
&#1608;&#1610;&#1580;&#1576; &#1575;&#1604;&#1575;&#1607;&#1578;&#1605;&#1575;&#1605; &#1576;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1610;&#1577; &#1580;&#1605;&#1610;&#1593;&#1607; &#1548; &#1608;&#1610;&#1576;&#1583;&#1571; &#1576;&#1575;&#1604;&#1606;&#1607;&#1610; &#1593;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1563; &#1604;&#1571;&#1606;&#1607; &#1571;&#1593;&#1592;&#1605; &#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1608;&#1610;&#1581;&#1576;&#1591; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604; &#1548; &#1608;&#1589;&#1575;&#1581;&#1576;&#1607; &#1605;&#1582;&#1604;&#1583; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; &#1548; &#1608;&#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569; &#1580;&#1605;&#1610;&#1593;&#1607;&#1605; &#1610;&#1576;&#1583;&#1572;&#1608;&#1606; &#1576;&#1575;&#1604;&#1571;&#1605;&#1585; &#1576;&#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1606;&#1607;&#1610; &#1593;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1548; &#1608;&#1602;&#1583; &#1571;&#1605;&#1585;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1576;&#1575;&#1578;&#1576;&#1575;&#1593; &#1591;&#1585;&#1610;&#1602;&#1607;&#1605; &#1608;&#1575;&#1604;&#1587;&#1610;&#1585; &#1593;&#1604;&#1609; &#1605;&#1606;&#1607;&#1580;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575; &#1605;&#1606; &#1571;&#1605;&#1608;&#1585; &#1575;&#1604;&#1583;&#1610;&#1606; .  &#1608;&#1575;&#1604;&#1575;&#1607;&#1578;&#1605;&#1575;&#1605; &#1576;&#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1576;&#1571;&#1606;&#1608;&#1575;&#1593;&#1607; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1577; &#1608;&#1575;&#1580;&#1576; &#1601;&#1610; &#1603;&#1604; &#1586;&#1605;&#1575;&#1606; &#1563; &#1604;&#1571;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1578;&#1593;&#1591;&#1610;&#1604; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1604;&#1575; &#1610;&#1586;&#1575;&#1604;&#1575;&#1606; &#1605;&#1608;&#1580;&#1608;&#1583;&#1610;&#1606; &#1548; &#1576;&#1604; &#1610;&#1603;&#1579;&#1585; &#1608;&#1602;&#1608;&#1593;&#1607;&#1605;&#1575; &#1608;&#1610;&#1588;&#1578;&#1583; &#1582;&#1591;&#1585;&#1607;&#1605;&#1575; &#1601;&#1610; &#1570;&#1582;&#1585; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1548; &#1608;&#1610;&#1582;&#1601;&#1609; &#1571;&#1605;&#1585;&#1607;&#1605;&#1575; &#1593;&#1604;&#1609; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1548; &#1608;&#1575;&#1604;&#1583;&#1593;&#1575;&#1577; &#1573;&#1604;&#1610;&#1607;&#1605;&#1575; &#1603;&#1579;&#1610;&#1585;&#1608;&#1606; &#1608;&#1606;&#1588;&#1610;&#1591;&#1608;&#1606; .    <P>
&#1608;&#1604;&#1610;&#1587; &#1608;&#1602;&#1608;&#1593; &#1575;&#1604;&#1588;&#1585;&#1603; &#1605;&#1602;&#1589;&#1608;&#1585;&#1575; &#1593;&#1604;&#1609; &#1586;&#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1548; &#1608;&#1604;&#1575; &#1578;&#1593;&#1591;&#1610;&#1604; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1605;&#1602;&#1589;&#1608;&#1585;&#1575; &#1593;&#1604;&#1609; &#1586;&#1605;&#1606; &#1575;&#1604;&#1573;&#1605;&#1575;&#1605; &#1571;&#1581;&#1605;&#1583; - &#1585;&#1581;&#1605;&#1607;&#1605;&#1575; &#1575;&#1604;&#1604;&#1607; - &#1548; &#1603;&#1605;&#1575; &#1608;&#1585;&#1583; &#1601;&#1610; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1548; &#1576;&#1604; &#1586;&#1575;&#1583; &#1582;&#1591;&#1585;&#1607;&#1605;&#1575; &#1608;&#1603;&#1579;&#1585; &#1608;&#1602;&#1608;&#1593;&#1607;&#1605;&#1575; &#1601;&#1610; &#1605;&#1580;&#1578;&#1605;&#1593;&#1575;&#1578; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1575;&#1604;&#1610;&#1608;&#1605; &#1548; &#1601;&#1607;&#1605; &#1576;&#1581;&#1575;&#1580;&#1577; &#1605;&#1575;&#1587;&#1577; &#1573;&#1604;&#1609; &#1605;&#1606; &#1610;&#1606;&#1607;&#1609; &#1593;&#1606; &#1575;&#1604;&#1608;&#1602;&#1608;&#1593; &#1601;&#1610;&#1607;&#1605;&#1575; &#1608;&#1610;&#1576;&#1610;&#1606; &#1582;&#1591;&#1585;&#1607;&#1605;&#1575; .  &#1605;&#1593; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1571;&#1606; &#1575;&#1604;&#1575;&#1587;&#1578;&#1602;&#1575;&#1605;&#1577; &#1593;&#1604;&#1609; &#1575;&#1605;&#1578;&#1579;&#1575;&#1604; &#1571;&#1608;&#1575;&#1605;&#1585; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1585;&#1603; &#1606;&#1608;&#1575;&#1607;&#1610;&#1607; &#1608;&#1578;&#1581;&#1603;&#1610;&#1605; &#1588;&#1585;&#1610;&#1593;&#1578;&#1607; - &#1603;&#1604; &#1584;&#1604;&#1603; &#1583;&#1575;&#1582;&#1604; &#1601;&#1610; &#1578;&#1581;&#1602;&#1610;&#1602; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605;&#1577; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; .    <P>
&#1608;&#1576;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1578;&#1608;&#1601;&#1610;&#1602; &#1548; &#1608;&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1606;&#1576;&#1610;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1608;&#1570;&#1604;&#1607; &#1608;&#1589;&#1581;&#1576;&#1607; &#1608;&#1587;&#1604;&#1605; .    <P>
  &#1575;&#1604;&#1604;&#1580;&#1606;&#1577; &#1575;&#1604;&#1583;&#1575;&#1574;&#1605;&#1577; &#1604;&#1604;&#1576;&#1581;&#1608;&#1579; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610;&#1577; &#1608;&#1575;&#1604;&#1573;&#1601;&#1578;&#1575;&#1569;    <P>
&#1593;&#1590;&#1608;: &#1576;&#1603;&#1585; &#1571;&#1576;&#1608; &#1586;&#1610;&#1583;  &#1593;&#1590;&#1608;: &#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1601;&#1608;&#1586;&#1575;&#1606;  &#1593;&#1590;&#1608;: &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1594;&#1583;&#1610;&#1575;&#1606;  &#1606;&#1575;&#1574;&#1576; &#1575;&#1604;&#1585;&#1574;&#1610;&#1587;: &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1570;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582;  &#1575;&#1604;&#1585;&#1574;&#1610;&#1587;: &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1576;&#1575;&#1586;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Tawheed is of three categories: <i>Tawheed ur-Ruboobiyyah</i>, <i>Tawheed ul-Uloohiyyah</i> and <i>Tawheed ul-Asmaa was-Sifaat</i>, <b>and there is no fourth category</b>. And judging by what Allaah sent down comes under Tawheed ul-Uloohiyyah since it is from the types of worship due to Allaah, the One free of all imperfections, and all of the types of worship fall under Tawheedul-Uloohiyyah. <b>Then making "al-Haakimiyyah" a separate category is an innovated matter, which has not been the saying of any of the scholars as far as we know</b>.    <P>
However there were some of them who generalised and said that Tawheed is of two classes: Tawheed of things known and affirmed (al-Ma'rifah wal-Ithbaat) - and it is Tawheedur-Ruboobiyyah and Tawheedul-Asmaa was-Sifaat; and Tawheed of purpose and intentions (at-Talab wal-Qasd) - and it is Tawheedul-Uloohiyyah. Then there are others who particularise and place Tawheed in three categories, as has preceded, and Allaah knows best.    <P>
<b>So it is obligatory to give attention to all of Tawheedul-Uloohiyyah, and to begin by forbidding <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>, since it is the greatest of sins and annuls all of the deeds, and a person upon it will remain for ever in the Fire</b>. Also all of the Prophets began with the command to worship Allaah alone and the forbiddance of <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>. And Allaah has <u>commanded us</u> to follow their way and to proceed upon their methodology in da'wah and the rest of the affairs of the deen.     <P>
So giving attention to Tawheed with its three categories <u>is obligatory in every time</u>, since <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> and divestment (ta'teel) of the Names and Attributes (of Allaah) are still found, indeed they occur very often and their danger increases towards the end of time, and the seriousness of these two is a matter hidden from many of the Muslims, and those who call to these two are many and active.     <P>
<b>So occurrence of <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a> is not something restricted to the time of Shaikh Muhammad ibn Abdul-Wahhaab, nor is divestment (ta'teel) of the names and attributes restricted to the time of Imaam Ahmad, rahimahullaah, as occurs in the question. Rather their danger has increased and their prevalence has grown in Muslim societies today</b>. So they are in the greatest need of those who will forbid from falling into them and who will make clear their danger. Whilst knowing that being upright upon the commands of Allaah and avoidance of what He forbids and applying by His Sharee'ah, all of that falls under realisation of Tawheed and remaining free from <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>Shirk</font></a>.    <P>
And may Allaah extol and send peace upon our Prophet Muhammad and his true followers and his Companions    <P>
<b>The Permanent Committee For Research and Verdicts</b>    <P>
<b>Member:</b> Bakr Abu Zayd<BR>  <b>Member:</b> Salih <a href="tags/al-fawzan.html" class="tagLink"><font class="tagLink">al-<a href="tags/fawzan.html" class="tagLink"><font class="tagLink">Fawzan</font></a></font></a><BR>  <b>Member:</b> Abdullaah <a href="tags/al-ghudayan.html" class="tagLink"><font class="tagLink">al-Ghudayan</font></a><BR>  <b>Deputy Head:</b> Abdul-Aziz Aal as-Shaykh<BR>  <b>Head:</b> Abdul-Aziz bin Baz  </blockquote>    <P>
This fatwa refutes the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> (Abdur-Rahman Abdul-Khaliq and followers) and Surooriyyah (Muhammad Suroor) and their likes who built their da'wah upon the assumption that the "<i>Shirk of the Quboor</i>" (Shirk of the graves) has been replaced by "<i>Shirk of the Qusoor</i>" (Shirk of the palaces, i.e. rulers, not ruling by what Allaah has revealed) - and recruited their followers upon these false claims.    <P>
As you can see, the Scholars have comprehensively and sufficiently rebutted the reasoning and argumentation presented in the question. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/jsypx-shaykh-salih-al-fawzan-the-duaat-of-haakimiyyah-take-the-aspect-that-is-lesser-and-abandon-that-which-is-greater.html">Shaykh Salih al-Fawzan: Deconstructs the Basis of the Da'wah of the 20th Century Callers to the Narrow, Restricted Haakimiyyah</a><BR>
//www.themadkhalis.com/md/?jsypx<BR>

<li><a href="articles/szskl-permanent-committee-making-haakimiyyah-as-a-separate-category-is-an-innovation.html">Permanent Committee: Making Haakimiyyah as a Separate Category is an Innovation. And The Danger of Shirk and Negation of the Attributes Has Only Increased In These Times, The Need to Address Them Comes First and Is Greater</a><BR>
//www.themadkhalis.com/md/?szskl<BR>

<li><a href="articles/pepob-does-aqidah-come-first-or-haakimiyyah.html">Does Aqidah Come First or Haakimiyyah?</a><BR>
//www.themadkhalis.com/md/?pepob<BR>

<li><a href="articles/lkrtj-shaykh-saalih-al-fawzaan-the-tafseer-of-the-hizbiyyeen-and-ikhwaaniyyeen-of-the-kalimah.html">Shaykh Saalih al-Fawzaan: The Tafseer of the Hizbiyyeen and Ikhwaaniyyeen of the Kalimah is 'There is no Haakimiyyah Except For Allaah'</a><BR>
//www.themadkhalis.com/md/?lkrtj<BR>

<li><a href="articles/ucvlc-shaykh-abdul-aziz-bin-baz-the-categories-of-tawhid-are-not-four-in-number-they-are-three.html">Shaykh Abdul-Aziz Bin Baz: The Categories of Tawhid are Not Four In Number, They Are Three</a><BR>
//www.themadkhalis.com/md/?ucvlc<BR>

<li><a href="articles/nspvn-shaykh-saalih-al-fawzaan-isolating-haakimiyyah-as-a-separate-category-of-tawheed-comes-from-a-20th-century-ignoramus.html">Shaykh Saalih al-Fawzaan: Isolating Haakimiyyah As a Separate Category of Tawheed Comes From a 20th Century Ignoramus</a><BR>
//www.themadkhalis.com/md/?nspvn<BR>

<li><a href="articles/tjxlr-shaykh-al-albaani-on-tawhid-al-haakimiyyah-a-political-tool-used-to-make-takfir-of-the-rulers.html">Shaykh al-Albaani on Tawhid al-Haakimiyyah: A Political Tool Used to Make Takfir of the Rulers</a><BR>
//www.themadkhalis.com/md/?tjxlr<BR>

<li><a href="articles/pmcwq-shaykh-muhammad-bin-saalih-al-uthaymeen.html">Shaykh Muhammad bin Saalih al-Uthaymeen: Tawhid al-Haakimiyyah As a Fourth Category Is the Saying of an Ignorant Strayer</a><BR>
//www.themadkhalis.com/md/?pmcwq<BR>

<li><a href="articles/prtli-shaykh-muhammad-bin-saalih-al-uthaymeen-on-tawhid-al-haakimiyyah-as-a-fourth-category.html">Shaykh Muhammad bin Saalih al-Uthaymeen: Tawhid al-Haakimiyyah As a Fourth Category Comes from an Ignorant Mubtadi'</a><BR>
//www.themadkhalis.com/md/?prtli<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?szskl by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
</html>


