




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?tzogk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TheMadkhalis.Com | Imaam al-Albaanee on the Kharijites in Egypt, Syria, Algeria and Saudi Arabia</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Imaam al-Albaanee on the Kharijites in Egypt, Syria, Algeria and Saudi Arabia</span><BR>
Friday, January 08 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at TheMadkhalis.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Imaam al-Albaanee (rahimahullaah) said in as-Silsilah as-Saheehah  (volume 7) whilst commenting on the hadeeth (<span class='arb'> &#1576;&#1575;&#1610;&#1593;&#1606;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1593;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577;</span>), and after refuting the doctrines of the Khawaarij, he said:    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1571;&#1606;&#1607;&#1605; &#1587;&#1606;&#1617;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1587;&#1606;&#1577;&#1611; &#1587;&#1610;&#1574;&#1577; &#1548;&#1608;&#1580;&#1593;&#1604;&#1608;&#1575; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1583;&#1610;&#1606;&#1575;&#1611; &#1593;&#1604;&#1609; &#1605;&#1585; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1608;&#1575;&#1604;&#1571;&#1610;&#1575;&#1605; &#1548; &#1585;&#1594;&#1605; &#1578;&#1581;&#1584;&#1610;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1605;&#1606;&#1607;&#1605; &#1601;&#1610; &#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1603;&#1579;&#1610;&#1585;&#1577; &#1548; &#1605;&#1606;&#1607;&#1575; &#1602;&#1608;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; <&#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1603;&#1604;&#1575;&#1576; &#1575;&#1604;&#1606;&#1575;&#1585;>.&#1608;&#1585;&#1594;&#1605; &#1571;&#1606;&#1607;&#1605; &#1604;&#1605; &#1610;&#1585;&#1608;&#1575; &#1603;&#1601;&#1585;&#1575;&#1611; &#1576;&#1614;&#1608;&#1575;&#1581;&#1575;&#1611; &#1605;&#1606;&#1607;&#1605; &#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1605;&#1575; &#1583;&#1608;&#1606; &#1584;&#1604;&#1603; &#1605;&#1606; &#1592;&#1604;&#1605; &#1608;&#1601;&#1580;&#1608;&#1585; &#1608;&#1601;&#1587;&#1602; . &#1608;&#1575;&#1604;&#1610;&#1608;&#1605; &#1608;&#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582; &#1610;&#1593;&#1610;&#1583; &#1606;&#1601;&#1587;&#1607; &#1603;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;- &#1563; &#1601;&#1602;&#1583; &#1606;&#1576;&#1578;&#1578; &#1606;&#1575;&#1576;&#1578;&#1577; &#1605;&#1606; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1604;&#1605; &#1610;&#1578;&#1601;&#1602;&#1607;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1573;&#1604;&#1575; &#1602;&#1604;&#1610;&#1604;&#1575; &#1608;&#1585;&#1571;&#1608;&#1575; &#1571;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1604;&#1575; &#1610;&#1581;&#1603;&#1605;&#1608;&#1606; &#1576;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1575; &#1602;&#1604;&#1610;&#1604;&#1575; &#1601;&#1585;&#1571;&#1608;&#1575; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1610;&#1607;&#1605; &#1583;&#1608;&#1606; &#1571;&#1606; &#1610;&#1587;&#1578;&#1588;&#1610;&#1585;&#1608;&#1575; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1601;&#1602;&#1607; &#1608;&#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1605;&#1606;&#1607;&#1605; &#1576;&#1604; &#1585;&#1603;&#1576;&#1608;&#1575; &#1585;&#1572;&#1608;&#1587;&#1607;&#1605; &#1571;&#1579;&#1575;&#1585;&#1608;&#1575; &#1601;&#1578;&#1606;&#1575;&#1611; &#1593;&#1605;&#1610;&#1575;&#1569; &#1608;&#1587;&#1601;&#1603;&#1608;&#1575; &#1575;&#1604;&#1583;&#1605;&#1575;&#1569; &#1601;&#1610; &#1605;&#1589;&#1585; &#1608;&#1587;&#1608;&#1585;&#1610;&#1575; , &#1608;&#1575;&#1604;&#1580;&#1586;&#1575;&#1574;&#1585; &#1608;&#1602;&#1576;&#1604; &#1584;&#1604;&#1603; &#1601;&#1578;&#1606;&#1577; &#1575;&#1604;&#1581;&#1585;&#1605; &#1575;&#1604;&#1605;&#1603;&#1610; &#1601;&#1582;&#1575;&#1604;&#1601;&#1608;&#1575; &#1576;&#1584;&#1604;&#1603; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1575;&#1604;&#1584;&#1610; &#1580;&#1585;&#1609; &#1593;&#1604;&#1610;&#1607; &#1593;&#1605;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1587;&#1604;&#1601;&#1575; &#1608;&#1582;&#1604;&#1601;&#1575; &#1573;&#1604;&#1575; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the intent is that they revived an evil way into Islam, and they took revolting against the Muslim rulers as a deen (to be followed) over the passing of time and [the passing of] days, despite the warning of the Prophet (sallallaahu alayhi wasallam) from them in many ahaadeeth. From them is his (sallallaahu alayhi wasallam's) saying, "<b>The Khawaarij are the Dogs of Hellfire</b>", and despite them not having seen kufr bawaah (manifest, plain, clear kufr). Rather [they see] what is less than that of dhulm (oppression) and fisq (sin). And the day, and history repeats itself, as they say, for [factions] of Muslim youth have sprung up who did not understand the religion except little and they considered that the rulers do not rule by what Allaah has revealed except little, and thus held the view of revolting against them, without consulting the people of fiqh (jurisprudence) and hikmah (wisdom) amongst them.     <P>
Rather, their leaders drove and kindled tribulations blindly, and they shed blood in <a href='tags/egypt.html' class='tagLink'><font class='tagLink'>Egypt</font></a>, <a href='tags/syria.html' class='tagLink'><font class='tagLink'>Syria</font></a>, <a href='tags/algeria.html' class='tagLink'><font class='tagLink'>Algeria</font></a> and prior to that in the tribulation of the Haram of Makkah. So they opposed this authentic hadeeth by way of that upon which the Muslims have acted, both the Salaf and the Khalaf, except the Khawaarij.</blockquote>    <P>
Refer also to:    <P>
<ul><li> <b>Shaykh Ibn Jibreen</b>: Usamah bin Laden and Followers Make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Muslims - (<a href=http://www.takfiris.com/takfir/?owscq>see here</a>)  <li> <b>Shaykh Salih al-Fawzan's</b> Refutation of Salman al-Awdah's Generalized Mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of All the Muslims - (<a href=http://www.takfiris.com/takfir/?qyrnf>see here</a>)  <li> <b>Shaykh Salih al-Fawzan</b> on Salman al-Awdah's Saying 'The Absent Ummah': This Necessitates the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Whole Ummah - (<a href=http://www.takfiris.com/takfir/?aorjc>see here</a>)  <li> <b>Shaykh Ibn Jibreen</b>: 'The Kharijite, Terrorist, Dogs of Hellfire', Those Who Revolt Against the Rulers - (<a href=http://www.takfiris.com/takfir/?srjss>see here</a>)  <li> <b>Shaykh Ibn Jibreen</b>: On Those Who Rule By <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> - (<a href=http://www.takfiris.com/takfir/?eoizx>see here</a>)  </ul> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/iywsi-shaykh-salih-al-fawzan-demolishes-the-doubts-of-the-qutbiyyah-kharijiyyah-regarding-obedience-takfir-and-revolt.html">Shaykh Salih al-Fawzan Demolishes the Doubts of the Qutbiyyah Kharijiyyah Regarding Obedience, Takfir and Revolt</a><BR>
//www.themadkhalis.com/md/?iywsi<BR>

<li><a href="articles/tzogk-imaam-al-albaanee-on-the-kharijites-in-egypt-syria-algeria-and-saudi-arabia.html">Imaam al-Albaanee on the Kharijites in Egypt, Syria, Algeria and Saudi Arabia</a><BR>
//www.themadkhalis.com/md/?tzogk<BR>

<li><a href="articles/hmoxm-sayyid-qutb-the-doctrine-of-wahdat-ul-wujood-imaam-al-albaanee-and-abdullaah-azzaam-part-2.html">Sayyid Qutb, The Doctrine of Wahdat ul-Wujood, Imaam al-Albaanee and Abdullaah Azzaam: Part 2 - Shaykh al-Albaanee on Abdullaah Azzam - a 'Dhaalim' Who Failed To Publish a Retraction From His Slander</a><BR>
//www.themadkhalis.com/md/?hmoxm<BR>

<li><a href="articles/vqtmh-sayyid-qutb-the-doctrine-of-wahdat-ul-wujood-imaam-al-albaanee-and-abdullaah-azzaam-part-1.html">Sayyid Qutb, The Doctrine of Wahdat ul-Wujood, Imaam al-Albaanee and Abdullaah Azzaam: Part 1 - Slandering Imaam al-Albaani Because He Stated Sayyid Qutb Speaks with the Unity of Existence</a><BR>
//www.themadkhalis.com/md/?vqtmh<BR>

</ul>


</td></tr></table>
<body>



</body>

<!-- Mirrored from www.themadkhalis.com/md/print.cfm?tzogk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:23:12 GMT -->
</html>


