

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.abovethethrone.com/arsh/print.cfm?fogpc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:18:26 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>AboveTheThrone.Com | Abu Sulayman al-Khattabi (d. 386H):  Allaah is Above the Heaven, Ascended Over the Throne</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">
<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>

<span class="articleTitle">Abu Sulayman al-Khattabi (d. 386H):  Allaah is Above the Heaven, Ascended Over the Throne</span><BR>
 Friday, November 06 2009 - by Abu Iyaad 
<hr size="1" noshade>
<b>Read more articles at AboveTheThrone.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p>Abu Sulaymaan al-Khattaabi was upon the madhhab of ta'weel of the sifaat initially and he recanted from that and adhered to the madhhab of the Salaf and his recantation from that is mentioned by Ibn Rajab al-Hanbali in his Fath ul-Bari (an explanation of Saheeh al-Bukharee). And al-Khattabi wrote a book called "<i>al-Ghunya anil-Kalaam wa Ahlihi</i>" being a critique of the people of kalaam in which he affirmed the  madhhab of the Salaf in the sifaat with speech that was also used more or less verbatim by the likes of al-Khateeb al-Baghdaadee - <a href=http://www.asharis.com/creed/?nwlcy>see this article here</a>.    <P>
The saying of Abu Sulayman al-Khattaabi is quoted from "Shi'aar ud-Deen", through Ibn al-Qayyim's "Mukhtasar as-Sawaa'iq" (2/318) and also "Tahdheeb Mukhtasar Sunan Abee Daawood" (7/109)    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1602;&#1608;&#1604; &#1601;&#1610; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1587;&#1578;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588;:&#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577; &#1587;&#1576;&#1610;&#1604;&#1607;&#1575; &#1575;&#1604;&#1578;&#1608;&#1602;&#1610;&#1601; &#1575;&#1604;&#1605;&#1581;&#1590; &#1608;&#1604;&#1575; &#1610;&#1589;&#1604; &#1573;&#1604;&#1610;&#1607;&#1575; &#1575;&#1604;&#1583;&#1604;&#1610;&#1604; &#1605;&#1606; &#1594;&#1610;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1608;&#1580;&#1607; &#1608;&#1602;&#1583; &#1606;&#1591;&#1602; &#1576;&#1607; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1601;&#1610; &#1594;&#1610;&#1585; &#1570;&#1610;&#1577; &#1608;&#1608;&#1585;&#1583;&#1578; &#1576;&#1607; &#1575;&#1604;&#1571;&#1582;&#1576;&#1575;&#1585; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1577; &#1601;&#1602;&#1576;&#1608;&#1604;&#1607; &#1605;&#1606; &#1580;&#1607;&#1577; &#1575;&#1604;&#1578;&#1608;&#1602;&#1610;&#1601; &#1608;&#1575;&#1580;&#1576; &#1608;&#1575;&#1604;&#1576;&#1581;&#1579; &#1593;&#1606;&#1607; &#1608;&#1591;&#1604;&#1576; &#1575;&#1604;&#1603;&#1610;&#1601;&#1610;&#1577; &#1594;&#1610;&#1585; &#1580;&#1575;&#1574;&#1586; &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1605;&#1575;&#1604;&#1603; &#1575;&#1604;&#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1605;&#1593;&#1604;&#1608;&#1605; &#1608;&#1575;&#1604;&#1603;&#1610;&#1601; &#1594;&#1610;&#1585; &#1605;&#1593;&#1602;&#1608;&#1604; &#1608;&#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1607; &#1608;&#1575;&#1580;&#1576; &#1608;&#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1593;&#1606;&#1607; &#1576;&#1583;&#1593;&#1577; &#1601;&#1605;&#1606; &#1575;&#1604;&#1578;&#1608;&#1602;&#1610;&#1601; &#1575;&#1604;&#1584;&#1610; &#1580;&#1575;&#1569; &#1576;&#1607; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; ( &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1575;&#1587;&#1578;&#1608;&#1609; ) &#1608;&#1602;&#1575;&#1604; (&#1579;&#1605; &#1575;&#1587;&#1578;&#1608;&#1609; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; ) &#1608;&#1602;&#1575;&#1604; ( &#1585;&#1601;&#1610;&#1593; &#1575;&#1604;&#1583;&#1585;&#1580;&#1575;&#1578; &#1584;&#1608; &#1575;&#1604;&#1593;&#1585;&#1588; ) &#1608;&#1602;&#1575;&#1604; ( &#1571;&#1571;&#1605;&#1606;&#1578;&#1605; &#1605;&#1606; &#1601;&#1610; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1571;&#1606; &#1610;&#1582;&#1587;&#1601; &#1576;&#1603;&#1605; &#1575;&#1604;&#1571;&#1585;&#1590; &#1601;&#1573;&#1584;&#1575; &#1607;&#1610; &#1578;&#1605;&#1608;&#1585; &#1571;&#1605; &#1571;&#1605;&#1606;&#1578;&#1605; &#1605;&#1606; &#1601;&#1610; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1571;&#1606; &#1610;&#1585;&#1587;&#1604; &#1593;&#1604;&#1610;&#1603;&#1605; &#1581;&#1575;&#1589;&#1576;&#1575; ) &#1608;&#1602;&#1575;&#1604; ( &#1578;&#1593;&#1585;&#1580; &#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1608;&#1575;&#1604;&#1585;&#1608;&#1581; &#1573;&#1604;&#1610;&#1607; ) &#1608;&#1602;&#1575;&#1604; ( &#1576;&#1604; &#1585;&#1601;&#1593;&#1607; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1610;&#1607; ) &#1608;&#1602;&#1575;&#1604; ( &#1573;&#1604;&#1610;&#1607; &#1610;&#1589;&#1593;&#1583; &#1575;&#1604;&#1603;&#1604;&#1605; &#1575;&#1604;&#1591;&#1610;&#1576; ) &#1608;&#1602;&#1575;&#1604; &#1581;&#1603;&#1575;&#1610;&#1577; &#1593;&#1606; &#1601;&#1585;&#1593;&#1608;&#1606; &#1571;&#1606;&#1607; &#1602;&#1575;&#1604; ( &#1610;&#1575; &#1607;&#1575;&#1605;&#1575;&#1606; &#1575;&#1576;&#1606; &#1604;&#1610; &#1589;&#1585;&#1581;&#1575; &#1604;&#1593;&#1604;&#1610; &#1571;&#1591;&#1604;&#1593; &#1573;&#1604;&#1609; &#1573;&#1604;&#1607; &#1605;&#1608;&#1587;&#1609; ) &#1601;&#1608;&#1602;&#1593; &#1602;&#1589;&#1583; &#1575;&#1604;&#1603;&#1575;&#1601;&#1585; &#1573;&#1604;&#1609; &#1575;&#1604;&#1580;&#1607;&#1577; &#1575;&#1604;&#1578;&#1610; &#1571;&#1582;&#1576;&#1585;&#1607; &#1605;&#1608;&#1587;&#1609; &#1593;&#1606;&#1607;&#1575; &#1608;&#1604;&#1584;&#1604;&#1603; &#1604;&#1605; &#1610;&#1591;&#1604;&#1576;&#1607; &#1601;&#1610; &#1591;&#1608;&#1604; &#1575;&#1604;&#1571;&#1585;&#1590; &#1608;&#1604;&#1575; &#1593;&#1585;&#1590;&#1607;&#1575; &#1608;&#1604;&#1605; &#1610;&#1606;&#1586;&#1604; &#1573;&#1604;&#1609; &#1591;&#1576;&#1602;&#1575;&#1578; &#1575;&#1604;&#1571;&#1585;&#1590; &#1575;&#1604;&#1587;&#1601;&#1604;&#1610; &#1601;&#1583;&#1604; &#1605;&#1575; &#1578;&#1604;&#1608;&#1606;&#1575;&#1607; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1570;&#1610; &#1593;&#1604;&#1609; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1601;&#1610; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1605;&#1587;&#1578;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1608;&#1604;&#1608; &#1603;&#1575;&#1606; &#1576;&#1603;&#1604; &#1605;&#1603;&#1575;&#1606; &#1604;&#1605; &#1610;&#1603;&#1606; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1582;&#1589;&#1610;&#1589; &#1605;&#1593;&#1606;&#1609; &#1608;&#1604;&#1575; &#1601;&#1610;&#1607; &#1601;&#1575;&#1574;&#1583;&#1577; &#1608;&#1602;&#1583; &#1580;&#1585;&#1578; &#1593;&#1575;&#1583;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1582;&#1575;&#1589;&#1578;&#1607;&#1605; &#1608;&#1593;&#1575;&#1605;&#1578;&#1607;&#1605; &#1576;&#1571;&#1606; &#1610;&#1583;&#1593;&#1608;&#1575; &#1585;&#1576;&#1607;&#1605; &#1593;&#1606;&#1583; &#1575;&#1604;&#1575;&#1576;&#1578;&#1607;&#1575;&#1604; &#1608;&#1575;&#1604;&#1585;&#1594;&#1576;&#1577; &#1573;&#1604;&#1610;&#1607; &#1608;&#1610;&#1585;&#1601;&#1593;&#1608;&#1575; &#1571;&#1610;&#1583;&#1610;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1608;&#1584;&#1604;&#1603; &#1604;&#1575;&#1587;&#1578;&#1601;&#1575;&#1590;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1593;&#1606;&#1583;&#1607;&#1605; &#1576;&#1571;&#1606; &#1585;&#1576;&#1607;&#1605; &#1575;&#1604;&#1605;&#1583;&#1593;&#1608; &#1601;&#1610; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1548; &#1608; &#1586;&#1593;&#1605; &#1576;&#1593;&#1590;&#1607;&#1605; &#1571;&#1606; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1607;&#1575;&#1607;&#1606;&#1575; &#1575;&#1604;&#1575;&#1587;&#1578;&#1610;&#1604;&#1575;&#1569; &#1548; &#1608;&#1606;&#1586;&#1593; &#1601;&#1610;&#1607; &#1576;&#1576;&#1610;&#1578; &#1605;&#1580;&#1607;&#1608;&#1604; &#1604;&#1605; &#1610;&#1602;&#1604;&#1607; &#1605;&#1606; &#1610;&#1589;&#1581; &#1575;&#1604;&#1575;&#1581;&#1578;&#1580;&#1575;&#1580; &#1576;&#1602;&#1608;&#1604;&#1607;</div>    <P>
Which translates:    <P>
<div class='quote'><img src='images/quote-start.gif'>The speech that Allaah, the Exalted, is ascended over the Throne: The route to this issue is through pure tawqeef (through the revealed texts only), and no evidence can approach this matter except through this angle. And the Book (of Allaah) has spoken of it and more than a verse, and authentic narrations have been reported regarding it.     <P>
So accepting it from the angle of [accepting] the revealed texts (at-tawqeef) is obligatory and to delve into it and seek its kaifiyyah (how it is) is not permissible. And Maalik has said,     <P>
<blockquote>"Al-Istiwaa is known, and the kayf is not fathomable, having faith in it is obligatory and asking about (its kayf) is an innovation."</blockquote>    <P>
So from the revealed texts (at-tawqeef) that the Book came with is His saying: "<b>ar-Rahmaan ascended over the Throne</b>", and He said, "<b>Then ar-Rahmaan ascended over the Throne</b>", and He said, "<b>The raiser of ranks and owner of the Throne</b>", and He said, "<b>Do you feel secure that He who is above the heaven will not cause the earth to sink with you then it behold it shakes (as in an earthquake). Or do you feel secure that He, Who is over the heaven (Allah), will not send against you a violent whirlwind?</b>" <b>And He said, "The Spirit (ar-Ruh, Jibreel) and the Angels ascend to Him</b>...", and He said, "<b>Nay, but He (Allaah) raised him (Eesaa) unto Himself</b>..." and He said, "<b>To Him does the good word ascend</b>..."    <P>
And He said, quoting Fir'awn that he said, "<b>And Fir'awn (Pharaoh) said: "O Hamaan! Build me a tower that I may arrive at the ways, the ways of the heavens, and I may look upon the deity of Moses</b>." Thus, the desire of the kaafir (Fir'awn) took place (to pursue) the direction which Moses had informed of, and that is why he did not seek Him (Allaah) across the length or breadth of the earth and nor did he descend into its lower layers. So  what we have quoted of these verses shows that Allaah, the Sublime, is above the heaven, ascended over the Throne, and if He had been in every place (makaan), there would be no meaning to this specification (of ascending over the Throne in particular), and nor any benefit in it.    <P>
And the habit of the Muslims, the special and general amongst them has continued upon them calling upon their Lord in suppliating to Him and aspiring towards Him that they raise their hands to the heaven, and this is because of the widespread knowledge present with them that their Lord that is being called upon, the Sublime, is above the heaven. And the claim of some of them that the meaning of <a href='tags/al-istiwaa.html' class='tagLink'><font class='tagLink'>al-Istiwaa</font></a> here is al-isteelaa (conquering, subduing), and pulling out an unknown line of poetry (as evidence), then no one in whose [saying] it is correct to use as proof has actually said it.</div> <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/fogpc-abu-sulayman-al-khattabi-d-386h--allaah-is-above-the-heaven-ascended-over-the-throne.html">Abu Sulayman al-Khattabi (d. 386H):  Allaah is Above the Heaven, Ascended Over the Throne</a><BR>
//www.abovethethrone.com/arsh/?fogpc<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.abovethethrone.com/arsh/print.cfm?fogpc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:18:26 GMT -->
</html>


