

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?ydiou by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Al-Walaa wal-Baraa (Loyalty and Disownment) for the Aqidah in all the Classical Books of Aqidah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Al-Walaa wal-Baraa (Loyalty and Disownment) for the Aqidah in all the Classical Books of Aqidah</span><BR>
Friday, December 04 2009 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
It is important for the Muslim to realize when learning the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> that <u>it is not purely an academic exercise</u>. Rather, the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> is something around which and upon which allegiance and disavowal is based. When we look into all the classical books of <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, we see the constant mention of loving and hating on the basis of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> embodied in the prohibition of associating, mixing and accompanying the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> who have opposed the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of the Book, the Sunnah, and what the Righteous Salaf were upon in the first three centuries of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>.    <P>
Imaam <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a> said in "<a href="tags/usool-us-sunnah.html" class="tagLink"><font class="tagLink">Usool us-Sunnah</font></a>":     <P>
<div class='arabic' align='right'>&#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1593;&#1606;&#1583;&#1606;&#1575; &#1575;&#1604;&#1578;&#1605;&#1587;&#1603; &#1576;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1575;&#1604;&#1575;&#1602;&#1578;&#1583;&#1575;&#1569; &#1576;&#1607;&#1605;&#1548; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1576;&#1583;&#1593;&#1548; &#1608;&#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1601;&#1607;&#1610; &#1590;&#1604;&#1575;&#1604;&#1577; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1582;&#1589;&#1608;&#1605;&#1575;&#1578;&#1548; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1580;&#1604;&#1608;&#1587; &#1605;&#1593; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Fundamental Principles of the Sunnah  with us  are: Holding fast to what the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>  of the Messenger of Allaah (sallalaahu alayhi wasallam) were upon. Taking them [and their way] as a model to be followed. The abandonment of <a href='tags/innovations.html' class='tagLink'><font class='tagLink'>innovations</font></a>, and every innovation is misguidance. The abandonment of controversies. The abandonment of sitting with the people of ahwaa (desires).  </blockquote>    <P>
And at-Tahaawi said at the end of his Aqidah:    <P>
<div class='arabic' align='right'>&#1601;&#1607;&#1584;&#1575; &#1583;&#1610;&#1606;&#1606;&#1575; &#1608;&#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1606;&#1575; &#1592;&#1575;&#1607;&#1585;&#1575; &#1608;&#1576;&#1575;&#1591;&#1606;&#1575; &#1608;&#1606;&#1581;&#1606; &#1576;&#1585;&#1575;&#1569; &#1575;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1606; &#1603;&#1604; &#1605;&#1606; &#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1584;&#1610; &#1584;&#1603;&#1585;&#1606;&#1575;&#1607; &#1608;&#1576;&#1610;&#1606;&#1575;&#1607; &#1608;&#1606;&#1587;&#1571;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1575;&#1606; &#1610;&#1579;&#1576;&#1578;&#1606;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1575;&#1610;&#1605;&#1575;&#1606; &#1608;&#1610;&#1582;&#1578;&#1605; &#1604;&#1606;&#1575; &#1576;&#1607; &#1608;&#1610;&#1593;&#1589;&#1605;&#1606;&#1575; &#1605;&#1606; &#1575;&#1604;&#1575;&#1607;&#1608;&#1575;&#1569; &#1575;&#1604;&#1605;&#1582;&#1578;&#1604;&#1601;&#1577; &#1608;&#1575;&#1604;&#1575;&#1585;&#1575;&#1569; &#1575;&#1604;&#1605;&#1578;&#1601;&#1585;&#1602;&#1577; &#1608;&#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1575;&#1604;&#1585;&#1583;&#1610;&#1577; &#1605;&#1579;&#1604; &#1575;&#1604;&#1605;&#1588;&#1576;&#1607;&#1577; &#1608;&#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1608;&#1575;&#1604;&#1580;&#1607;&#1605;&#1610;&#1577; &#1608;&#1575;&#1604;&#1580;&#1576;&#1585;&#1610;&#1577; &#1608;&#1575;&#1604;&#1602;&#1583;&#1585;&#1610;&#1577; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1582;&#1575;&#1604;&#1601;&#1608;&#1575; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1608;&#1581;&#1575;&#1604;&#1601;&#1608;&#1575; &#1575;&#1604;&#1590;&#1604;&#1575;&#1604;&#1577; &#1608;&#1606;&#1581;&#1606; &#1605;&#1606;&#1607;&#1605; &#1576;&#1585;&#1575;&#1569; &#1608;&#1607;&#1605; &#1593;&#1606;&#1583;&#1606;&#1575; &#1590;&#1604;&#1575;&#1604; &#1608;&#1575;&#1585;&#1583;&#1610;&#1575;&#1569; &#1608;&#1576;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1593;&#1589;&#1605;&#1577; &#1608;&#1575;&#1604;&#1578;&#1608;&#1601;&#1610;&#1602;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This is our religion and our <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> outwardly and inwardly, and we are absolved, in front of Allaah, the Exalted, of every one who opposes that which we have mentioned and explained. And we ask Allaah, the Exalted to make us firm upon <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a>, to seal [the end] of our lives with it, to protect us from the variant desires and scattering opinions, and corrupt doctrines such as those of the Mushabbihah, the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, the Jabariyyah, the <a href='tags/qadariyyah.html' class='tagLink'><font class='tagLink'>Qadariyyah</font></a> and others besides them, from those who have opposed the Sunnah and Jamaa'ah and have allied with misguidance. We are free of them, and they, in our view, are astray, ruined. And with Allaah [alone] is safety (protection) and success.</blockquote>    <P>
And Imaam <a href='tags/al-laalikaaee.html' class='tagLink'><font class='tagLink'>al-Laalikaa'ee</font></a> brings, from the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of the two Raazees, Abu Zur'ah (d. 264H) and Abu Haatim (d. 277H), in "Sharh Usool il-I'tiqaad" (1/202,no.322)    <P>
<img src=assets/images/two-raazees-innovators.gif border=0>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Abu Muhammad said:    <P>
And I heard my father and Abu Zur'ah ordering with the boycotting of the people of deviation and <a href='tags/innovations.html' class='tagLink'><font class='tagLink'>innovations</font></a>, being very harsh in that with the most severe harshness. And they refused the compilation of books with opinions, with other than narrations.    <P>
And they forbade from sitting with the ahl ul-kalaam (people of theological rhetoric) and looking into the books of the  mutakallimoon (theologians) and they would both say: "The person of theological rhetoric will never prosper."    <P>
Abu Muhammad said: "And I say that too." And Abu Alee bin Habeesh al-Muqirree said: "And I say that." And our Shaikh (Ibn al-Mudhaffar) said: "And I say that." And our Shaikh - meaning the author - said: "And I say that."</blockquote>    <P>
And Abu Uthmaan as-Saaboonee (d. 449H) - may Allaah have mercy upon him - said in "Aqidah as-Salaf wa As.haabil-Hadeeth" (p. 123):     <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1578;&#1601;&#1602;&#1608;&#1575; &#1605;&#1593; &#1584;&#1604;&#1603; &#1593;&#1604;&#1609; &#1575;&#1604;&#1602;&#1608;&#1604; &#1576;&#1602;&#1607;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593;&#1548; &#1608;&#1573;&#1584;&#1604;&#1575;&#1604;&#1607;&#1605; &#1608;&#1573;&#1582;&#1586;&#1575;&#1574;&#1607;&#1605; &#1608;&#1575;&#1576;&#1593;&#1575;&#1583;&#1607;&#1605; &#1608;&#1575;&#1602;&#1589;&#1575;&#1574;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1578;&#1576;&#1575;&#1593;&#1583; &#1605;&#1606;&#1607;&#1605; &#1608;&#1605;&#1606; &#1605;&#1589;&#1575;&#1581;&#1576;&#1578;&#1607;&#1605; &#1608;&#1605;&#1593;&#1575;&#1588;&#1585;&#1578;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1578;&#1602;&#1585;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; &#1576;&#1605;&#1580;&#1575;&#1606;&#1576;&#1578;&#1607;&#1605; &#1608;&#1605;&#1607;&#1575;&#1580;&#1585;&#1578;&#1607;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And along with that they [the Salaf who have passed before him] unanimously agreed with their saying about the Ahl ul-Bid'ah, that they should be subdued, humiliated and disgraced, banished and driven away. That [one must] keep away from them, from those who associate with them and from those who are intimate with them. And to seek nearness to Allaah by avoiding them and fleeing from them.</blockquote>    <P>
And he also said (pp. 114-115):    <P>
<div class='arabic' align='right'>&#1608;&#1610;&#1576;&#1594;&#1590;&#1608;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593; &#1575;&#1604;&#1584;&#1610;&#1606; &#1571;&#1581;&#1583;&#1579;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1605;&#1575; &#1604;&#1610;&#1587; &#1605;&#1606;&#1607;&#1548; &#1608;&#1604;&#1575; &#1610;&#1581;&#1576;&#1608;&#1606;&#1607;&#1605; &#1608;&#1604;&#1575; &#1610;&#1589;&#1581;&#1576;&#1608;&#1606;&#1607;&#1605;&#1548; &#1608;&#1604;&#1575; &#1610;&#1587;&#1605;&#1593;&#1608;&#1606; &#1603;&#1604;&#1575;&#1605;&#1607;&#1605;&#1548; &#1608;&#1604;&#1575; &#1610;&#1580;&#1575;&#1604;&#1587;&#1608;&#1606;&#1607;&#1605; &#1608;&#1604;&#1575; &#1610;&#1580;&#1575;&#1583;&#1604;&#1608;&#1606;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606;&#1548; &#1608;&#1604;&#1575; &#1610;&#1606;&#1575;&#1592;&#1585;&#1608;&#1606;&#1607;&#1605; &#1608;&#1610;&#1585;&#1608;&#1606; &#1589;&#1608;&#1606; &#1570;&#1584;&#1575;&#1606;&#1607;&#1605; &#1593;&#1606; &#1587;&#1605;&#1575;&#1593; &#1571;&#1576;&#1575;&#1591;&#1610;&#1604;&#1607;&#1605; &#1575;&#1604;&#1578;&#1610; &#1573;&#1584;&#1575; &#1605;&#1585;&#1578; &#1576;&#1575;&#1604;&#1570;&#1584;&#1575;&#1606; &#1608;&#1602;&#1585;&#1578; &#1601;&#1610; &#1575;&#1604;&#1602;&#1604;&#1608;&#1576; &#1590;&#1585;&#1578;&#1548; &#1608;&#1580;&#1585;&#1578; &#1573;&#1604;&#1610;&#1607;&#1575; &#1575;&#1604;&#1608;&#1587;&#1575;&#1608;&#1587; &#1608;&#1575;&#1604;&#1582;&#1591;&#1585;&#1575;&#1578; &#1575;&#1604;&#1601;&#1575;&#1587;&#1583;&#1577;. &#1608;&#1601;&#1610;&#1607; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604; &#1602;&#1608;&#1604;&#1607;: "&#1608;&#1573;&#1584;&#1575; &#1585;&#1571;&#1610;&#1578; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1582;&#1608;&#1590;&#1608;&#1606; &#1601;&#1610; &#1570;&#1610;&#1575;&#1578;&#1606;&#1575; &#1601;&#1571;&#1593;&#1585;&#1590; &#1593;&#1606;&#1607;&#1605; &#1581;&#1578;&#1609; &#1610;&#1582;&#1608;&#1590;&#1608;&#1575; &#1601;&#1610; &#1581;&#1583;&#1610;&#1579; &#1594;&#1610;&#1585;&#1607;" </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And they [Ahl us-Sunnah] hate the people of innovation who have introduced into the religion that which is not from it. They do not love them, nor do they accompany them, nor do they listen to their speech, nor do they sit with them, nor argue with them regarding the religion, and nor do they debate them. And they see that their ears should be guarded from listening to their falsehoods, those which if they pass by the ears and enter into the hearts, will harm (the hearts) and lead them to corrupt whisperings and thoughts. And it is regarding [all of this] that Allaah, the Mighty and Majestic, revealed His saying, "<b>And when you see those who engage in false conversation about our signs, stay away from them till they turn to another topic</b>." (al-An'aam 6:68)</blockquote>    <P>
And all of this is only <u>a tiny sample</u> of the sum whole of what has been reported from the Salaf on this subject. You will find that the overwhelming majority of the books of <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> never fail to mention this subject. In this article we have only quoted from those who compiled the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> and summarized the positions of Ahl us-Sunnah - as for the hundreds of specific narrations from the Salaf in this regard, then inshaa'Allaah they will be covered in specific articles.    <P>
<b>In summary:</b> A Muslim loves and hate on the basis of his <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and i<u>t is not merely an academic exercise</u>. It is not like the <a href='tags/irjaa.html' class='tagLink'><font class='tagLink'>irjaa'</font></a> of the Murji'ah where the only thing that enters the heart is <u>pure information</u> and <u>pure factual knowledge</u> with no resulting <u>love and hate, allegiance and disavowal</u> in the heart, and no outward resultant effect manifested in behaviour.  <b>Worse still</b> is when a man spends years and years studying the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of the Salaf, grasping it, explaining it and writing books on it, only to then sit, with open arms, with the deniers of Allaah's Uluww, the callers to grave-worship and istighaathah (seeking rescue from other than Allaah), proclaiming:    <P>
<blockquote class='quotered'><img src='images/quote-start.gif'>I am proud to call all of them my brothers in faith; I am always honored to be in their company; I am eager to further my relationship with them; I sense a genuine spirit of Islamic brotherhood whilst amongst them; I wish the best for them and their da'wah; I am desirous to benefit from their wisdom and knowledge.</blockquote>    <P>
And the da'wah of the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> he is referring to being the da'wah to ta'teel and hulool and worshipping others besides Allaah - which is what their organizations and institutes preach and teach. All of this is evidence that knowledge of <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> is a proof against an individual and that it may not have benefited him except as a mere academic exercise.     <P>
Compare this to <u>the Ijmaa' of the Salaf</u>, meaning the hundreds of Imaams of Guidance from the first few centuries of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>, as mentioned by as-Saaboonee, just quoted previously:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And they [Ahl us-Sunnah] hate the people of innovation who have introduced into the religion that which is not from it. They do not love them, nor do they accompany them, nor do they listen to their speech, nor do they sit with them, nor argue with them regarding the religion, and nor do they debate them. And they see that their ears should be guarded from listening to their falsehoods, those which if they pass by the ears and enter into the hearts, will harm (the hearts) and lead them to corrupt whisperings and thoughts. And it is regarding [all of this] that Allaah, the Mighty and Majestic, revealed His saying, "<b>And when you see those who engage in false conversation about our signs, stay away from them till they turn to another topic</b>." (al-An'aam 6:68)</blockquote>    <P>
And this topic will be expanded upon specifically in other articles inshaa'Allaah, upon the usool of Ahl us-Sunnah regarding innovation and its people - for in these usool there is <u>the protection and safeguarding</u> of the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> after it has entered into the hearts - so whoever is eager upon his <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and wishes to meet his Lord upon what the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> were upon, then let him not be neglectful in this regard, rather he should understand the usool of Ahl us-Sunnah regarding the mu'aamalah with the people of innovation, with respect to those who call to it, and those who do not call to it, with respect to the leaders of innovation and those who are followers - for all these affairs have clear guidelines which are made clear in the writings of Ahl us-Sunnah wal-Jamaa'ah.    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/ydiou-al-walaa-wal-baraa-allegiance-and-disavowal-for-the-aqidah-in-the-books-of-aqidah.html">Al-Walaa wal-Baraa (Loyalty and Disownment) for the Aqidah in all the Classical Books of Aqidah</a><BR>
https://www.aqidah.com/creed/?ydiou<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?ydiou by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
</html>


