

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?adfqp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Loyalty and Disownment For the  Aqidah: Yunus bin Ubayd (d. 139H) and Mixing with the People of Deviation</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Loyalty and Disownment For the  Aqidah: Yunus bin Ubayd (d. 139H) and Mixing with the People of Deviation</span><BR>
Thursday, December 03 2009 - by Abu.Khadeejah.SP 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<img src=assets/images/barbahaaree-manuscript.jpg align=right border=1 hspace=8 border=0><font class='titleHeadline'>Sharh us-Sunnah of <a href="tags/al-barbahaaree.html" class="tagLink"><font class="tagLink">Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a></font>    <P>
The book "<i><a href='tags/sharh-us-sunnah.html' class='tagLink'><font class='tagLink'>Sharh us-Sunnah</font></a></i>" of al-Imaam Abu Muhammad al-Hasan bin Alee bin Khalf <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> (d. 329H) is contained in Tabaqaat al-Hanaabilah of Abu Ya'laa (2/18), and exists in  manuscript form in al-Maktabah adh-Dhaahiriyyah in Damascus in the writing of the Imaam, Abu al-Qaasim Ubayd Allaah bin Hamza (d. 550H), and it has been ascribed to <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> by Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> in "<i>Bughyat ul-Murtaad</i>", adh-Dhahabi in "<i><a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-Uluww</font></a></i>" and "<i>Taareekh ul-Islaam</i>", and "<i>Siyar</i>", also by Ibn Muflih in "<i>al-Furoo</i>" and "<i>al-Aadaab ash-Sharee'ah</i>", and also by as-Safadee in "<i>al-Waafee bil-Wafayaat</i>", and by Ibn Hajar in "<i>Fath al-Baaree</i>", and by Ibn al-Imaad in "<i>Shadharaat adh-Dhahab</i>"    <P>
<font class='titleHeadline'>Yunus bin Ubayd on the Company of <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> and Sinners</font>    <P>
<b>The Imaam of Ahlus-Sunnah in his time:</b> Abu Muhammad al-Hasan ibn 'Alee ibn Khalaf <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> (d. 329H) stated in his monumental work, 'Sharhus-Sunnah', point 150 (Maktabatur-Rushd, 1429H/2008):    <P>
<div class='arabic' align='right'>&#1585;&#1571;&#1609; &#1610;&#1608;&#1606;&#1587; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583; &#1575;&#1576;&#1606;&#1607; &#1608;&#1602;&#1583; &#1582;&#1585;&#1580; &#1605;&#1606; &#1593;&#1606;&#1583; &#1589;&#1575;&#1581;&#1576; &#1607;&#1608;&#1609; &#1601;&#1602;&#1575;&#1604; &#1610;&#1575; &#1576;&#1606;&#1610; &#1605;&#1606; &#1571;&#1610;&#1606; &#1582;&#1585;&#1580;&#1578; &#1602;&#1575;&#1604; &#1605;&#1606; &#1593;&#1606;&#1583; &#1593;&#1605;&#1585;&#1608; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583; &#1602;&#1575;&#1604; &#1610;&#1575; &#1576;&#1606;&#1610; &#1604;&#1571;&#1606; &#1571;&#1585;&#1575;&#1603; &#1582;&#1585;&#1580;&#1578; &#1605;&#1606; &#1576;&#1610;&#1578; &#1582;&#1606;&#1579;&#1609; &#1571;&#1581;&#1576; &#1573;&#1604;&#1610; &#1605;&#1606; &#1571;&#1606; &#1571;&#1585;&#1575;&#1603; &#1582;&#1585;&#1580;&#1578; &#1605;&#1606; &#1576;&#1610;&#1578; &#1601;&#1604;&#1575;&#1606; &#1608;&#1601;&#1604;&#1575;&#1606; &#1608;&#1604;&#1571;&#1606; &#1578;&#1604;&#1602;&#1609; &#1575;&#1604;&#1604;&#1607; &#1586;&#1575;&#1606;&#1610;&#1575; &#1587;&#1575;&#1585;&#1602;&#1575; &#1582;&#1575;&#1574;&#1606;&#1575; &#1571;&#1581;&#1576; &#1573;&#1604;&#1610; &#1605;&#1606; &#1571;&#1606; &#1578;&#1604;&#1602;&#1575;&#1607; &#1576;&#1602;&#1608;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569; .  &#1571;&#1604;&#1575; &#1578;&#1585;&#1609; &#1571;&#1606; &#1610;&#1608;&#1606;&#1587; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583; &#1602;&#1583; &#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1582;&#1606;&#1579;&#1609; &#1604;&#1575; &#1610;&#1590;&#1604; &#1575;&#1576;&#1606;&#1607; &#1593;&#1606; &#1583;&#1610;&#1606;&#1607; &#1608;&#1571;&#1606; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1610;&#1590;&#1604;&#1607; &#1581;&#1578;&#1609; &#1610;&#1603;&#1601;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Yoonus bin 'Ubaid saw his son exiting the house of a person of desires (i.e. misguidance) so he said: "O my son! From where have you just exited?" He replied: "From the company of 'Amr ibn 'Ubaid." So he said: "O my son. That I had seen you exiting the house of shameless and lewd person would have been more beloved to me than that I see you exiting the house of so-and-so! That you should meet Allaah, O my son, as a fornicator, a sinner, a thief or as a treacherous soul is more beloved to me than that you should meet him with a saying of the people of desires (i.e. misguidance)." Do you not see that <a href='tags/yoonus-ibn-ubaid.html' class='tagLink'><font class='tagLink'>Yoonus ibn 'Ubaid</font></a> knew that the shameless and lewd person would not misguide his son away from the Religion, whereas the person of innovation (i.e. bid'ah) would misguide him until he causes him to disbelieve."</blockquote>    <P>
<font class='titleHeadline'>Commentary of Shaykh Saalih <a href="tags/al-fawzaan.html" class="tagLink"><font class="tagLink">al-Fawzaan</font></a></font>    <P>
The following commentary of Shaikh Saalih ibn Fawzaan ibn Abdullaah <a href='tags/al-fawzaan.html' class='tagLink'><font class='tagLink'>al-Fawzaan</font></a> is taken from "<i>Ittihaaf al-Qaaree bi at-Ta'liqaat 'alaa Sharh is-Sunnah</i>" (pp. 233-235):    <P>
<div class='arabic' align='right'>&#1585;&#1571;&#1609; &#1610;&#1608;&#1606;&#1587; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583; &#1575;&#1576;&#1606;&#1607; &#1608;&#1602;&#1583; &#1582;&#1585;&#1580; &#1605;&#1606; &#1593;&#1606;&#1583; &#1589;&#1575;&#1581;&#1576; &#1607;&#1608;&#1609; &#1601;&#1602;&#1575;&#1604; &#1610;&#1575; &#1576;&#1606;&#1610; &#1605;&#1606; &#1571;&#1610;&#1606; &#1582;&#1585;&#1580;&#1578; &#1602;&#1575;&#1604; &#1605;&#1606; &#1593;&#1606;&#1583; &#1593;&#1605;&#1585;&#1608; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583;</div>     <blockquote class='quote'><img src='images/quote-start.gif'>Yoonus bin 'Ubaid saw his son exiting the house of a person of desires (i.e. misguidance) so he said: "O my son! From where have you just exited?" He replied: "From the company of 'Amr ibn 'Ubaid."</blockquote>    <P>
'Amr ibn 'Ubaid was the shaikh of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>.     <P>
<div class='arabic' align='right'>&#1602;&#1575;&#1604; &#1610;&#1575; &#1576;&#1606;&#1610; &#1604;&#1571;&#1606; &#1571;&#1585;&#1575;&#1603; &#1582;&#1585;&#1580;&#1578; &#1605;&#1606; &#1576;&#1610;&#1578; &#1582;&#1606;&#1579;&#1609; &#1571;&#1581;&#1576; &#1573;&#1604;&#1610; &#1605;&#1606; &#1571;&#1606; &#1571;&#1585;&#1575;&#1603; &#1582;&#1585;&#1580;&#1578; &#1605;&#1606; &#1576;&#1610;&#1578; &#1601;&#1604;&#1575;&#1606; &#1608;&#1601;&#1604;&#1575;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>O my son. That I had seen you exiting the house of a 'khunthaa' would have been more beloved to me than that I see you exiting the house of so-and-so!</blockquote>    <P>
The word "Khunthaa" is not clear, and in some manuscripts there occurs "from the house of a 'heetiyy'" and this is also unclear [1], however the intent is that you should not sit with the people of bid'ah; and if you had exited from the company of a person of Sunnah, but one who was a sinner, then that would have been easier than that you sit with a person of <a href='tags/bidah.html' class='tagLink'><font class='tagLink'>bid'ah</font></a>. This is what <a href='tags/yoonus-ibn-ubaid.html' class='tagLink'><font class='tagLink'>Yoonus ibn 'Ubaid</font></a> was warning his son about. This is because he sat with 'Amr ibn 'Ubaid, the head of the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>. So sitting with a Muslim, a person of Sunnah, even if he has deficiency in (practicing his) religion, then that is easier and less harmful than his sitting with the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a>, and even more so if he is learning from them! Do not study or learn from the people of desires, innovation and newly invented matters. Rather learn from Ahlus-Sunnah, from the scholars of Ahlus-Sunnah, the scholars of sound and correct belief - just as Muhammad ibn Sireen (died 110H) said:     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed this knowledge is Religion, so look and investigate from whom you take your religion.</blockquote>    <P>
Reported by Muslim in his Muqaddimah to his Saheeh (1/14).    <P>
And if it is the case that by merely sitting with them, there is great danger, then what is the case of taking knowledge from the innovators!!    <P>
<div class='arabic' align='right'>&#1608;&#1604;&#1571;&#1606; &#1578;&#1604;&#1602;&#1609; &#1575;&#1604;&#1604;&#1607; &#1586;&#1575;&#1606;&#1610;&#1575; &#1587;&#1575;&#1585;&#1602;&#1575; &#1582;&#1575;&#1574;&#1606;&#1575; &#1571;&#1581;&#1576; &#1573;&#1604;&#1610; &#1605;&#1606; &#1571;&#1606; &#1578;&#1604;&#1602;&#1575;&#1607; &#1576;&#1602;&#1608;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>That you should meet Allaah, O my son, as a fornicator, a sinner, a thief or as a treacherous soul is more beloved to me than that you should meet him with a saying of the people of desires (i.e. misguidance).</blockquote>    <P>
So he saying to his son, that were you to die as a sinner, committing a major sin lesser than shirk and therefore you hope in the mercy of Allaah - as He, the Most High, stated:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1573;&#1616;&#1606;&#1617;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1614; &#1604;&#1575;&#1614; &#1610;&#1614;&#1594;&#1618;&#1601;&#1616;&#1585;&#1615; &#1571;&#1614;&#1606; &#1610;&#1615;&#1588;&#1618;&#1585;&#1614;&#1603;&#1614; &#1576;&#1616;&#1607;&#1616; &#1608;&#1614;&#1610;&#1614;&#1594;&#1618;&#1601;&#1616;&#1585;&#1615; &#1605;&#1614;&#1575; &#1583;&#1615;&#1608;&#1606;&#1614; &#1584;&#1614;&#1604;&#1616;&#1603;&#1614; &#1604;&#1616;&#1605;&#1614;&#1606; &#1610;&#1614;&#1588;&#1614;&#1575;&#1569; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> Indeed Allaah does not forgive that partners be associated with Him in worship, but He forgives lesser than that to whoever He pleases. (an-Nisaa 4:48) </b><img src='images/qnend.gif'></blockquote>     <P>
To the extent that even if the one who commits a major sin is punished in the Hellfire, his final abode will be Jannah - he will not remain eternally in the Fire. As for the person of innovation, then his innovation may lead him to unbelief and thus he becomes eternally a dweller of the Fire because he innovated into the Religion that which is not from it.    <P>
As for the sinner, he does not say that his sin is from the Religion (unlike the innovator who claims his innovation is from Islaam), so therefore that you die upon sin, even if it be major yet less than shirk is better than dying upon <a href='tags/bidah.html' class='tagLink'><font class='tagLink'>bid'ah</font></a> - and this is something very clear indeed.    <P>
<div class='arabic' align='right'>&#1571;&#1604;&#1575; &#1578;&#1585;&#1609; &#1571;&#1606; &#1610;&#1608;&#1606;&#1587; &#1576;&#1606; &#1593;&#1576;&#1610;&#1583; &#1602;&#1583; &#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1582;&#1606;&#1579;&#1609; &#1604;&#1575; &#1610;&#1590;&#1604; &#1575;&#1576;&#1606;&#1607; &#1593;&#1606; &#1583;&#1610;&#1606;&#1607; &#1608;&#1571;&#1606; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1610;&#1590;&#1604;&#1607; &#1581;&#1578;&#1609; &#1610;&#1603;&#1601;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Do you not see that <a href='tags/yoonus-ibn-ubaid.html' class='tagLink'><font class='tagLink'>Yoonus ibn 'Ubaid</font></a> knew that the shameless and lewd person would not misguide his son away from the Religion, whereas the person of innovation (i.e. bid'ah) would misguide him until he causes him to disbelieve.</blockquote>    <P>
And this is the wisdom behind why he should not sit with the people of <a href='tags/bidah.html' class='tagLink'><font class='tagLink'>bid'ah</font></a>. That he sit with a person of Sunnah, even if he is deficient in his religion and <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a>. For indeed the harm he will receive by sitting with an innovator is more severe than the harm he will receive by sitting with a person of Sunnah who a sinner; and this is because the person of <a href='tags/bidah.html' class='tagLink'><font class='tagLink'>bid'ah</font></a> will call you to <a href='tags/innovations.html' class='tagLink'><font class='tagLink'>innovations</font></a> and to opposing the Book and Sunnah. And as for the sinner from Ahlus-Sunnah then he will not warn you from the Book and Sunnah, nor will he warn you from the ittibaa' (i.e. the following) of the Sunnah, ever. So there is a difference between what the innovator directs you to and what the sinner directs you to. The most the sinner will do is beautify for you sinful acts, and as for warning you from the Sunnah, then no. He will not warn against the Sunnah - rather he honors and venerates the Sunnah, contrary to the innovator who does not honor the Sunnah.    <P>
<font class='titleHeadline'>Footnotes</font>    <P>
[1] In one of the manuscripts the words "min bayti Khammaar" occurs which means "from the house of a wine-seller". (See "<i><a href='tags/sharhus-sunnah.html' class='tagLink'><font class='tagLink'>sharhus-sunnah</font></a></i>", Maktabah Daar al-Minhaaj, printed 1426H, page 121).   <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/adfqp-explanation-of-sharhus-sunnah-of-imaam-al-barbaharee-died-329h-yoonus-ibn-ubaid-saw-his-son-exiting-the-house-of-a-person-of-misguidance.html">Loyalty and Disownment For the  Aqidah: Yunus bin Ubayd (d. 139H) and Mixing with the People of Deviation</a><BR>
https://www.aqidah.com/creed/?adfqp<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?adfqp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
</html>


