

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?jmnak by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:30 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Imam al-Barbahaaree's Praise of All&#257;h and His Favour: Shaikh al-Fawzaan's Explanation</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Imam al-Barbahaaree's Praise of All&#257;h and His Favour: Shaikh al-Fawzaan's Explanation</span><BR>
Thursday, April 26 2012 - by Abu.Khadeejah.SP 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<img src=assets/images/barbahaaree-manuscript.jpg align=right border=1 hspace=8 border=0><font class='titleHeadline'>Sharh us-Sunnah of <a href="tags/al-barbahaaree.html" class="tagLink"><font class="tagLink">Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a></font>    <P>
The book "<i><a href='tags/sharh-us-sunnah.html' class='tagLink'><font class='tagLink'>Sharh us-Sunnah</font></a></i>" of al-Imaam Abu Muhammad al-Hasan bin Alee bin Khalf <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> (d. 329H) is contained in Tabaqaat al-Hanaabilah of Abu Ya'laa (2/18), and exists in  manuscript form in al-Maktabah adh-Dhaahiriyyah in Damascus in the writing of the Imaam, Abu al-Qaasim Ubayd Allaah bin Hamza (d. 550H), and it has been ascribed to <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> by Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> in "<i>Bughyat ul-Murtaad</i>", adh-Dhahabi in "<i><a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-Uluww</font></a></i>" and "<i>Taareekh ul-Islaam</i>", and "<i>Siyar</i>", also by Ibn Muflih in "<i>al-Furoo</i>" and "<i>al-Aadaab ash-Sharee'ah</i>", and also by as-Safadee in "<i>al-Waafee bil-Wafayaat</i>", and by Ibn Hajar in "<i>Fath al-Baaree</i>", and by Ibn al-Imaad in "<i>Shadharaat adh-Dhahab</i>"    <P>
<font class='titleHeadline'>Introduction: "Praise of All&#257;h and His Favour" | Explanation by the Noble Shaikh, the Scholar, S&#257;lih al-Fawz&#257;n</font>    <P>
Im&#257;m al-Barbah&#257;ree, may All&#257;h's Mercy be upon him, said:    <P>
<div class='arabic' align='right'>&#1602;&#1575;&#1604; &#1575;&#1604;&#1576;&#1585;&#1576;&#1607;&#1575;&#1585;&#1610; &#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610; &#1607;&#1583;&#1575;&#1606;&#1575; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1608;&#1605;&#1606; &#1593;&#1604;&#1610;&#1606;&#1575; &#1576;&#1607; &#1608;&#1571;&#1582;&#1585;&#1580;&#1606;&#1575; &#1601;&#1610; &#1582;&#1610;&#1585; &#1571;&#1605;&#1577; &#1601;&#1606;&#1587;&#1571;&#1604;&#1607; &#1575;&#1604;&#1578;&#1608;&#1601;&#1610;&#1602; &#1604;&#1605;&#1575; &#1610;&#1581;&#1576; &#1608;&#1610;&#1585;&#1590;&#1609; &#1608;&#1575;&#1604;&#1581;&#1601;&#1592; &#1605;&#1605;&#1575; &#1610;&#1603;&#1585;&#1607; &#1608;&#1610;&#1587;&#1582;&#1591;</div>    <P>
<div class='sidebar'><b>All praise is due to All&#257;h who guided us to Isl&#257;m, and He favoured us with it, and He placed us in the best nation - so we ask Him to grant us success to adhere to that which He loves and is pleased with, and to protect us from that which He hates and that which angers Him.</b></div>    <P>
<font class='titleHeadline'>EXPLANATION  </font>    <P>
This is the opening address of the book, so he began with <b>"All praise is due to Allaah (al-hamdulillaah)"</b> thereby acting upon the Sunnah. The Prophet (salallaahu 'alaihi wassallam) himself used to praise and extol All&#257;h in his writings and sermons - and this was the way of the Pious Salaf and the people of knowledge. They would begin their books with  the words <i>"In the name of All&#257;h, the Merciful, the Bestower of Mercy"</i> following in that the Book of the Almighty; and they would begin also with <i>"All praise is due to All&#257;h, the Lord of the worlds"</i> following the example of the Prophet (salallaahu 'alaihi wassallam). So when he (salallaahu 'alaihi wassallam) would wished to deliver a sermon or to speak to clarify a matter, he would praise All&#257;h and extol Him<sup>[1]</sup>, he would then explain and clarify whatever he wished (salallaahu 'alaihi wassallam). So the author, al-Barbah&#257;ree, has taken this same methodology following the Salaf and beginning with <i>"al-hamdulill&#257;hi"</i> i.e. all praise is due to All&#257;h.    <P>
The meaning of <i>"al-hamdulill&#257;hi"</i> is that all praises are due to All&#257;h (the Most High), and <i>"al-hamd"</i> is praise and extolling of the praiseworthy. So All&#257;h (the Most High) is praised Himself, and that praise is due to His Attributes, His Names, and He (the Most High) is praise upon His Actions. So He is deserving of all of the types of praise because all the bounties come from Him (the Most High). As for other than Him, then that person is praised in accordance to what is conferred upon him of bounties, however the absolute, complete and all-encompassing praise is for All&#257;h (the Most High) only - so it would not be permissible for you to say: "Al-hamd (i.e. all praise) is due to so-and-so" with the meaning of complete and overwhelming praise. This is not permitted for anyone except All&#257;h, just as it occurs in the Qur'&#257;n:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1575;&#1604;&#1618;&#1581;&#1614;&#1605;&#1618;&#1583;&#1615; &#1604;&#1616;&#1604;&#1617;&#1614;&#1607;&#1616; &#1585;&#1614;&#1576;&#1616;&#1617; &#1575;&#1604;&#1618;&#1593;&#1614;&#1575;&#1604;&#1614;&#1605;&#1616;&#1610;&#1606;&#1614; &#1757; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1618;&#1605;&#1614;&#1648;&#1606;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1616; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> All praise is due to Allah, Lord of the worlds, the Most Merciful, the Bestower of Mercy.  Al-F&#257;tihah, 2-3 </b><img src='images/qnend.gif'></blockquote>  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1575;&#1604;&#1618;&#1581;&#1614;&#1605;&#1618;&#1583;&#1615; &#1604;&#1616;&#1604;&#1617;&#1614;&#1607;&#1616; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1582;&#1614;&#1604;&#1614;&#1602;&#1614; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1614;&#1575;&#1608;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1571;&#1614;&#1585;&#1618;&#1590;&#1614; &#1608;&#1614;&#1580;&#1614;&#1593;&#1614;&#1604;&#1614; &#1575;&#1604;&#1592;&#1617;&#1615;&#1604;&#1615;&#1605;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1606;&#1617;&#1615;&#1608;&#1585;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> All praise is due to Allah, who created the heavens and the earth and made the darkness and the light.  Al-An&#8219;&#257;m, 1 </b><img src='images/qnend.gif'></blockquote>  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1575;&#1604;&#1618;&#1581;&#1614;&#1605;&#1618;&#1583;&#1615; &#1604;&#1616;&#1604;&#1617;&#1614;&#1607;&#1616; &#1601;&#1614;&#1575;&#1591;&#1616;&#1585;&#1616; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1614;&#1575;&#1608;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> All praise is due to Allah, Creator of the heavens and the earth.  F&#257;tir, 1 </b><img src='images/qnend.gif'></blockquote>    <P>
If you were say, "I am grateful to so-and-so" or, "I praise so-and-so due to what he has done" with the meaning of specifying something for which you have praised him or thanked him, then in that there is no harm. As for you saying, "Al-hamd (i.e. all praise) is due to so-and-so" then this is not permitted except for All&#257;h (the Most High).    <P>
As for "<b>All&#257;h</b>", then it is a name from His names, the Most High. It's meaning is "The One Diety (al-Ma'looh), The One Worshipped (al-Ma&#8219;bood)". This is because the meaning of al-Uloohiyyah (i.e. to single out All&#257;h as the Diety) is al-&#8219;Uboodiyyah (i.e. to single All&#257;h alone with all worship).    <P>
This is name that is not used except for All&#257;h - no one is to be ever named with this name other than All&#257;h Himself. Even the tyrants, the obstinate disbelievers and the godless athiests never named themselves "All&#257;h". The Pharoah never said, "I am All&#257;h", rather he would say, "I am your Lord the Most High."<sup>[2]</sup> So this name is specific and only for All&#257;h (the Most High).    <P>
In the term <b>"Lord of the worlds (<span class='arb'>&#1585;&#1614;&#1576;&#1616;&#1617; &#1575;&#1604;&#1618;&#1593;&#1614;&#1575;&#1604;&#1614;&#1605;&#1616;&#1610;&#1606;&#1614;</span>)"</b>, the meaning of ar-Rabb (The Lord) is: al-M&#257;lik (the Owner), al-Mutasarrif (the Governing Sovereign). The worlds <span class='arb'>(&#1575;&#1604;&#1618;&#1593;&#1614;&#1575;&#1604;&#1614;&#1605;&#1616;&#1610;&#1606;&#1614;)</span> is the plural of world <span class='arb'>(&#1593;&#1614;&#1575;&#1604;&#1614;&#1605;)</span> - the worlds here refers to all of <a href='tags/creation.html' class='tagLink'><font class='tagLink'>creation</font></a>. All&#257;h is the Lord of the worlds, He created them and controls them - He is Sole One that is worthy of being worshipped by the <a href='tags/creation.html' class='tagLink'><font class='tagLink'>creation</font></a> and the Sole One and True Diety.  The saying of the Im&#257;m al-Barbah&#257;ree (may All&#257;h's Mercy be upon him): <b>"All praise is due to All&#257;h who guided us to Isl&#257;m"</b> Then Isl&#257;m is the greatest blessing, All&#257;h (the Most High) stated:  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1575;&#1604;&#1618;&#1610;&#1614;&#1608;&#1618;&#1605;&#1614; &#1571;&#1614;&#1603;&#1618;&#1605;&#1614;&#1604;&#1618;&#1578;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1618; &#1583;&#1616;&#1610;&#1606;&#1614;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1571;&#1614;&#1578;&#1618;&#1605;&#1614;&#1605;&#1618;&#1578;&#1615; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1603;&#1615;&#1605;&#1618; &#1606;&#1616;&#1593;&#1618;&#1605;&#1614;&#1578;&#1616;&#1610; &#1608;&#1614;&#1585;&#1614;&#1590;&#1616;&#1610;&#1578;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1615; &#1575;&#1604;&#1618;&#1573;&#1616;&#1587;&#1618;&#1604;&#1614;&#1575;&#1605;&#1614; &#1583;&#1616;&#1610;&#1606;&#1611;&#1575; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> This day I have perfected for you your religion and completed My favour upon you and have approved for you Islam as religion.  al-M&#257;'idah, 3 </b><img src='images/qnend.gif'></blockquote>    <P>
So with Isl&#257;m the favour and blessing was completed upon the Muslims - and All&#257;h (the Most High) states:  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1602;&#1615;&#1604;&#1618; &#1576;&#1616;&#1601;&#1614;&#1590;&#1618;&#1604;&#1616; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1608;&#1614;&#1576;&#1616;&#1585;&#1614;&#1581;&#1618;&#1605;&#1614;&#1578;&#1616;&#1607;&#1616; &#1601;&#1614;&#1576;&#1616;&#1584;&#1614;&#1648;&#1604;&#1616;&#1603;&#1614; &#1601;&#1614;&#1604;&#1618;&#1610;&#1614;&#1601;&#1618;&#1585;&#1614;&#1581;&#1615;&#1608;&#1575; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> Say, "In the bounty of Allah and in His mercy - in that let them rejoice"   Yoonus, 58 </b><img src='images/qnend.gif'></blockquote>    <P>
The bounty of All&#257;h mentioned here is Isl&#257;m, and the mercy is the Qur'&#257;n. So let them rejoice with Isl&#257;m and the Qur'&#257;n.    <P>
In this is a recognition for you that bounty belongs to All&#257;h for you being guided to Isl&#257;m, and being directed towards it. This is a bounty from All&#257;h, not due to your strength or your power - rather it is guidance and success that is granted by All&#257;h (the Most High). He is the One who guided you - and it is for this reason that the people of Paradise will say once they have entered into Paradise on the Day of Resurrection:  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1575;&#1604;&#1618;&#1581;&#1614;&#1605;&#1618;&#1583;&#1615; &#1604;&#1616;&#1604;&#1617;&#1614;&#1607;&#1616; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1607;&#1614;&#1583;&#1614;&#1575;&#1606;&#1614;&#1575; &#1604;&#1616;&#1607;&#1614;&#1648;&#1584;&#1614;&#1575; &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1615;&#1606;&#1617;&#1614;&#1575; &#1604;&#1616;&#1606;&#1614;&#1607;&#1618;&#1578;&#1614;&#1583;&#1616;&#1610;&#1614; &#1604;&#1614;&#1608;&#1618;&#1604;&#1614;&#1575; &#1571;&#1614;&#1606;&#1618; &#1607;&#1614;&#1583;&#1614;&#1575;&#1606;&#1614;&#1575; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1615;ý&#1750;     <img src='images/qnend.gif'></div>  <blockquote  class='quotequran'><img src='images/qnstart.gif'><b> "Praise to Allah, who has guided us to this; and we would never have been guided if Allah had not guided us."  Al-A&#8219;r&#257;f, 43   </b><img src='images/qnend.gif'></blockquote>    <P>
Al-Barbah&#257;ree stated: <b>"..and He placed us in the best nation.."</b> He took this from the statement of All&#257;h (the Most High):  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1603;&#1615;&#1606;&#1578;&#1615;&#1605;&#1618; &#1582;&#1614;&#1610;&#1618;&#1585;&#1614; &#1571;&#1615;&#1605;&#1617;&#1614;&#1577;&#1613; &#1571;&#1615;&#1582;&#1618;&#1585;&#1616;&#1580;&#1614;&#1578;&#1618; &#1604;&#1616;&#1604;&#1606;&#1617;&#1614;&#1575;&#1587;&#1616;   <img src='images/qnend.gif'></div>  <blockquote  class='quotequran'><img src='images/qnstart.gif'><b> You are the best nation raised for mankind.  &#256;li &#8219;Imr&#257;n, 110 </b><img src='images/qnend.gif'></blockquote>    <P>
The saying of All&#257;h, <b>"You are.."</b> is addressed to the Muslims. His saying, <b>"..best nation.."</b> meaning the best of all nations. And the intent of the term, Nation (Ummah) is <i>al-Jam&#257;&#8219;ah</i>. In the statement of All&#257;h (the Most High), <b>"..best nation raised for mankind"</b>, scrutinise the words, <b>"..for mankind."</b> So the goodness of this Ummah is not limited to only upon their own individual selves - it does not suffice that a person learns and acts whilst he abandons others, rather he must spread the message, and spread knowledge, and spread the goodness, and call to All&#257;h, enjoin what is good, forbid what is evil and he becomes an active member of the Muslim Society. So the meaning of His (the Most High) saying, <b>"..raised for mankind"</b> is that they were not merely raised for their own benefit, but raised for mankind in general.    <P>
The saying of the Im&#257;m al-Barbah&#257;ree (may All&#257;h's Mercy be upon him): <b>"So we ask Him to grant us success to adhere to that which He loves and is pleased with"</b> A person asks All&#257;h for steadfastness, even if he knows the truth, acts upon it and believes in it. He does not feel safe from being deviated, and from trials that may come, plague him and led him astray from the Path of All&#257;h (the Most High). For this reason the Prophet (salallaahu 'alaihi wassallam) would say:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>"O Turner of the hearts! Keep my heart firm upon your Religion."<sup>[3]</sup></blockquote>     <P>
And al-Khal&#299;l, the close friend of All&#257;h, Ibr&#257;h&#299;m (salallaahu 'alaihi wassallam) stated in his supplication:  <div class='arabicquran'><img src='images/qnstart.gif'>   &#1608;&#1614;&#1575;&#1580;&#1618;&#1606;&#1615;&#1576;&#1618;&#1606;&#1616;&#1610; &#1608;&#1614;&#1576;&#1614;&#1606;&#1616;&#1610;&#1617;&#1614; &#1571;&#1614;&#1606; &#1606;&#1617;&#1614;&#1593;&#1618;&#1576;&#1615;&#1583;&#1614; &#1575;&#1604;&#1618;&#1571;&#1614;&#1589;&#1618;&#1606;&#1614;&#1575;&#1605;&#1614; &#1757; &#1585;&#1614;&#1576;&#1616;&#1617; &#1573;&#1616;&#1606;&#1617;&#1614;&#1607;&#1615;&#1606;&#1617;&#1614; &#1571;&#1614;&#1590;&#1618;&#1604;&#1614;&#1604;&#1618;&#1606;&#1614; &#1603;&#1614;&#1579;&#1616;&#1610;&#1585;&#1611;&#1575; &#1605;&#1616;&#1617;&#1606;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1587;&#1616;ý&#1750;    <img src='images/qnend.gif'></div>  <blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And keep me and my sons away from worshipping idols. My Lord, indeed they have led astray many among the people.  Ibr&#257;h&#299;m, 35-36 </b><img src='images/qnend.gif'></blockquote>    <P>
All&#257;h's Messenger Ibr&#257;h&#299;m (salallaahu 'alaihi wassallam) feared for himself - and it is true that for every strengthening of &#298;m&#257;n in All&#257;h, a person fears and does not feel secure from being put to trial, and he does not praise himself, or sanctify himself. Rather he asks All&#257;h for steadfastness, asks Him for a good end to his life, fears a wicked ending. He fears falling into trials and tribulations - he fears deviation, misguidance and the callers to evil.    <P>
The saying of the Im&#257;m al-Barbah&#257;ree (may All&#257;h's Mercy be upon him): <b>"And to protect us from that which He hates and that which angers Him."</b> So He (the Most High) may grant us success in that which He loves and is pleased with of actions, sayings and beliefs - and that He (the Most High) protects us and keeps us away from that which angers Him from sayings, actions and beliefs. So He (the Most High) is The Guide (al-H&#257;dee), The One who grants success (al-Muwaffiq) - He is the One who shows the way and gives direction.     <P>
<b><u>FOOTNOTES</u></b>    <P>
[1] As occurs in the story related to the conversion of Dim&#257;d al-Azdee (radhiyallaahu 'anhu) in which All&#257;h's Messenger (salallaahu 'alaihi wassallam) opening his discussion with:     <blockquote class='quote'><img src='images/quote-start.gif'>"All praise is due to All&#257;h, we praise Him and we seek His assistance. Whomsoever He guides, there is none to misguide, and whomseover He misguides, there is none to guide. I testify that there is nothing worthy of worship except for All&#257;h alone - He has no partners - and Muhammad is His servant and Messenger, to proceed.."</blockquote>    <P>
Reported by Muslim in his <i>Sah&#299;h</i> (2/593 no.868) from &#8219;Abdull&#257;h bin &#8219;Abb&#257;s (radhiyallaahu 'anhumaa).    <P>
[2] Soorah An-N&#257;zi&#8219;&#257;t: 24.     <P>
[3] Reported by: Im&#257;m <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a> in <i>al-Musnad</i> (4/182), Ibn M&#257;jah in <i>as-Sunan</i> (no. 199), An-Nas&#257;'ee in <i>as-Sunan al-Kubr&#257;</i> (no. 7738), Ibn Hibb&#257;n in <i>as-Sah&#299;h</i> (no. 934), Al-H&#257;kim in <i>al-Mustadrak &#8219;alas-Sah&#299;hain</i> (1/525) - he stated its authenticity upon the conditions of Im&#257;m Muslim and adh-Dhahabee agreed. Al-Busairee stated in <i>Misb&#257;h az-Zuj&#257;jah</i> (1/27): "It's chain of narration is authentic (sah&#299;h)."     <P>
  <i>Translation Copyright Salafi Publications. All rights reserved 2012.</i>    <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/jmnak-barbahaarees-praise-of-all257h-and-his-favour-shaikh-al-fawzaans-explantion.html">Imam al-Barbahaaree's Praise of All&#257;h and His Favour: Shaikh al-Fawzaan's Explanation</a><BR>
https://www.aqidah.com/creed/?jmnak<BR>

<li><a href="articles/egkbv-introduction-to-the-book-by-the-explainer-the-noble-shaikh-the-scholar-s257lih-al-fawz257n.html">Introduction to the Book of Imaam al-Barbaharee by the Explainer: The Noble Shaikh, the Scholar, S&#257;lih al-Fawz&#257;n</a><BR>
https://www.aqidah.com/creed/?egkbv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?jmnak by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:30 GMT -->
</html>


