

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?mjqsp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:30 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Want to Understand Aqidah Properly? Then You Must Learn and Understand History!</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Want to Understand Aqidah Properly? Then You Must Learn and Understand History!</span><BR>
Thursday, September 06 2012 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>A person will not truly grasp and understand the Salafi <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and manhaj until he understands the historical origins of whatever opposes them. This requires having a grasp of <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a>, and especially of the first three hundred years hijrah. This is a nice statement from Shaykh Saalih Aal al-Shaykh emphasizing this matter. Knowledge of <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a> is vital and crucial to the people of the Sunnah, it aids in refuting the opposers.  </div>    <P>
Shaykh Saalih Aal al-Shaykh (hafidhahullaah) says in his explanation of al-Aqidah al-Hamawiyyah (2nd cassette, Side A):    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1605;&#1607;&#1605; &#1571;&#1606; &#1578;&#1593;&#1585;&#1601; &#1603;&#1610;&#1601; &#1583;&#1582;&#1604; &#1575;&#1604;&#1575;&#1606;&#1581;&#1585;&#1575;&#1601; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1603;&#1610;&#1601; &#1583;&#1582;&#1604;&#1567; &#1605;&#1575; &#1578;&#1601;&#1607;&#1605; &#1575;&#1604;&#1571;&#1602;&#1608;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1604;&#1575; &#1575;&#1604;&#1578;&#1601;&#1589;&#1610;&#1604;&#1575;&#1578; &#1581;&#1578;&#1609; &#1578;&#1593;&#1585;&#1601; &#1578;&#1591;&#1608;&#1585; &#1584;&#1604;&#1603; &#1576;&#1575;&#1604;&#1587;&#1606;&#1610;&#1606;&#1548; &#1601;&#1610; &#1575;&#1604;&#1602;&#1585;&#1606; &#1575;&#1604;&#1571;&#1608;&#1604; &#1603;&#1575;&#1606; &#1603;&#1584;&#1575;&#1548; &#1608;&#1575;&#1604;&#1602;&#1585;&#1606; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1603;&#1575;&#1606; &#1603;&#1584;&#1575;&#1548; &#1608;&#1578;&#1614;&#1583;&#1614;&#1585;&#1617;&#1615;&#1580; &#1584;&#1604;&#1603;&#1548; &#1578;&#1601;&#1607;&#1605; &#1603;&#1604; &#1602;&#1608;&#1604; &#1605;&#1575; &#1605;&#1606;&#1588;&#1572;&#1607;&#1548; &#1608;&#1604;&#1605; &#1606;&#1588;&#1571; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601; &#1601;&#1610;&#1607;&#1567; &#1608;&#1575;&#1604;&#1571;&#1602;&#1608;&#1575;&#1604; &#1575;&#1604;&#1605;&#1578;&#1590;&#1575;&#1585;&#1576;&#1577; &#1605;&#1575; &#1587;&#1576;&#1576;&#1607;&#1575;&#1567;   &#1571;&#1605;&#1575; &#1573;&#1584;&#1575; &#1571;&#1582;&#1584;&#1578; &#1575;&#1604;&#1571;&#1602;&#1608;&#1575;&#1604; &#1571;&#1602;&#1608;&#1575;&#1604; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577;&#1548; &#1571;&#1608; &#1571;&#1602;&#1608;&#1575;&#1604; &#1575;&#1604;&#1605;&#1582;&#1575;&#1604;&#1601;&#1610;&#1606; &#1583;&#1608;&#1606; &#1605;&#1593;&#1585;&#1601;&#1577; &#1576;&#1578;&#1587;&#1604;&#1587;&#1604; &#1575;&#1604;&#1602;&#1608;&#1604;&#1548; &#1608;&#1603;&#1610;&#1601; &#1606;&#1588;&#1571;&#1567; &#1610;&#1603;&#1608;&#1606; &#1593;&#1606;&#1583;&#1603; &#1590;&#1593;&#1601; &#1604;&#1573;&#1583;&#1585;&#1575;&#1603; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1605;&#1606; &#1603;&#1604;&#1575;&#1605;&#1607;&#1605; &#1608;&#1575;&#1604;&#1585;&#1583; &#1593;&#1604;&#1610;&#1607;&#1605;&#1548; &#1573;&#1604;&#1609; &#1570;&#1582;&#1585;&#1607;. &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1605;&#1607;&#1605; &#1571;&#1606; &#1578;&#1593;&#1604;&#1605; &#1603;&#1610;&#1601; &#1583;&#1582;&#1604; &#1575;&#1604;&#1575;&#1606;&#1581;&#1585;&#1575;&#1601; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1601;&#1610; &#1588;&#1578;&#1609; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604;&#1575;&#1578;&#1563; &#1601;&#1610; &#1575;&#1604;&#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1548; &#1601;&#1610; &#1575;&#1604;&#1593;&#1605;&#1604;&#1548; &#1576;&#1575;&#1604;&#1578;&#1601;&#1589;&#1610;&#1604;&#1548; &#1573;&#1604;&#1609; &#1570;&#1582;&#1585;&#1607;.  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The intent behind "important knowledge" is that you know how deviation entered into  the Muslims, how did it enter? You will not understand the sayings (of the Salaf) in <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and nor the detailed elaborations until you know how that evolved over the years. In the first century was such and such and in the second century was such and such, and the graduation in that. You will understand the origin of every saying, why did differing occur with respect to it? And the conflicting views, what was their reason? But as for when you take the sayings of the scholars, or the sayings of the opposers without being acquainted with the successive development of the saying (in that matter) and how it originated, then you will (only have) a weak comprehension of what is intended in their sayings (of the opposers) and refutation of them and so on. So from the important knowledge is that you know how deviation entered into the Muslims in diverse areas, in <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a>, in action, in detail and so on ...</blockquote>    <P>
You can refer to a series of articles on the <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a> of the sects in the early <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a> of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a> here:    <P>
<ul>  <li> <b>The Splitting of the Muslim Ummah: Part 1</b> - The Completion and Perfection of the Religion and The Way of the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> - (<a href=index9cff.html?oeotc>see here</a>)  <li> <b>The Splitting of the Muslim Ummah: Part 2</b> - The Emergence of the Sects and the Heads of Misguidance - (<a href=indexf77a.html?vqlrf>see here</a>)  <li> <b>The Splitting of the Muslim Ummah: Part 3</b> - An Overview of the Various Deviant Sects and Corrupt Creeds and Methodologies - (<a href=index6693.html?hxnhe>see here</a>)  <li> <b>The Splitting of the Muslim Ummah: Part 4</b> - The Preservation and Safeguarding of the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> - (<a href=indexcda2.html?flqoi>see here</a>)  </ul>    <P>
Whilst the articles above provide a broad <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a>, what is intended for the purposes of this article is <u>the origin,  <a href='tags/evolution.html' class='tagLink'><font class='tagLink'>Evolution</font></a> and graduation of each saying</u>, so for example: How did the saying of the Khawaari, that major sin expels from <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>, arise? Or how did the saying that Allaah is not above His Throne arise? Or how did the saying that actions are not from Eeemaan arise? Or how did the saying that the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is created arise? (<a href=http://www.asharis.com/creed/?fsffi>study this article</a>). So what were the historical backgrounds to these sayings and what did the Salaf say in response and how did these various sayings evolve and develop? These are the issues that a person of the Sunnah must know and grasp so that his feet are planted firmly. Likewise in a contemporary setting, how and why did the saying of Hassan al-Bannaa arise, his so called "Golden Principle" of cooperation, and how and why did takfir of the whole Ummah arise, and how and why and for what purpose and end did the concept of the "Islamic Jamaa'ah" arise in the 20th century, and why did some Ikhwanis try to distinguish between al-Firqah al-Naajiyah and al-Taa'ifah al-Mansurah, and why did the same Ikhwanis invent the principle of al-Muwaazanah and so on.    <P>
<div class='sidebar'>You must know and understand that <a href='tags/history.html' class='tagLink'><font class='tagLink'>history</font></a> is the weapon of a Sunni, Salafi, Athari against all factions of <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a>. Entering the field without this weapon necessitates weakness, allowing the people of falsehood to possess an upper hand and to deceive the people about their innovation and misguidance.</div>   <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/mjqsp-want-to-understand-aqidah-properly-then-you-must-learn-and-understand-history.html">Want to Understand Aqidah Properly? Then You Must Learn and Understand History!</a><BR>
https://www.aqidah.com/creed/?mjqsp<BR>

<li><a href="articles/odoyp-the-meaning-of-aqidah.html">The Meaning and Importance of 'Aqidah'</a><BR>
https://www.aqidah.com/creed/?odoyp<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?mjqsp by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:30 GMT -->
</html>


