

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?hyqru by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Ibn Taymiyyah on the One Who Believes in 'al-Jihah' (Direction) for Allaah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Ibn Taymiyyah on the One Who Believes in 'al-Jihah' (Direction) for Allaah</span><BR>
Tuesday, December 01 2009 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p>There occurs Majmoo' ul-Fataawaa (5/262), a question posed to Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a>, under the chapter heading, "<b>Issue: The one who believes in <a href='tags/al-jihah.html' class='tagLink'><font class='tagLink'>al-<a href="tags/jihah.html" class="tagLink"><font class="tagLink">jihah</font></a></font></a> (for Allaah), is He an innovator or a disbeliever?</b>":    <P>
<div class='arabic' align='right'> &#1587;&#1574;&#1604; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; : - &#1593;&#1605;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; " &#1575;&#1604;&#1580;&#1607;&#1577; " &#1607;&#1604; &#1607;&#1608; &#1605;&#1576;&#1578;&#1583;&#1593; &#1571;&#1608; &#1603;&#1575;&#1601;&#1585; &#1571;&#1608; &#1604;&#1575; &#1567; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Shaykh ul-Islaam was asked about the one who believes in <a href='tags/al-jihah.html' class='tagLink'><font class='tagLink'>al-<a href="tags/jihah.html" class="tagLink"><font class="tagLink">jihah</font></a></font></a> (for Allaah), is He an innovator or a disbeliever?</blockquote>    <P>
So he responded:     <P>
<div class='arabic' align='right'>&#1571;&#1605;&#1575; &#1605;&#1606; &#1575;&#1593;&#1578;&#1602;&#1583; &#1575;&#1604;&#1580;&#1607;&#1577; ; &#1601;&#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1583;&#1575;&#1582;&#1604; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1578;&#1581;&#1608;&#1610;&#1607; &#1575;&#1604;&#1605;&#1589;&#1606;&#1608;&#1593;&#1575;&#1578; &#1608;&#1578;&#1581;&#1589;&#1585;&#1607; &#1575;&#1604;&#1587;&#1605;&#1608;&#1575;&#1578; &#1608;&#1610;&#1603;&#1608;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1601;&#1608;&#1602;&#1607; &#1608;&#1576;&#1593;&#1590;&#1607;&#1575; &#1578;&#1581;&#1578;&#1607; &#1601;&#1607;&#1584;&#1575; &#1605;&#1576;&#1578;&#1583;&#1593; &#1590;&#1575;&#1604; . &#1608;&#1603;&#1584;&#1604;&#1603; &#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1610;&#1601;&#1578;&#1602;&#1585; &#1573;&#1604;&#1609; &#1588;&#1610;&#1569; &#1610;&#1581;&#1605;&#1604;&#1607; - &#1573;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607; - &#1601;&#1607;&#1608; &#1571;&#1610;&#1590;&#1575; &#1605;&#1576;&#1578;&#1583;&#1593; &#1590;&#1575;&#1604; . &#1608;&#1603;&#1584;&#1604;&#1603; &#1573;&#1606; &#1580;&#1593;&#1604; &#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1604;&#1607; &#1605;&#1579;&#1604; &#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1610;&#1606; &#1601;&#1610;&#1602;&#1608;&#1604; : &#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1603;&#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602; &#1571;&#1608; &#1606;&#1586;&#1608;&#1604;&#1607; &#1603;&#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1601;&#1607;&#1584;&#1575; &#1605;&#1576;&#1578;&#1583;&#1593; &#1590;&#1575;&#1604; ; &#1601;&#1573;&#1606; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1605;&#1593; &#1575;&#1604;&#1593;&#1602;&#1604; &#1583;&#1604;&#1578; &#1593;&#1604;&#1609; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1604;&#1575; &#1578;&#1605;&#1575;&#1579;&#1604;&#1607; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1601;&#1610; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1571;&#1588;&#1610;&#1575;&#1569; &#1608;&#1583;&#1604;&#1578; &#1593;&#1604;&#1609; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1594;&#1606;&#1610; &#1593;&#1606; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1583;&#1604;&#1578; &#1593;&#1604;&#1609; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1605;&#1576;&#1575;&#1610;&#1606; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1593;&#1575;&#1604; &#1593;&#1604;&#1610;&#1607;&#1575; . &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606; &#1575;&#1604;&#1582;&#1575;&#1604;&#1602; &#1578;&#1593;&#1575;&#1604;&#1609; &#1576;&#1575;&#1574;&#1606; &#1593;&#1606; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1608;&#1571;&#1606;&#1607; &#1601;&#1608;&#1602; &#1587;&#1605;&#1608;&#1575;&#1578;&#1607; &#1593;&#1604;&#1609; &#1593;&#1585;&#1588;&#1607; &#1576;&#1575;&#1574;&#1606; &#1605;&#1606; &#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578;&#1607; &#1604;&#1610;&#1587; &#1601;&#1610; &#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578;&#1607; &#1588;&#1610;&#1569; &#1605;&#1606; &#1584;&#1575;&#1578;&#1607; &#1608;&#1604;&#1575; &#1601;&#1610; &#1584;&#1575;&#1578;&#1607; &#1588;&#1610;&#1569; &#1605;&#1606; &#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578;&#1607; ; &#1608;&#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1594;&#1606;&#1610; &#1593;&#1606; &#1575;&#1604;&#1593;&#1585;&#1588; &#1608;&#1593;&#1606; &#1603;&#1604; &#1605;&#1575; &#1587;&#1608;&#1575;&#1607; &#1604;&#1575; &#1610;&#1601;&#1578;&#1602;&#1585; &#1573;&#1604;&#1609; &#1588;&#1610;&#1569; &#1605;&#1606;  &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; ; &#1576;&#1604; &#1607;&#1608; &#1605;&#1593; &#1575;&#1587;&#1578;&#1608;&#1575;&#1574;&#1607; &#1593;&#1604;&#1609; &#1593;&#1585;&#1588;&#1607; &#1610;&#1581;&#1605;&#1604; &#1575;&#1604;&#1593;&#1585;&#1588; &#1608;&#1581;&#1605;&#1604;&#1577; &#1575;&#1604;&#1593;&#1585;&#1588; &#1576;&#1602;&#1583;&#1585;&#1578;&#1607; &#1608;&#1604;&#1575; &#1610;&#1605;&#1579;&#1604; &#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1576;&#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1610;&#1606; ; &#1576;&#1604; &#1610;&#1579;&#1576;&#1578; &#1575;&#1604;&#1604;&#1607; &#1605;&#1575; &#1571;&#1579;&#1576;&#1578;&#1607; &#1604;&#1606;&#1601;&#1587;&#1607; &#1605;&#1606; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1608;&#1610;&#1606;&#1601;&#1609; &#1593;&#1606;&#1607; &#1605;&#1605;&#1575;&#1579;&#1604;&#1577; &#1575;&#1604;&#1605;&#1582;&#1604;&#1608;&#1602;&#1575;&#1578; &#1608;&#1610;&#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1604;&#1610;&#1587; &#1603;&#1605;&#1579;&#1604;&#1607; &#1588;&#1610;&#1569; : &#1604;&#1575; &#1601;&#1610; &#1584;&#1575;&#1578;&#1607; &#1608;&#1604;&#1575; &#1601;&#1610; &#1589;&#1601;&#1575;&#1578;&#1607; &#1608;&#1604;&#1575; &#1571;&#1601;&#1593;&#1575;&#1604;&#1607; . &#1601;&#1607;&#1584;&#1575; &#1605;&#1589;&#1610;&#1576; &#1601;&#1610; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607; &#1605;&#1608;&#1575;&#1601;&#1602; &#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1571;&#1605;&#1577; &#1608;&#1571;&#1574;&#1605;&#1578;&#1607;&#1575;  </div>    <P>
Which translates:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for the one who believed in <a href='tags/al-jihah.html' class='tagLink'><font class='tagLink'>al-<a href="tags/jihah.html" class="tagLink"><font class="tagLink">jihah</font></a></font></a> (for Allaah), then if he believes that Allaah is within the created beings, being contained by the created things, and being encompassed by the heavens, such that some of the created things are above Him and some of them are beneath Him, then he is a straying innovator.    <P>
Likewise, if he believes that Allaah is in need of anything to carry Him - [in need] of the Throne and other than it - then he is also a straying innovator.    <P>
And likewise, if he made the attributes of Allaah to be like the attributes of the creatures, saying: The istiwaa (ascent) of Allaah is like the ascent of the <a href='tags/creation.html' class='tagLink'><font class='tagLink'>creation</font></a>, or His <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> (descent) is like the descent of the <a href='tags/creation.html' class='tagLink'><font class='tagLink'>creation</font></a> and what is like this, then he is a straying innovator.    <P>
For verily, the Book and the Sunnah, alongside [sound] intellect indicate that nothing from the created things are like Allaah in anything from the affairs, and they indicate that Allaah is free of need (ghaniyy) from everything, and they indicate that Allaah is separate from the created things, exalted, high above them.    <P>
And if he believes that the Creator, the Exalted, is separate and distinct (baa'in) from the created things, and that He is above His heavens, over His Throne, separate from His creatures, and that there is nothing from His essence inside the creatures, and that nothing from the creatures are inside His essence, and that Allaah is free of need of the Throne and everything that is besides it, not being dependent upon anything from the creatures - rather that He, alongside His istiwaa over the Throne, carries the Throne and the carrieres of the Throne with His power, and he does not liken the istiwaa of Allaah with the istiwaa of the creatures. Rather, he affirms for Allaah what He affirmed for Himself of Names and Attributes, and negates from Him any likeness to the creatures, and he knows that there is no likeness unto Allaah, neither in His Essence, His Attributes or His Actions, then such a one is correct in his belief, in agreement with the Salaf of the Ummah and its leading scholars.</blockquote>    <P>
<font class='titleHeadline'>Additional Notes</font>    <P>
<b><u>ONE:</u></b> The word 'al-jihah' (direction) is from the innovated terms used by the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a> to negate for Allaah what they consider to be the qualities and incidental attributes of bodies, basing this upon Aristotle's "al-Maqoolaat al-Ashar" (the Ten Categories), around which the entirety of their <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> revolves, and this is why Imaam Ibn Suraij ash-Shaafi'ee (d. 306H) said, as narrated from him by Abu Ismaa'eel al-Harawi in "Dhamm ul-Kalaam" and as mentioned by <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> in "Bayaan Talbees al-Jahmiyyah":    <P>
<div class='arabic' align='right'> &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1588;&#1607;&#1583; &#1571;&#1606; &#1604;&#1575; &#1575;&#1604;&#1607; &#1575;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1606; &#1605;&#1581;&#1605;&#1583;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604; &#1575;&#1604;&#1582;&#1608;&#1590; &#1601;&#1610; &#1575;&#1604;&#1571;&#1593;&#1585;&#1575;&#1590; &#1608;&#1575;&#1604;&#1571;&#1580;&#1587;&#1575;&#1605; &#1608;&#1575;&#1606;&#1605;&#1575; &#1576;&#1593;&#1579; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1576;&#1575;&#1606;&#1603;&#1575;&#1585; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of the people of knowledge and the jamaa'ah of the Muslims is "<i>I testify none is worthy of worship except Allaah (alone) and that Muhammad is the Messenger of Allaah</i>". And the <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of the people of falsehood is disputing about al-a'raad (incidental attributes) and al-ajsaam (bodies) and the Prophet (sallallaahu alayhi wasallam) was sent with the rejection of that.</blockquote>    <P>
You can learn more about this "Tawheed of al-Jawhar wal-Arad" by visiting our support group for people affected by it here: "<b>Aristotelians Anonymous</b>": <a href=http://www.asharis.com/creed/?brner>the launch</a>, and <a href=http://www.asharis.com/creed/?mrgly >1st workshop</a>, and <a href=http://www.asharis.com/creed/?iowfm>this article</a> will also be of help.    <P>
<b><u>TWO:</u></b> The way of Ahl us-Sunnah is to neither affirm nor deny these terms until the meaning intended behind them is clarified. If it is a true meaning that is in agreement with the Book and the Sunnah, the  meaning is accepted, the word is shunned, and the correct word(s) found in the revealed texts are used. And if it is a false meaning, then the meaning is rejected and the word is also rejected - for Ahl us-Sunnah, and this is a proof of their being upon the manifest truth, only speak about Allaah in both affirmation and negation, with what has come in the revealed texts, never departing from that, in the <u>corroboration and affirmation</u> of their <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a>. However, in <u>refuting</u> the <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a>, Ahl us-Sunnah may make use of these terms (which originate with the Innovators) with a view of clarifying and explaining the truth, however this is not from the angle of corroborating these words (and the false meanings they imply), but rather to verify and separate out the true and correct meanings with their proper wordings from the innovated words.    <P>
<b><u>THREE:</u></b> The word 'al-jihah' is used with its correct meaning by certain Scholars. Take for example al-Qurtubi's characterization of the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of the Salaf whom he says,  "spoke with the affirmation of al-jihah" for Allaah (<a href=http://www.asharis.com/creed/?wmhvd>see this article</a>). And likewise, Shaykh <a href='tags/abdul-qadir-al-jeelaanee.html' class='tagLink'><font class='tagLink'>Abdul-Qadir al-Jeelaanee</font></a> (d. 561H) also spoke with it, <a href=index3c31.html?zrhee>see this article here</a>. And likewise Abu Sulaymaan al-Khattaabee (d. 386H), <a href=http://www.abovethethrone.com/arsh/?fogpc>see this article here</a>. And they are all referring to a correct meaning, upon the way that Shaykh ul-Islaam <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> has explained above, even though we hold that using this term is not befitting.    <P>
<b><u>FOUR:</u></b> The <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>innovators</font></a>, the Philosophers, <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and Later Ash'ariyyah (the early Kullaabi Ash'aris affirmed Allaah's uluww, with His Essence) are all united upon rejecting Allaah is above the Throne, above the heaven, with His essence, upon the same language, terminology and classification that they took from the atheist philosophers. To learn why they deny this, please visit the lecture of al-Ustaadh Abu Nicomachus Aristotle bin Nicomachus (d. 322BC) <a href=http://www.asharis.com/creed/?glwlf>in this article here</a>. In fact the later Ash'arites simply reverted back to the sayings of kafirs like Ibn Sinaa (d. 429H) <a href=http://www.asharis.com/creed/?mrsit>see this article here</a>, and the Philosophers and <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> who said, "<i>Allaah is not within the universe nor outside of it</i>", or "<i>Allaah is not within created things, or outside of created things</i>". So this is where the deen of the later Ash'arites is derived from. As for the early Kullaabi Ash'aris, they affirmed Allaah is above the Throne, with His Essence. See <a href=http://www.asharis.com/creed/series/the-creed-of-the-early-ashari-scholars-differs-from-the-later-jahmite-ashari-scholars.cfm>this series of articles</a> for more information.  </ul>    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/hyqru-ibn-taymiyyah-on-the-one-who-believes-in--al-jihah-direction-for-allaah.html">Ibn Taymiyyah on the One Who Believes in 'al-Jihah' (Direction) for Allaah</a><BR>
https://www.aqidah.com/creed/?hyqru<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?hyqru by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
</html>


