

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?zrhee by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Abdul-Qadir al-Jeelaanee (d. 561H): On Allaah's Uluww, Istiwaa and Nuzool and a Refutation of the Jahmiyyah, Mu'tazilah and Ash'ariyyah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Abdul-Qadir al-Jeelaanee (d. 561H): On Allaah's Uluww, Istiwaa and Nuzool and a Refutation of the Jahmiyyah, Mu'tazilah and Ash'ariyyah</span><BR>
Monday, November 16 2009 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p>Shaikh Abdul-Qaadir al-Jeelaanee (d. 561H) said (Ghunyat ut-Taalibeen, 1/73):    <P>
<div class='arabic' align='right'>&#1608;&#1607;&#1608; &#1576;&#1580;&#1607;&#1577; &#1575;&#1604;&#1593;&#1604;&#1608; &#1605;&#1587;&#1578;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1605;&#1581;&#1578;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1604;&#1603; &#1605;&#1581;&#1610;&#1591; &#1593;&#1604;&#1605;&#1607; &#1576;&#1575;&#1604;&#1571;&#1588;&#1610;&#1575;&#1569;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And He is in the direction of <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-Uluww</font></a> (meaning above), ascended over the Throne, owning the dominion, His knowledge encompassing [all] things. </blockquote>    <P>
He also said (1/73):     <P>
<div class='arabic' align='right'> &#1608;&#1610;&#1606;&#1576;&#1594;&#1610; &#1573;&#1591;&#1604;&#1575;&#1602; &#1589;&#1601;&#1577; &#1575;&#1604;&#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1605;&#1606; &#1594;&#1610;&#1585; &#1578;&#1571;&#1608;&#1610;&#1604; &#1548; &#1608;&#1571;&#1606;&#1607; &#1575;&#1587;&#1578;&#1608;&#1575;&#1569; &#1575;&#1604;&#1584;&#1575;&#1578; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1585;&#1588; &#1604;&#1575; &#1593;&#1604;&#1609; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1602;&#1593;&#1608;&#1583; &#1608;&#1575;&#1604;&#1605;&#1605;&#1575;&#1587;&#1577; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1605;&#1580;&#1587;&#1605;&#1577; &#1608;&#1575;&#1604;&#1603;&#1585;&#1575;&#1605;&#1610;&#1577; &#1548; &#1608;&#1604;&#1575; &#1593;&#1604;&#1609; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1593;&#1604;&#1608; &#1608;&#1575;&#1604;&#1585;&#1601;&#1593;&#1577; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610;&#1577; &#1548; &#1608;&#1604;&#1575; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1575;&#1587;&#1578;&#1610;&#1604;&#1575;&#1569; &#1608;&#1575;&#1604;&#1594;&#1604;&#1576;&#1577; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1548; &#1604;&#1571;&#1606; &#1575;&#1604;&#1588;&#1585;&#1593; &#1604;&#1605; &#1610;&#1585;&#1583; &#1576;&#1584;&#1604;&#1603; &#1608;&#1604;&#1575; &#1606;&#1602;&#1604; &#1593;&#1606; &#1571;&#1581;&#1583; &#1605;&#1606; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1608;&#1575;&#1604;&#1578;&#1575;&#1576;&#1593;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1605;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1584;&#1604;&#1603; &#1548; &#1576;&#1604; &#1575;&#1604;&#1605;&#1606;&#1602;&#1608;&#1604; &#1593;&#1606;&#1607;&#1605; &#1581;&#1605;&#1604;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1591;&#1604;&#1575;&#1602;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is essential to apply the attribute of <a href='tags/al-istiwaa.html' class='tagLink'><font class='tagLink'>al-Istiwaa</font></a> (Allaah's Ascending) without restriction - [meaning] without ta'weel, and that it is an ascension with His Dhaat (self) over the Throne. Istiwaa does not mean sitting (qu'ood) or touching (mumaassah) - as the Mujassimah and Karraamiyyah say. Nor does it mean uluww (grandeur and highness) - as the Ash'ariyyah say. Nor does it mean isteelaa (conquering) and ghalabah (dominating) as the Muýtazilah say. The [revealed] legislation did not mention any of this. Neither has this been related by any one from  <a href='tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> and the Taabi'een from the Salaf, [nor] from the Ashaabul-Hadeeth (Scholars of Hadeeth). Rather, it is related from them that they carried [al-istiwaa] unrestrictedly.</blockquote>    <P>
It is apparent from Shaykh Abdul-Qadir (rahimahullaah), who was a Hanbali, that <a href='tags/al-istiwaa.html' class='tagLink'><font class='tagLink'>al-Istiwaa</font></a>, which is Allaah ascending over the Throne, with His Essence, is carried unrestrictedly without:    <P>
<ul><li>The tajseem of the Mujassimah (see note below)  <li>The ta'weel of the Ash'ariyyah  <li>The ta'weel of the Mu'tazilah</ul>    <P>
He also said (1/74)    <P>
<div class='arabic' align='right'>&#1608;&#1571;&#1606;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1610;&#1606;&#1586;&#1604; &#1601;&#1610; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1603;&#1610;&#1601; &#1588;&#1575;&#1569; &#1608;&#1603;&#1605;&#1575; &#1588;&#1575;&#1569; &#1548; &#1601;&#1610;&#1594;&#1601;&#1585; &#1604;&#1605;&#1606; &#1571;&#1584;&#1606;&#1576; &#1608;&#1571;&#1582;&#1591;&#1571; &#1608;&#1571;&#1580;&#1585;&#1605; &#1608;&#1593;&#1589;&#1609; &#1604;&#1605;&#1606; &#1610;&#1582;&#1578;&#1575;&#1585; &#1605;&#1606; &#1593;&#1576;&#1575;&#1583;&#1607; &#1608;&#1610;&#1588;&#1575;&#1569; &#1578;&#1576;&#1575;&#1585;&#1603; &#1575;&#1604;&#1593;&#1604;&#1610; &#1575;&#1604;&#1571;&#1593;&#1604;&#1609; &#1548; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1607;&#1608; &#1604;&#1607; &#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1581;&#1587;&#1606;&#1609; &#1548; &#1604;&#1575; &#1576;&#1605;&#1593;&#1606;&#1609; &#1606;&#1586;&#1608;&#1604; &#1575;&#1604;&#1585;&#1581;&#1605;&#1577; &#1608;&#1579;&#1608;&#1575;&#1576;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1575;&#1583;&#1593;&#1578;&#1607; &#1575;&#1604;&#1605;&#1593;&#1578;&#1586;&#1604;&#1577; &#1608;&#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And that He, the Exalted, descends to the lowest heaven every night, however He wills, as He wills, and He forgives the one who sinned, erred, wronged and disobeyed, to whomever He chooses and wills from His servants. Blessed is the Lofty, the Most High. There is none worthy of worship except He. To Him belong the most beautiful Names. [The Nuzool] is not with the meaning of the descent of mercy (rahmah) and His reward (thawaab) as is claimed by the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and Ash'ariyyah.</blockquote>    <P>
The <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> have attempted to claim these are not the sayings of <a href='tags/abdul-qadir-al-jeelaanee.html' class='tagLink'><font class='tagLink'>Abdul-Qadir al-Jeelaanee</font></a> without bringing any evidence whatsoever! This is despite the fact that Ash'arites such as al-Izz bin Abdus-Salaam acknowledged this to be the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of Shaykh <a href='tags/abdul-qadir-al-jeelaanee.html' class='tagLink'><font class='tagLink'>Abdul-Qadir al-Jeelaanee</font></a> as is indicated by adh-Dhahabi in his Siyar (20/443):    <P>
<div class='arabic' align='right'>&#1602;&#1575;&#1604; &#1588;&#1610;&#1582;&#1606;&#1575; &#1575;&#1604;&#1581;&#1575;&#1601;&#1592; &#1571;&#1576;&#1608; &#1575;&#1604;&#1581;&#1587;&#1610;&#1606; &#1593;&#1604;&#1610; &#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#1587;&#1605;&#1593;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1601;&#1602;&#1610;&#1607; &#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1610;&#1602;&#1608;&#1604; &#1605;&#1575; &#1606;&#1602;&#1604;&#1578; &#1573;&#1604;&#1610;&#1606;&#1575; &#1603;&#1585;&#1575;&#1605;&#1575;&#1578; &#1571;&#1581;&#1583; &#1576;&#1575;&#1604;&#1578;&#1608;&#1575;&#1578;&#1585; &#1573;&#1604;&#1575; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1602;&#1575;&#1583;&#1585; &#1601;&#1602;&#1610;&#1604; &#1604;&#1607; &#1607;&#1584;&#1575; &#1605;&#1593; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607; &#1601;&#1603;&#1610;&#1601; &#1607;&#1584;&#1575; &#1601;&#1602;&#1575;&#1604; &#1604;&#1575;&#1586;&#1605; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576; &#1604;&#1610;&#1587; &#1576;&#1605;&#1584;&#1607;&#1576; . &#1602;&#1604;&#1578; &#1610;&#1588;&#1610;&#1585; &#1573;&#1604;&#1609; &#1573;&#1579;&#1576;&#1575;&#1578;&#1607; &#1589;&#1601;&#1577; &#1575;&#1604;&#1593;&#1604;&#1608; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1608;&#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1581;&#1606;&#1575;&#1576;&#1604;&#1577; &#1601;&#1610; &#1584;&#1604;&#1603; &#1605;&#1593;&#1604;&#1608;&#1605; &#1610;&#1605;&#1588;&#1608;&#1606; &#1582;&#1604;&#1601; &#1605;&#1575; &#1579;&#1576;&#1578; &#1593;&#1606; &#1573;&#1605;&#1575;&#1605;&#1607;&#1605; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1575; &#1605;&#1606; &#1610;&#1588;&#1584; &#1605;&#1606;&#1607;&#1605; &#1608;&#1578;&#1608;&#1587;&#1593; &#1601;&#1610; &#1575;&#1604;&#1593;&#1576;&#1575;&#1585;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Our Shaykh, the Haafidh, Abul-Husain Alee bin Muhammad:  I heard the Shaykh, Abdul-Azeez bin Abdus-Salaam, the Shaafi'ee Jurist, saying: "The karaamaat of anyone have not been narrated to us through successive large-scale transmission (tawaatur) except (those of) Shaykh Abdul-Qadir." It was said to him: "This alongside his belief?" He replied, "The binding implication of a madhhab is not considered to be the madhhab".     <P>
I [adh-Dhahabi] say: He is referring to his [Abdul-Qadir's] affirmation of the attribute of <a href='tags/al-uluww.html' class='tagLink'><font class='tagLink'>al-Uluww</font></a> and what is similar to that. And the madhhab of the Hanbalis regarding that is known, they traverse behind what has been established from their Imaam [Ahmad bin Hanbal] may Allaah have mercy upon him, except [whoever] separated from them and took liberties in expression.</blockquote>    <P>
The senior amongst today's Jahmites have had to humbly admit that this indeed was the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of Shaykh <a href='tags/abdul-qadir-al-jeelaanee.html' class='tagLink'><font class='tagLink'>Abdul-Qadir al-Jeelaanee</font></a> (rahimahullaah), and they affirm and corroborate his use of the phrase "bi dhaatihi" (with His Essence), as this occurs in other books of his too.     <P>
<b>Refer also to:</b>    <P>
<ul><li>Abdul-Qaadir al-Jeelaanee (d. 561H): From the Views of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> is That Allaah Is Not Above the Throne - <b><a href=http://www.abovethethrone.com/arsh/?tgnnw>read article here</a></b>.  <li>Abdul-Qaadir al-Jeelaanee (d. 561H): 'Allaah is in the Direction of Above and is Ascended Above the Throne' - <b><a href=http://www.abovethethrone.com/arsh/?yyccw>read article here</a></b>.  <li>Abdul-Qaadir al-Jeelaanee (d. 561H): Refutation of the Saalimiyyah Sect Who Claim Allaah is Everywhere And Not Above His Throne Exclusively - <b><a href=http://www.abovethethrone.com/arsh/?oeqwt >read article here</a></b>.  </ul>    <P>
<div class='sidebar'><b>Important Note Concerning the Early Kullaabis And Their Affirmation of Allaah Being Above the Throne and Their Responses to the Karraamiyyah Mujassimah</b>    <P>
The <u>Salaf</u>, the <u>Karraamiyyah</u>, and the <u><a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a></u> and the early <u>Kullaabi Ash'aris</u> were all agreed that Allaah Himself is above the Throne, in opposition to the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>. The early Kullaabis are those who were upon the bulk of the <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> of Ibn Kullaab al-Qattaan al-Basri (d. 240H) such as Abu al-Hasan al-Ash'ari (d. 324H), Abu al-Abbaas al-Qalanisi, Ibn Mahdee at-Tabari (d. 380H) Abu Bakr al-Baqillani (d. 403H) - who affirmed Allaah is above the Throne, with His Essence, and affirmed the attributes of Face, Hands, Eyes as attributes of the Essence without ta'weel, whilst refuting the ta'weels of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>.    <P>
However, the Karraamiyyah, in their affirmation of Allaah being above the Throne, and being Mujassimah, they used certain excesses in language in their affirmation and so they said that Allaah is above the Throne, "<i>With contact (mumaassah, mulaasaqah)</i>", "<i>Filling the Throne</i>", "<i>Confined by the Throne</i>" and what is similar to this. And in turn the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> and Kullaabi Ash'aris retorted with "<i>without contact (mumaassah, mulaasaqah)</i>", and "<i>without confinement (tahdeed)</i>" and so on, alongside their affirmation that it is Allaah Himself, with His Essence, who is above the Throne.     <P>
The Karraamiyyah were of two groups: Those that said that Allaah is a jism (body), intending merely that Allaah is "qaa'imun bi nafsihi" (established by His self) and that He is "mawjood" (exists), and not like the created bodies (see the Ash'ari textbook viewpoint on this group <a href=http://www.asharis.com/creed/?bolnh>in this article</a>). And those who made Allaah like the created bodies (ajsaam), and they were those who wallowed in tajseem. So this faction was present at the height of the Kullaabi-Early-Ash'ari era (mid to late third century hijrah) and Ibn Karraam, to whom the Karraamiyyah are ascribed died in 255H.    <P>
And so the Kullaabi Ash'aris, whilst agreeing with the Karraamiyyah (and with the Salaf) that Allaah Himself, <u>with His Essence</u>, is above the Throne, stated in their affirmation that Allaah is above the Throne, "without contact, confinement, fixed in a place (as in like the created places)" and so on, and in this, they refuted the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and also the Karraamiyyah.    <P>
In his book "al-Asnaa Fee Sharh Asmaa  Allaah il-Husnaa", Abu Abdullaah Muhammad bin <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a> al-Qurtubi (and he is the mufassir, author of al-Jaami' Li Ahkaam il-Qur'aan) says, when discussing the numerous opinions held on the issue of Allaah's Istiwaa (ascending) over the Throne (Volume 2, page 123):    <P>
<img src=assets/images/qurtubi-baqillani-uluww.gif border=1 width=515 border=0>    <P>
And here is the translation of this statement:    <P>
<blockquote><b>And the sixth:</b> The saying of at-Tabaree, Ibn Abee Zayd, al-Qaadee Abdul-Wahhaab and a group (jamaa'ah) of shuyook (scholars) of hadeeth and fiqh (jurisprudence) and it is apparent (from) some of the books of the qaadee, Abu Bakr [al-Baqillani] - may Allaah be pleased with Him, <u>and [also] Abul-Hasan [al-Ash'ari]</u>. <b>And al-Qaadee Abd ul-Wahhaab quoted this from him, I mean from al-Qaadee Abu Bakr, textually - which is that He, the Sublime, ascends over His Throne <u>with His Essence (bi dhaatihi)</u> - and in some places they applied (the words) "<u>above His Throne (fawqa arshihi)</u>"</b>.     <P>
The Imaam, Abu Bakr (Muhammad bin al-Hasan al-Hadramee al-Qayrawaanee) said: "And that which I say is [what is] correct [i.e. Allaah being above the Throne, making istiwaa with His Essence], without confinement, nor fixing in a place, nor being inside of it, and without touching".    <P>
I [al-Qurtubi] say: This is the saying of al-Qaadee Abu Bakr in the book of his "Tamheed ul-Awaa'il". And we have mentioned it. And this has also been said by the teacher, Abu Bakr bin Fawrak in "Sharh Awaa'il il-Adillah", and it is the saying of Ibn Abdul-Barr, and at-Talamankee and others from amongst the Andulusians, and [also] al-Khattaabi in the book "Shi'aar ud-Deen", and that has already preceded.</blockquote>    <P>
Al-Qurtubi makes it clear that Abu Bakr al-Baqillani held Allaah to make istiwaa bi dhaatihi (with His Essence) and that He is above His Throne (fawqa arshihi) and that this is the same view as Ibn Abee Zaid (al-Qayrawaanee al-Maalikee) al-Haafidh Abu Umar Ibn Abdul-Barr and Abu Umar at-Talamankee  (<a href=http://www.asharis.com/creed/?kmtsq>see their statements on here</a>). However, the Ash'arite Mutakallimoon used language such as "<i>without, touch, confinement</i>" and the likes as a rebuttal of the Karraamiyyah, whereas the methodology of Ahl us-Sunnah is to avoid any language not established from any of the Salaf, and we see this clearly in the Imaams of the Salaf who were free of the language of both the Karraamiyyah and the Kullaabi, Ash'arite Mutakallimoon.  </div> <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/krnsa-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah-affirmation-of-allaahs-nuzool-without-kayf.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of Allaah's Nuzool Without Kayf</a><BR>
https://www.aqidah.com/creed/?krnsa<BR>

<li><a href="articles/zrhee-abdul-qadir-al-jeelaanee-d-561h-on-allaahs-uluww-istiwaa-and-nuzool-and-a-refutation-of-the-jahmiyyah-mutazilah-and-ashariyyah.html">Abdul-Qadir al-Jeelaanee (d. 561H): On Allaah's Uluww, Istiwaa and Nuzool and a Refutation of the Jahmiyyah, Mu'tazilah and Ash'ariyyah</a><BR>
https://www.aqidah.com/creed/?zrhee<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?zrhee by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:53 GMT -->
</html>


