

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?jsxlv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Concerning the Twelve Khalifahs That Will Rule Before the Hour, All Of Them From the Quraish</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Concerning the Twelve Khalifahs That Will Rule Before the Hour, All Of Them From the Quraish</span><BR>
Friday, December 18 2009 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>The Hadeeth of the Twelve Rulers All From Quraish</font>    <P>
There occurs in the Saheeh of al-Bukhaaree, in "<i>Kitaab ul-Ahkaam</i>" under the chapter of "<i>Istikhlaaf</i>":    <P>
<div class='arabic' align='right'>&#1581;&#1614;&#1583;&#1617;&#1614;&#1579;&#1614;&#1606;&#1616;&#1610; &#1605;&#1615;&#1581;&#1614;&#1605;&#1617;&#1614;&#1583;&#1615; &#1576;&#1618;&#1606;&#1615; &#1575;&#1604;&#1618;&#1605;&#1615;&#1579;&#1614;&#1606;&#1617;&#1614;&#1609; &#1581;&#1614;&#1583;&#1617;&#1614;&#1579;&#1614;&#1606;&#1614;&#1575; &#1594;&#1615;&#1606;&#1618;&#1583;&#1614;&#1585;&#1612; &#1581;&#1614;&#1583;&#1617;&#1614;&#1579;&#1614;&#1606;&#1614;&#1575; &#1588;&#1615;&#1593;&#1618;&#1576;&#1614;&#1577;&#1615; &#1593;&#1614;&#1606;&#1618; &#1593;&#1614;&#1576;&#1618;&#1583;&#1616; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1616;&#1603;&#1616; &#1587;&#1614;&#1605;&#1616;&#1593;&#1618;&#1578;&#1615; &#1580;&#1614;&#1575;&#1576;&#1616;&#1585;&#1614; &#1576;&#1618;&#1606;&#1614; &#1587;&#1614;&#1605;&#1615;&#1585;&#1614;&#1577;&#1614; &#1602;&#1614;&#1575;&#1604;&#1614; &#1587;&#1614;&#1605;&#1616;&#1593;&#1618;&#1578;&#1615; &#1575;&#1604;&#1606;&#1617;&#1614;&#1576;&#1616;&#1610;&#1617;&#1614; &#1589;&#1614;&#1604;&#1617;&#1614;&#1609; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1615; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1607;&#1616; &#1608;&#1614;&#1587;&#1614;&#1604;&#1617;&#1614;&#1605;&#1614; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1615; &#1610;&#1614;&#1603;&#1615;&#1608;&#1606;&#1615; &#1575;&#1579;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1588;&#1614;&#1585;&#1614; &#1571;&#1614;&#1605;&#1616;&#1610;&#1585;&#1611;&#1575; &#1601;&#1614;&#1602;&#1614;&#1575;&#1604;&#1614; &#1603;&#1614;&#1604;&#1616;&#1605;&#1614;&#1577;&#1611; &#1604;&#1614;&#1605;&#1618; &#1571;&#1614;&#1587;&#1618;&#1605;&#1614;&#1593;&#1618;&#1607;&#1614;&#1575; &#1601;&#1614;&#1602;&#1614;&#1575;&#1604;&#1614; &#1571;&#1614;&#1576;&#1616;&#1610; &#1573;&#1616;&#1606;&#1617;&#1614;&#1607;&#1615; &#1602;&#1614;&#1575;&#1604;&#1614; &#1603;&#1615;&#1604;&#1617;&#1615;&#1607;&#1615;&#1605;&#1618; &#1605;&#1616;&#1606;&#1618; &#1602;&#1615;&#1585;&#1614;&#1610;&#1618;&#1588;&#1613;</div>    <P>
From Jaabir bin Samurah who said:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I heard the Prophet (sallallaahu alayhi wasallam) say: "<i>There will be twelve ameers (leaders)</i>", and then he said a word that I did not hear. Then he said: Meaning, he (the Prophet) said: "<i>All of them are from Quraish.</i>"</blockquote>    <P>
Ibn Katheer discusses this matter in his tafseer of the verse in Surah al-Maa'idah (5:12), which mentions twelve elders raised amongst Banee Israa'eel:    <P>
<div class='arabic' align='right'>&#1608;&#1571;&#1589;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1579;&#1575;&#1576;&#1578; &#1601;&#1610; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1610;&#1606; &#1605;&#1606; &#1581;&#1583;&#1610;&#1579; &#1580;&#1575;&#1576;&#1585; &#1576;&#1606; &#1587;&#1605;&#1585;&#1577; &#1602;&#1575;&#1604; : &#1587;&#1605;&#1593;&#1578; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604; : " &#1604;&#1575; &#1610;&#1586;&#1575;&#1604; &#1571;&#1605;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1575;&#1590;&#1610;&#1575; &#1605;&#1575; &#1608;&#1604;&#1610;&#1607;&#1605; &#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1585;&#1580;&#1604;&#1575; " &#1579;&#1605; &#1578;&#1603;&#1604;&#1605; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1576;&#1603;&#1604;&#1605;&#1577; &#1582;&#1601;&#1610;&#1578; &#1593;&#1604;&#1610; &#1601;&#1587;&#1571;&#1604;&#1578; &#1571;&#1610; &#1605;&#1575;&#1584;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1567; &#1602;&#1575;&#1604; :" &#1603;&#1604;&#1607;&#1605; &#1605;&#1606; &#1602;&#1585;&#1610;&#1588; " &#1608;&#1607;&#1584;&#1575; &#1604;&#1601;&#1592; &#1605;&#1587;&#1604;&#1605; &#1608;&#1605;&#1593;&#1606;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1576;&#1588;&#1575;&#1585;&#1577; &#1576;&#1608;&#1580;&#1608;&#1583; &#1575;&#1579;&#1606;&#1610; &#1593;&#1588;&#1585; &#1582;&#1604;&#1610;&#1601;&#1577; &#1589;&#1575;&#1604;&#1581;&#1575; &#1610;&#1602;&#1610;&#1605; &#1575;&#1604;&#1581;&#1602; &#1608;&#1610;&#1593;&#1583;&#1604; &#1601;&#1610;&#1607;&#1605; &#1608;&#1604;&#1575; &#1610;&#1604;&#1586;&#1605; &#1605;&#1606; &#1607;&#1584;&#1575; &#1578;&#1608;&#1575;&#1604;&#1610;&#1607;&#1605; &#1608;&#1578;&#1578;&#1575;&#1576;&#1593; &#1571;&#1610;&#1575;&#1605;&#1607;&#1605; &#1576;&#1604; &#1602;&#1583; &#1608;&#1580;&#1583; &#1605;&#1606;&#1607;&#1605; &#1571;&#1585;&#1576;&#1593;&#1577; &#1593;&#1604;&#1609; &#1606;&#1587;&#1602; &#1608;&#1607;&#1605; &#1575;&#1604;&#1582;&#1604;&#1601;&#1575;&#1569; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; : &#1571;&#1576;&#1608; &#1576;&#1603;&#1585; &#1608;&#1593;&#1605;&#1585; &#1608;&#1593;&#1579;&#1605;&#1575;&#1606; &#1608;&#1593;&#1604;&#1610; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605; &#1608;&#1605;&#1606;&#1607;&#1605; &#1593;&#1605;&#1585; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1604;&#1575; &#1588;&#1603; &#1593;&#1606;&#1583; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1608;&#1576;&#1593;&#1590; &#1576;&#1606;&#1610; &#1575;&#1604;&#1593;&#1576;&#1575;&#1587; &#1608;&#1604;&#1575; &#1578;&#1602;&#1608;&#1605; &#1575;&#1604;&#1587;&#1575;&#1593;&#1577; &#1581;&#1578;&#1609; &#1578;&#1603;&#1608;&#1606; &#1608;&#1604;&#1575;&#1610;&#1578;&#1607;&#1605; &#1604;&#1575; &#1605;&#1581;&#1575;&#1604;&#1577; &#1608;&#1575;&#1604;&#1592;&#1575;&#1607;&#1585; &#1571;&#1606; &#1605;&#1606;&#1607;&#1605; &#1575;&#1604;&#1605;&#1607;&#1583;&#1610; &#1575;&#1604;&#1605;&#1576;&#1588;&#1585; &#1576;&#1607; &#1601;&#1610; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1575;&#1604;&#1608;&#1575;&#1585;&#1583;&#1577; &#1576;&#1584;&#1603;&#1585;&#1607; &#1601;&#1584;&#1603;&#1585; &#1571;&#1606;&#1607; &#1610;&#1608;&#1575;&#1591;&#1574; &#1575;&#1587;&#1605;&#1607; &#1575;&#1587;&#1605; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1575;&#1587;&#1605; &#1571;&#1576;&#1610;&#1607; &#1575;&#1587;&#1605; &#1571;&#1576;&#1610;&#1607; &#1601;&#1610;&#1605;&#1604;&#1571; &#1575;&#1604;&#1571;&#1585;&#1590; &#1593;&#1583;&#1604;&#1575; &#1608;&#1602;&#1587;&#1591;&#1575; &#1603;&#1605;&#1575; &#1605;&#1604;&#1574;&#1578; &#1580;&#1608;&#1585;&#1575; &#1608;&#1592;&#1604;&#1605;&#1575; &#1608;&#1604;&#1610;&#1587; &#1607;&#1584;&#1575; &#1576;&#1575;&#1604;&#1605;&#1606;&#1578;&#1592;&#1585; &#1575;&#1604;&#1584;&#1610; &#1578;&#1578;&#1608;&#1607;&#1605; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1608;&#1580;&#1608;&#1583;&#1607; &#1579;&#1605; &#1592;&#1607;&#1608;&#1585;&#1607; &#1605;&#1606; &#1587;&#1585;&#1583;&#1575;&#1576; &#1587;&#1575;&#1605;&#1585;&#1575; &#1601;&#1573;&#1606; &#1584;&#1604;&#1603; &#1604;&#1610;&#1587; &#1604;&#1607; &#1581;&#1602;&#1610;&#1602;&#1577; &#1608;&#1604;&#1575; &#1608;&#1580;&#1608;&#1583; &#1576;&#1575;&#1604;&#1603;&#1604;&#1610;&#1577; &#1576;&#1604; &#1607;&#1608; &#1605;&#1606; &#1607;&#1608;&#1587; &#1575;&#1604;&#1593;&#1602;&#1608;&#1604; &#1575;&#1604;&#1587;&#1582;&#1610;&#1601;&#1577; &#1608;&#1578;&#1608;&#1607;&#1605; &#1575;&#1604;&#1582;&#1610;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1590;&#1593;&#1610;&#1601;&#1577; &#1608;&#1604;&#1610;&#1587; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1576;&#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1582;&#1604;&#1601;&#1575;&#1569; &#1575;&#1604;&#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1601;&#1610;&#1607;&#1605; &#1575;&#1604;&#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1605;&#1606; &#1575;&#1604;&#1585;&#1608;&#1575;&#1601;&#1590; &#1604;&#1580;&#1607;&#1604;&#1607;&#1605; &#1608;&#1602;&#1604;&#1577; &#1593;&#1602;&#1604;&#1607;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the basis of this hadeeth is established in the two Saheehs from the hadeeth of Jaabir bin Samurah who said: I heard the Prophet (sallallaahu alayhi wasallam) saying: "<i>The affair of the people will never cease to continue so long as twelve men take authority over them</i>." Then the Prophet (sallallaahu alayhi wasallam) spoke with a word which was not audible to me, so I asked, meaning "What?" The Prophet (sallallaahu alayhi wasallam) said, "<i>All of them are from Quraish</i>." And this is the wording of Muslim.    <P>
And the meaning of this hadeeth is the glad tiding of the presence of twelve righteous khalifahs who will establish the truth and rule with justice over them [the people]. And it is not binding from this that their rule be successive, following each other [in succession]. Rather, four of them have already been found in order, and they are the four rightly guided khalifahs: Abu Bakr, Umar, Uthmaan and Alee (radiallaahu anhum), and amongst them is Umar bin Abdul-Azeez without doubt in the view of the Scholars and some of Banee al-Abbaas. The Hour will not be established until their rule (i.e those who remain from the twelve) has taken place, certainly. And what is apparent is that the promised <a href='tags/mahdi.html' class='tagLink'><font class='tagLink'>Mahdi</font></a> [mentioned] in the reported ahaadeeth is from amongst them. So it has been mentioned that his name will concur with the name of the Prophet (sallallaahu alayhi wasallam) and that the name of his father will be the name of his (the Prophet's) father, and that he will fill the earth with justice, just as it had been filled with tyranny and oppression. And this [Mahdi] is not the awaited [mahdi] whose presence and emergence from the cave is presumed by the Raafidah, for that has no reality to it and no existence at all. Rather it is from the fancy of the feeble intellects and the presumption of weak imaginations. And it is not intended by those <a href='tags/twelve-khalifahs.html' class='tagLink'><font class='tagLink'>Twelve Khalifahs</font></a> the twelve Imaams that are believed in by the Twelver Rafidites [which they believe] due to their ignorance, and lack of intellect.</blockquote>    <P>
The <a href='tags/mahdi.html' class='tagLink'><font class='tagLink'>Mahdi</font></a> will be upon the Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>, and thus he is included amongst the twelve mentioned as he is also from the Quraish, as is apparent from the texts. Regarding the apparent conflict between these ahaadeeth regarding the <a href='tags/twelve-khalifahs.html' class='tagLink'><font class='tagLink'>Twelve Khalifahs</font></a>, ameers and the hadeeth of Safeenah that the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> will last thirty years, Ibn Katheer expains, in the sixth volume of al-Bidaayah wan-Nihaayah, under the title of "<i>Reports Concerning The Twelve Imaams All of Whom Are From the Quraish</i>" - and he is addressing what has been put forward by al-Bayhaqi of the explanation of the twelve, and al-Bayhaqi had stated that the twelve are the first twelve successive leaders, inclusive of the four rightly guided khalifahs:    <P>
<div class='arabic' align='right'>&#1601;&#1573;&#1606; &#1602;&#1575;&#1604;: &#1571;&#1606;&#1575; &#1604;&#1575; &#1571;&#1593;&#1578;&#1576;&#1585; &#1573;&#1604;&#1575; &#1605;&#1606; &#1575;&#1580;&#1578;&#1605;&#1593;&#1578; &#1575;&#1604;&#1571;&#1605;&#1577; &#1593;&#1604;&#1610;&#1607; &#1604;&#1586;&#1605;&#1607; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1602;&#1608;&#1604; &#1571;&#1606; &#1604;&#1575; &#1610;&#1593;&#1583; &#1593;&#1604;&#1610; &#1575;&#1576;&#1606; &#1571;&#1576;&#1610; &#1591;&#1575;&#1604;&#1576;&#1548; &#1608;&#1604;&#1575; &#1575;&#1576;&#1606;&#1607; &#1604;&#1571;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1604;&#1605; &#1610;&#1580;&#1578;&#1605;&#1593;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607;&#1605;&#1575; &#1608;&#1584;&#1604;&#1603; &#1571;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1588;&#1575;&#1605; &#1576;&#1603;&#1605;&#1575;&#1604;&#1607;&#1605; &#1604;&#1605; &#1610;&#1576;&#1575;&#1610;&#1593;&#1608;&#1607;&#1605;&#1575;&#1548; &#1608;&#1593;&#1583; &#1581;&#1576;&#1610;&#1576; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577;&#1548; &#1608;&#1575;&#1576;&#1606;&#1607; &#1610;&#1586;&#1610;&#1583;&#1548; &#1608;&#1575;&#1576;&#1606; &#1575;&#1576;&#1606;&#1607; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1576;&#1606; &#1610;&#1586;&#1610;&#1583;&#1548; &#1608;&#1604;&#1605; &#1610;&#1602;&#1610;&#1583; &#1576;&#1571;&#1610;&#1575;&#1605; &#1605;&#1585;&#1608;&#1575;&#1606; &#1608;&#1604;&#1575; &#1575;&#1576;&#1606; &#1575;&#1604;&#1586;&#1576;&#1610;&#1585; &#1603;&#1571;&#1606; &#1575;&#1604;&#1571;&#1605;&#1577; &#1604;&#1605; &#1578;&#1580;&#1578;&#1605;&#1593; &#1593;&#1604;&#1609; &#1608;&#1575;&#1581;&#1583; &#1605;&#1606;&#1607;&#1605;&#1575;&#1548; &#1601;&#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1606;&#1602;&#1608;&#1604; &#1601;&#1610; &#1605;&#1587;&#1604;&#1603;&#1607; &#1607;&#1584;&#1575; &#1593;&#1575;&#1583;&#1575; &#1604;&#1604;&#1582;&#1604;&#1601;&#1575;&#1569;: &#1571;&#1576;&#1610; &#1576;&#1603;&#1585;&#1548; &#1608;&#1593;&#1605;&#1585;&#1548; &#1608;&#1593;&#1579;&#1605;&#1575;&#1606;&#1548; &#1579;&#1605; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577;&#1548; &#1579;&#1605; &#1610;&#1586;&#1610;&#1583; &#1576;&#1606; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577;&#1548; &#1579;&#1605; &#1593;&#1576;&#1583; &#1575;&#1604;&#1605;&#1604;&#1603;&#1548; &#1579;&#1605; &#1575;&#1604;&#1608;&#1604;&#1610;&#1583; &#1576;&#1606; &#1587;&#1604;&#1610;&#1605;&#1575;&#1606;&#1548; &#1579;&#1605; &#1593;&#1605;&#1585; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586;&#1548; &#1579;&#1605; &#1610;&#1586;&#1610;&#1583;&#1548; &#1579;&#1605; &#1607;&#1588;&#1575;&#1605;&#1548; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1593;&#1588;&#1585;&#1577;&#1548; &#1579;&#1605; &#1605;&#1606; &#1576;&#1593;&#1583;&#1607;&#1605; &#1575;&#1604;&#1608;&#1604;&#1610;&#1583; &#1576;&#1606; &#1610;&#1586;&#1610;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1605;&#1604;&#1603; &#1575;&#1604;&#1601;&#1575;&#1587;&#1602;&#1548; &#1608;&#1604;&#1603;&#1606; &#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1587;&#1604;&#1603; &#1601;&#1571;&#1582;&#1584;&#1607;&#1575; &#1610;&#1604;&#1586;&#1605; &#1605;&#1606;&#1607; &#1573;&#1582;&#1585;&#1575;&#1580; &#1593;&#1604;&#1610; &#1608;&#1575;&#1576;&#1606;&#1607; &#1575;&#1604;&#1581;&#1587;&#1606; &#1605;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1575;&#1579;&#1606;&#1610; &#1593;&#1588;&#1585; &#1608;&#1607;&#1608; &#1582;&#1604;&#1575;&#1601; &#1605;&#1575; &#1606;&#1589; &#1593;&#1604;&#1610;&#1607; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1587;&#1606;&#1577; &#1576;&#1604; &#1608;&#1575;&#1604;&#1588;&#1610;&#1593;&#1577;&#1548; &#1579;&#1605; &#1607;&#1608; &#1582;&#1604;&#1575;&#1601; &#1605;&#1575; &#1583;&#1604; &#1593;&#1604;&#1610;&#1607; &#1606;&#1589;&#1575; &#1581;&#1583;&#1610;&#1579; &#1587;&#1601;&#1610;&#1606;&#1577; &#1593;&#1606; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1606;&#1607; &#1602;&#1575;&#1604;: &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1576;&#1593;&#1583;&#1610; &#1579;&#1604;&#1575;&#1579;&#1608;&#1606; &#1587;&#1606;&#1577; &#1579;&#1605; &#1578;&#1603;&#1608;&#1606; &#1605;&#1604;&#1603;&#1575; &#1593;&#1590;&#1608;&#1590;&#1575; .    <P>
&#1608;&#1602;&#1583; &#1584;&#1603;&#1585; &#1587;&#1601;&#1610;&#1606;&#1577; &#1578;&#1601;&#1589;&#1610;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1610;&#1606; &#1587;&#1606;&#1577; &#1601;&#1580;&#1605;&#1593;&#1607;&#1575; &#1605;&#1606; &#1582;&#1604;&#1575;&#1601;&#1577; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577;&#1548; &#1608;&#1602;&#1583; &#1576;&#1610;&#1606;&#1575; &#1583;&#1582;&#1608;&#1604; &#1582;&#1604;&#1575;&#1601;&#1577; &#1575;&#1604;&#1581;&#1587;&#1606; &#1608;&#1603;&#1575;&#1606;&#1578; &#1606;&#1581;&#1608;&#1575; &#1605;&#1606; &#1587;&#1578;&#1577; &#1571;&#1588;&#1607;&#1585; &#1601;&#1610;&#1607;&#1575; &#1571;&#1610;&#1590;&#1575; &#1579;&#1605; &#1589;&#1575;&#1585; &#1575;&#1604;&#1605;&#1604;&#1603; &#1573;&#1604;&#1609; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1604;&#1605;&#1575; &#1587;&#1604;&#1605; &#1575;&#1604;&#1571;&#1605;&#1585; &#1573;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1587;&#1606; &#1576;&#1606; &#1593;&#1604;&#1610;&#1548; &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1601;&#1610;&#1607; &#1575;&#1604;&#1605;&#1606;&#1593; &#1605;&#1606; &#1578;&#1587;&#1605;&#1610;&#1577; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1582;&#1604;&#1610;&#1601;&#1577;&#1548; &#1608;&#1576;&#1610;&#1575;&#1606; &#1571;&#1606; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1602;&#1583; &#1575;&#1606;&#1602;&#1591;&#1593;&#1578; &#1576;&#1593;&#1583; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1610;&#1606; &#1587;&#1606;&#1577; &#1604;&#1575; &#1605;&#1591;&#1604;&#1602;&#1575; &#1576;&#1604; &#1575;&#1606;&#1602;&#1591;&#1593; &#1578;&#1578;&#1575;&#1576;&#1593;&#1607;&#1575;&#1548; &#1608;&#1604;&#1575; &#1610;&#1606;&#1601;&#1610; &#1608;&#1580;&#1608;&#1583; &#1582;&#1604;&#1601;&#1575;&#1569; &#1585;&#1575;&#1588;&#1583;&#1610;&#1606; &#1576;&#1593;&#1583; &#1584;&#1604;&#1603; &#1603;&#1605;&#1575; &#1583;&#1604; &#1593;&#1604;&#1610;&#1607; &#1581;&#1583;&#1610;&#1579; &#1580;&#1575;&#1576;&#1585; &#1576;&#1606; &#1587;&#1605;&#1585;&#1577;.    <P>
&#1608;&#1602;&#1575;&#1604; &#1606;&#1593;&#1610;&#1605; &#1576;&#1606; &#1581;&#1605;&#1575;&#1583;: &#1581;&#1583;&#1579;&#1606;&#1575; &#1585;&#1575;&#1588;&#1583; &#1576;&#1606; &#1587;&#1593;&#1583; &#1593;&#1606; &#1575;&#1576;&#1606; &#1604;&#1607;&#1610;&#1593;&#1577;&#1548; &#1593;&#1606; &#1582;&#1575;&#1604;&#1583; &#1575;&#1576;&#1606; &#1571;&#1576;&#1610; &#1593;&#1605;&#1585;&#1575;&#1606;&#1548; &#1593;&#1606; &#1581;&#1584;&#1610;&#1601;&#1577; &#1576;&#1606; &#1575;&#1604;&#1610;&#1605;&#1575;&#1606; &#1602;&#1575;&#1604;: &#1610;&#1603;&#1608;&#1606; &#1576;&#1593;&#1583; &#1593;&#1579;&#1605;&#1575;&#1606; &#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1605;&#1604;&#1603;&#1575; &#1605;&#1606; &#1576;&#1606;&#1610; &#1571;&#1605;&#1610;&#1577;&#1548; &#1608;&#1602;&#1610;&#1604; &#1604;&#1607;: &#1582;&#1604;&#1601;&#1575;&#1569;&#1567;    <P>
&#1602;&#1575;&#1604;: &#1604;&#1575; &#1576;&#1604; &#1605;&#1604;&#1608;&#1603;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And if he says: I do not consider [as being from these twelve] except the one upon whom the ummah has united upon, then it is binding upon him, based upon this saying, to not count Alee bin Abee Taalib and nor his son [as from the twelve] because the people did not unite altogether over them. This is because the people of Shaam as a whole did not pledge allegiance to them both, and to consider the beloved Mu'aawiyah, his son Yazeed, and his grandson, Mu'aawiyah bin Yazeed (as being from the twelve), and it is not restricted to the days (of rule) of Marwaan and nor Ibn az-Zubayr, as the ummah did not unite behind either of them.     <P>
So upon this we say that with his approach in counting the khalifahs: Abu Bakr, Umar, Uthmaan, then Mu'aawiyah, then Yazeed bin Mu'aawiyah, then Abdul-Malik, then al-Waleed bin Sulaymaan, then Umar bin Abdul-Azeez, then Yazeed, then Hishaam. So they are ten, then after them al-Waleed bin Yazeed bin Abdul-Malik, the faasiq. However, it is not possible to take this approach for taking this [approach] means expelling Alee and his son al-Hasan form those twelve.    <P>
And this is different to what the Scholars of the Sunnah, and also the Shi'ah have textually stated. Further, it also opposes what has been indicated textually in the hadeeth of Safeenah from the Messenger of Allaah (sallallaahu alayhi wasallam), "<i>The <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> after me is for thirty years, then there will be biting kingship</i>."     <P>
And Safeenah has mentioned the explanation of these thirty years bringing them together in the four khilaafahs, and we have explained the inclusion of the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> of al-Hasan, which was for around six months, into [these thirty years] also. Then it turned to <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a> with Mu'aawiyah when al-Hasan bin Ali submitted the affair (the rule) to him. And in this hadeeth is the prohibition of labelling Mu'aawiyah as "khalifah", and an explanation that the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> had terminated after the thirty years, not absolutely, but its succession had terminated, and it does not negate the presence of rightly-guided khalifas after that as has been indicated by the hadeeth of Jaabir bin Samurah.    <P>
And Nu'aym bin Hammaad said: Raashid bin Sa'd narrated to us from Ibn Luhay'ah, from Khaalid ibn Abee Imraan, from Hudhayfah bin al-Yaamaan, who said: There will be twelve kings from the Bani Umayyah after Uthmaan." It was said to him, "Are they khalifahs?" He said, "No, rather they are kings".</blockquote>    <P>
Ibn Katheer, in this passage and what occurs before it in his quotation of the view of al-Bayhaqi and another group of scholars, explained that specifying the condition that the whole ummah has to be united behind them means the expulsion of Alee and al-Hasan from the twelve and others from all those who were successive in time. Ibn Kather explained that the condition that the khalifahs have to be successive, one after the other, also means the expulsion of Umar bin Abdul-Azeez from the twelve, since the the twelve end with Sulaymaan bin Abdul-Malik (after inclusion of al-Hasan). And thus, what is correct is that while the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> ended after thirty years, and was replaced by <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, then that does not prevent the presence of rightly-guided khalifahs being found, in accordance with the hadeeth of Jaabir, even if that be during the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, or through the mode of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>.    <P>
<font class='titleHeadline'>Summary</font>    <P>
From the previous two articles on this subject and this article - see <a href=index1b15.html?kyvik>here</a> and <a href=index1ece.html?jebhu>here</a> - the following points are clear:    <P>
<ul><li> After the period of Prophethood, there was a <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> upon the way of prophethood for thirty years.    <P>
<li>This <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> spanned the rule of Abu Bakr, Umar, Uthmaan, Alee, and some include al-Hasan bin Alee.    <P>
<li> Mu'aawiyah was the first king in <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a> and his rule broke the succession of the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>, and here <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a> entered the Ummah and was the mode of rule and will remain the mode of rule until the approach of the hour when the Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> will return. However, with the succession of the <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> ended, this does not prevent the naming of rulers as "khalifahs", even if they are kings, or took their rule in the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, and their being named with "khalifahs" in turn, does not negate that the mode of rule had been passed through "<a href="tags/kingship.html" class="tagLink"><font class="tagLink">kingship</font></a>", or that they are in the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, as explained by Ibn Hajr (<a href=index1ece.html?jebhu>see this article</a>).    <P>
<li> Within this long period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a> that is in between the two periods of Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>, there will be found khalifahs who are rightly-guided, and the hadeeth of the Prophet (sallallaahu alayhi wasallam) states that the affair will never cease until  twelve rulers, ameers, khalifahs have taken the rule, and the presence of these twelve spans all these periods, the first Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>, the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a> (both biting and tyrannical) and the second Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>. The proof is that the <a href='tags/mahdi.html' class='tagLink'><font class='tagLink'>Mahdi</font></a> is included amongst these twelve, just as the Ummah is united that the rule of Umar bin Abdul-Azeez was a righteous rule, even if it took place during the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>.    <P>
<li> Claiming that these twelve ameers, khalifahs are in direct succession after each other is not a strong viewpoint.    <P>
<li> The <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a>, upon its original state and way, will return after the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, and the <a href='tags/mahdi.html' class='tagLink'><font class='tagLink'>Mahdi</font></a>, who is from the Quraish will rule in this period for a time of seven years (and possibly others after him), and after his departure the affair will then deteriorate and get worse.    <P>
<li> The twelve imaams, or ameers or khalifahs are not those of the heretical Rafidite Twelvers who claim their twelfth Imaam is present in person, hiding in a cave, and has been for hundreds of years and will eventually emerge out of the cave to establish justice.  </ul>    <P>
Finally, in the discussion of this topic, some of the scholars mention that since there was a mention of "twelve" great men from the offspring of Ismaa'eel in the <a href='tags/torah.html' class='tagLink'><font class='tagLink'>Torah</font></a>, when the Jews who became Muslims heard the Rafidah speak of their "twelve" Imaams, many Jews inclined towards the Rafidah and took on their way. Ibn Katheer said (in his tafseer of al-Maa'idah 5/12):    <P>
<div class='arabic' align='right'>&#1608;&#1601;&#1610; &#1575;&#1604;&#1578;&#1608;&#1585;&#1575;&#1577; &#1575;&#1604;&#1576;&#1588;&#1575;&#1585;&#1577; &#1576;&#1573;&#1587;&#1605;&#1575;&#1593;&#1610;&#1604; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1608;&#1571;&#1606; &#1610;&#1602;&#1610;&#1605; &#1605;&#1606; &#1589;&#1604;&#1576;&#1607; &#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1593;&#1592;&#1610;&#1605;&#1575; &#1608;&#1607;&#1605; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1582;&#1604;&#1601;&#1575;&#1569; &#1575;&#1604;&#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1575;&#1604;&#1605;&#1584;&#1603;&#1608;&#1585;&#1608;&#1606; &#1601;&#1610; &#1581;&#1583;&#1610;&#1579; &#1575;&#1576;&#1606; &#1605;&#1587;&#1593;&#1608;&#1583; &#1608;&#1580;&#1575;&#1576;&#1585; &#1576;&#1606; &#1587;&#1605;&#1585;&#1577; &#1608;&#1576;&#1593;&#1590; &#1575;&#1604;&#1580;&#1607;&#1604;&#1577; &#1605;&#1605;&#1606; &#1571;&#1587;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1610;&#1607;&#1608;&#1583; &#1573;&#1584;&#1575; &#1575;&#1602;&#1578;&#1585;&#1606; &#1576;&#1607;&#1605; &#1576;&#1593;&#1590; &#1575;&#1604;&#1588;&#1610;&#1593;&#1577; &#1610;&#1608;&#1607;&#1605;&#1608;&#1606;&#1607;&#1605; &#1571;&#1606;&#1607;&#1605; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1575;&#1579;&#1606;&#1575; &#1593;&#1588;&#1585; &#1601;&#1610;&#1578;&#1588;&#1610;&#1593; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606;&#1607;&#1605; &#1580;&#1607;&#1604;&#1575; &#1608;&#1587;&#1601;&#1607;&#1575; &#1604;&#1602;&#1604;&#1577; &#1593;&#1604;&#1605;&#1607;&#1605; &#1608;&#1593;&#1604;&#1605; &#1605;&#1606; &#1604;&#1602;&#1606;&#1607;&#1605; &#1584;&#1604;&#1603; &#1576;&#1575;&#1604;&#1587;&#1606;&#1606; &#1575;&#1604;&#1579;&#1575;&#1576;&#1578;&#1577; &#1593;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And in the <a href='tags/torah.html' class='tagLink'><font class='tagLink'>Torah</font></a> is the glad tiding regarding Ismaa'eel (alayhis salaam) and that twelve great men will arise and be established from his offspring, and they are the twelve mentioned in the hadeeth of Ibn Mas'ood and Jaabir bin Samurah. And some of the ignoramuses from the Jews who accepted <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>, when some of the Shi'ah associated with them and made them presume that they (the Shi'ah) are the twelve imaams, many of them (the Jews) took on Shi'ism out of ignorance and foolishness, due to their lack of knowledge and the [lack of] knowledge of those who dictated that to them of the established Sunan (narrations) from the Prophet (sallallaahu alayhi wasallam)</blockquote>    <P>
And this would explain a route through which Jews took on the way of the Rafidah Shi'ah, out of their ignorance and lack of knowledge of the religion of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>.    <P>
<font class='titleHeadline'>Another View By Shaykh Ibn Baaz</font>    <P>
Shaykh Ibn Baaz (rahimahullaah) has a view different to that of Ibn Katheer on this subject, regarding the specification of these twelve rulers. He states (Majmoo' Fataawaa 4/99-101, English translation, alifta.com, with some corrections):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There are some of the scholars who gave some irregular opinions in this regard but their views are not considered here. As for what Al-Hafiz  Isma'il ibn Kathir (may Allah confer His Mercy on him) stated in his book of the exegesis of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> in Surah of Al-Ma'idah while speaking about the deputies of the people of Medina, that Al-Mahdi may be one of The Twelve Imams, this is doubtful.    <P>
The Prophet (may Allah's Peace and Blessings be upon him) said: "<i>The matter of this nation will continue well-established when they are ruled by twelve caliphs who all belong to Quraysh</i>". The saying of the Prophet (peace be upon him) indicates that religion at their time is established and prevailing and the truth is apparent. It is known that this prophecy was fulfilled before the end of the era of Banu Umayyah. However, during the last days of this era a great difference occurred which caused disunity and was a disaster for Muslims for they divided into two countries, one in Andalusia and one in Iraq as well as other inflictions which affected Muslims during this time as known.    <P>
The Prophet (peace be upon him) said: "<i>The matter of this nation will continue well-established...</i>" Then, there were many great matters that helped unbalance the system of caliphate and the Islamic territory disunited into small countries with their own rulers, as is the case in the present time, even widely and apparently.    <P>
To this day, Al-Mahdi has not appeared so how can one dare to say that the matter of religion will continue well-established until the coming of Al-Mahdi? Indeed, this is rejected by fair thinking and contemplation.    <P>
According to some scholars, the most proper meaning of the Hadith, "<i>The matter of this nation will continue well-established when they are ruled by twelve caliphs who all belong to Quraysh</i>", is that the Prophet (peace be upon him) intends the four caliphs, Mu'awiyah (may Allah be pleased with them), his son Yazid , 'Abdul-Malik ibn Marwan, his four sons and 'Umar ibn 'Abdul-`Aziz. These are twelve caliphs.    <P>
What I want to assure is that the strongest and soundest view concerning the twelve Imams is that they end with Hisham ibn 'Abdul-Malik as religion in their time was established, Islam was prevailing, the truth was apparent and Jihad was in force. As for what happened after the death of Yazid of difference and disunity in the caliphate so that Marwan ruled Al-Sham (The Levant) and Ibn Al-Zubayr ruled Hijaz all of this did not harm Muslims in their religion for their religion was predominant and widespread and their enemy was subjugated in spite of the dispute that happened then it ended by paying the pledge of allegiance to to 'Abdul-Malik and people became united in spite of the trouble that happened at the hands of Al-Hajjaj and others.    <P>
It becomes clear that the matter which the Prophet (peace be upon him) told us about has happened and ended whereas the matter of Al-Mahdi is to be during the last days (of the world) and that it has no relation to the Hadith narrated by Jabir ibn Samurah concerning the Twelve Imams .</blockquote>    <P>
Upon this view, four of the rulers were in the period of Prophetic <a href='tags/khilaafah.html' class='tagLink'><font class='tagLink'>khilaafah</font></a> and the rest were in the period of <a href='tags/kingship.html' class='tagLink'><font class='tagLink'>kingship</font></a>, and the reign of all of these twelve rulers (ameers, khalifahs) ended around the turn of the first century as Umar bin Abd al-Azeez died around 101H.    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/jsxlv-concerning-the-mahdi-and-the-twelve-khalifahs-that-will-rule-all-of-them-from-quraish.html">Concerning the Twelve Khalifahs That Will Rule Before the Hour, All Of Them From the Quraish</a><BR>
https://www.aqidah.com/creed/?jsxlv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?jsxlv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
</html>


