

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?mevrk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:29 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | Shaykh Salih al-Fawzan on the Study of the 'Scientific Miracle'</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Salih al-Fawzan on the Study of the 'Scientific Miracle'</span><BR>
Friday, August 23 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>Numerous people have been leading the 'Scientific Miracle' bandwagon and directing average Muslims into using this as a basis for inviting others to Islam. This is not the way of Ahl al-Sunnah wal-Jamaa'ah, the followers of the Salafi methodology in da'wah. The reason is quite obvious and plain. Scientific knowledge is always in a state of flux and attempting to correlate verses of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> with modern science is in reality speaking about the intent of Allaah without knowledge, and amounts to lying upon Allaah, the Exalted.     <P>
Whilst the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> alludes to certain natural phenomenon, the primary purpose behind such texts is to make a man reflect on the universe and upon his own self and upon his own <a href='tags/creation.html' class='tagLink'><font class='tagLink'>creation</font></a> (how he came to be) so as to come to a concrete realization: That none has the right to be worshipped in truth except Allaah alone and that there is no true serenity and satisfaction for the hearts except in this.  </blockquote>   </div>    <P>
<font class='titleHeadline'>Shaykh Salih al-Fawzan on the 'Scientific Miracle'</font>    <P>
The Shaykh delivered <a href=http://www.sahab.net/forums/index.php?showtopic=128242>a lecture</a> entitled (<span class='arb'> &#1608;&#1602;&#1601;&#1577; &#1605;&#1593; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;: &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1571;&#1606;&#1586;&#1604; &#1593;&#1604;&#1610;&#1603; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; </span>) and was asked the following question therein:    <P>
<blockquote><div class='arabic' align='right'>&#1607;&#1604; &#1593;&#1604;&#1605; &#1575;&#1604;&#1573;&#1593;&#1580;&#1575;&#1586; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610; &#1601;&#1610; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1548; &#1593;&#1604;&#1605; &#1605;&#1581;&#1583;&#1579; &#1571;&#1605; &#1604;&#1575; &#1567;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Is the science (study) of the scientific miracle of the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> an innovated science or not?</blockquote>    <P>
The Shaykh answered:    <P>
<blockquote><div class='arabic' align='right'>&#1605;&#1581;&#1583;&#1579; &#1548; &#1575;&#1604;&#1573;&#1593;&#1580;&#1575;&#1586; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610; &#1607;&#1584;&#1575; &#1605;&#1581;&#1583;&#1579; &#1548; &#1602;&#1589;&#1583;&#1607;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605;&#1610; &#1605;&#1575; &#1607;&#1608; &#1576;&#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610; &#1548;&#1602;&#1589;&#1583;&#1607;&#1605; &#1575;&#1604;&#1589;&#1606;&#1575;&#1593;&#1610; &#1608; &#1575;&#1604;&#1571;&#1601;&#1603;&#1575;&#1585; &#1575;&#1604;&#1578;&#1610; &#1573;&#1593;&#1578;&#1605;&#1583;&#1608;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1582;&#1578;&#1585;&#1593;&#1575;&#1578; &#1608;&#1607;&#1584;&#1575; &#1593;&#1604;&#1605; &#1583;&#1606;&#1610;&#1608;&#1610; &#1608;&#1604;&#1575; &#1610;&#1601;&#1587;&#1585; &#1576;&#1607; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1608;&#1607;&#1584;&#1575; &#1610;&#1582;&#1591;&#1574; &#1608;&#1610;&#1589;&#1610;&#1576; &#1571;&#1610;&#1590;&#1575;&#1611; &#1548; &#1601;&#1603;&#1610;&#1601; &#1610;&#1601;&#1587;&#1585; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1576;&#1588;&#1610;&#1569; &#1593;&#1585;&#1590;&#1607; &#1604;&#1604;&#1582;&#1591;&#1571;&#1548; &#1593;&#1585;&#1590;&#1577; &#1604;&#1604;&#1582;&#1591;&#1571; &#1608;&#1593;&#1585;&#1590;&#1577; &#1593;&#1583;&#1605; &#1604;&#1604;&#1589;&#1581;&#1577;&#1548; &#1604;&#1571;&#1606;&#1607;&#1575; &#1571;&#1602;&#1608;&#1575;&#1604; &#1575;&#1604;&#1606;&#1575;&#1587; . &#1606;&#1593;&#1605; .</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is newly-invented (muhdath), this 'scientific miracle' is newly-invented. Their intent behind 'scientific (knowledge, study)' is not the legislative (Shar'iah) knowledge, their intent is applied science or the ideas they depend upon from the newly-invented things. And this is worldly knowledge, the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> is not to be interpreted by way of it, because it can be right and wrong too. So how can the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> be interpreted with something that is subject to error, subject to error and subject to absence of (being) sound, because they are from the sayings of men. Yes.</blockquote> <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?mevrk by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:29 GMT -->
</html>


