

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?oeotc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | The Splitting of the Muslim Ummah: Part 1 - The Completion and Perfection of the Religion and The Way of the Companions</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Splitting of the Muslim Ummah: Part 1 - The Completion and Perfection of the Religion and The Way of the Companions</span><BR>
Wednesday, July 07 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><b>View: <a href=index9cff.html?oeotc>Part 1</a>, <a href=indexf77a.html?vqlrf>Part 2</a>, <a href=index6693.html?hxnhe>Part 3</a>, <a href=indexcda2.html?flqoi>Part 4</a></b></div>    <P>
<font class='titleHeadline'>Introduction</font>    <P>
There have been many eras that have passed upon the Muslim Ummah. In some of these eras the Ummah held fast onto the correct sound <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and in others this attachment weakened, and some from the Ummah held fast to it, whilst others deviated from it. In this series we will take a look at the period in which the Ummah held fast to the sound <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and the factors and causes that led to the change in this situation, bringing about differing, splitting, disunity and the emergence of multiple sects and groups each claiming to represent the true Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> of the Messengers.    <P>
<b><u>The Era of the Messengership, the Companions</u></b>     <P>
During this era, <u>the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> was pristine and pure</u>, it was pure in the hearts of the Believers (the Companions), there were no blemishes or anything  mixed with it. The Messenger (alayhis salaam) did not depart to the Higher Companionship except after he had conveyed the message, and had fulfilled the trust, and had given sincere advice to the Ummah. Allaah the Most High testified that He had indeed completed and perfected the deen of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a> (and all what it contains of <i>aqaa'id</i>, <i>ibaadaat</i>, <i>ahkaam</i>), so He said:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1575;&#1604;&#1618;&#1610;&#1614;&#1608;&#1618;&#1605;&#1614; &#1571;&#1614;&#1603;&#1618;&#1605;&#1614;&#1604;&#1618;&#1578;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1618; &#1583;&#1616;&#1610;&#1606;&#1614;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1571;&#1614;&#1578;&#1618;&#1605;&#1614;&#1605;&#1618;&#1578;&#1615; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1603;&#1615;&#1605;&#1618; &#1606;&#1616;&#1593;&#1618;&#1605;&#1614;&#1578;&#1616;&#1610; &#1608;&#1614;&#1585;&#1614;&#1590;&#1616;&#1610;&#1578;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1615; &#1575;&#1604;&#1573;&#1616;&#1587;&#1618;&#1604;&#1575;&#1614;&#1605;&#1614; &#1583;&#1616;&#1610;&#1606;&#1611;&#1575; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> This day have I perfected for you your religion, have completed my favour upon you and have chosen for you Islam as your religion. </b><img src='images/qnend.gif'></blockquote>    <P>
And Allaah ordered His Prophet (alayhis salaam) to convey from Allaah, Allaah's religion, so Allaah said:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1610;&#1614;&#1575; &#1571;&#1614;&#1610;&#1617;&#1615;&#1607;&#1614;&#1575; &#1575;&#1604;&#1585;&#1617;&#1614;&#1587;&#1615;&#1608;&#1604;&#1615; &#1576;&#1614;&#1604;&#1617;&#1616;&#1594;&#1618; &#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1586;&#1616;&#1604;&#1614; &#1573;&#1616;&#1604;&#1614;&#1610;&#1618;&#1603;&#1614; &#1605;&#1616;&#1606; &#1585;&#1617;&#1614;&#1576;&#1617;&#1616;&#1603;&#1614; &#1608;&#1614;&#1573;&#1616;&#1606; &#1604;&#1617;&#1614;&#1605;&#1618; &#1578;&#1614;&#1601;&#1618;&#1593;&#1614;&#1604;&#1618; &#1601;&#1614;&#1605;&#1614;&#1575; &#1576;&#1614;&#1604;&#1617;&#1614;&#1594;&#1618;&#1578;&#1614; &#1585;&#1616;&#1587;&#1614;&#1575;&#1604;&#1614;&#1578;&#1614;&#1607;&#1615; &#1608;&#1614;&#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1610;&#1614;&#1593;&#1618;&#1589;&#1616;&#1605;&#1615;&#1603;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1587;&#1616; &#1573;&#1616;&#1606;&#1617;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1614; &#1604;&#1575;&#1614; &#1610;&#1614;&#1607;&#1618;&#1583;&#1616;&#1610; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1614; &#1575;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1616;&#1610;&#1606;&#1614;   <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> O Messenger! Proclaim (the Message) which has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message. Allaah will protect you from mankind. Verily, Allaah guides not the people who disbelieve.  (Al-Ma'idah 5:67) </b><img src='images/qnend.gif'></blockquote>    <P>
Thus, the Messenger (alayhis salaam) conveyed it, just as he had been commanded. He conveyed the entire religion in both aqeedah (beliefs) and sharee'ah (rulings). And the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> (radiallaahu anhum) who were characterized with <i>amaanah</i> (trustworthiness), they acquired this deen as it was being revealed, right to its completion.    <P>
In the two Saheehs of  al-Bukhari and Muslim there is the hadeeth of Hudhayfah bin al-Yamaan (radiallaahu anhu):    <P>
<div class='arabic' align='right'>&#1581;&#1583;&#1579;&#1606;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1581;&#1583;&#1610;&#1579;&#1610;&#1606; &#1602;&#1583; &#1585;&#1571;&#1610;&#1578; &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1608;&#1571;&#1606;&#1575; &#1575;&#1606;&#1578;&#1592;&#1585; &#1575;&#1604;&#1570;&#1582;&#1585; &#1581;&#1583;&#1579;&#1606;&#1575; &#1571;&#1606; &#1575;&#1604;&#1571;&#1605;&#1575;&#1606;&#1577; &#1606;&#1586;&#1604;&#1578; &#1601;&#1610; &#1580;&#1584;&#1585; &#1602;&#1604;&#1608;&#1576; &#1575;&#1604;&#1585;&#1580;&#1575;&#1604; &#1579;&#1605; &#1606;&#1586;&#1604; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1601;&#1593;&#1604;&#1605;&#1608;&#1575; &#1605;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1608;&#1593;&#1604;&#1605;&#1608;&#1575; &#1605;&#1606; &#1575;&#1604;&#1587;&#1606;&#1577; &#1579;&#1605; &#1581;&#1583;&#1579;&#1606;&#1575; &#1593;&#1606; &#1585;&#1601;&#1593; &#1575;&#1604;&#1571;&#1605;&#1575;&#1606;&#1577; &#1601;&#1602;&#1575;&#1604; &#1610;&#1606;&#1575;&#1605; &#1575;&#1604;&#1585;&#1580;&#1604; &#1575;&#1604;&#1606;&#1608;&#1605;&#1577; &#1601;&#1578;&#1602;&#1576;&#1590; &#1575;&#1604;&#1571;&#1605;&#1575;&#1606;&#1577; &#1605;&#1606; &#1602;&#1604;&#1576;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Messenger of Allah (sallallaahu alayhi wasallam) foretold to us two ahaadeeth. I have seen one (being fulfilled), and I am waiting for the other. He told us that the <i>amaanah</i> (quality of trustworthiness and fulfilling trusts)  descended in the innermost (root) of the hearts of men. Then the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> was revealed and they learnt from the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Quran</font></a> and they learned from the Sunnah. Then he told us about the removal of <i>amaanah</i>. He said, "<i>The man would have some sleep, and Amanah would be taken away from his heart</i>..."</blockquote>    <P>
So here trustworthiness (<i>amaanah</i>) was found in the hearts of the people first and upon this quality did they acquire the <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> and the Sunnah (i.e. the religion with all its beliefs, deeds and injunctions). They affirmed all of what was revealed in beliefs, sayings and actions and acted upon all of that and whatever it contained of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, eeemaan, the righteous actions, and the rulings.    <P>
This religion, at that time, was a sound, authentic and complete manhaj (methodology) which did not admit to any additions or deletions. And the affair continued upon this way, upon this Straight Path, and it was traversed by the Righteous Salaf, who are the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>, and their successors, then their successors. This was the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, this was the deen and the <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a> that raised these people, who are the best of people to have walked the earth, after the Prophets and Messengers.    <P>
<b><u>It Was the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> That United the Companions</u></b>    <P>
In the days of Jaahiliyyah there was much corruption in terms belief, morals and likewise in economic, social and political conditions. The Arabs were divided, with tribes constantly waging wars over insignificant matters. They were idol-worshippers, and would worship the righteous dead. They were split in their religion (of Shirk). The strong would consume the weak. The birth of females was seen as a disgrace. Women would sleep with many men, as a result of which the geneologies of those born would become obscure. Men would inherit the wives of their fathers. They proceeeded upon their affairs with great superstition and believed in omens and the likes, held strong beliefs in the magicians, soothsayers and the likes. Although there is a great deal more that can be said this should be enough to give an insight into the type of society that was present - one that was far, far away from the traces and remnants of Prophethood and Messengership, and was on the verge of destruction.    <P>
<div class='sidebar'>Then Allaah sent Muhammad (alayhis salaam), and he ordered him to convey the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, the pillar of which is the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> of Allaah, to single out Allaah in worship and in His Names and Attributes, and this was the first affair that he called to, for 13 years before any of the legislated actions were revealed.</div>    <P>
And he was not ordered to first unite the Arabs into a single mass,  nor to call to "social justice", nor to struggle for the rights of women, nor to call for economic equality and justice, nor to to become involved in the politics of the tribes in order to unite them, and nor did he begin with the legislative rulings. Rather, he began with that which truly united and cemented their hearts, which was the pristine, pure <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>.    <P>
And Allaah, the Most High, recounted this to the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>, when He said:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1575;&#1593;&#1618;&#1578;&#1614;&#1589;&#1616;&#1605;&#1615;&#1608;&#1575;&#1618; &#1576;&#1616;&#1581;&#1614;&#1576;&#1618;&#1604;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1580;&#1614;&#1605;&#1616;&#1610;&#1593;&#1611;&#1575; &#1608;&#1614;&#1604;&#1575;&#1614; &#1578;&#1614;&#1601;&#1614;&#1585;&#1617;&#1614;&#1602;&#1615;&#1608;&#1575;&#1618; &#1608;&#1614;&#1575;&#1584;&#1618;&#1603;&#1615;&#1585;&#1615;&#1608;&#1575;&#1618; &#1606;&#1616;&#1593;&#1618;&#1605;&#1614;&#1578;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1603;&#1615;&#1605;&#1618; &#1573;&#1616;&#1584;&#1618; &#1603;&#1615;&#1606;&#1578;&#1615;&#1605;&#1618; &#1571;&#1614;&#1593;&#1618;&#1583;&#1614;&#1575;&#1569; &#1601;&#1614;&#1571;&#1614;&#1604;&#1617;&#1614;&#1601;&#1614; &#1576;&#1614;&#1610;&#1618;&#1606;&#1614; &#1602;&#1615;&#1604;&#1615;&#1608;&#1576;&#1616;&#1603;&#1615;&#1605;&#1618; &#1601;&#1614;&#1571;&#1614;&#1589;&#1618;&#1576;&#1614;&#1581;&#1618;&#1578;&#1615;&#1605; &#1576;&#1616;&#1606;&#1616;&#1593;&#1618;&#1605;&#1614;&#1578;&#1616;&#1607;&#1616; &#1573;&#1616;&#1582;&#1618;&#1608;&#1614;&#1575;&#1606;&#1611;&#1575; &#1608;&#1614;&#1603;&#1615;&#1606;&#1578;&#1615;&#1605;&#1618; &#1593;&#1614;&#1604;&#1614;&#1609;&#1614; &#1588;&#1614;&#1601;&#1614;&#1575; &#1581;&#1615;&#1601;&#1618;&#1585;&#1614;&#1577;&#1613; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1585;&#1616; &#1601;&#1614;&#1571;&#1614;&#1606;&#1602;&#1614;&#1584;&#1614;&#1603;&#1615;&#1605; &#1605;&#1617;&#1616;&#1606;&#1618;&#1607;&#1614;&#1575; &#1603;&#1614;&#1584;&#1614;&#1604;&#1616;&#1603;&#1614; &#1610;&#1615;&#1576;&#1614;&#1610;&#1617;&#1616;&#1606;&#1615; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1604;&#1614;&#1603;&#1615;&#1605;&#1618; &#1570;&#1610;&#1614;&#1575;&#1578;&#1616;&#1607;&#1616; &#1604;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1603;&#1615;&#1605;&#1618; &#1578;&#1614;&#1607;&#1618;&#1578;&#1614;&#1583;&#1615;&#1608;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And hold fast, all of you together, to the Rope of Allaah and be not divided among yourselves. And remember Allýh's Favour on you, for you were enemies one to another but He joined your hearts together, so that, by His Grace, you became brethren (in Islamic Faith), and you were on the brink of a pit of Fire, and He saved you from it. Thus Allaah makes His signs clear to you, that you may be guided.  (Aali Imran 3:103) </b><img src='images/qnend.gif'></blockquote>    <P>
So just as He united their hearts together (upon the Islamic aqidah), He also commanded them to remain united upon that by holding fast to His rope, which is the deen of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a>, and the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> - and this command extends to the rest of the Ummah.    <P>
<b><u>The Obligation to Follow the Companions</u></b>    <P>
And in the Book of Allaah, and in the Sunnah there are numerous evidences, that the Scholars of Ahl us-Sunnah utilize as proof for the obligation to remain steadfast upon that which the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> were upon and not to depart from it. And from these texts:    <P>
The saying of Allaah, the Most High:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1605;&#1614;&#1606; &#1610;&#1615;&#1588;&#1614;&#1575;&#1602;&#1616;&#1602;&#1616; &#1575;&#1604;&#1585;&#1617;&#1614;&#1587;&#1615;&#1608;&#1604;&#1614; &#1605;&#1616;&#1606; &#1576;&#1614;&#1593;&#1618;&#1583;&#1616; &#1605;&#1614;&#1575; &#1578;&#1614;&#1576;&#1614;&#1610;&#1617;&#1614;&#1606;&#1614; &#1604;&#1614;&#1607;&#1615; &#1575;&#1604;&#1618;&#1607;&#1615;&#1583;&#1614;&#1609; &#1608;&#1614;&#1610;&#1614;&#1578;&#1617;&#1614;&#1576;&#1616;&#1593;&#1618; &#1594;&#1614;&#1610;&#1618;&#1585;&#1614; &#1587;&#1614;&#1576;&#1616;&#1610;&#1604;&#1616; &#1575;&#1604;&#1618;&#1605;&#1615;&#1572;&#1618;&#1605;&#1616;&#1606;&#1616;&#1610;&#1606;&#1614; &#1606;&#1615;&#1608;&#1614;&#1604;&#1617;&#1616;&#1607;&#1616; &#1605;&#1614;&#1575; &#1578;&#1614;&#1608;&#1614;&#1604;&#1617;&#1614;&#1609; &#1608;&#1614;&#1606;&#1615;&#1589;&#1618;&#1604;&#1616;&#1607;&#1616; &#1580;&#1614;&#1607;&#1614;&#1606;&#1617;&#1614;&#1605;&#1614; &#1608;&#1614;&#1587;&#1614;&#1575;&#1569;&#1578;&#1618; &#1605;&#1614;&#1589;&#1616;&#1610;&#1585;&#1611;&#1575; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And whoever contradicts and opposes the Messenger after the right path has been shown clearly to him, <u>and follows other than the believers' way</u>, we shall keep him in the path he has chosen, and burn him in Hell - what an evil destination. (An-Nisa 4:115) </b><img src='images/qnend.gif'></blockquote>    <P>
And the Scholar's, amongst them Imaam ash-Shaafi'ee (d. 204) have explained that this verse is a proof to follow the ijmaa' of the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>. As Allaah, in addition to mentioning contradictind and opposing the Messenger (alayhis salaam), He added, (<span class='arb'>&#1608;&#1614;&#1610;&#1614;&#1578;&#1617;&#1614;&#1576;&#1616;&#1593;&#1618; &#1594;&#1614;&#1610;&#1618;&#1585;&#1614; &#1587;&#1614;&#1576;&#1616;&#1610;&#1604;&#1616; &#1575;&#1604;&#1618;&#1605;&#1615;&#1572;&#1618;&#1605;&#1616;&#1606;&#1616;&#1610;&#1606;&#1614;</span>), "... <i>and follows a path other than the believer's way</i>...", and this way is explained in other verses and <i>ahaadeeth</i>, as being that which the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> were upon in their <i>fahm</i> (understanding) and implementation of the religion.    <P>
Also the saying of Allaah, the Most High:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1575;&#1604;&#1587;&#1617;&#1614;&#1575;&#1576;&#1616;&#1602;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1571;&#1614;&#1608;&#1617;&#1614;&#1604;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1615;&#1607;&#1614;&#1575;&#1580;&#1616;&#1585;&#1616;&#1610;&#1606;&#1614; &#1608;&#1614;&#1575;&#1604;&#1571;&#1614;&#1606;&#1589;&#1614;&#1575;&#1585;&#1616; &#1608;&#1614;&#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1575;&#1578;&#1617;&#1614;&#1576;&#1614;&#1593;&#1615;&#1608;&#1607;&#1615;&#1605; &#1576;&#1616;&#1573;&#1616;&#1581;&#1618;&#1587;&#1614;&#1575;&#1606;&#1613; &#1585;&#1617;&#1614;&#1590;&#1616;&#1610;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1593;&#1614;&#1606;&#1618;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1585;&#1614;&#1590;&#1615;&#1608;&#1575;&#1618; &#1593;&#1614;&#1606;&#1618;&#1607;&#1615; &#1608;&#1614;&#1571;&#1614;&#1593;&#1614;&#1583;&#1617;&#1614; &#1604;&#1614;&#1607;&#1615;&#1605;&#1618; &#1580;&#1614;&#1606;&#1617;&#1614;&#1575;&#1578;&#1613; &#1578;&#1614;&#1580;&#1618;&#1585;&#1616;&#1610; &#1578;&#1614;&#1581;&#1618;&#1578;&#1614;&#1607;&#1614;&#1575; &#1575;&#1604;&#1571;&#1614;&#1606;&#1618;&#1607;&#1614;&#1575;&#1585;&#1615; &#1582;&#1614;&#1575;&#1604;&#1616;&#1583;&#1616;&#1610;&#1606;&#1614; &#1601;&#1616;&#1610;&#1607;&#1614;&#1575; &#1571;&#1614;&#1576;&#1614;&#1583;&#1611;&#1575; &#1584;&#1614;&#1604;&#1616;&#1603;&#1614; &#1575;&#1604;&#1618;&#1601;&#1614;&#1608;&#1618;&#1586;&#1615; &#1575;&#1604;&#1618;&#1593;&#1614;&#1592;&#1616;&#1610;&#1605;&#1615; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And the first (to embrace Islaam) of the Muhaajiroon (those who migrated from Makkah to al-Madinah) and the Ansaar (the citizens of al-Madinah who helped and gave aid to the Muhaajiroon) <u>and also those who followed them exactly (in Faith) [thereafter]</u>. Allaah is well-pleased with them as they are well-pleased with Him. He has prepared for them Gardens under which rivers flow (Paradise), to dwell therein forever. That is the supreme success.  (At-Tawbah 9:100) </b><img src='images/qnend.gif'></blockquote>    <P>
So in this verse, Allaah mentioned, those who followed the Muhaajireen and the Ansaar upon <i><a href='tags/ihsaan.html' class='tagLink'><font class='tagLink'>Ihsaan</font></a></i> (goodness), which means the <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a> and the deen, and ash-Shawkaanee explains in Fath ul-Qadeer (2/398), that this refers to "...<i>those <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> who came after them (the Muhaajireen and the Ansaar) and whoever came after them right until the Day of Judgement</i>."    <P>
And also the saying of Allaah, the Most High:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1580;&#1614;&#1575;&#1572;&#1615;&#1608;&#1575; &#1605;&#1616;&#1606; &#1576;&#1614;&#1593;&#1618;&#1583;&#1616;&#1607;&#1616;&#1605;&#1618; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1615;&#1608;&#1606;&#1614; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1604;&#1616;&#1573;&#1616;&#1582;&#1618;&#1608;&#1614;&#1575;&#1606;&#1616;&#1606;&#1614;&#1575; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1587;&#1614;&#1576;&#1614;&#1602;&#1615;&#1608;&#1606;&#1614;&#1575; &#1576;&#1616;&#1575;&#1604;&#1618;&#1573;&#1616;&#1610;&#1605;&#1614;&#1575;&#1606;&#1616; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618; &#1601;&#1616;&#1610; &#1602;&#1615;&#1604;&#1615;&#1608;&#1576;&#1616;&#1606;&#1614;&#1575; &#1594;&#1616;&#1604;&#1617;&#1611;&#1575; &#1604;&#1617;&#1616;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1570;&#1605;&#1614;&#1606;&#1615;&#1608;&#1575; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1573;&#1616;&#1606;&#1617;&#1614;&#1603;&#1614; &#1585;&#1614;&#1572;&#1615;&#1608;&#1601;&#1612; &#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1612; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And those who came after them say: "Our Lord! Forgive us and our brethren <u>who have preceded us in <a href='tags/faith.html' class='tagLink'><font class='tagLink'>faith</font></a> (<a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a>)</u>, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.  (Al-Hashr 59:10) </b><img src='images/qnend.gif'></blockquote>    <P>
And those being referred to here are the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> (radiallaahu anhum) who preceded the whole Ummah in <a href='tags/faith.html' class='tagLink'><font class='tagLink'>faith</font></a> (<a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a>) which is the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and what follows on from it of speech and action. In this verse is a praise of those who come after the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>, recognize the virtue of the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> and their precedence in <a href='tags/faith.html' class='tagLink'><font class='tagLink'>faith</font></a>, make supplication for them, and they do not harbour any ill-will or hatred towards the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>. And this is in indication of the obligation to follow the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> in their <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a> (<a href='tags/faith.html' class='tagLink'><font class='tagLink'>faith</font></a>), which is the Islamic <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and whatever follows on from it of speech and action.    <P>
And also the saying of Allaah, the Most High:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1601;&#1614;&#1573;&#1616;&#1606;&#1618; &#1570;&#1605;&#1614;&#1606;&#1615;&#1608;&#1575;&#1618; &#1576;&#1616;&#1605;&#1616;&#1579;&#1618;&#1604;&#1616; &#1605;&#1614;&#1575; &#1570;&#1605;&#1614;&#1606;&#1578;&#1615;&#1605; &#1576;&#1616;&#1607;&#1616; &#1601;&#1614;&#1602;&#1614;&#1583;&#1616; &#1575;&#1607;&#1618;&#1578;&#1614;&#1583;&#1614;&#1608;&#1575;&#1618; &#1608;&#1617;&#1614;&#1573;&#1616;&#1606; &#1578;&#1614;&#1608;&#1614;&#1604;&#1617;&#1614;&#1608;&#1618;&#1575;&#1618; &#1601;&#1614;&#1573;&#1616;&#1606;&#1617;&#1614;&#1605;&#1614;&#1575; &#1607;&#1615;&#1605;&#1618; &#1601;&#1616;&#1610; &#1588;&#1616;&#1602;&#1614;&#1575;&#1602;&#1613; &#1601;&#1614;&#1587;&#1614;&#1610;&#1614;&#1603;&#1618;&#1601;&#1616;&#1610;&#1603;&#1614;&#1607;&#1615;&#1605;&#1615; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1608;&#1614;&#1607;&#1615;&#1608;&#1614; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1616;&#1610;&#1593;&#1615; &#1575;&#1604;&#1618;&#1593;&#1614;&#1604;&#1616;&#1610;&#1605;&#1615; <img src='images/qnend.gif'></div>    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> <u>So if they believe with the like of that which you believe, then they are rightly guided</u>, but if they turn away, then they are only in opposition. So Allaah will suffice you against them. And He is the All-Hearer, the All-Knower. Al-Baqarah (2):137  </b><img src='images/qnend.gif'></blockquote>    <P>
Although this verse was revealed in relation to the <a href='tags/people-of-the-book.html' class='tagLink'><font class='tagLink'>People of the Book</font></a> (Jews and Christians), there is an accepted and agreed upon principle in tafseer amongst the Scholars of tafseer that the meanings of the verses are not restricted to their specific causes of revelation, but also carry the general meaning afforded by their wording. This verse constitutes a proof that only those are guided <u>who believe with that specific belief of the Companions</u>, because in this verse Allaah stated, (<span class='arb'>&#1601;&#1614;&#1573;&#1616;&#1606;&#1618; &#1570;&#1605;&#1614;&#1606;&#1615;&#1608;&#1575;&#1618; &#1576;&#1616;&#1605;&#1616;&#1579;&#1618;&#1604;&#1616; &#1605;&#1614;&#1575; &#1570;&#1605;&#1614;&#1606;&#1578;&#1615;&#1605; &#1576;&#1616;&#1607;&#1616;</span>), "<i>If they believe with the like of what you <u>(i.e. the Prophet and His Companions)</u> believe</i>...", the pronoun is in the <u>2nd person plural</u>, which indicates the Prophet and his <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>. For this reason, those who depart from the belief (aqidah and eemaan) of the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>, then they are not rightly guided and are in opposition.    <P>
Then what occurs in the Sunnah, from the hadeeth of Imraan bin Hussain, that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1582;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1602;&#1585;&#1606;&#1610; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The best of people is  my generation, then those that follow them, then those that follow them.</blockquote>    <P>
And al-Bukhaaree narrates the hadeeth of Abu Burdah al-Aslamee that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1582;&#1610;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1605;&#1577; &#1575;&#1604;&#1602;&#1585;&#1606; &#1575;&#1604;&#1584;&#1610; &#1576;&#1593;&#1579;&#1578; &#1601;&#1610;&#1607;&#1605; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1563; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1548; &#1579;&#1605; &#1610;&#1603;&#1608;&#1606; &#1601;&#1610;&#1607;&#1605; &#1602;&#1608;&#1605; &#1578;&#1587;&#1576;&#1602; &#1588;&#1607;&#1575;&#1583;&#1578;&#1607;&#1605; &#1571;&#1610;&#1605;&#1575;&#1606;&#1607;&#1605; &#1608;&#1571;&#1610;&#1605;&#1575;&#1606;&#1607;&#1605; &#1588;&#1607;&#1575;&#1583;&#1578;&#1607;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The best of this Ummah is the generation to which I have been sent. Then those who come after them, then those who come after them, then those who come after them. Then there will come a people whose witness precedes their oaths, or their oaths precede their witness.</blockquote>    <P>
And in the <i>hasan</i> hadeeth narrated by at-Tirmidhee:    <P>
<div class='arabic' align='right'>&#1608;&#1578;&#1601;&#1578;&#1585;&#1602; &#1571;&#1605;&#1578;&#1610; &#1593;&#1604;&#1609; &#1579;&#1604;&#1575;&#1579; &#1608;&#1587;&#1576;&#1593;&#1610;&#1606; &#1601;&#1585;&#1602;&#1577; &#1548; &#1603;&#1604;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; &#1573;&#1604;&#1575; &#1608;&#1575;&#1581;&#1583;&#1577; " &#1601;&#1602;&#1610;&#1604; &#1604;&#1607; : &#1605;&#1575; &#1575;&#1604;&#1608;&#1575;&#1581;&#1583;&#1577; &#1567; &#1602;&#1575;&#1604; : " &#1605;&#1575; &#1571;&#1606;&#1575; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1610;&#1608;&#1605; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1610;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And my ummah will split into seventy-three sects, all of them in the Fire except for one. So it was said to him, "What is this one?". He said: That which I am and my <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> are upon today.</blockquote>    <P>
And Abdullaah bin Mas'ood narrates, as reported by <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a>, an-Nasaa'ee and others:    <P>
<div class='arabic' align='right'>&#1582;&#1591; &#1604;&#1606;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; - &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; - &#1582;&#1591;&#1575; &#1601;&#1602;&#1575;&#1604;: &#1607;&#1584;&#1575; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1604;&#1607;&#1548; &#1579;&#1605; &#1582;&#1591; &#1582;&#1591;&#1608;&#1591;&#1575; &#1593;&#1606; &#1610;&#1605;&#1610;&#1606;&#1607; &#1608;&#1593;&#1606; &#1588;&#1605;&#1575;&#1604;&#1607; &#1579;&#1605; &#1602;&#1575;&#1604;: &#1607;&#1584;&#1607; &#1587;&#1615;&#1576;&#1604; &#1605;&#1578;&#1601;&#1585;&#1602;&#1577;&#1548; &#1593;&#1604;&#1609; &#1603;&#1604; &#1587;&#1576;&#1610;&#1604; &#1605;&#1606;&#1607;&#1575; &#1588;&#1610;&#1591;&#1575;&#1606; &#1610;&#1583;&#1593;&#1608; &#1573;&#1604;&#1610;&#1607;&#1548; &#1579;&#1605; &#1578;&#1604;&#1575; &#1608;&#1614;&#1571;&#1614;&#1606;&#1617;&#1614; &#1607;&#1614;&#1584;&#1614;&#1575; &#1589;&#1616;&#1585;&#1614;&#1575;&#1591;&#1616;&#1610; &#1605;&#1615;&#1587;&#1618;&#1578;&#1614;&#1602;&#1616;&#1610;&#1605;&#1611;&#1575; &#1601;&#1614;&#1575;&#1578;&#1617;&#1614;&#1576;&#1616;&#1593;&#1615;&#1608;&#1607;&#1615; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1578;&#1617;&#1614;&#1576;&#1616;&#1593;&#1615;&#1608;&#1575; &#1575;&#1604;&#1587;&#1617;&#1615;&#1576;&#1615;&#1604;&#1614; &#1601;&#1614;&#1578;&#1614;&#1601;&#1614;&#1585;&#1617;&#1614;&#1602;&#1614; &#1576;&#1616;&#1603;&#1615;&#1605;&#1618; &#1593;&#1614;&#1606;&#1618; &#1587;&#1614;&#1576;&#1616;&#1610;&#1604;&#1616;&#1607;&#1616;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Messenger of Allaah (sallallaahu alayhi wasallam) drew for us a line (in the sand), and then said: "This is the path of Allaah", then he drew lines to the right and to the left, and then said: "These are different ways, upon each of these is a devil calling to it." Then he recited:    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And verily, this is my Straight Path, so follow it, and follow not (other) paths, for they will separate you away from His Path. (Al-An'am 6:153) </b><img src='images/qnend.gif'></blockquote>  </blockquote>    <P>
This hadeeth, in light of the previous ones, proves and shows that the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> were the ones who were not upon any path except that which the Prophet (alayhis salaam) came with, and they were the ones who were sound and safe in their religion, the foundation of which is the <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>, and were the united <i>jamaa'ah</i>.    <P>
<b><u>Warning Against Innovation and Its People</u></b>    <P>
The Prophet (alayhis salaam), after informing about the splitting of the Ummah, cautioned against the underlying causes and reasons for that, <u>from the greatest of them being inovations into the religion</u>. For this reason, there is found an abundance of warnings in the Prophetic Sunnah in this regard, and from them, for the sake of brevity:    <P>
The famous hadeeth of al-Irbaad bin Saariyah (radiallaahu anhu) in which he narrates from the Prophet (alayhis salaam):    <P>
<div class='arabic' align='right'>&#1571;&#1608;&#1589;&#1610;&#1603;&#1605; &#1576;&#1578;&#1602;&#1608;&#1609; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1608;&#1573;&#1606; &#1593;&#1576;&#1583;&#1575; &#1581;&#1576;&#1588;&#1610;&#1575; &#1601;&#1573;&#1606;&#1607; &#1605;&#1606; &#1610;&#1593;&#1588; &#1605;&#1606;&#1603;&#1605; &#1576;&#1593;&#1583;&#1610; &#1601;&#1587;&#1610;&#1585;&#1609; &#1575;&#1582;&#1578;&#1604;&#1575;&#1601;&#1575; &#1603;&#1579;&#1610;&#1585;&#1575; &#1601;&#1593;&#1604;&#1610;&#1603;&#1605; &#1576;&#1587;&#1606;&#1578;&#1610; &#1608;&#1587;&#1606;&#1577; &#1575;&#1604;&#1582;&#1604;&#1601;&#1575;&#1569; &#1575;&#1604;&#1605;&#1607;&#1583;&#1610;&#1610;&#1606; &#1575;&#1604;&#1585;&#1575;&#1588;&#1583;&#1610;&#1606; &#1578;&#1605;&#1587;&#1603;&#1608;&#1575; &#1576;&#1607;&#1575; &#1608;&#1593;&#1590;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607;&#1575; &#1576;&#1575;&#1604;&#1606;&#1608;&#1575;&#1580;&#1584; &#1608;&#1573;&#1610;&#1575;&#1603;&#1605; &#1608;&#1605;&#1581;&#1583;&#1579;&#1575;&#1578; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1601;&#1573;&#1606; &#1603;&#1604; &#1605;&#1581;&#1583;&#1579;&#1577; &#1576;&#1583;&#1593;&#1577; &#1608;&#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1590;&#1604;&#1575;&#1604;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I advise you with the taqwaa of Allaah, and to hear and obey (your leader), even if he is an Abysinnian slave. For verily, whoever amongst you lives for long after me will see great differences. So upon you is to follow my Sunnah and the Sunnah of my rightly-guided successors (caliphs). Hold fast to it (the Sunnah) and bite onto it with your molar-teeth. And beware of the newly-invented matters, <b>for every newly-invented matter is misguidance</b>.</blockquote>    <P>
The hadeeth of Aa'ishah (radiallaahu anhaa) related by al-Bukhaaree and Muslim, that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1605;&#1606; &#1571;&#1581;&#1583;&#1579; &#1601;&#1610; &#1571;&#1605;&#1585;&#1606;&#1575; &#1607;&#1584;&#1575; &#1605;&#1575; &#1604;&#1610;&#1587; &#1605;&#1606;&#1607; &#1601;&#1607;&#1608; &#1585;&#1583;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Whoever introduced into this affair of ours (i.e. Islaam), that which is not from it, will have it rejected.</blockquote>    <P>
And also from Aa'ishah (radiallaahu anhaa) as related by Muslim, that the Prophet (alayhis salaam) said:     <P>
<div class='arabic' align='right'>&#1605;&#1606; &#1593;&#1605;&#1604; &#1593;&#1605;&#1604;&#1575;&#1611; &#1604;&#1610;&#1587; &#1593;&#1604;&#1610;&#1607; &#1571;&#1605;&#1585;&#1606;&#1575; &#1601;&#1607;&#1608; &#1585;&#1583;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Whoever does an action which our affair is not in agreement with, will have it rejected.</blockquote>    <P>
And then this matter became known and established with the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> (radiallaahu anhum) and those following in their way:    <P>
<blockquote>Ibn Abbaas (d. 68H) said: "<i>Indeed the most detestable of things to Allaah are the innovations</i>." Reported by al-Bayhaqee in as-Sunan al-Kubraa (4/316). Al-Hasan al-Basree (d. 110H) said: "<i>Do not sit with the people of innovation and desires, nor argue with them, nor listen to them</i>." Reported by <a href='tags/al-laalikaaee.html' class='tagLink'><font class='tagLink'>al-Laalikaa'ee</font></a> in Sharh Usool ul-I'tiqaad (no.267). Al-Fudayl bin 'Iyaad (d. 187H) said: "<i>I met the best of people, all of them people of the Sunnah and they used to forbid from accompanying the people of innovation</i>." Reported by <a href='tags/al-laalikaaee.html' class='tagLink'><font class='tagLink'>al-Laalikaa'ee</font></a> in Sharh Usool ul-Iýtiqaad (no.267). Ibraaheem bin Maysarah (d.132H) said: "<i>Whoever honours an innovator has aided in the destruction of Islam</i>." Reported by <a href='tags/al-laalikaaee.html' class='tagLink'><font class='tagLink'>al-Laalikaa'ee</font></a> (1/139). Sufyaan ath-Thawree (d. 161H) said: "<i>Whoever listens to an innovator has left the protection of Allaah and is entrusted with the innovation</i>." Reported by Abu Nu'aym in al-Hilyah (7/26) and Ibn Battah (no.444). Imaam Maalik (d. 179H) said: "<i>How evil are the people of innovation, we do not give them salaam</i>." Reported by al-Baghawee in <a href='tags/sharh-us-sunnah.html' class='tagLink'><font class='tagLink'>Sharh us-Sunnah</font></a> (1/234).</blockquote>    <P>
Ath-Thaabit bin al-Ajlaan said, as occurs in <i>Sharh Usool ul-I'tiqaad of al-Laalikaa'ee</i> (no.239):     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I met Anas bin Maalik, Ibn al-Musayyab, al-Hasan al-Basree, Sa'eed bin Jubair, ash-Sha'bee, Ibraaheem an-Nakha'ee, Ataa' bin Abee Riyaah, Taawoos, Mujaahid, Abdullaah bin Abee Mulaikah, az-Zuhree, Makhool, al-Qaasim Abu Abdur-Rahmaan, Ataa' al-Khurasaanee, Thaabit al-Banaanee, al-Hakam bin Utbah, Ayyoob as-Sakhtiyaanee, Hammaad bin Muhammad bin Seereen, Abu Aamir - and he had actually met Abu Bakr as-Siddeeq - Yazeed ar-Riqaashee, and Sulaimaan bin Moosaa, all of them were ordering me [to hold on to] the Jamaa'ah and forbidding me from the the People of Desires (i.e  Innovations).</blockquote>    <P>
Imaam <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a> said in the opening of his treatise "<i><a href='tags/usool-us-sunnah.html' class='tagLink'><font class='tagLink'>Usool us-Sunnah</font></a></i>":    <P>
<div class='arabic' align='right'>&#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1593;&#1606;&#1583;&#1606;&#1575;: &#1575;&#1604;&#1578;&#1605;&#1587;&#1603; &#1576;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; - &#1608;&#1575;&#1604;&#1575;&#1602;&#1578;&#1583;&#1575;&#1569; &#1576;&#1607;&#1605;&#1548; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1601;&#1607;&#1610; &#1590;&#1604;&#1575;&#1604;&#1577;&#1548; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1582;&#1589;&#1608;&#1605;&#1575;&#1578; &#1608;&#1575;&#1604;&#1580;&#1604;&#1608;&#1587; &#1605;&#1593; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The foundational principles of the Sunnah with us  are: Holding fast to what the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a>  of the Messenger of Allaah were upon. Taking them [and their way] as a model to be followed. The abandonment of <a href='tags/innovations.html' class='tagLink'><font class='tagLink'>innovations</font></a>, and every innovation is misguidance. The abandonment of controversies and the abandonment of sitting with the people of ahwaa (desires).  </blockquote>    <P>
Imaam <a href='tags/al-barbahaaree.html' class='tagLink'><font class='tagLink'>Al-<a href="tags/barbahaaree.html" class="tagLink"><font class="tagLink">barbahaaree</font></a></font></a> (d. 329H) said in his "<i><a href='tags/sharh-us-sunnah.html' class='tagLink'><font class='tagLink'>Sharh us-Sunnah</font></a></i>":    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1571;&#1587;&#1575;&#1587; &#1575;&#1604;&#1584;&#1610; &#1578;&#1576;&#1606;&#1609; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1607;&#1605; &#1571;&#1589;&#1581;&#1575;&#1576; &#1605;&#1581;&#1605;&#1583; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;- &#1608;&#1585;&#1581;&#1605;&#1607;&#1605; &#1575;&#1604;&#1604;&#1607; &#1571;&#1580;&#1605;&#1593;&#1610;&#1606;&#1548; &#1608;&#1607;&#1605; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1601;&#1605;&#1606; &#1604;&#1605; &#1610;&#1571;&#1582;&#1584; &#1593;&#1606;&#1607;&#1605;&#1548; &#1601;&#1602;&#1583; &#1590;&#1604; &#1608;&#1575;&#1576;&#1578;&#1583;&#1593;&#1548; &#1608;&#1603;&#1604; &#1576;&#1583;&#1593;&#1577; &#1590;&#1604;&#1575;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1590;&#1604;&#1575;&#1604;&#1577; &#1608;&#1571;&#1607;&#1604;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the foundation upon which the <i>Jamaa'ah</i> (united body of Muslims) is built, is the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> of Muhammad (sallallaahu alayhi wasallam), and may Allaah have mercy upon them all, they are <i>Ahl us-Sunnah wal-Jamaa'ah</i>. So whoever does not take from them, then he is strayed and innovated, and every innovation is misguidance, and misguidance and its people are in the Hellfire.</blockquote>    <P>
These are just a sample of the texts relating to this subject  which indicate that the deen of <a href='tags/islaam.html' class='tagLink'><font class='tagLink'>Islaam</font></a> was pristine and pure and the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> adhered firmly to it, and because of this, <u>they were given strength, victory, authority, honour and might</u>, to such a level that they conquered the East and the West. And it was nothing but the sound pristine <a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> and <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a> they upheld that resulted in this. These texts also illustrate how the <a href='tags/companions.html' class='tagLink'><font class='tagLink'>Companions</font></a> and their followers understood what was contained in the Prophetic Sunnah of warning against innovation and its people and their role in corroding Islam and splitting the Ummah and plundering its unity, and breaking the handholds of <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a> (<a href='tags/faith.html' class='tagLink'><font class='tagLink'>faith</font></a>).    <P>
    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/flqoi-the-splitting-of-the-muslim-ummah-part-4.html">The Splitting of the Muslim Ummah: Part 4 - The Preservation and Safeguarding of the Islamic Aqidah</a><BR>
https://www.aqidah.com/creed/?flqoi<BR>

<li><a href="articles/hxnhe-the-splitting-of-the-muslim-ummah-part-3.html">The Splitting of the Muslim Ummah: Part 3 - An Overview of the Various Deviant Sects and Corrupt Creeds and Methodologies</a><BR>
https://www.aqidah.com/creed/?hxnhe<BR>

<li><a href="articles/vqlrf-the-splitting-of-the-muslim-ummah-part-2.html">The Splitting of the Muslim Ummah: Part 2 - The Emergence of the Sects and the Heads of Misguidance</a><BR>
https://www.aqidah.com/creed/?vqlrf<BR>

<li><a href="articles/oeotc-glimpses-into-the-splitting-of-the-muslim-ummah-part-1.html">The Splitting of the Muslim Ummah: Part 1 - The Completion and Perfection of the Religion and The Way of the Companions</a><BR>
https://www.aqidah.com/creed/?oeotc<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?oeotc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
</html>


