

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?krnsa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Aqidah.Com | The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of Allaah's Nuzool Without Kayf</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of Allaah's Nuzool Without Kayf</span><BR>
Saturday, December 12 2009 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Aqidah.Com</b>
<hr size="1" noshade>



<div class="articleContent">
<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>I'tiqaad Ahl is-Sunnah</font>    <P>
<img src=assets/images/ismaaeelee-manuscript.gif align=right hspace=4 border=0>The Book "I'tiqaad Ahl is-Sunnah" (manuscript copy sample, first page, to the right) is authentically ascribed to <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a>, and it has been mentioned by Abu Uthmaan as-Saaboonee (d. 449H) in his book "Aqeedat us-Salaf wa Ashaabil-Hadeeth", and likewise by Ibn Rajab al-Hanbali in "Jaami al-Uloom wal-Hikam", referring to it as "the risaalah of <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> to the people of the mountain." The book has a connected chain of narration to its author and it has been narrated with its chain by Ibn Qudaamah al-Maqdisi in "Dhamm ut-Ta'weel", ad-Dhahabi in "<a href="tags/al-uluww.html" class="tagLink"><font class="tagLink">al-Uluww</font></a>", and in "Tadhkirat ul-Huffaadh" and "Siyar". And in his book "al-Arba'een Fee Sifaati Rabbil-Aalameen", adh-Dhahabee says, "And this <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> (al-mu'taqad), we have heard this from him with a saheeh isnaad (authentic chain of narration)" (p. 118). The book also has three hearings (samaa') in the years 574H, 617H, and 667H, the details of which are found in the manuscripts. So the book is firmly established and corroborated as being the work of <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a>. In these articles we will be quoting from the tahqeeq of Jamaal Azzoon, first edition, 1999, Dar Ibn Hazm.    <P>
<font class='titleHeadline'>Brief Note Regarding <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> and the Contemporary <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> Parading Under the Label of "Ash'ariyyah"</font>    <P>
We see these spurious, fraudulent lists of so called "Ash'ari" Scholars being circulated and spread on blogs and websites, with an impressive array of names mentioned therein, and Abu Bakr al-Ismaa'eelee's name is often found in these lists. This is one of the greatest of frauds being perpetrated by the Jahmite Machinery that has taken on the label of "Ash'ariyyah" in the 20th and 21st century. Whilst this is not the place to digress away from the subject of this article, let it be known that <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> was a Salafi, Sunni, Athari (all synonymous terms representing only one approach and one aqidah) and his <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> is in opposition to the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> Ash'ariyyah. He affirmed Allaah's Uluww, with His Essence, affirmed the attributes of Face, Hands, Eyes, and affirms that the Names of Allaah are not created (unlike the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> and Ash'ariyyah - <a href=http://www.asharis.com/creed/?msfeb>see here</a>), and affirmed that this <a href='tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> present with us is uncreated, and opposes the Lafdhiyyah <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> (i.e. Ash'ariyyah) who say that al-lafdh al-maqroo' is created (<a href=http://www.asharis.com/creed/?bxzbp>see here</a>). And he opposed the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and Ash'ariyyah on the subject of <a href='tags/eemaan.html' class='tagLink'><font class='tagLink'>Eemaan</font></a>, affirming that it is belief and action, that it increases and decreases. And further he affirms the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, without takyeef or ta'weel or tafweed, on account of it being reported in the authentic narrations. Inshaa'Allaah these details of belief from <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> will be the subject of this series of articles. We demand the contemporary <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> <a href=http://www.asharis.com/creed/?ovpij>to abide by the criterion</a> laid out <a href=http://www.asharis.com/creed/?ovpij>in this article</a> when imputing Ash'ariyyah to any Scholar.    <P>
<font class='titleHeadline'>Abu Bakr al-Ismaa'eelee And Affirmation of Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> Without Kayf And His Affirmation Of the <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of the Messenger, In Opposition to the Negation of So Called "Hawaadith" (Events) Which Is the Pole and Axis of the <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of al-Jawhar wal-'Arad</font>    <P>
Abu Bakr al-Ismaa'eelee said:    <P>
<img src=assets/images/ismaaeelee-nuzool.gif border=0>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And that He, the Mighty and Majestic, descends to the heaven [based upon] the report that is authentic from the Messenger of Allaah, without holding belief in a kayf regarding it.</blockquote>    <P>
The hadeeth regarding the <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> are firmly established and collected by al-Bukhaaree,  Muslim and others, and the Ummah has taken them with acceptance and submission, with the exception of those in whose hearts is perversion. So he has affirmed that this is what Ahl us-Sunnah who have preceded him believe in, and he is simply conveying their <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a>, saying what they say.    <P>
<font class='titleHeadline'>Abu Uthmaan as-Saaboonee (d. 449H) on Affirmation of Allaah's <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> Without Kayf</font>    <P>
Abu Uthmaan as-Saaboonee (d. 449) said in his book "<i>Aqidah as-Salaf wa As.haab il-Hadeeth</i>" (tahqeeq Nasir al-Judai', p. 192):    <P>
<div class='arabic' align='right'>&#1608;&#1602;&#1585;&#1571;&#1578; &#1601;&#1610; &#1585;&#1587;&#1575;&#1604;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1575;&#1604;&#1573;&#1587;&#1605;&#1575;&#1593;&#1610;&#1604;&#1610; &#1573;&#1604;&#1609; &#1571;&#1607;&#1604; &#1580;&#1610;&#1604;&#1575;&#1606; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1610;&#1606;&#1586;&#1604; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1593;&#1604;&#1609; &#1605;&#1575; &#1589;&#1581; &#1576;&#1607; &#1575;&#1604;&#1582;&#1576;&#1585; &#1593;&#1606; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1602;&#1583; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604;: (&#1607;&#1604; &#1610;&#1606;&#1592;&#1585;&#1608;&#1606; &#1573;&#1604;&#1575; &#1571;&#1606; &#1610;&#1571;&#1578;&#1610;&#1607;&#1605; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1592;&#1604;&#1604; &#1605;&#1606; &#1575;&#1604;&#1594;&#1605;&#1575;&#1605;) &#1608;&#1602;&#1575;&#1604;: (&#1608;&#1580;&#1575;&#1569; &#1585;&#1576;&#1603; &#1608;&#1575;&#1604;&#1605;&#1604;&#1603; &#1589;&#1601;&#1575; &#1589;&#1601;&#1575;) &#1608;&#1606;&#1572;&#1605;&#1606; &#1576;&#1584;&#1604;&#1603; &#1603;&#1604;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601;&#1548; &#1601;&#1604;&#1608; &#1588;&#1575;&#1569; &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1571;&#1606; &#1610;&#1576;&#1610;&#1606; &#1604;&#1606;&#1575; &#1603;&#1610;&#1601;&#1610;&#1577; &#1584;&#1604;&#1603; &#1601;&#1593;&#1604;&#1548; &#1601;&#1575;&#1606;&#1578;&#1607;&#1610;&#1606;&#1575; &#1573;&#1604;&#1609; &#1605;&#1575; &#1571;&#1581;&#1603;&#1605;&#1607;&#1548; &#1608;&#1603;&#1601;&#1601;&#1606;&#1575; &#1593;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1578;&#1588;&#1575;&#1576;&#1607; &#1573;&#1584; &#1603;&#1606;&#1575; &#1602;&#1583; &#1571;&#1605;&#1585;&#1606;&#1575; &#1576;&#1607; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1593;&#1586; &#1608;&#1580;&#1604;: (&#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1571;&#1606;&#1586;&#1604; &#1593;&#1604;&#1610;&#1603; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1605;&#1606;&#1607; &#1570;&#1610;&#1575;&#1578; &#1605;&#1581;&#1603;&#1605;&#1575;&#1578; &#1607;&#1606; &#1571;&#1605; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576;&#1548; &#1608;&#1571;&#1582;&#1585; &#1605;&#1578;&#1588;&#1575;&#1576;&#1607;&#1575;&#1578; &#1601;&#1571;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610;&#1606; &#1601;&#1610; &#1602;&#1604;&#1608;&#1576;&#1607;&#1605; &#1586;&#1610;&#1594; &#1601;&#1610;&#1578;&#1576;&#1593;&#1608;&#1606; &#1605;&#1575; &#1578;&#1588;&#1575;&#1576;&#1607; &#1605;&#1606;&#1607;&#1548; &#1575;&#1576;&#1578;&#1594;&#1575;&#1569; &#1575;&#1604;&#1601;&#1578;&#1606;&#1577; &#1608;&#1575;&#1576;&#1578;&#1594;&#1575;&#1569; &#1578;&#1571;&#1608;&#1610;&#1604;&#1607;&#1548; &#1608;&#1605;&#1575; &#1610;&#1593;&#1605; &#1578;&#1571;&#1608;&#1610;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1575;&#1604;&#1585;&#1575;&#1587;&#1582;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1593;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1570;&#1605;&#1606;&#1575; &#1576;&#1607; &#1603;&#1604; &#1605;&#1606; &#1593;&#1606;&#1583; &#1585;&#1576;&#1606;&#1575; &#1608;&#1605;&#1575; &#1610;&#1584;&#1603;&#1585; &#1573;&#1604;&#1575; &#1571;&#1608;&#1604;&#1608; &#1575;&#1604;&#1571;&#1604;&#1576;&#1575;&#1576;)    <P>
&#1571;&#1582;&#1576;&#1585;&#1606;&#1575; &#1571;&#1576;&#1608; &#1576;&#1603;&#1585; &#1576;&#1606; &#1586;&#1603;&#1585;&#1610;&#1575; &#1575;&#1604;&#1588;&#1610;&#1576;&#1575;&#1606;&#1610; &#1587;&#1605;&#1593;&#1578; : &#1571;&#1576;&#1575; &#1581;&#1575;&#1605;&#1583; &#1576;&#1606; &#1575;&#1604;&#1588;&#1585;&#1602;&#1610; &#1610;&#1602;&#1608;&#1604;: &#1587;&#1605;&#1593;&#1578;  &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1608;&#1571;&#1576;&#1575; &#1583;&#1575;&#1608;&#1583; &#1575;&#1604;&#1582;&#1601;&#1575;&#1580;&#1610; &#1610;&#1602;&#1608;&#1604;&#1575;&#1606;: &#1587;&#1605;&#1593;&#1606;&#1575; &#1573;&#1587;&#1581;&#1575;&#1602; &#1576;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1575;&#1604;&#1581;&#1606;&#1592;&#1604;&#1610;  &#1610;&#1602;&#1608;&#1604;: &#1602;&#1575;&#1604; &#1604;&#1610; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585; &#1593;&#1576;&#1583;&#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1591;&#1575;&#1607;&#1585;: &#1610;&#1575; &#1571;&#1576;&#1575; &#1610;&#1593;&#1602;&#1608;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1584;&#1610; &#1578;&#1585;&#1608;&#1610;&#1607; &#1593;&#1606; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; " &#1610;&#1606;&#1586;&#1604; &#1585;&#1576;&#1606;&#1575; &#1603;&#1604; &#1604;&#1610;&#1604;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575;. &#1603;&#1610;&#1601; &#1610;&#1606;&#1586;&#1604;&#1567; &#1602;&#1575;&#1604;&#1548; &#1602;&#1604;&#1578;: &#1571;&#1593;&#1586; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585;&#1548; &#1604;&#1575; &#1610;&#1602;&#1575;&#1604; &#1604;&#1571;&#1605;&#1585; &#1575;&#1604;&#1585;&#1576; &#1603;&#1610;&#1601;&#1567; &#1573;&#1606;&#1605;&#1575; &#1610;&#1606;&#1586;&#1604; &#1576;&#1604;&#1575; &#1603;&#1610;&#1601;.  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And I read in the risaalah of the Shaykh, <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> to the people of Jeelaan that Allaah, the Sublime, descends to the heaven [based upon] the report that is authentic from the Messenger of Allaah (sallallaahu alayhi wasallam).     <P>
And Allaah, the Mighty and Majestic has said:    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> Do they then wait for anything other than that Allaah should come to them in the shadows of the clouds and the angels?   (Al-Baqarah 2:210) </b><img src='images/qnend.gif'></blockquote>    <P>
And He said:    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> And your Lord comes with the angels in rows. (Al-Fajr 89:22) </b><img src='images/qnend.gif'></blockquote>    <P>
And we believe in all of upon the manner in which it has come (in these texts) without a kayf [asking or enquiring into the 'how']. If Allaah, the Sublime, had willed to explain the kaifiyyah of that to us, He would have done so. Thus, we stop at what He made precise and clear [i.e. the meaning], and we hold back from that which is ambiguous [i.e. the kaifiyyah], since we have been commanded with this in His, the Mighty and Majestic's saying:    <P>
<blockquote  class='quotequran'><img src='images/qnstart.gif'><b> It is He Who has sent down to you the Book. In it are Verses that are entirely clear, they are the foundations of the Book, and others not entirely clear. So as for those in whose hearts there is a deviation (from the truth) they follow that which is not entirely clear thereof, seeking tribulation and seeking for its explanation, but none knows its explanation save Allah. And those who are firmly grounded in knowledge say: "We believe in it; the whole of it (clear and unclear Verses) are from our Lord." And none receive admonition except men of understanding. (Aali Imran 3:7) </b><img src='images/qnend.gif'></blockquote>    <P>
Abu Bakr bin Zakariyyaa ash-Shaybaanee informed us; I heard Abu Haamid bin ash-Sharqee saying: I heard <a href='tags/ahmad.html' class='tagLink'><font class='tagLink'>Ahmad</font></a> as-Sullamee and Abu Dawud al-Khafaajee both saying: We heard Ishaaq bin Ibraaheem [ar-Raahawaih] al-Handhalee saying: The Ameer Abdullaah bin Taahir said to me: "O Abu Ya'qub, this hadeeth that you narrate from the Messenger of Allaah (sallallaahu alayhi wasallam): '<i>Our Lord descends every night to the lowest heaven</i>', how does He descend?". He [Ishaaq] said: I said: "May Allaah strengthen and honor the ameer. It is not said regarding the affair of the Lord, "how?" Verily, He descends without [specifying or asking about a] how.</blockquote>    <P>
The foundation of the <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of Ahl us-Sunnah and the Jamaa'ah of the Muslims is to affirm for Allaah whatever He or His Messenger affirmed for Him whilst negating takyeef and tashbeeh. This is the deen of the Muslims.    <P>
<font class='titleHeadline'>The Freedom of the Salaf, and the Generality of the Muslims From the Jawharist Kalaamists, the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a>, <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a>, <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a>, Ash'ariyyah, Maturidiyyah</font>    <P>
The foundation of the deen of the people of falsehood is to negate from him the qualities (<a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>Sifaat</font></a>), incidental attributes (a'raad) and events (hawaadith) of bodies (ajsaam, jawaahir) -  having used this properties of bodies as part of a proof of the createdness of the universe, demonstrated to the atheist philosophers, to whom these very words, terms, and classifications belong to in the first place.    <P>
Thus, the <u><a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a></u> and <u><a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a></u> (the pioneers of this proof) rejected any descriptions for Allaah, with the <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> appearing to affirm the Names but on the surface only, not in reality. They rejected any description for Allaah to avoid declaring Him a body (jism) through such attributions. And the <u><a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a></u> affirmed the Names and the <a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>Sifaat</font></a> dhaatiyyah (attributes of the Essence), but rejected the <a href='tags/sifaat.html' class='tagLink'><font class='tagLink'>Sifaat</font></a> fi'liyyah because they amount, in their view, to events (hawaadith). And the <u>Ash'ariyyah</u> simply popularized the deen of the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a>, and it took on the name of "Ash'ariyyah".     <P>
And those revealed texts which appeared to them to be what they called events (hawaadith), such as Allaah's istiwaa, <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a>, love, anger, pleasure and so on, they had to reject, because it clashed with this proof. Thus, they made ta'weel of these texts with what was unknown to the Salaf, and it was really the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> and <a href='tags/mutazilah.html' class='tagLink'><font class='tagLink'>Mu'tazilah</font></a> who pioneered the various ta'weels, and when this approach was not satisfactory to the <a href='tags/kullaabiyyah.html' class='tagLink'><font class='tagLink'>Kullaabiyyah</font></a> Ash'ariyyah, they innovated tafweed ("<i>Hey, the apparent, obvious meaning is not intended, and we don't know what these texts mean, these texts are just like a foreign alphabet to us, Allaah knows best what they mean</i>") and they tried to impute this to the Salaf, who are free of it - for the Salaf knew nothing of the "Tawheed of al-Jawhar wal-Arad" that these people are upon.    <P>
And all their arguments between each other <u>are simply on subsidiary issues</u> about what can and cannot be affirmed or denied for Allaah, without invalidating the intellectual proof (hudooth ul-ajsaam) that they are all united upon, or which is the common ground between them.    <P>
So we see that <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> affirms, like all the Salaf, the attribute of <a href='tags/nuzool.html' class='tagLink'><font class='tagLink'>Nuzool</font></a> whilst negating knowledge of a kayf, and he is not upon the falsehood of the Jawharists, whose speech regarding <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> is built around negating Aristotle's Ten Categories (al-Maqoolaat al-Ashar) from Allaah the Most High!    <P>
Ibn Suraij as-Shafi'ee (d. 306H) said, as narrated from him by Abu Ismaa'eel al-Harawi in "Dhamm ul-Kalaam" and as mentioned by <a href='tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> in "Bayaan Talbees al-Jahmiyyah":    <P>
<div class='arabic' align='right'> &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1588;&#1607;&#1583; &#1571;&#1606; &#1604;&#1575; &#1575;&#1604;&#1607; &#1575;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1606; &#1605;&#1581;&#1605;&#1583;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1608;&#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1607;&#1604; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604; &#1575;&#1604;&#1582;&#1608;&#1590; &#1601;&#1610; &#1575;&#1604;&#1571;&#1593;&#1585;&#1575;&#1590; &#1608;&#1575;&#1604;&#1571;&#1580;&#1587;&#1575;&#1605; &#1608;&#1575;&#1606;&#1605;&#1575; &#1576;&#1593;&#1579; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1576;&#1575;&#1606;&#1603;&#1575;&#1585; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of the people of knowledge and the jamaa'ah of the Muslims is "<i>I testify none is worthy of worship except Allaah (alone) and that Muhammad is the Messenger of Allaah</i>". And the <a href='tags/tawheed.html' class='tagLink'><font class='tagLink'>Tawheed</font></a> of the people of falsehood is disputing about al-a'raad (incidental attributes) and al-ajsaam (bodies) and the Prophet (sallallaahu alayhi wasallam) was sent with the rejection of that.</blockquote>    <P>
Imaam ash-Shaafi'ee (d. 204H) said, as reported by as-Suyuti in Sawn al-Mantiq (1/47-48):    <P>
<div class='arabic' align='right'>&#1605;&#1575;&#1580;&#1607;&#1604; &#1575;&#1604;&#1606;&#1575;&#1587; &#1608;&#1604;&#1575;&#1575;&#1582;&#1578;&#1604;&#1601;&#1608;&#1575; &#1573;&#1604;&#1575; &#1604;&#1578;&#1585;&#1603;&#1607;&#1605; &#1604;&#1587;&#1575;&#1606; &#1575;&#1604;&#1593;&#1585;&#1576; &#1608;&#1605;&#1610;&#1604;&#1607;&#1605; &#1573;&#1604;&#1609; &#1604;&#1587;&#1575;&#1606; &#1575;&#1585;&#1587;&#1591;&#1608;&#1591;&#1575;&#1604;&#1610;&#1587;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The people did not become ignorant and nor differ (with each other) except due to their abandonment of the language of the Arabs and their inclination to the language of Aristotle.</blockquote>    <P>
This statement of ash-Shaafi'ee (rahimahullaah) is true both in the affairs of <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> (<a href='tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a>) and in jurisprudence (fiqh), for both the metaphysics and the flawed syllogistic and other forms of logic of Aristotle corrupted both of these disciplines for those who turned to the language, logic and metaphysics of Aristotle.     <P>
From all the above, it is established that <a href='tags/abu-bakr-al-ismaaeelee.html' class='tagLink'><font class='tagLink'>Abu Bakr al-Ismaa'eelee</font></a> is free of the <a href='tags/jahmiyyah.html' class='tagLink'><font class='tagLink'>Jahmiyyah</font></a> who spuriously impute "Ash'ariyyah" to him by including him those long lists of so called "Ash'ari" scholars.    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="articles/mahrq-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Eemaan is Speech and Action, It Increases and Decreases, and the Believers Excel Over Each Other With Respect to Their Eemaan</a><BR>
https://www.aqidah.com/creed/?mahrq<BR>

<li><a href="articles/krnsa-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah-affirmation-of-allaahs-nuzool-without-kayf.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of Allaah's Nuzool Without Kayf</a><BR>
https://www.aqidah.com/creed/?krnsa<BR>

<li><a href="articles/qveea-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: There is Only One Qur'an and No Matter How It is Conveyed, It Is Not Created</a><BR>
https://www.aqidah.com/creed/?qveea<BR>

<li><a href="articles/ebnfr-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: The Names of Allaah Are Not Created</a><BR>
https://www.aqidah.com/creed/?ebnfr<BR>

<li><a href="articles/gfpqi-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of the Sifaat Dhaatiyyah Without Distinguishing Between Them</a><BR>
https://www.aqidah.com/creed/?gfpqi<BR>

<li><a href="articles/dqxkb-the-creed-of-abu-bakr-al-ismaaeelee-d-371h-and-refutation-of-the-ashariyyah-jahmiyyah.html">The Creed of Abu Bakr al-Ismaa'eelee (d. 371H) And Refutation of the Ash'ariyyah Jahmiyyah: Affirmation of Two Hands For Allaah Without Kayf</a><BR>
https://www.aqidah.com/creed/?dqxkb<BR>

<li><a href="articles/qoysc-abu-bakr-al-ismaaeelee-d-371h.html">Abu Bakr al-Ismaa'eelee (d. 371H)</a><BR>
https://www.aqidah.com/creed/?qoysc<BR>

<li><a href="articles/zrhee-abdul-qadir-al-jeelaanee-d-561h-on-allaahs-uluww-istiwaa-and-nuzool-and-a-refutation-of-the-jahmiyyah-mutazilah-and-ashariyyah.html">Abdul-Qadir al-Jeelaanee (d. 561H): On Allaah's Uluww, Istiwaa and Nuzool and a Refutation of the Jahmiyyah, Mu'tazilah and Ash'ariyyah</a><BR>
https://www.aqidah.com/creed/?zrhee<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.aqidah.com/creed/print.cfm?krnsa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:56:34 GMT -->
</html>


