



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?gvokb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Dajjaal.Com | The Dajjaal (Anti-Christ) Will Appear After 70,000 From Bani Ishaq (Children of Isaac) Conquer Constantinople</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Dajjaal (Anti-Christ) Will Appear After 70,000 From Bani Ishaq (Children of Isaac) Conquer Constantinople</span><BR>
Saturday, March 20 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at Dajjaal.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Bani Ishaq (Offspring of Isaac) Conquering <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> (Istanbul)</font>    <P>
Imaam Muslim brings in his Sahih compilation the hadith narrated by Abu Hurairah (radiallaahu anhu) pertaining to the re-conquering of <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> (present day Istanbul):    <P>
<div class='arabic' align='right'>&#1581;&#1583;&#1579;&#1606;&#1575; &#8207; &#8207;&#1602;&#1578;&#1610;&#1576;&#1577; &#1576;&#1606; &#1587;&#1593;&#1610;&#1583; &#8207; &#8207;&#1581;&#1583;&#1579;&#1606;&#1575; &#8207; &#8207;&#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1610;&#1593;&#1606;&#1610; &#1575;&#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#8207; &#8207;&#1593;&#1606; &#8207; &#8207;&#1579;&#1608;&#1585; &#1608;&#1607;&#1608; &#1575;&#1576;&#1606; &#1586;&#1610;&#1583; &#1575;&#1604;&#1583;&#1610;&#1604;&#1610; &#8207; &#8207;&#1593;&#1606; &#8207; &#8207;&#1571;&#1576;&#1610; &#1575;&#1604;&#1594;&#1610;&#1579; &#8207; &#8207;&#1593;&#1606; &#8207; &#8207;&#1571;&#1576;&#1610; &#1607;&#1585;&#1610;&#1585;&#1577; &#8207;  &#8207;&#1571;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610; &#8207; &#8207;&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#8207; &#8207;&#1602;&#1575;&#1604; &#8207; &#8207;&#1587;&#1605;&#1593;&#1578;&#1605; &#1576;&#1605;&#1583;&#1610;&#1606;&#1577; &#1580;&#1575;&#1606;&#1576; &#1605;&#1606;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1576;&#1585; &#1608;&#1580;&#1575;&#1606;&#1576; &#1605;&#1606;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1576;&#1581;&#1585; &#1602;&#1575;&#1604;&#1608;&#1575; &#1606;&#1593;&#1605; &#1610;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1602;&#1575;&#1604; &#1604;&#1575; &#1578;&#1602;&#1608;&#1605; &#1575;&#1604;&#1587;&#1575;&#1593;&#1577; &#1581;&#1578;&#1609; &#1610;&#1594;&#1586;&#1608;&#1607;&#1575; &#1587;&#1576;&#1593;&#1608;&#1606; &#1571;&#1604;&#1601;&#1575; &#1605;&#1606; &#1576;&#1606;&#1610; &#8207; &#8207;&#1573;&#1587;&#1581;&#1602; &#8207; &#8207;&#1601;&#1573;&#1584;&#1575; &#1580;&#1575;&#1569;&#1608;&#1607;&#1575; &#1606;&#1586;&#1604;&#1608;&#1575; &#1601;&#1604;&#1605; &#1610;&#1602;&#1575;&#1578;&#1604;&#1608;&#1575; &#1576;&#1587;&#1604;&#1575;&#1581; &#1608;&#1604;&#1605; &#1610;&#1585;&#1605;&#1608;&#1575; &#1576;&#1587;&#1607;&#1605; &#1602;&#1575;&#1604;&#1608;&#1575; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1603;&#1576;&#1585; &#1601;&#1610;&#1587;&#1602;&#1591; &#1571;&#1581;&#1583; &#1580;&#1575;&#1606;&#1576;&#1610;&#1607;&#1575; &#1602;&#1575;&#1604; &#8207; &#8207;&#1579;&#1608;&#1585; &#8207; &#8207;&#1604;&#1575; &#1571;&#1593;&#1604;&#1605;&#1607; &#1573;&#1604;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1584;&#1610; &#1601;&#1610; &#1575;&#1604;&#1576;&#1581;&#1585; &#1579;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1575; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1603;&#1576;&#1585; &#1601;&#1610;&#1587;&#1602;&#1591; &#1580;&#1575;&#1606;&#1576;&#1607;&#1575; &#1575;&#1604;&#1570;&#1582;&#1585; &#1579;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1575; &#1575;&#1604;&#1579;&#1575;&#1604;&#1579;&#1577; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1604;&#1607; &#1571;&#1603;&#1576;&#1585; &#8207; &#8207;&#1601;&#1610;&#1601;&#1585;&#1580; &#8207; &#8207;&#1604;&#1607;&#1605; &#1601;&#1610;&#1583;&#1582;&#1604;&#1608;&#1607;&#1575; &#1601;&#1610;&#1594;&#1606;&#1605;&#1608;&#1575; &#1601;&#1576;&#1610;&#1606;&#1605;&#1575; &#1607;&#1605; &#1610;&#1602;&#1578;&#1587;&#1605;&#1608;&#1606; &#1575;&#1604;&#1605;&#1594;&#1575;&#1606;&#1605; &#1573;&#1584; &#1580;&#1575;&#1569;&#1607;&#1605; &#1575;&#1604;&#1589;&#1585;&#1610;&#1582; &#1601;&#1602;&#1575;&#1604; &#1573;&#1606; &#8207; &#8207;&#1575;&#1604;&#1583;&#1580;&#1575;&#1604; &#8207; &#8207;&#1602;&#1583; &#1582;&#1585;&#1580; &#1601;&#1610;&#1578;&#1585;&#1603;&#1608;&#1606; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1610;&#1585;&#1580;&#1593;&#1608;&#1606; &#8207;  &#8207;&#1581;&#1583;&#1579;&#1606;&#1610; &#8207; &#8207;&#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1605;&#1585;&#1586;&#1608;&#1602; &#8207; &#8207;&#1581;&#1583;&#1579;&#1606;&#1575; &#8207; &#8207;&#1576;&#1588;&#1585; &#1576;&#1606; &#1593;&#1605;&#1585; &#1575;&#1604;&#1586;&#1607;&#1585;&#1575;&#1606;&#1610; &#8207; &#8207;&#1581;&#1583;&#1579;&#1606;&#1610; &#8207; &#8207;&#1587;&#1604;&#1610;&#1605;&#1575;&#1606; &#1576;&#1606; &#1576;&#1604;&#1575;&#1604; &#8207; &#8207;&#1581;&#1583;&#1579;&#1606;&#1575; &#8207; &#8207;&#1579;&#1608;&#1585; &#1576;&#1606; &#1586;&#1610;&#1583; &#1575;&#1604;&#1583;&#1610;&#1604;&#1610; &#8207; &#8207;&#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1573;&#1587;&#1606;&#1575;&#1583; &#8207; &#8207;&#1576;&#1605;&#1579;&#1604;&#1607;</div>    <P>
  <blockquote class='quote'><img src='images/quote-start.gif'>Abu Hurairah reports that the Prophet (sallallaahu alayhi wasallam) said: "Have you heard of a city a portion of which is within the land and a portion of which lies by the sea?" They said, "Yes, O Messenger of Allaah". He said: The Last Hour will not be established until 70,000 from the offspring of Ishaq (Isaac) attack it. When they come to it, they will alight and will not fight with weapons and nor will they throw any spear. They will say, "<i>There is none which has the right to be worshipped (alone) save Allaah, and Allaah is the Greatest</i>", and one half of it would fall ... and then they will say it a second time, "<i>There is none which has the right to be worshipped (alone) save Allaah, and Allaah is the Greatest</i>", and relief will be granted to them, and they will enter it, and t hey will collecting and dividing the booty when a crier will come to them, saying, "The <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> has emerged", so they will leave everything and return [to Shaam].</blockquote>    <P>
Regarding the "Bani Ishaaq" (Children of Isaac) mentioned in this hadeeth, Ibn Katheer writes in his book "<i>an-Nihayah fil-Fitan wal-Malaahim</i>", through "<i>Ashraat us-Saa'ah</i>" of Yusuf bin Abdullaah al-Waabil:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It indicates that ar-Room (the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a>, meaning Europeans) will become Muslims at the end of time, and perhaps the conquering of <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> (Istanbul) will be through their hands, as the aforementioned hadeeth has stated, that 70,000 from <a href='tags/bani-ishaq.html' class='tagLink'><font class='tagLink'>Bani Ishaq</font></a> will attack it.</blockquote>    <P>
And Ibn Katheer also indicates in the same work that "ar-Room" (<a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a>) are from the offspring of al-Ees, the son of Ishaaq (Isaac) the son of Ibrahim, the Khalil (alayhis salaam).    <P>
And in another hadeeth in Saheeh Muslim, which sheds further light, it is reported by Abu Hurairah that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1604;&#1575; &#1578;&#1602;&#1608;&#1605; &#1575;&#1604;&#1587;&#1575;&#1593;&#1577; &#1581;&#1578;&#1609; &#1610;&#1606;&#1586;&#1604; &#1575;&#1604;&#1585;&#1608;&#1605; &#1576;&#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1602; &#1571;&#1608; &#1576;&#1583;&#1575;&#1576;&#1602; &#1601;&#1610;&#1582;&#1585;&#1580; &#1573;&#1604;&#1610;&#1607;&#1605; &#1580;&#1610;&#1588; &#1605;&#1606; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577; &#1605;&#1606; &#1582;&#1610;&#1575;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1585;&#1590; &#1610;&#1608;&#1605;&#1574;&#1584; &#1601;&#1573;&#1584;&#1575; &#1578;&#1589;&#1575;&#1601;&#1608;&#1575; &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1585;&#1608;&#1605;: &#1582;&#1604;&#1608;&#1575; &#1576;&#1610;&#1606;&#1606;&#1575; &#1608; &#1576;&#1610;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1587;&#1576;&#1608;&#1575; &#1605;&#1606;&#1575; &#1606;&#1602;&#1575;&#1578;&#1604;&#1607;&#1605; &#1601;&#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1608;&#1606;: &#1604;&#1575; &#1608; &#1575;&#1604;&#1604;&#1607; &#1604;&#1575; &#1606;&#1582;&#1604;&#1610; &#1576;&#1610;&#1606;&#1603;&#1605; &#1608; &#1576;&#1610;&#1606; &#1573;&#1582;&#1608;&#1575;&#1606;&#1606;&#1575; &#1601;&#1610;&#1602;&#1575;&#1578;&#1604;&#1608;&#1606;&#1607;&#1605; &#1601;&#1610;&#1606;&#1607;&#1586;&#1605; &#1579;&#1604;&#1579; &#1604;&#1575; &#1610;&#1578;&#1608;&#1576; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607;&#1605; &#1571;&#1576;&#1583;&#1575; &#1608; &#1610;&#1602;&#1578;&#1604; &#1579;&#1604;&#1579; &#1607;&#1605; &#1571;&#1601;&#1590;&#1604; &#1575;&#1604;&#1588;&#1607;&#1583;&#1575;&#1569; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607; &#1608; &#1610;&#1601;&#1578;&#1578;&#1581; &#1575;&#1604;&#1579;&#1604;&#1579; &#1604;&#1575; &#1610;&#1601;&#1578;&#1606;&#1608;&#1606; &#1571;&#1576;&#1583;&#1575; ; &#1601;&#1610;&#1601;&#1578;&#1578;&#1581;&#1608;&#1606; &#1575;&#1604;&#1602;&#1587;&#1591;&#1606;&#1591;&#1610;&#1606;&#1610;&#1577; &#1601;&#1576;&#1610;&#1606;&#1605;&#1575; &#1607;&#1605; &#1610;&#1602;&#1578;&#1587;&#1605;&#1608;&#1606; &#1575;&#1604;&#1594;&#1606;&#1575;&#1574;&#1605; &#1602;&#1583; &#1593;&#1604;&#1602;&#1608;&#1575; &#1587;&#1610;&#1608;&#1601;&#1607;&#1605; &#1576;&#1575;&#1604;&#1586;&#1610;&#1578;&#1608;&#1606; &#1573;&#1584; &#1589;&#1575;&#1581; &#1601;&#1610;&#1607;&#1605; &#1575;&#1604;&#1588;&#1610;&#1591;&#1575;&#1606;: &#1573;&#1606; &#1575;&#1604;&#1605;&#1587;&#1610;&#1581; &#1602;&#1583; &#1582;&#1604;&#1601;&#1603;&#1605; &#1601;&#1610; &#1571;&#1607;&#1604;&#1610;&#1603;&#1605; &#1601;&#1610;&#1582;&#1585;&#1580;&#1608;&#1606; &#1608; &#1584;&#1604;&#1603; &#1576;&#1575;&#1591;&#1604; &#1601;&#1573;&#1584;&#1575; &#1580;&#1575;&#1569;&#1608;&#1575; &#1575;&#1604;&#1588;&#1575;&#1605; &#1582;&#1585;&#1580; &#1601;&#1576;&#1610;&#1606;&#1605;&#1575; &#1607;&#1605; &#1610;&#1593;&#1583;&#1608;&#1606; &#1604;&#1604;&#1602;&#1578;&#1575;&#1604; &#1610;&#1587;&#1608;&#1608;&#1606; &#1575;&#1604;&#1589;&#1601;&#1608;&#1601; &#1573;&#1584; &#1571;&#1602;&#1610;&#1605;&#1578; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1601;&#1610;&#1606;&#1586;&#1604; &#1593;&#1610;&#1587;&#1609; &#1576;&#1606; &#1605;&#1585;&#1610;&#1605; &#1601;&#1571;&#1605;&#1607;&#1605; &#1601;&#1573;&#1584;&#1575; &#1585;&#1570;&#1607; &#1593;&#1583;&#1608; &#1575;&#1604;&#1604;&#1607; &#1584;&#1575;&#1576; &#1603;&#1605;&#1575; &#1610;&#1584;&#1608;&#1576; &#1575;&#1604;&#1605;&#1604;&#1581; &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1601;&#1604;&#1608; &#1578;&#1585;&#1603;&#1607; &#1604;&#1575; &#1606;&#1584;&#1575;&#1576; &#1581;&#1578;&#1609; &#1610;&#1607;&#1604;&#1603; &#1608; &#1604;&#1603;&#1606; &#1610;&#1602;&#1578;&#1604;&#1607; &#1575;&#1604;&#1604;&#1607; &#1576;&#1610;&#1583;&#1607; &#1601;&#1610;&#1585;&#1610;&#1607;&#1605; &#1583;&#1605;&#1607; &#1601;&#1610; &#1581;&#1585;&#1576;&#1578;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Last Hour would not come until the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> would land at al-A'maaq or in Dabiq. An army consisting of the best (soldiers) of the people of the earth at that time will come from Medinah (to counteract them). When they will arrange themselves in ranks, the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> would say: "Do not stand between us and those (Muslims) who took prisoners from amongst us, let us fight with them", and the Muslims would say: "Nay, by Allaah, we would never get aside from you and from our brethren that you may fight them". They will then fight and a third (part) of the army would run away, whom Allaah will never forgive. A third (part of the army). which would be constituted of excellent martyrs in Allaah's eye, would be killed <b>and the third who would never be put to trial would win and they would be conquerors of Constantinople</b>. And as they would be busy in distributing the spoils of war (amongst themselves) after hanging their swords by the olive trees, the <a href='tags/satan.html' class='tagLink'><font class='tagLink'>Satan</font></a> would cry: The <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> has taken your place among your family. They would then leave (to return to Syria), but it would be of no avail (it was a false alarm). And when they return to Syria, he (<a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a>) would come out while they would be still preparing themselves for battle drawing up the ranks...</blockquote>    <P>
Note here that when the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> emerges he will traverse the Earth for forty-days, one day like a year, one day like a month, one day like a week and the rest as normal days, and he will spread misguidance and corruption upon the Earth, and then the above hadeeth continues to describe when Jesus (alayhis salaam) will descend after this period.    <P>
<!---<blockquote class='quote'><img src='https://www.dajjaal.com/liar/images/quote-start.gif'>...Certainly, the time of prayer shall come and then Jesus (sallallaahu alayhi wa sallam) son of Mary would descend and would lead them in prayer. When the enemy of Allaah would see him, it would (disappear) just as the salt dissolves itself in water and if he (Jesus) were not to confront them at all, even then it would dissolve completely, but Allaah would kill them by his hand and he would show them their blood on his lance (the lance of Jesus Christ). </blockquote>//--->    <P>
The place <b>Dabiq</b> is in Syria, north of Aleppo (Halab) and <b>al-A'maaq</b> is towards the south coast of Yemen. It is clear from combining the two hadeeths that the <a href='tags/bani-ishaq.html' class='tagLink'><font class='tagLink'>Bani Ishaq</font></a> (Children of Isaac) will be those from the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> who have accepted Islam and will be pursued by the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> who will alight at either Dabiq or al-A'maq, but from other ahaadeeth it is clear that it is <b>the place near Aleppo</b> (which is Dabiq). This is indicated in the hadeeth reported by Abu Dawud which is authentic (Saheeh Jaami as-Sagheer, no. 2116), narrating which his chain from Abu ad-Dardaa, that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1573;&#1606; &#1601;&#1587;&#1591;&#1575;&#1591; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1610;&#1608;&#1605; &#1575;&#1604;&#1605;&#1604;&#1581;&#1605;&#1577; &#1576;&#1575;&#1604;&#1594;&#1608;&#1591;&#1577; &#1573;&#1604;&#1609; &#1580;&#1575;&#1606;&#1576; &#1605;&#1583;&#1610;&#1606;&#1577; &#1610;&#1602;&#1575;&#1604; &#1604;&#1607;&#1575; &#1583;&#1605;&#1588;&#1602; &#1605;&#1606; &#1582;&#1610;&#1585; &#1605;&#1583;&#1575;&#1574;&#1606; &#1575;&#1604;&#1588;&#1575;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The town in which the Muslims will have amassed on the day of al-Malhamah (the great battle) is in the land of al-Ghutah [a place having rivers and trees surrounded by mountains] in a city called Damascus, from the best of the cities of ash-Shaam (Syria)</blockquote>     So from the above we gather that a contingent of the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> will become Muslims and join the Muslims, and then the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> will alight at Dabiq to pursue them.  A faction will depart from Madinah gathering in the place at Damascus. The <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> will ask the Muslims to clear the way so that they can go after that particular faction. A third from the Muslims will desert the battle, a third will be martyrs and a third will be victorious, and they are the ones who will defeat <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a>. And from this third, will be those 70,000 <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> who had accepted Islam and they will go on to conquer <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a>.    <P>
In another authentic hadeeth (Saheeh al-Jaami' as-Sagheer, no. 4096, and in Musnad Ahmad and Sunan Abu Dawud) by Mu'aadh (radiallaahu anhu) reported that the Prophet (alayhis salaam) said,     <P>
<div class='arabic' align='right'>&#1593;&#1605;&#1585;&#1575;&#1606; &#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1602;&#1583;&#1587; &#1582;&#1585;&#1575;&#1576; &#1610;&#1579;&#1585;&#1576; &#1608; &#1582;&#1585;&#1575;&#1576; &#1610;&#1579;&#1585;&#1576; &#1582;&#1585;&#1608;&#1580; &#1575;&#1604;&#1605;&#1604;&#1581;&#1605;&#1577; &#1608; &#1582;&#1585;&#1608;&#1580; &#1575;&#1604;&#1605;&#1604;&#1581;&#1605;&#1577; &#1601;&#1578;&#1581; &#1575;&#1604;&#1602;&#1587;&#1591;&#1606;&#1591;&#1610;&#1606;&#1610;&#1577; &#1608; &#1601;&#1578;&#1581; &#1575;&#1604;&#1602;&#1587;&#1591;&#1606;&#1591;&#1610;&#1606;&#1610;&#1577; &#1582;&#1585;&#1608;&#1580; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604;</div>     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The habitation of Bayt al-Maqdis (Jerusalem) [by Muslims] signals the desolation (ruin) of Yathrib (Madinah), and the desertion of Yathrib signals the occurrence of the Great Battle (with the Romans) and the occurrence of the great battle signals the conquering of <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a>, and the conquering of <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> signals the emergence of the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a>.</blockquote>    <P>
This hadeeth indicates the habitation of Jerusalam [as a seat of power] alongside the desolation of Madinah. The army that will gather in Shaam (Syria) to fight the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> will leave from Madinah, indicating that whilst Jerusalem is inhabited [as a seat of power], there will remain Muslims in Madinah. And we also know that <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> will come to Madinah whilst it is inhabited, being unable to enter it, that it will rock thrice, expelling every disbeliever and hypocrite. This shows that Madinah will remain occupied.     <P>
There is in another hadeeth what indicates that Jerusalem will be the place where the Khilaafah will return, as occurs in the hadeeth of al-Irbaab bin Saariyah found in Musnad of Imaam Ahmad, and Sunan Abu Dawud and al-Mustadrak of al-Haakim, declared Saheeh in Saheeh al-Jaami' as-Sagheer (no. 7838), that the Prophet (alayhis salaam) said:    <P>
<div class='arabic' align='right'>&#1610;&#1575; &#1575;&#1576;&#1606; &#1581;&#1608;&#1575;&#1604;&#1577; ! &#1573;&#1584;&#1575; &#1585;&#1571;&#1610;&#1578; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1602;&#1583; &#1606;&#1586;&#1604;&#1578; &#1575;&#1604;&#1571;&#1585;&#1590; &#1575;&#1604;&#1605;&#1602;&#1583;&#1587;&#1577; &#1601;&#1602;&#1583; &#1583;&#1606;&#1578; &#1575;&#1604;&#1586;&#1604;&#1575;&#1586;&#1604; &#1608; &#1575;&#1604;&#1576;&#1604;&#1575;&#1576;&#1604; &#1608; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1575;&#1604;&#1593;&#1592;&#1575;&#1605; &#1608; &#1575;&#1604;&#1587;&#1575;&#1593;&#1577; &#1610;&#1608;&#1605;&#1574;&#1584; &#1571;&#1602;&#1585;&#1576; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1610;&#1583;&#1610; &#1607;&#1584;&#1607; &#1605;&#1606; &#1585;&#1571;&#1587;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>O son of Hawaalah! When you see the Khilaafah has descended to the blessed land (i.e. Bayt al-Maqdis), then the earthquakes, great anxieties, and great portents and the Hour on that day will be closer to the people than these hands are to your head.</blockquote>    <P>
So it is clear that the seat of power will be Jerusalem and Madinah will be less inhabited as a result, and the above has been explained by Ibn Katheer in an-Nihaayah (1.94) where he says:    <P>
<div class='arabic' align='right'>&#1608;&#1604;&#1610;&#1587; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1571;&#1606; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577; &#1578;&#1582;&#1585;&#1576; &#1576;&#1575;&#1604;&#1603;&#1604;&#1610;&#1577; &#1602;&#1576;&#1604; &#1582;&#1585;&#1608;&#1580; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604; &#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1584;&#1604;&#1603; &#1570;&#1582;&#1585; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1548; &#1576;&#1604; &#1578;&#1603;&#1608;&#1606; &#1593;&#1605;&#1575;&#1585;&#1577; &#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1602;&#1583;&#1587; &#1587;&#1576;&#1576;&#1575; &#1601;&#1610; &#1582;&#1585;&#1575;&#1576; &#1575;&#1604;&#1605;&#1583;&#1610;&#1606;&#1577; &#1575;&#1604;&#1606;&#1576;&#1608;&#1610;&#1577; &#1548; &#1601;&#1573;&#1606;&#1607; &#1602;&#1583; &#1579;&#1576;&#1578; &#1601;&#1610; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1577; &#1571;&#1606; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604; &#1604;&#1575; &#1610;&#1602;&#1583;&#1585; &#1593;&#1604;&#1609; &#1583;&#1582;&#1608;&#1604;&#1607;&#1575; &#1548; &#1610;&#1615;&#1605;&#1606;&#1593; &#1605;&#1606; &#1584;&#1604;&#1603; &#1576;&#1605;&#1575; &#1593;&#1604;&#1609; &#1571;&#1576;&#1608;&#1575;&#1576;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1575;&#1604;&#1602;&#1575;&#1574;&#1605;&#1610;&#1606; &#1576;&#1571;&#1610;&#1583;&#1607;&#1605; &#1575;&#1604;&#1587;&#1610;&#1608;&#1601; &#1575;&#1604;&#1605;&#1589;&#1604;&#1578;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the intent is not that Madinah will become totally desolate before the appearance of the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a>, that is at the very end of time (i.e. its total desertion). Rather, the habitation of Bayt al-Maqdis [as a seat of power] will be a reason for the [partial] desertion of al-Madinah an-Nabawiyyah. And it is established in the authentic ahaadeeth that the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> will not be able to enter it, he will be prevented from that by the Angels with drawn swords who are stationed at its gates...</blockquote>    <P>
<font class='titleHeadline'>Summary</font>    <P>
From the above it the following points can be made:    <P>
That the Khilaafah will descend at Bayt al-Maqdis, but this will the Khilaafah upon the Prophetic Minhaaj (Methodology), and this shows the obligation of the tasfiyah (purification) of the religion and then tarbiyah (cultivation) upon it, and a return to that which the Righteous Salaf were upon, and this is manifest and clear from the statement of the Messenger (alayhis salaam):    <P>
<div class='arabic' align='right'>&#1578;&#1603;&#1608;&#1606; &#1575;&#1604;&#1606;&#1576;&#1608;&#1577; &#1601;&#1610;&#1603;&#1605; &#1605;&#1575; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1548; &#1579;&#1605; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569; &#1571;&#1606; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1548; &#1579;&#1605; &#1578;&#1603;&#1608;&#1606; &#1582;&#1604;&#1575;&#1601;&#1577; &#1593;&#1604;&#1609; &#1605;&#1606;&#1607;&#1575;&#1580; &#1575;&#1604;&#1606;&#1576;&#1608;&#1577; &#1548; &#1601;&#1578;&#1603;&#1608;&#1606; &#1605;&#1575; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1548; &#1579;&#1605; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569; &#1571;&#1606; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1548; &#1579;&#1605; &#1578;&#1603;&#1608;&#1606; &#1605;&#1604;&#1603;&#1575; &#1593;&#1575;&#1590;&#1575; &#1548; &#1601;&#1610;&#1603;&#1608;&#1606; &#1605;&#1575; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1548; &#1579;&#1605; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569; &#1571;&#1606; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1548; &#1579;&#1605; &#1610;&#1603;&#1608;&#1606; &#1605;&#1604;&#1603;&#1575; &#1580;&#1576;&#1585;&#1610;&#1575; &#1548; &#1601;&#1578;&#1603;&#1608;&#1606; &#1605;&#1575; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1548; &#1579;&#1605; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1573;&#1584;&#1575; &#1588;&#1575;&#1569; &#1571;&#1606; &#1610;&#1585;&#1601;&#1593;&#1607;&#1575; &#1548; &#1579;&#1605; &#1578;&#1603;&#1608;&#1606; &#1582;&#1604;&#1575;&#1601;&#1577; &#1593;&#1604;&#1609; &#1605;&#1606;&#1607;&#1575;&#1580; &#1575;&#1604;&#1606;&#1576;&#1608;&#1577; &#1548; &#1579;&#1605; &#1587;&#1603;&#1578;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><blockquote>The Prophethood will remain amongst you for as long as Allaah wills it to be. Then Allaah will raise it when He wills to raise it. Then there will be the khilaafah upon the Prophetic methodology. And it will last for as long as Allaah wills it to last. Then Allaah will raise it when He wills to raise it. Then there will be biting kingship, and it will remain for as long as Allaah wills it to remain. Then Allaah will raise it when He wills to raise it. Then there will be tyrannical (forceful) kingship and it will remain for as long as Allaah wills it to remain. Then He will raise it when He wills to raise it. Then there will be a khilaafah upon the Prophetic methodology.</blockquote>    <P>
Then he (the Prophet) was silent. </blockquote>    <P>
Reported by Ahmad and Abu Dawud. Silsilah as-Saheehah of Imaam al-Albani (1/34 no. 5) and it is <b>Saheeh</b>. So this hadeeth is a proof that the Prophetic Khilaafah will only return when the Muslim's return back to the Book and the Sunnah, upon the way of the Righteous Salaf, and shun all innovations, and unite their hearts upon this criterion.      <P>
And this is not the Khilaafah of the <u>Rafidi Shites</u>, and nor that of the <u>Qadiyani Ahmadis</u> and nor is it the Khilaafah of the <u>Khawaarij</u>, for it is a law in Allaah's creation that the Khawaarij will always be cut off. Rather the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> will appear in the midst of the Khawaarij in that time (<a href=http://www.takfiris.com/takfir/?zyxuc>see proof here</a>), which shows that the Khawaarij will be present in that time too, creating problems for the Muslims as they have done in all ages.    <P>
Nor is it the khilaafah of the likes of Hasan al-Bannaa which accommodates every deviant innovator and strayer under the lowest common denominator of simply expressing "<i>Laa ilaaha illallaah</i>" (thus, amassing the Jahmee, Mu'tazilee, Qadaree, Soofee, and worshipper of other than Allaah into one lump), in order to establish a khilaafah. Nor is it the khilaafah of Mawdudi (who considered the rule of al-Khomeini, the kafir, mushrik, enemy of Abu Bakr and Umar - radiallaahu anhumaa - to be a true Islamic khilaafah). Nor is it the Khilaafah envisaged by Sayyid Qutb which admits to Marxist-Communist tenets and it's notions of "social justice". And nor is it the khilaafah of Taqi ud-Din an-Nabahani with his party formation upon Ba'thist, Communist structures aiming at ideological and political revolutions.     <P>
<div class='sidebar'><b>Warning:</b> All of these factions are very vocal on these issues, expressing opinions spewing propaganda and looking at these affairs (of the Dajjal) through the spectacles of their own innovation and deviation. And they are active on the tube, on forums, blogs and websites, so one should be on guard against them and their lies, deviation and propaganda.</div>    <P>
With the return of this Khilaafah, there will be a desertion of al-Madinah in part, as people will go to the land of Bayt al-Maqdis, and with the return of the Prophetic Khilaafah, the great signs, portents and calamities will start to take place.    <P>
There will be battles taking place between the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> and the Muslims, as well as truces and they will also unite together to fight a common enemy, all of which occurs in the authentic texts. But, a contingent amongst these <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a>, during that period will accept Islam, and they will recognize the truth of Islam, that it preaches the true monotheism which was brought by all previous prophets including Jesus (alayhis salaam).    <P>
This faction will be sought after by the <a href='tags/romans.html' class='tagLink'><font class='tagLink'>Romans</font></a> who will alight at Dabiq, and a Muslim army will depart from Madinah and alight at Damascus and a battle will ensue and this is known as the "Malhamah", this will be fought in ash-Shaam (Syria)     <P>
<img src=assets/images/shaam-dabiq.gif border=1 border=0>    <P>
Those who are victorious in this battle will comprise the 70,000 from the <a href='tags/bani-ishaq.html' class='tagLink'><font class='tagLink'>Bani Ishaq</font></a> (descendants of Isaac) who will then go onto conquer <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> (Istanbul). And the conquering of <a href='tags/constantinople.html' class='tagLink'><font class='tagLink'>Constantinople</font></a> signals the emergence of ad-Dajjaal  who will come from the East, from Khurasaan (present day Iran). <P> 

</div>
<br>


<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/gvokb-the-dajjaal-anti-christ-will-appear-after-70000-from-bani-ishaq-conquer-constantinople.html">The Dajjaal (Anti-Christ) Will Appear After 70,000 From Bani Ishaq (Children of Isaac) Conquer Constantinople</a><BR>
https://www.dajjaal.com/liar/?gvokb<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?gvokb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
</html>


