



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?qovvu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Dajjaal.Com | What a Man or Woman Must Do To Become a Magician (Saahir)</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">What a Man or Woman Must Do To Become a Magician (Saahir)</span><BR>
Saturday, February 27 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at Dajjaal.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Allaah the Most High said, regarding those who learn and practice magic:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1604;&#1614;&#1602;&#1614;&#1583;&#1618; &#1593;&#1614;&#1604;&#1616;&#1605;&#1615;&#1608;&#1575;&#1618; &#1604;&#1614;&#1605;&#1614;&#1606;&#1616; &#1575;&#1588;&#1618;&#1578;&#1614;&#1585;&#1614;&#1575;&#1607;&#1615; &#1605;&#1614;&#1575; &#1604;&#1614;&#1607;&#1615; &#1601;&#1616;&#1610; &#1575;&#1604;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1605;&#1616;&#1606;&#1618; &#1582;&#1614;&#1604;&#1575;&#1614;&#1602;&#1613; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. (al-Baqarah 2:102) </b><img src='images/qnend.gif'></blockquote>    <P>
And the "buying, purchasing" mentioned in the verse, Shaykh Saalih Aal ash-Shaykh says in explanation of the verse, as occurs in his explanation of Kitab ut-Tawhid on the chapter on magic:    <P>
<div class='arabic' align='right'>&#1608;&#1575;&#1604;&#1587;&#1575;&#1581;&#1585; &#1575;&#1588;&#1578;&#1585;&#1609; &#1605;&#1606; &#1578;&#1593;&#1604;&#1605; &#1575;&#1604;&#1587;&#1581;&#1585; &#1575;&#1588;&#1578;&#1585;&#1609;&#1548; &#1575;&#1588;&#1578;&#1585;&#1609; &#1571;&#1610; &#1588;&#1610;&#1569;&#1567; &#1575;&#1588;&#1578;&#1585;&#1609; &#1575;&#1604;&#1587;&#1581;&#1585; &#1576;&#1583;&#1604; &#1571;&#1610; &#1588;&#1610;&#1569;&#1567; &#1576;&#1583;&#1604; &#1578;&#1608;&#1581;&#1610;&#1583;&#1607;&#1548; &#1601;&#1575;&#1604;&#1579;&#1605;&#1606; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583;&#1548; &#1575;&#1604;&#1579;&#1605;&#1606; &#1607;&#1608; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1581;&#1583;&#1607;&#1548; &#1608;&#1575;&#1604;&#1605;&#1579;&#1605;&#1606; &#1607;&#1608; &#1575;&#1604;&#1587;&#1581;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the magician he has purchased the learning of magic, he has purchased, purchased what thing? He has purchased magic in place of what thing? In place of Tawhid, so the price is Tawhid, the price is faith in Allaah alone, and the object (being bought) is magic... so it means the one who gave his religion as consideration (something of value) for that thing which he took, which is magic...</blockquote>    <P>
Since magic relies upon the agency of the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> (<a href=index90cf.html?wkytq>see here</a>), then a man or woman does not become a magician up until the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> can verify that this person is eager to become one truthfully and practically, and that he desires to harm the people, and thus when an individual first starts making contact with the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>, they will require from him or her the following, as examples:    <P>
<ul><li> To disbelieve in Allaah, through reviling Him, or transgressing against Him (such as in the manner described below)  <li> To abandon the prayer.  <li> To pray in the toilet area.  <li> To put the mus.haf (copy of the Qur'an) under his feet and to enter the toilet with it area, as a means of defiling and belittling it.  <li> To write the Qur'an with impurities such as menstrual blood or faeces as a means of belittling it.  <li> To commit incest.  <li> To remain alone in a dark room for forty days without coming into contact with water.  <li> To remain for a long time in janaabah (state of sexual impurity) without bathing.  <li> To remain in a dark room, or some deserted isolated place where the rebellious devils amongst the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> come and perform lewd acts with him or her.  </ul>    <P>
Shaykh Saalih Aal ash-Shaykh also says in the same aforementioned chapter:    <P>
<div class='arabic' align='right'> &#1575;&#1604;&#1587;&#1581;&#1585; &#1576;&#1580;&#1605;&#1610;&#1593; &#1571;&#1606;&#1608;&#1575;&#1593;&#1607; &#1601;&#1610;&#1607; &#1575;&#1587;&#1578;&#1582;&#1583;&#1575;&#1605; &#1604;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1608;&#1575;&#1587;&#1578;&#1593;&#1575;&#1606;&#1577; &#1576;&#1607;&#1575;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1604;&#1575; &#1578;&#1582;&#1583;&#1605; &#1573;&#1604;&#1575; &#1605;&#1606; &#1578;&#1602;&#1585;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575;&#1548; &#1578;&#1578;&#1602;&#1585;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575; &#1576;&#1571;&#1610; &#1588;&#1610;&#1569;&#1567; &#1576;&#1575;&#1604;&#1584;&#1576;&#1581; &#1610;&#1578;&#1602;&#1585;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575; &#1576;&#1571;&#1610; &#1588;&#1610;&#1569;&#1567; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1575;&#1579;&#1577; &#1610;&#1578;&#1602;&#1585;&#1576; &#1573;&#1604;&#1610;&#1607;&#1575; &#1576;&#1575;&#1604;&#1575;&#1587;&#1578;&#1593;&#1575;&#1584;&#1577; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603;&#1548; &#1610;&#1593;&#1606;&#1610;: &#1610;&#1589;&#1585;&#1601; &#1573;&#1604;&#1610;&#1607;&#1575; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577;&#1548; &#1576;&#1604; &#1602;&#1583; &#1606;&#1592;&#1585;&#1578; &#1601;&#1610; &#1576;&#1593;&#1590; &#1603;&#1578;&#1576; &#1575;&#1604;&#1587;&#1581;&#1585;&#1548; &#1601;&#1608;&#1580;&#1583;&#1578; &#1571;&#1606; &#1587;&#1575;&#1581;&#1585;&#1575; - &#1576;&#1581;&#1587;&#1576; &#1605;&#1575; &#1608;&#1589;&#1601; &#1584;&#1604;&#1603; &#1575;&#1604;&#1603;&#1575;&#1578;&#1576; - &#1604;&#1575; &#1610;&#1589;&#1604; &#1573;&#1604;&#1609; &#1581;&#1602;&#1610;&#1602;&#1577; &#1575;&#1604;&#1587;&#1581;&#1585; &#1608;&#1578;&#1582;&#1583;&#1605;&#1607; &#1575;&#1604;&#1580;&#1606; &#1603;&#1605;&#1575; &#1610;&#1606;&#1576;&#1594;&#1610; &#1581;&#1578;&#1609; &#1610;&#1607;&#1610;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606;&#1548; &#1608;&#1610;&#1607;&#1610;&#1606; &#1575;&#1604;&#1605;&#1589;&#1581;&#1601;&#1548; &#1608;&#1581;&#1578;&#1609; &#1610;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1610;&#1587;&#1576; &#1575;&#1604;&#1604;&#1607;  - &#1580;&#1604; &#1608;&#1593;&#1604;&#1575; - &#1608;&#1606;&#1576;&#1610;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Magic in all of its types contains the use of the devils and seeking aid from them. The devils do not serve except the one who seeks closeness to them. You seek closeness to them with what thing? With sacrifice (of something to them). He seeks closeness to them with what thing? With seeking aid. He seeks nearness to them through seeking refuge (in them) and so on. Meaning that he directs some of the worship (that is only due to Allaah alone) to them. And I have looked in some of the books of magic and I  found that the  magician - in accordance with what that autohr described - that he cannot arrive at true, real magic and the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> will not serve him as is desired until he belittles the Qur'an, or belittles the copy of the Quran (mus.haf) or until he disbelieves in Allaah, the Mighty and Majestic, and His Prophet (sallallaahu alayhi wasallam).</blockquote>    <P>
The devils love disobedience in Allaah and kufr and shirk, and thus, they will only serve and carry out the requests of people who are prepared to do acts similar to those above. If you recall, <a href='tags/iblis.html' class='tagLink'><font class='tagLink'>Iblis</font></a> refused to bow to <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> (alayhis salaam), and thereafter beguiled <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> to disobey his Lord. Thus, enmity was set up between <a href='tags/iblis.html' class='tagLink'><font class='tagLink'>Iblis</font></a> and his offspring and <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> and his offspring, and <a href='tags/iblis.html' class='tagLink'><font class='tagLink'>Iblis</font></a>  knows that his destination is the fire and that he has simply been given respite for a period. And thus he is using that period of respite in order to misguide and lead as much of Adam's offspring into the fire with him. The <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> in general are characterized with envy, hatred, jealousy and mischief in general, and they detest revelation and prophethood, which is why they request the aforementioned acts of desecration from those seeking their aid in witchcraft. And the relationship between these two categories of people is mentioned in the verse:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1610;&#1614;&#1608;&#1618;&#1605;&#1614; &#1610;&#1616;&#1581;&#1618;&#1588;&#1615;&#1585;&#1615;&#1607;&#1615;&#1605;&#1618; &#1580;&#1614;&#1605;&#1616;&#1610;&#1593;&#1611;&#1575; &#1610;&#1614;&#1575; &#1605;&#1614;&#1593;&#1618;&#1588;&#1614;&#1585;&#1614; &#1575;&#1604;&#1618;&#1580;&#1616;&#1606;&#1617;&#1616; &#1602;&#1614;&#1583;&#1616; &#1575;&#1587;&#1618;&#1578;&#1614;&#1603;&#1618;&#1579;&#1614;&#1585;&#1618;&#1578;&#1615;&#1605; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1573;&#1616;&#1606;&#1587;&#1616; &#1608;&#1614;&#1602;&#1614;&#1575;&#1604;&#1614; &#1571;&#1614;&#1608;&#1618;&#1604;&#1616;&#1610;&#1614;&#1570;&#1572;&#1615;&#1607;&#1615;&#1605; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1573;&#1616;&#1606;&#1587;&#1616; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1587;&#1618;&#1578;&#1614;&#1605;&#1618;&#1578;&#1614;&#1593;&#1614; &#1576;&#1614;&#1593;&#1618;&#1590;&#1615;&#1606;&#1614;&#1575; &#1576;&#1616;&#1576;&#1614;&#1593;&#1618;&#1590;&#1613; &#1608;&#1614;&#1576;&#1614;&#1604;&#1614;&#1594;&#1618;&#1606;&#1614;&#1575; &#1571;&#1614;&#1580;&#1614;&#1604;&#1614;&#1606;&#1614;&#1575; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1614; &#1571;&#1614;&#1580;&#1617;&#1614;&#1604;&#1618;&#1578;&#1614; &#1604;&#1614;&#1606;&#1614;&#1575; &#1602;&#1614;&#1575;&#1604;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1585;&#1615; &#1605;&#1614;&#1579;&#1618;&#1608;&#1614;&#1575;&#1603;&#1615;&#1605;&#1618; &#1582;&#1614;&#1575;&#1604;&#1616;&#1583;&#1616;&#1610;&#1606;&#1614; &#1601;&#1616;&#1610;&#1607;&#1614;&#1575; &#1573;&#1616;&#1604;&#1575;&#1617;&#1614; &#1605;&#1614;&#1575; &#1588;&#1614;&#1575;&#1569; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1573;&#1616;&#1606;&#1617;&#1614; &#1585;&#1614;&#1576;&#1617;&#1614;&#1603;&#1614; &#1581;&#1614;&#1603;&#1616;&#1610;&#1605;&#1612; &#1593;&#1614;&#1604;&#1610;&#1605;&#1612; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And on the Day when He will gather them (all) together (and say): "O you assembly of jinns! Many did you mislead of men," and their allies amongst men will say: "Our Lord! We benefited one from the other, but now we have reached our appointed term which You did appoint for us." He will say: "The Fire be your dwelling place, you will dwell therein forever, except as Allah may will. Certainly your Lord is All-Wise, All-Knowing."  (Al-An'am 6:128) </b><img src='images/qnend.gif'></blockquote>    <P>
Ibn Taymiyyah comments on this verse (<i>an-Nubuwwaat</i>, pp, 311-312, through <i>Fath ul-Mannaan</i>, a compilation of the writings of Ibn Taymiyyah on the Jinn):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for magic and soothsaying, then it is from the assistance of the devils to the sons of <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a>, for the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> inform the soothsayer (with information) and likewise the magician, he kills or brings about illness or levitates in the sky through the devil's assistance of him. And so their affairs depart from what human's consider the norm by way of the devil's assistance of them ...</blockquote>    <P>
Then he quotes the above verse, then he continues:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>For the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> and humans, they sought benefit (utility, pleasure), some of them from others, so these ones used those ones, and those ones used these ones in many affairs. All of them did for another whatever his objective was so as to aid in his objective, and magic and soothsaying (fortune-telling) is from this angle.</blockquote>    <P>
And thus, the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> seek their benefit through the magicians which is the desecration of the sanctity of revelation, prophethood and the religion, and the magicians seek the utility of the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> in bringing about or repelling harm, or seeking fame, fortune and the likes.    <P>
<div class='sidebar'>Note that this also happens amongst the Jews and Christians. Those who are practitioners of magic amongst them will be asked by the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> to commit what would be, in their religion, disbelief, such as dishonoring the Bible, or the Torah, or cursing and reviling Jesus, the son of Mary and so on. And in general the devils hate the revealed books, and they hate Prophethood and Messengership, and as the Jinns are of many different religions and beliefs (Jews, Christians, Muslims, Hindus, Pagans and so on), including hypocrites amongst them and innovators, and as the general characteristic of the devils is to love disbelief and disobedience and violation of the sanctities, then they will command the magicians, that come from the background of the revealed books, to commit that which is a revilement upon the notions of revelation and prophethood.</div> <P> 

</div>
<br>




</td></tr></table>
<body>



</body>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?qovvu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
</html>


