



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?gdcsj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Dajjaal.Com | Shaykh Muhammad bin Haadee Explains and Illustrates al-Sihr al-Takhyeeliyy (Illusionary Magic)</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Muhammad bin Haadee Explains and Illustrates al-Sihr al-Takhyeeliyy (Illusionary Magic)</span><BR>
Sunday, November 04 2012 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Dajjaal.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
In the previous articles, we have alluded many times to a misunderstanding regarding what is meant by <i>al-sihr al-takhyeeliyy</i> ("illusionary magic") and based upon this misunderstanding some of the statements and verdicts of the Scholars can be misunderstood. In this article, we present an answer to a question regarding the difference between magic (al-sihr) and the evil eye (al-ayn), in the course of which it is explained, by Shaykh Muhammad bin Haadee (hafidhahullaah), the reality of the magic which is referred to as takhyeeliyy, which is no doubt kufr.     <P>
In a question and answer session following a lecture on the status of the Sunnah and the excellence of holding fast to it (on 2/12/1433H) a transcript of which is found on <a href=http://www.sahab.net/forums/index.php?showtopic=132959>Sahab.Net</a>, Shaykh Muhammad bin Haadee was asked:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This one asks, is there a difference between al-sihr (magic) and al-ayn (evil eye)?</blockquote>    <P>
The Shaykh answered:    <P>
<blockquote><div class='arabic' align='right'>&#1606;&#1593;&#1605;&#1548; &#1601;&#1610;&#1607; &#1601;&#1585;&#1602;&#1612; &#1576;&#1610;&#1606; &#1575;&#1604;&#1587;&#1616;&#1617;&#1581;&#1585; &#1608;&#1575;&#1604;&#1593;&#1610;&#1606;&#1548; &#1575;&#1604;&#1587;&#1617;&#1581;&#1585; &#1602;&#1583; &#1610;&#1615;&#1580;&#1606;&#1615;&#1617; &#1576;&#1607; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1608;&#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1587;&#1581;&#1585; &#1578;&#1582;&#1610;&#1610;&#1604; &#1601;&#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1610;&#1578;&#1582;&#1610;&#1617;&#1604; &#1571;&#1588;&#1610;&#1575;&#1569; &#1604;&#1575; &#1610;&#1585;&#1575;&#1607;&#1575; &#1575;&#1604;&#1581;&#1575;&#1590;&#1585;&#1608;&#1606; &#1571;&#1605;&#1575;&#1605;&#1607;&#1563; &#1610;&#1585;&#1609; &#1603;&#1584;&#1575; &#1608;&#1610;&#1585;&#1609; &#1603;&#1584;&#1575; &#1606;&#1581;&#1606; &#1580;&#1575;&#1604;&#1587;&#1608;&#1606; &#1575;&#1604;&#1570;&#1606; &#1610;&#1585;&#1609; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1580;&#1604;&#1587; &#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1589;&#1575; &#1571;&#1601;&#1575;&#1593;&#1610; &#1571;&#1608; &#1581;&#1610;&#1617;&#1575;&#1578;&#1548; &#1608;&#1575;&#1604;&#1587;&#1617;&#1604;&#1610;&#1605; &#1604;&#1575; &#1610;&#1585;&#1609; &#1588;&#1610;&#1574;&#1611;&#1575; &#1605;&#1606; &#1584;&#1604;&#1603; &#1606;&#1593;&#1605;&#1548; &#1576;&#1604; &#1571;&#1606;&#1575; &#1571;&#1615;&#1582;&#1576;&#1585;&#1603;&#1605; &#1593;&#1606; &#1588;&#1582;&#1589;&#1613; &#1610;&#1593;&#1606;&#1610; &#1593;&#1588;&#1578;&#1615; &#1605;&#1614;&#1593;&#1607; &#1603;&#1575;&#1606; &#1610;&#1585;&#1609; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1575;&#1604;&#1605;&#1608;&#1604;&#1608;&#1583;&#1610;&#1606; &#1575;&#1604;&#1589;&#1617;&#1594;&#1575;&#1585; &#1610;&#1585;&#1575;&#1607;&#1605; &#1580;&#1585;&#1575;&#1569; &#1589;&#1594;&#1575;&#1585; &#1575;&#1604;&#1603;&#1604;&#1575;&#1576; &#1580;&#1585;&#1608; &#1587;&#1615;&#1581;&#1616;&#1585; &#1601;&#1603;&#1575;&#1606; &#1573;&#1584;&#1575; &#1580;&#1575;&#1569;&#1607; &#1591;&#1601;&#1604; &#1610;&#1585;&#1575;&#1607; &#1603;&#1571;&#1606;&#1617;&#1607; &#1580;&#1585;&#1608; &#1601;&#1607;&#1584;&#1575; &#1578;&#1582;&#1610;&#1610;&#1604;&#1548; &#1576;&#1610;&#1606;&#1605;&#1575; &#1575;&#1604;&#1593;&#1610;&#1606; &#1604;&#1575;&#1548; &#1602;&#1583; &#1610;&#1605;&#1585;&#1590; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1593;&#1590;&#1608;&#1610;&#1611;&#1617;&#1575; &#1603;&#1605;&#1575; &#1580;&#1575;&#1569; &#1584;&#1604;&#1603; &#1601;&#1610; &#1581;&#1583;&#1610;&#1579; &#1571;&#1576;&#1610; &#1571;&#1605;&#1575;&#1605;&#1577; &#1587;&#1607;&#1604; &#1576;&#1606; &#1581;&#1606;&#1610;&#1601; &#1581;&#1610;&#1606;&#1605;&#1575; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1593;&#1605;&#1585;&#1608; &#1576;&#1606; &#1585;&#1576;&#1610;&#1593;&#1577; ý&#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605;&#1575; &#1580;&#1605;&#1610;&#1593;&#1611;&#1575;- &#1593;&#1575;&#1606;&#1607; &#1581;&#1610;&#1606;&#1605;&#1575; &#1602;&#1575;&#1604;: &#1608;&#1602;&#1583; &#1606;&#1586;&#1604; &#1601;&#1610; &#1588;&#1593;&#1576; &#1610;&#1615;&#1602;&#1575;&#1604; &#1604;&#1607; &#1575;&#1604;&#1582;&#1585;&#1617;&#1575;&#1585; &#1610;&#1594;&#1578;&#1587;&#1604; &#1608;&#1603;&#1575;&#1606; &#1571;&#1576;&#1610;&#1590; &#1575;&#1604;&#1580;&#1616;&#1604;&#1583; &#1601;&#1585;&#1570;&#1607; &#1578;&#1581;&#1578; &#1575;&#1604;&#1605;&#1575;&#1569; &#1601;&#1602;&#1575;&#1604;: &#1605;&#1575; &#1585;&#1571;&#1610;&#1578; &#1605;&#1579;&#1604; &#1575;&#1604;&#1610;&#1608;&#1605; &#1608;&#1604;&#1575; &#1580;&#1604;&#1583; &#1605;&#1615;&#1582;&#1583;&#1617;&#1585;&#1577; &#1601;&#1614;&#1604;&#1615;&#1576;&#1616;&#1591; &#1610;&#1593;&#1606;&#1610;: &#1605;&#1585;&#1610;&#1590; &#1601;&#1610; &#1581;&#1610;&#1606;&#1607;&#1563; &#1601;&#1571;&#1582;&#1576;&#1585;&#1608;&#1575; &#1575;&#1604;&#1606;&#1617;&#1576;&#1610;&#1617; ý&#1589;&#1604;&#1617;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1601;&#1602;&#1575;&#1604;: &#1607;&#1604; &#1578;&#1578;&#1617;&#1607;&#1605;&#1608;&#1606; &#1576;&#1589;&#1575;&#1581;&#1576;&#1603;&#1605; &#1571;&#1581;&#1583;&#1611;&#1575;&#1567; &#1601;&#1602;&#1575;&#1604;&#1608;&#1575;: &#1606;&#1593;&#1605; &#1608;&#1584;&#1603;&#1585;&#1608;&#1575; &#1604;&#1607; &#1589;&#1575;&#1581;&#1576;&#1607;&#1563; &#1601;&#1594;&#1590;&#1576; &#1575;&#1604;&#1606;&#1617;&#1576;&#1610;&#1617; ý&#1589;&#1604;&#1617;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1608;&#1580;&#1575;&#1569; &#1576;&#1607; &#1608;&#1578;&#1607;&#1583;&#1617;&#1583;&#1607;&#1563; &#1601;&#1602;&#1575;&#1604;:(&#1593;&#1604;&#1609; &#1605;&#1575; &#1610;&#1602;&#1578;&#1615;&#1604;&#1615; &#1571;&#1581;&#1583;&#1603;&#1605; &#1571;&#1582;&#1575;&#1607;&#1563; &#1575;&#1594;&#1578;&#1587;&#1604; &#1604;&#1607;) &#1610;&#1593;&#1606;&#1610;: &#1578;&#1608;&#1590;&#1617;&#1571; &#1604;&#1607; &#1601;&#1571;&#1605;&#1585;&#1607; &#1576;&#1575;&#1604;&#1606;&#1617;&#1576;&#1610;&#1617; ý&#1589;&#1604;&#1617;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1617;&#1605;- &#1608;&#1607;&#1606;&#1575;&#1603; &#1601;&#1585;&#1602;&#1612; &#1576;&#1610;&#1606; &#1607;&#1584;&#1575; &#1608;&#1584;&#1575;&#1603;.</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Yes, there is a difference between magic and the evil eye. With magic, a person may be afflicted with it, and it can sometimes be the magic of illusion [of the eyes, mind, imagination] (sihr takhyeel). <b>So a person begins to imagine things which others present do not see in front of him. He sees such and such and we are sitting now, he sees in this gathering this stick as snakes. However, the sound person (not afflicted with magic) does not see anything of that. In fact, I shall tell you about a person, meaning who I lived with, he would see some of the newly-born children as puppies, small dogs, a puppy. He had magic done upon him, and when a child came, he would see him as if he was a puppy, so this is takhyeel (illusion of the eyes and mind)</b>. Whereas the evil eye, then no, a person may become ill with respect to a particular part of his body, as has come in the hadeeth of Abu Umaamah Sahl bin Haneef, when Abdullaah bin Amr bin Rabee'ah (may Allaah be pleased with them all) gave him the eye, he said, when he had come to a place (of a reef) known as al-Kharraar, he (Sahl) was bathing, and he had white skin, so he (Abdullaah) saw him under the water and he said, "I have not seen the like of today and nor a skin so white" and he (Sahl) stumbled, meaning became ill thereupon. So they informed the Prophet (sallallaahu alayhi wasallam) and he said, "Do you suspect anyone with respect to your companion?" And they said, "Yes" and they mentioned his companion to him, so the Prophet (sallallaahu alayhi wasallam) became angry. They brought him and he threatened him and said, "For what does one of you kill his own brother, bathe for him," meaning make ablution for him (and give him the resultant water). So his affair  was with the Prophet (sallallaahu alayhi wasallam) and so there is a difference between this and that.</blockquote>    <P>
<font class='titleHeadline'>Comment</font>    <P>
From the answer of the Shaykh we gain some clarification as to what is meant by al-sihr al-takhyeeliyy (illusionary magic) - and it refers to magic that is done with the assistance of the devils to afflict a person so that he starts seeing what others (not afflicted with magic) do not actually see. This type of  magic should not be confused with the tricks of magicians who use sleight of hand and what is similar to that. We repeat here once more what was said <a href=indexd51f.html?hbwcp>in an earlier article</a>:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This passage from Ibn al-Qayyim helps to clarify the confusion about what is referred to as "<i>al-sihr al-takhyeeliyy</i>" (illusionary magic). When this term is used, "<i>illusionary magic</i>", then to an English speaking audience, two things can be intended: <u>The first of them:</u> The actual perceptive faculties and imaginations of people being affected through magic involving devils. So they <u>imagine</u> they are seeing something which is not really there. This is similar to when a husband believes his wife to be ugly, or that she is black instead of white, or that he perceives a horrible smell every time he comes close to her. In all of these cases, the perceptive and imaginative faculties (minds) are being manipulated and played with by the devils, hence it is called "<b>takhyeeliyy</b>" (imaginary, illusory). <u>The second of them:</u> The use of trickery, sleight of hand, and specially crafted artefacts to give the impression of magic but which is not really magic, rather it is simply an art and craft involving ways and  means that are known to a special circle of people which they do not reveal to others and through which they do "illusions" and "tricks." This does not involve the agency of the devils and whilst it is not kufr which expels from Islaam, it is prohibited severely, and in practical experience, many of those who are involved in this type of "illusory" magic, it is not far off to say that most of them are also involved in the magic that involves service to the devils.</blockquote>    <P>
This clarification will help to ensure that the verdicts and rulings of some of the Scholars are understood in the right context. To study this matter in detail and get a thorough grasp of it, please refer to all the following articles:    <P>
<ul> <li> Shaykh Abdur-Rahman al-Barraak on The Various Types Of Magic and a Warning Against Kamal al-Mekki's Enticement of Muslims to Watch The Tricks of The Magicians - (<a href=index1abd.html?mrayz>see here</a>)  <li> Shaykh Ibn Baz on the Magicians and What is Intended by Illusory Magic (al-Sihr al-Takhyeeliyy) - (<a href=index7d5e.html?xkvkx>see here</a>)  <li> Ibn al-Qayyim on the Nature of the Magic of the Magicians of Pharoah and Refutation of the Mu'tazilah Who Deny Magic and A Clarification of What is Meant by Illusory Magic - (<a href=indexd51f.html?hbwcp>see here</a>)  <li> Shaykh Saalih Aal al-Shaykh on the Nature of the Magic Which Expels from Islaam - (<a href=index7dd5.html?crdpu>see here</a>)  <li> Shaykh Ibn Baz on the Tafseel (Detailed Clarification) Regarding Magic Which Constitutes Kufr - (<a href=index2cfb.html?ovgju>see here</a>)  <li> Shaykh Ibn al-Uthaymeen on the Magic that Expels from Islam and the Magic Which Does Not - (<a href=index27ec.html?gwwua>see here</a>)  <li> Shaykh <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> bin Abdullaah bin Abdul-Wahhaab on What Constitutes the Magic Which Expels from Islaam - (<a href=index06e6.html?hbvnw>see here</a>)  <li> Imaam al-Shanqeetee's Clarification and Verification on the Magic that Expels From the Religion - (<a href=indexdddf.html?ltfwe>see here</a>)  <li> Shaykh Ibn Baz: That Which Makes Magic to Be Kufr is Worship of the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> and Seeking their Assistance - (<a href=indexc594.html?ebgpf>see here</a>)    <P>
</ul>   <P> 

</div>
<br>




</td></tr></table>
<body>



</body>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?gdcsj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
</html>


