



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?btvsv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Dajjaal.Com | Shaykh Saalih Aal ash-Shaykh: The Ruling on Seeking Aid From the Jinn</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Saalih Aal ash-Shaykh: The Ruling on Seeking Aid From the Jinn</span><BR>
Wednesday, February 24 2010 - by Admin 
<hr size="1" noshade>
<b>Read more articles at Dajjaal.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Shaykh Saalih Aal ash-Shaykh said in relation to seeking aid from the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>, as occurs in "Majallaat ud-Da'wah no. 1683, p. 23 (1419H):    <P>
 <div class='arabic' align='right'> &#1608;&#1602;&#1583; &#1571;&#1583;&#1578; &#1575;&#1604;&#1575;&#1587;&#1578;&#1593;&#1575;&#1606;&#1577; &#1576;&#1605;&#1606; &#1586;&#1593;&#1605;&#1608;&#1575; &#1571;&#1606;&#1607;&#1605; &#1605;&#1606; &#1605;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1580;&#1606; &#1605;&#1606; &#1602;&#1576;&#1604; &#1576;&#1593;&#1590; &#1575;&#1604;&#1585;&#1575;&#1602;&#1610;&#1606; &#1573;&#1604;&#1609; &#1601;&#1578;&#1606; &#1608;&#1588;&#1581;&#1606;&#1575;&#1569; &#1608;&#1605;&#1588;&#1603;&#1604;&#1575;&#1578; &#1576;&#1610;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1601;&#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1585;&#1575;&#1602;&#1610; &#1573;&#1606; &#1575;&#1604;&#1580;&#1606; &#1610;&#1602;&#1608;&#1604; &#1573;&#1606; &#1575;&#1604;&#1581;&#1575;&#1587;&#1583; &#1571;&#1608; &#1575;&#1604;&#1593;&#1575;&#1574;&#1606; &#1607;&#1608; &#1575;&#1604;&#1586;&#1608;&#1580;&#1577; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577; &#1571;&#1608; &#1575;&#1604;&#1587;&#1581;&#1585; &#1605;&#1606; &#1602;&#1576;&#1604; &#1571;&#1607;&#1604; &#1575;&#1604;&#1586;&#1608;&#1580;&#1577; &#1571;&#1608; &#1605;&#1606; &#1601;&#1604;&#1575;&#1606; &#1605;&#1606; &#1575;&#1604;&#1571;&#1602;&#1585;&#1576;&#1575;&#1569; &#1608;&#1607;&#1603;&#1584;&#1575; &#1548; &#1605;&#1605;&#1575; &#1610;&#1572;&#1583;&#1610; &#1573;&#1604;&#1609; &#1575;&#1604;&#1602;&#1591;&#1610;&#1593;&#1577; &#1608;&#1575;&#1604;&#1588;&#1581;&#1606;&#1575;&#1569; &#1608;&#1575;&#1604;&#1588;&#1585;&#1608;&#1585;    <P>
&#1608;&#1607;&#1606;&#1575; &#1571;&#1605;&#1585; &#1606;&#1604;&#1601;&#1578; &#1573;&#1604;&#1610;&#1607; &#1608;&#1607;&#1608; &#1571;&#1606; &#1593;&#1583;&#1575;&#1604;&#1577; &#1575;&#1604;&#1580;&#1606; &#1604;&#1575; &#1578;&#1593;&#1604;&#1605; &#1581;&#1578;&#1609; &#1604;&#1608; &#1603;&#1575;&#1606; &#1602;&#1585;&#1610;&#1606;&#1575; &#1604;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1608;&#1607;&#1604; &#1575;&#1604;&#1580;&#1606; &#1601;&#1610;&#1605;&#1575; &#1610;&#1582;&#1576;&#1585; &#1576;&#1607; &#1593;&#1583;&#1604; &#1571;&#1608; &#1594;&#1610;&#1585; &#1593;&#1583;&#1604; &#1548; &#1608;&#1604;&#1607;&#1584;&#1575; &#1584;&#1603;&#1585; &#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1601;&#1610; &#1603;&#1578;&#1576; &#1575;&#1604;&#1605;&#1589;&#1591;&#1604;&#1581; &#1571;&#1606; &#1585;&#1608;&#1575;&#1610;&#1577; &#1605;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1580;&#1606; &#1590;&#1593;&#1610;&#1601;&#1577; &#1604;&#1571;&#1606; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1577; &#1601;&#1610; &#1589;&#1581;&#1578;&#1607;&#1575; &#1605;&#1608;&#1602;&#1608;&#1601;&#1577; &#1593;&#1604;&#1609; &#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1593;&#1583;&#1575;&#1604;&#1577; &#1608;&#1575;&#1604;&#1579;&#1602;&#1577; &#1601;&#1610; &#1575;&#1604;&#1585;&#1575;&#1608;&#1610; &#1608;&#1607;&#1584;&#1575; &#1604;&#1575; &#1587;&#1576;&#1610;&#1604; &#1604;&#1604;&#1608;&#1589;&#1608;&#1604; &#1573;&#1604;&#1610;&#1607; &#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1604;&#1580;&#1606; &#1601;&#1603;&#1610;&#1601; &#1610;&#1602;&#1576;&#1604; &#1605;&#1606; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1576;&#1571;&#1606;&#1607;&#1605; &#1605;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1580;&#1606; &#1573;&#1605;&#1575; &#1601;&#1604;&#1575;&#1606; &#1605;&#1587;&#1581;&#1608;&#1585; &#1593;&#1604;&#1609; &#1610;&#1583; &#1601;&#1604;&#1575;&#1606; &#1571;&#1608; &#1571;&#1606;&#1607; &#1605;&#1581;&#1587;&#1608;&#1583; &#1576;&#1593;&#1610;&#1606; &#1601;&#1604;&#1575;&#1606; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Seeking aid (through the Jinn) by those who perform <a href='tags/ruqyah.html' class='tagLink'><font class='tagLink'>Ruqyah</font></a> (treatment of magic through religious incantations) from those who claim that they from the Muslim <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> has let to tribulations and enmity and problems between the people. So the raaqi (the one treating cases of magic) says that the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> says that the jealous one or the one giving the evil eye is the second wife, or the magic is being done by the wife's family or from so and so from the relatives and so on like this, and this is from what leads to the cutting (of family relations) and enmity and evils.    <P>
And there is a matter that we will turn to, which is that the integrity (trustworthiness) of the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> is not know, even if he was a close associate of a person and likewise, are the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> trustworthy or not trustworthy in what they narrate, for this reason the Scholars of hadeeth mention in the books of mustalah (the science of narrating) that the narration from the Muslim <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> are weak (unacceptable) because in its authenticity, a narration is dependent upon knowing the integrity and trustworthiness of the narrator, and there is no way to arrive at this (knowledge) in relation to the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>. So how can those who say that they are Muslim <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> accept that a person has had magic done on him by so and so, or that a person is envied by the eye of so and so.</blockquote>    <P>
And from this (and other scholars have also clarified the same, we shall bring their statements), we establish that the information provided by a <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> is not to be trusted, because his trustworthiness is unknown, and this is besides the fact that if a <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> has possessed someone, then that is a major sin and it is fisq and dhulm, and thus the Jinn's integrity is already invalidated, so how can those who do <a href='tags/ruqyah.html' class='tagLink'><font class='tagLink'>Ruqyah</font></a> and treat people accept wholeheartedly whatever the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> tell them? And further, amongst the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> there are hypocrites who claim to be Muslim, and who no doubt tell lies. So with all of this, it is great source of danger that information be readily taken and accepted from the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>, it is a danger that only leads to more corruption in the society, because the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> love mischief, and so they lay out plans of great deception, to outsmart those who make <a href='tags/ruqyah.html' class='tagLink'><font class='tagLink'>Ruqyah</font></a> and treat cases of magic amongst the people, so it is upon all concerned to be aware of these realities.    <P>
 <P> 

</div>
<br>




</td></tr></table>
<body>



</body>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?btvsv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:33 GMT -->
</html>


