



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?feicu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Dajjaal.Com | Prophet Solomon, the Devils (Shayaateen), Magic, the Angels Harut and Marut and Baabil (Babylon)</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Prophet Solomon, the Devils (Shayaateen), Magic, the Angels Harut and Marut and Baabil (Babylon)</span><BR>
Wednesday, February 24 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Dajjaal.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Claims Regarding Prophet Sulaymaan</font>    <P>
It is widespread amongst the Jews, Christians and the Occultists that Prophet <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam) practiced magic, and some of them consider him to be a magician and not a Prophet. There are many other claims and associations made with respect to <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam) which he is free of. In this article we want to clarify the Qur'anic treatment of this subject which absolves and exonerates <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam) from the false things attributed to him.    <P>
<font class='titleHeadline'>The Qur'an on Prophet <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>, the Devils, Magic and <a href="tags/babylon.html" class="tagLink"><font class="tagLink">Babylon</font></a></font>    <P>
First the passage in the Qur'an on this subject, Allah, the Most High, said in Surah al-Baqarah:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'>  &#1608;&#1614;&#1604;&#1614;&#1605;&#1617;&#1614;&#1575; &#1580;&#1614;&#1575;&#1569;&#1607;&#1615;&#1605;&#1618; &#1585;&#1614;&#1587;&#1615;&#1608;&#1604;&#1612; &#1605;&#1617;&#1616;&#1606;&#1618; &#1593;&#1616;&#1606;&#1583;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1605;&#1615;&#1589;&#1614;&#1583;&#1617;&#1616;&#1602;&#1612; &#1604;&#1617;&#1616;&#1605;&#1614;&#1575; &#1605;&#1614;&#1593;&#1614;&#1607;&#1615;&#1605;&#1618; &#1606;&#1614;&#1576;&#1614;&#1584;&#1614; &#1601;&#1614;&#1585;&#1616;&#1610;&#1602;&#1612; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1571;&#1615;&#1608;&#1578;&#1615;&#1608;&#1575;&#1618; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1614; &#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1608;&#1614;&#1585;&#1614;&#1575;&#1569; &#1592;&#1615;&#1607;&#1615;&#1608;&#1585;&#1616;&#1607;&#1616;&#1605;&#1618; &#1603;&#1614;&#1571;&#1614;&#1606;&#1617;&#1614;&#1607;&#1615;&#1605;&#1618; &#1604;&#1575;&#1614; &#1610;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614;. &#1608;&#1614;&#1575;&#1578;&#1617;&#1614;&#1576;&#1614;&#1593;&#1615;&#1608;&#1575;&#1618; &#1605;&#1614;&#1575; &#1578;&#1614;&#1578;&#1618;&#1604;&#1615;&#1608;&#1575;&#1618; &#1575;&#1604;&#1588;&#1617;&#1614;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1605;&#1615;&#1604;&#1618;&#1603;&#1616; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1600;&#1603;&#1616;&#1606;&#1617;&#1614; &#1575;&#1604;&#1588;&#1617;&#1614;&#1610;&#1618;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575;&#1618; &#1610;&#1615;&#1593;&#1614;&#1604;&#1617;&#1616;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1617;&#1616;&#1581;&#1618;&#1585;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1617;&#1616;&#1605;&#1614;&#1575;&#1606;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1581;&#1614;&#1578;&#1617;&#1614;&#1609; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1575;&#1614; &#1573;&#1616;&#1606;&#1617;&#1614;&#1605;&#1614;&#1575; &#1606;&#1614;&#1581;&#1618;&#1606;&#1615; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1612; &#1601;&#1614;&#1604;&#1575;&#1614; &#1578;&#1614;&#1603;&#1618;&#1601;&#1615;&#1585;&#1618; &#1601;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618;&#1607;&#1615;&#1605;&#1614;&#1575; &#1605;&#1614;&#1575; &#1610;&#1615;&#1601;&#1614;&#1585;&#1617;&#1616;&#1602;&#1615;&#1608;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1576;&#1614;&#1610;&#1618;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1614;&#1585;&#1618;&#1569;&#1616; &#1608;&#1614;&#1586;&#1614;&#1608;&#1618;&#1580;&#1616;&#1607;&#1616; &#1608;&#1614;&#1605;&#1614;&#1575; &#1607;&#1615;&#1605; &#1576;&#1616;&#1590;&#1614;&#1570;&#1585;&#1617;&#1616;&#1610;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1573;&#1616;&#1604;&#1575;&#1617;&#1614; &#1576;&#1616;&#1573;&#1616;&#1584;&#1618;&#1606;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1608;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1614;&#1575; &#1610;&#1614;&#1590;&#1615;&#1585;&#1617;&#1615;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1575;&#1614; &#1610;&#1614;&#1606;&#1601;&#1614;&#1593;&#1615;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1614;&#1602;&#1614;&#1583;&#1618; &#1593;&#1614;&#1604;&#1616;&#1605;&#1615;&#1608;&#1575;&#1618; &#1604;&#1614;&#1605;&#1614;&#1606;&#1616; &#1575;&#1588;&#1618;&#1578;&#1614;&#1585;&#1614;&#1575;&#1607;&#1615; &#1605;&#1614;&#1575; &#1604;&#1614;&#1607;&#1615; &#1601;&#1616;&#1610; &#1575;&#1604;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1605;&#1616;&#1606;&#1618; &#1582;&#1614;&#1604;&#1575;&#1614;&#1602;&#1613; &#1608;&#1614;&#1604;&#1614;&#1576;&#1616;&#1574;&#1618;&#1587;&#1614; &#1605;&#1614;&#1575; &#1588;&#1614;&#1585;&#1614;&#1608;&#1618;&#1575;&#1618; &#1576;&#1616;&#1607;&#1616; &#1571;&#1614;&#1606;&#1601;&#1615;&#1587;&#1614;&#1607;&#1615;&#1605;&#1618; &#1604;&#1614;&#1608;&#1618; &#1603;&#1614;&#1575;&#1606;&#1615;&#1608;&#1575;&#1618; &#1610;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And when there came to them a Messenger from Allah (Muhammad) confirming what was with them, a party of those who were given the Scripture threw away the Book of Allah behind their backs as if they did not know!  They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>). <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic and such things that came down at <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i>." And from these (angels) people learn that by which they cause separation between man and his wife, but they could not thus harm anyone except by Allah's permission. And they learn that which harms them and profits them not. And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. And how bad indeed was that for which they sold their ownselves, if they but knew.  (Al-Baqarah 2:101-102) </b><img src='images/qnend.gif'></blockquote>    <P>
We can turn to the classical commentaries of Ibn Jareer at-Tabari and Ibn Katheer for the explanation of these verses, part by part, so what follows will be based upon these commentaries.    <P>
<b><u>Background to the Verse on Magic</u></b>    <P>
<div class='arabic' align='right'>&#1608;&#1614;&#1604;&#1614;&#1605;&#1617;&#1614;&#1575; &#1580;&#1614;&#1575;&#1569;&#1607;&#1615;&#1605;&#1618; &#1585;&#1614;&#1587;&#1615;&#1608;&#1604;&#1612; &#1605;&#1617;&#1616;&#1606;&#1618; &#1593;&#1616;&#1606;&#1583;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1605;&#1615;&#1589;&#1614;&#1583;&#1617;&#1616;&#1602;&#1612; &#1604;&#1617;&#1616;&#1605;&#1614;&#1575; &#1605;&#1614;&#1593;&#1614;&#1607;&#1615;&#1605;&#1618; &#1606;&#1614;&#1576;&#1614;&#1584;&#1614; &#1601;&#1614;&#1585;&#1616;&#1610;&#1602;&#1612; &#1605;&#1617;&#1616;&#1606;&#1614; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1571;&#1615;&#1608;&#1578;&#1615;&#1608;&#1575;&#1618; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1614; &#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1608;&#1614;&#1585;&#1614;&#1575;&#1569; &#1592;&#1615;&#1607;&#1615;&#1608;&#1585;&#1616;&#1607;&#1616;&#1605;&#1618; &#1603;&#1614;&#1571;&#1614;&#1606;&#1617;&#1614;&#1607;&#1615;&#1605;&#1618; &#1604;&#1575;&#1614; &#1610;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614;.</div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And when there came to them a Messenger from Allah (Muhammad) confirming what was with them, a party of those who were given the Scripture threw away the Book of Allah behind their backs as if they did not know! </b><img src='images/qnend.gif'></blockquote>    <P>
Ibn Katheer explains that this refers to a faction amongst the Jews who threw the Torah behind their backs when they learned that the glad tidings of the Prophethood Muhammad (alayhis salaam) are found within it, and that they abandoned it as if they did not know that this (knowledge) was in it. Instead they resorted to magic (witchcraft, sorcery), and Ibn Katheer makes mention of Labeed bin al-A'sam, the Jew who practiced witchcraft upon the Prophet (alayhis salaam), with the use of a comb thrown into a well. At-Tabaree explains likewise that this verse is in rebuke of the Jews who were in the time of the Prophet Muhammad (alayhis salaam) and rejected his prophethood despite knowing he was a messenger, and in rebuke of them not acting upon this knowledge which is in their hands (in the Torah), and their following of their ancestors who followed what the devils rehearsed to them in the kingship of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (of magic).    <P>
This verse leads into the next one which continues on the subject of magic.    <P>
<b><u>The Devils in the Time of Sulaymaan</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1575;&#1578;&#1617;&#1614;&#1576;&#1614;&#1593;&#1615;&#1608;&#1575;&#1618; &#1605;&#1614;&#1575; &#1578;&#1614;&#1578;&#1618;&#1604;&#1615;&#1608;&#1575;&#1618; &#1575;&#1604;&#1588;&#1617;&#1614;&#1610;&#1614;&#1575;&#1591;&#1616;&#1610;&#1606;&#1615; &#1593;&#1614;&#1604;&#1614;&#1609; &#1605;&#1615;&#1604;&#1618;&#1603;&#1616; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> They followed what the Shayaateen (devils) gave out (falsely of the magic) in the lifetime of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (<a href='tags/solomon.html' class='tagLink'><font class='tagLink'>Solomon</font></a>)... </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari brings narrations:    <P>
<blockquote><u>From Mujaahid</u>: That this that the devils (shayaateen) used to listen to the revelation (in his time) and whenever they caught something of it, they added two hundred other words like it. So <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> consfiscated these books from them, and when Sulaymaan died, the devils found them and taught the people from them, which was magic.     <P>
<u>From Qatadah</u>: That this refers to soothsaying and magic, and that Allaah mentions here that the devils innovated books in which there was magic, and then they spread it amongst the people and taught it to them.    <P>
<u>Ibn Abbaas</u>: That the devils in the time of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> wrote books in which there was magic and disbelief, then they buried them under the throne of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>, and later they brought them out and read them to the people.</blockquote>    <P>
<b><u>Magic Was Taught By the Devils and <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> Was Free From It</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1587;&#1615;&#1604;&#1614;&#1610;&#1618;&#1605;&#1614;&#1575;&#1606;&#1615; &#1608;&#1614;&#1604;&#1614;&#1600;&#1603;&#1616;&#1606;&#1617;&#1614; &#1575;&#1604;&#1588;&#1617;&#1614;&#1610;&#1618;&#1575;&#1591;&#1616;&#1610;&#1606;&#1614; &#1603;&#1614;&#1601;&#1614;&#1585;&#1615;&#1608;&#1575;&#1618; &#1610;&#1615;&#1593;&#1614;&#1604;&#1617;&#1616;&#1605;&#1615;&#1608;&#1606;&#1614; &#1575;&#1604;&#1606;&#1617;&#1614;&#1575;&#1587;&#1614; &#1575;&#1604;&#1587;&#1617;&#1616;&#1581;&#1618;&#1585;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> Sulayman did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic... </b><img src='images/qnend.gif'></blockquote>    <P>
At Tabaree explains that in this verse that what Allaah ascribed to the devils, the Jews ascribed to <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>, claiming that it was from his knowledge, and that he subjugated the men, <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> and devils (shayaateen), and other creatures of Allaah through magic. And on account of this belief of their's they justified to the people their own actions in doing what Allaah had made unlawful upon them of magic. And then they said that <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> was not a Prophet but a magician, so Allaah absolved <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> bin Dawud from magic and kufr against the claims made against him, and also declared as liars those justifying their practice of magic, and Allaah exposed them in that they were simply following the magic that the devils rehearsed to them during the era of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>.    <P>
Ibn Katheer brings a narration:    <P>
<blockquote><u>Muhammad bin Ishaaq bin Yasaar</u>: That the devils wrote books on types of magic, after they knew of Sulayman's death, and so they wrote "Whoever wishes to attain such and such, let him do such and such", and they put all of this into a book, and then placed a seal on it upon the seal of Prophet <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> and they wrote as its title, "<i>This is What Aasif bin Burkhyaa the Friend of the King <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> Wrote of the Kept Treasures of Knowledge</i>". Then they buried it beneath his throne. Later, some of the Children of Israel found this book and they said, "By Allaah Sulayman's kingdom was not except by way of this (magic)". So they spread this magic amongst the people, they learned it and taught it, and magic is not found amongst anyone more than amongst the Jews...</blockquote>    <P>
And at-Tabaree brings a number of narrations:    <P>
<blockquote><u>Ibn Hawshab:</u> He states similar to what was said by Ibn Ishaq above, and explains that the devils would write, "Whoever wants to arrive at such and such let him turn to the sun and let him say such and such. And whoever wants [to be able] to do such and such, let him face his back to the sun and let him say such and such." So they wrote the likes of this and put it in a book, and gave it the same title as mentioned by Ibn Ishaq above. Then they buried it under Sulayman's throne. When <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> died, <a href='tags/iblees.html' class='tagLink'><font class='tagLink'>Iblees</font></a> stood as a khateeb and said, "O people, verily <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> was not a prophet, but he was a magician, so hold to his magic which is in his place of retreat and in his houses", then he showed them the place in which it was buried, and when they found it they said, "By Allaah, <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> was a magician, and this is his magic, with it shall we worship, and through it shall we subdue (others)". However, the believers amongst those Jews said, "Rather, he was a Prophet, a believer". Then, when Allaah sent the Prophet Muhammad (alayhis salaam), he mentioned the Prophets, until he mentioned Dawud and <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>, so the Jews said, "Look at Muhammad, mixing truth with falsehood, he is mentioning <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> along with the Prophets, he was merely a magician who would carry the winds", so Allah revealed the verse, "<b>Sulayman did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic...</b>"    <P>
<u>Saeed bin Jubair</u>: That <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> use to follow up what was in the hands of the devils of magic, and he took it from them and put it all under his throne in his treasure house. The devils were not able to reach it, so they came to the men and said "Do you want the knowledge by which <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> used to subjugate the devils and the winds and other (things)?" They said, "Yes", and so the devils directed them to the treasure house, under the throne. So the men found it and then began acting upon it.  This (false claim) continued until the people of Hijaz said that <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> used to also practice this, and that this is magic. Then Allaah, the Mighty and Majestic, revealed, upon the tongue of Muhammad (alayhis salaam) the exoneration of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> from that.    <P>
<u>Qatadah:</u> The devils innovated a book in which there was magic and they spread it amongst the people teaching it to them. When <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam) heard of it, he followed up those books, took them and buried them under his throne, hating that the people would learn from them. When Allaah took <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> away, the devils took out those books from where they were and taught them to the people. They (the devils) said that this is the knowledge that <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> used to conceal and keep to himself. So Allaah excused <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> and exonerated him, saying, "<b>Sulayman did not disbelieve, but the Shayaateen (devils) disbelieved, teaching men magic</b>."    <P>
<u>Muhammad bin Ishaaq</u>: That the book(s) they found after the death of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam), they claim that it was a book revealed by Allaah from <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a>, which <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> kept hidden from them, so they took it and made it into their religion.</blockquote>    <P>
What happened was that the people fell into two groups. <b>The first</b>: Those amongst the believers who knew magic was kufr and unlawful, and so they reviled Sulaymaan (alayhis salaam), out of their wrong belief that he practiced magic, and some of them denied he was a Prophet. <b>The second</b>: Another group who held that since <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> was a Prophet and he practiced magic (as they were misled to believe by the devils), then they considered it permissible to indulge in magic, so they took that as a religion to be followed, and this is what characterized these people from that time until the time of Prophet Jesus (alayhis salaam) through to the time of Prophet Muhammad (alayhis salaam), right until this day of ours.    <P>
<div class='sidebar'>Note here that in this verse Allaah is referring to the Jews contemporary to the Prophet Muhammad (sallallaahu alayhi wasallam) and it is an indication that they continued upon that magic that the devils rehearsed to the people in the time of Sulaymaan in the 10th century BC. In this verse Allaah, is clearing <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> from that false accusation and recounting the historical facts and realities. In the 6th century BC. Nebuchadnezzar, the Chaldean king of <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> (Babil), conquered Judah (the Jews, Bani Israil) and put them into exile. When these Jews came to <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>, in addition to the magic they had learned from the devils, they also learned of the magic at Babil part of which came to the people through the angels <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>. Babil was a center of occult science, and it was the place of the Chaldeans who were star and planet worshipers.  Whilst in captivity in Babil (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>) Jewish priests, after looking into and studying the "mystery religion" of those Babylonians developed their own sophisticated form of occultism.</div>    <P>
<div class='sidebar'>The occult knowledge and codified magic practiced by the Jews historically and today is known as the <a href='tags/qabbalah.html' class='tagLink'><font class='tagLink'>Qabbalah</font></a> (also spelt Kabbalah and referred to as "Jewish Mysticism" or "Jewish Esoteric Knowledge"). It is essentially (and in reality) a coded system of magic, of invoking the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> (and angels, as they believe), through words, numbers, symbols, geometry and so on.  Also, the word <a href='tags/qabbalah.html' class='tagLink'><font class='tagLink'>Qabbalah</font></a>, is from the hebrew root Q-B-L, ("to receive"), and it is similar to the Arabic root of qaaf, baa, laam ("to receive"). It means to receive "mystical knowledge", or "secret teaching", and it is expressed diagramatically through what is called the "Tree of Life". It would be <a href=http:///www.dajjaal.com/liar/?bgxjt >a real good idea to read this article here</a> to make some important connections. The <a href='tags/qabbalah.html' class='tagLink'><font class='tagLink'>Qabbalah</font></a> was transmitted orally and secretly through the centuries and was written down in the the Christian era. What was written is not the entire <a href='tags/qabbalah.html' class='tagLink'><font class='tagLink'>Qabbalah</font></a> but just the rudiments of it. The essence, core and reality of the <a href='tags/qabbalah.html' class='tagLink'><font class='tagLink'>Qabbalah</font></a>  is only ever passed on through oral tradition and with conditions. It continued to be transmitted through the ages (picking up elements from other beliefs) right to this day and has been and still is behind the esoteric doctrines of most secret orders and sects. <a href='tags/iblees.html' class='tagLink'><font class='tagLink'>Iblees</font></a> and his offspring the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a>, have continued to deceive people into believing that there is "immortality" through "secret esoteric knowledge", and that the practitioners of these esoteric mystery religions of <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> and Egypt (magic and devil worship) can become "angels" and "live forever". These people consider themselves "<u>illuminated</u>" and the rest of mankind as gullible, incapable, unfit, inferior people who must be hemmed in and ruled over.</div>    <P>
<u><b>Babylon and The Two Angels <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and Marut</b></u>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'>  &#1608;&#1614;&#1605;&#1614;&#1575; &#1571;&#1615;&#1606;&#1586;&#1616;&#1604;&#1614; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1618;&#1605;&#1614;&#1604;&#1614;&#1603;&#1614;&#1610;&#1618;&#1606;&#1616; &#1576;&#1616;&#1576;&#1614;&#1575;&#1576;&#1616;&#1604;&#1614; &#1607;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; &#1608;&#1614;&#1605;&#1614;&#1575;&#1585;&#1615;&#1608;&#1578;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>... and such things that came down at <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> to the two angels, <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i>."</blockquote>    <P>
Babylon (Baabil, Babel) is a region just south of Bagdhad in Iraq, and it was the place of Nimrod who is said by at-Tabari (and other sources) to have built the Tower of Babel, and the place of the Chaldeans and Assyrians, and the Sabean planet worshippers. It became a center of much learning, especially magic and astrology. Magic was integral to the functioning of the society. It should be noted that place-names are not generally mentioned in the Qur'an in relation to past events, and there are only a few that are mentioned, such as Midyan, Iram, <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a>, so the mention of <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> in particular has significance and as we shall see, the verse we are discussing is extremely accurate in characterizing those Jews who simply followed the magic rehearsed to them by the devils in the time of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> (alayhis salaam) and what they took from <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>, and which they incorporated into the Talmud (the Babylonian Talmud).    <P>
At-Tabaree brings numerous narrations:    <P>
<blockquote><u>As-Sudee:</u> That this was another type of magic by which they (the Jews) disputed with him (Muhammad), through what was revealed upon the two Angels, and that the speech of the Angels between themselves, when it is taught to the men, crafted and acted upon, it is magic.    <P>
<u>Qataadah</u>: Magic is of two types: The magic taught by the devils, and the magic taught by <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>.    <P>
<u>Ibn Zayd</u>: The devils and the two angels teaching the people magic. </blockquote>    <P>
  At-Tabaree explains:     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So the meaning of the verse upon the explanation of this saying which we have mentioned from those whom we have mentioned it from is: That the Jews followed that (magic) which the devils rehearsed to them during the lifetime of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> which was (that magic) sent down upon the two angels at <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>), <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, and they are two angels from the angels of Allaah.</blockquote>    <P>
And he says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed Allaah, the Mighty and Majestic, sent down (all) the good and the evil, and He explained all of that to His servants, and He inspired His Messengers (with revelation) and ordered them to teach His creation and to distinguish for them what is lawful from what is unlawful, such as fornication (adultery), stealing, and all the sins which they (the Prophets)informed them about and prohibited them from committing them. So magic is one of those sins which He informed them of and prohibited them from acting upon.</blockquote>    <P>
Then at-Tabaree mentions an alternative reading of the verse:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So the explanation of the verse upon this saying is: And they followed the magic that the devils rehearsed in the lifetime of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> and [that magic of] the separation between a man and his wife which was revealed upon the two angels at <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a>, <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>.</blockquote>    <P>
And he brings in this regard:    <P>
<blockquote><u>Mujaahid</u>: As for magic, then the devils taught it, and as for what the angels taught, then it is separation between a man and his wife, as Allaah the Most High said.  </blockquote>    <P>
Then at-Tabari brings about ten or so narrations from the early commentators regarding the two angels, and we will bring the information from those narrations together here:    <P>
<blockquote><u>Ibn Abbaas</u>: Allaah open up the heaven so that the angels could look at the actions of sons of <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a>. [Ar-Rabee']: When the people after <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> fell into what they fell into of sins and disbelief in Allaah, the Angels in the heaven said, "O Lord this world, you created them for your worship and obedience, but they have fallen into disbelief, killing the unlawful soul, eating unlawful wealth, stealing and fornicating, and drinking intoxicant", and so they began to supplicate against them, and did not make excuse for them.     <P>
<u>[Mujaahid]</u>: For the Angels became surprised at the oppression of the sons of <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a>, and their had come to them Messengers and books and clear proofs. <u>[Ibn Abbaas]</u>: The Angels said, "O Lord, those children of <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> whom you created with your own hand, and to which you made the angels prostrate,and to whom  you taught all the names of all things, they commit sins." [Ibn Mas'ood]: The Angels supplicated against them, and against the earth, heaven and mountins, saying "O Lord, will you not destroy them?"     <P>
<u>[Ibn Abbaas]</u>: So Allaah said that if you were in their place you would have done actions just like theirs. <u>[Ibn Mas'ood]</u>: So Allaah revealed to the Angels: "If I sent down the lust, desire (shahwah) and the devils upon your hearts, and you descended (to the earth), you would have done (the same) also." And so the angels conversed amongst themselves that if they were put to trial they would remain firm.    <P>
<u>[Ibn Abbaas]</u>: They (the angels) said, "Subhaanallaah, this is not something befitting for us to do." So they were ordered to choose (from amongst them) who would be sent down to the earth, so they chose <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, .    <P>
<u>As-Sudee:</u> <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a> reviled the people of the earth for their judgements (ahkaam), and it was said to them that the son of <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> was given ten desires by which they disobey Allaah. And <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a> said that if these desires were given to them, and were then sent down (to the earth) they would have judged with (and abided by) justice. So Allaah said, "Descend, I have given you both those ten desires, so judge amongst the people with justice..."    <P>
<u>[Ibn Abbaas]</u>: They were sent down to the earth and everything was made lawful for them on the earth except that they should not associate partners with Allaah in worship, and nor steal, and nor fornicate, and nor drink intoxicants and nor kill a soul that Allaah had made unlawful except with due right.So they continued (upon the earth) until they came across a woman given half of beauty, called Beedhukht. <u>[As-Sudee]</u>: She came to them regarding a dispute with her husband. [Ibn Abbaas]: When they saw her, they desired to commit zinaa with her. She said not unless you worship others alongside Allaah, and drink intoxicants and kill a soul and prostrate to this idol. So they said "We do not associate anything with Allaah (in worship)".     <P>
<u>[Ar-Rabee']</u>: When she saw that they refused to worship the idol, she said to them that you must choose one of these three, either worship the idol, kill a soul or drink intoxicants. <u>[Ibn Abbaas}</u>: So one of the angels said to the other "Go back to her" and she said, "No, unless you drink intoxicants", so they did until they were intoxicated. Then a man came upon them (and saw them)...<u>[Ar-Rabee']</u> So they feared that he might divulge this (their being intoxicated)... <u>[Ibn Abbaas]</u>: so they killed him. When they fell into this evil, Allaah open the heaven for His angels, and they said, "Subhaanaka, you are most knowledgeable". <u>[Ar-Rabee']</u>: When the angels saw what these two angels had fallen into, they were very surprised ... and so they began to seek forgiveness for those in the earth after this. Then it was said to them to choose the punishment of the world or that of the hereafter, so they said (to themselves) that the punishment of the world expires but the punishment of the hereafter never ends. So they chose the punishment of the world, and so they were placed in <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>), and they are punished there. <u>[Mujaahid]</u>: They were ordered to go to <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a>, where their punishment was to be given. <u>As-Sudee</u>: So they were restrained in <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> where they began speaking to the people with their speech which was magic.  </blockquote>    <P>
Ibn Katheer, after mentioning many of these narrations in his tafseer of this verse explains that the story of <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a> has been narrated from a group amongst the taabi'een, such as Mujahid, as-Sudee, al-Hasan al-Basree, Qataadah, Abu al-Aaliyah, az-Zuhree, ar-Rabee' bin Anas, Muqaatil bin Hayyaan and others, and that a portion of the mufassireen (exegetes) from the earlier and later ones have also reported them, and that the contents of them go back to the narrations that come from Banee Israa'eel, since there is no authentic, connected hadeeth, ascribed to the truthful, the believed, the infallible, who does not speak of his own desire [the Prophet (alayhis salaam)], and that the report in the Qur'an is given generally, without detail, and that we believe in what Allaah has related in the Qur'an upon what Allaah intended by it, and Allaah knows best about the reality.    <P>
<b><u>Harut and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a> and the Tribulation of Magic</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1605;&#1614;&#1575; &#1610;&#1615;&#1593;&#1614;&#1604;&#1617;&#1616;&#1605;&#1614;&#1575;&#1606;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1581;&#1614;&#1578;&#1617;&#1614;&#1609; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1575;&#1614; &#1573;&#1616;&#1606;&#1617;&#1614;&#1605;&#1614;&#1575; &#1606;&#1614;&#1581;&#1618;&#1606;&#1615; &#1601;&#1616;&#1578;&#1618;&#1606;&#1614;&#1577;&#1612; &#1601;&#1614;&#1604;&#1575;&#1614; &#1578;&#1614;&#1603;&#1618;&#1601;&#1615;&#1585;&#1618; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> ...but neither of these two (angels) taught anyone (such things) till they had said, "<i>We are only for trial, so disbelieve not (by learning this magic from us)</i>." </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari brings narrations:    <P>
<blockquote><u>Qatadah and al-Hasan</u>: A (covenant) was taken from them that they would not teach anyone until they said, "We are a tribulation so do not disbelieve".    <P>
<u>Ibn Juraij</u>: A covenant was taken from them bot that they do not teach anyone until they say, "We are a tribulation so do not disbelieve, no one ventures into magic except a disbeliever". </blockquote>    <P>
At-Tabari explains that the tribulation (fitnah) is a trial, an examination, a test.    <P>
<b><u>Learning What Separates a Man From His Wife</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'>  &#1601;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618;&#1607;&#1615;&#1605;&#1614;&#1575; &#1605;&#1614;&#1575; &#1610;&#1615;&#1601;&#1614;&#1585;&#1617;&#1616;&#1602;&#1615;&#1608;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1576;&#1614;&#1610;&#1618;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1614;&#1585;&#1618;&#1569;&#1616; &#1608;&#1614;&#1586;&#1614;&#1608;&#1618;&#1580;&#1616;&#1607;&#1616; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b>  And from these (angels) people learn that by which they cause separation between man and his wife... </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari explains:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The meaning of the speech is that the angels would not teach anyone until they said they are a tribulation, but the people would refuse to accept this and proceed to learn from them what would separate a man from his wife.</blockquote>    <P>
And this type of magic occurs when a man (or woman) is made to imagine things about the spouse that which is not real, so he may see her as very ugly, or may perceive unbearable smells, and things of this nature, which are not real, but they are only in his own mind, so he is made to imagine things that are not real. This is from the type of magic that is called "imaginary".    <P>
At-Tabari brings a narration:    <P>
<blockquote><u>Qatadah</u>: The separation of them (husband and wife) is that he would bewitch each one from its partner,and cause each one of them to hate their partner.</blockquote>    <P>
<b><u>Benefit and Harm Lies Only with Allaah and With His Permission and Decree</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1605;&#1614;&#1575; &#1607;&#1615;&#1605; &#1576;&#1616;&#1590;&#1614;&#1570;&#1585;&#1617;&#1616;&#1610;&#1606;&#1614; &#1576;&#1616;&#1607;&#1616; &#1605;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1614;&#1583;&#1613; &#1573;&#1616;&#1604;&#1575;&#1617;&#1614; &#1576;&#1616;&#1573;&#1616;&#1584;&#1618;&#1606;&#1616; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> ...but they could not thus harm anyone except by Allah's permission... </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari comments:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Those who learned from the two angels, <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a>, that by which they separate between a man and his wife, were not able to harm (anyone) with what they learned from them both (the angels) through which they (tried) to separate between a man and his wife in relation to anyone amongst the people, except for the one whom Allaah had already decreed that such (magic) will harm him. As for the one for whom Allaah has repelled its harm, and guarded him from the disliked magic, and blowing on knots and spells (incantations), then that will not harm him and its harm will not reach him.</blockquote>    <P>
And he brings a narration:    <P>
<blockquote><u>Sufyaan (ath-Thawree)</u>: Regarding His saying, "but they could not thus harm anyone except by Allah's permission", he said: By the <i>qadaa</i> (ordainment, decree) of Allaah.</blockquote>    <P>
And the qadaa (ordainment, decree) here refers to the <i>qadaa al-kawnee</i>, that which relates to all the occurrences in the creation, both good and evil - whilst noting that evil exists only within the occurrences in the creation and not in Allaah's actions of decreeing them and bringing them into existence, since in Allaah's actions are nothing but wisdom and justice, and they have a far-reaching purpose and lofty goals, tied to his wisdom and justice.    <P>
<b><u>Magicians Only Learn What Harms Them</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1610;&#1614;&#1578;&#1614;&#1593;&#1614;&#1604;&#1617;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1614;&#1575; &#1610;&#1614;&#1590;&#1615;&#1585;&#1617;&#1615;&#1607;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1575;&#1614; &#1610;&#1614;&#1606;&#1601;&#1614;&#1593;&#1615;&#1607;&#1615;&#1605;&#1618; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And they learn that which harms them and profits them not. </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>They learn from them the magic which harms them in their religion, and it does not benefit them in their hereafter. As for this life in the world, then they used to earn through it and acquire a (means of) living through it.</blockquote>    <P>
<b><u>The Practitioners of Magic Have No Share in the Hereafter</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1604;&#1614;&#1602;&#1614;&#1583;&#1618; &#1593;&#1614;&#1604;&#1616;&#1605;&#1615;&#1608;&#1575;&#1618; &#1604;&#1614;&#1605;&#1614;&#1606;&#1616; &#1575;&#1588;&#1618;&#1578;&#1614;&#1585;&#1614;&#1575;&#1607;&#1615; &#1605;&#1614;&#1575; &#1604;&#1614;&#1607;&#1615; &#1601;&#1616;&#1610; &#1575;&#1604;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1605;&#1616;&#1606;&#1618; &#1582;&#1614;&#1604;&#1575;&#1614;&#1602;&#1613; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And indeed they knew that the buyers of it (magic) would have no share in the Hereafter. </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari brings narrations:    <P>
<blockquote><u>Qatadah</u>: The people of the book knew that from the covenant that Allaah took from them that the sorcerer will have no share on the Day of Judgement with Allaah.    <P>
<u>As-Sudee</u>: Meaning the Jews, He says that the Jews already know that whoever learned it or chose it, he would have no share in the Hereafter.    <P>
<u>Mujahid</u>: For the one who purchased (the knowledge) of what separates a man from his wife.    <P>
<u>Ibn Zayd</u>: The Jews knew that in the Book of Allaah, in the Torah, that whoever purchased magic and abandoned the deen of Allaah, he will not have any share in the Hereafter and so the fire is his destination.</blockquote>    <P>
And at-Tabari explains that this is in reference to the Jews at the time of Muhammad (alayhis salaam) for they knew from their own book, the Torah, these facts (as occurs in the above narrations) but despite knowing this they continued to follow the magic rehearsed at the time of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> by the devils and the magic revealed by <a href='tags/harut.html' class='tagLink'><font class='tagLink'>Harut</font></a> and <a href='tags/marut.html' class='tagLink'><font class='tagLink'>Marut</font></a> to the people at <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>), and they essentially threw the Torah behind their backs, even after knowing the Muhammad was mentioned therein.    <P>
As for "buying, purchasing" mentioned in the verse, Shaykh Saalih Aal ash-Shaykh says in explanation of the verse, as occurs in his explanation of Kitab ut-Tawhid on the chapter on magic:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the magician he has purchased the learning of magic, he has purchase, purchased what thing? He is purchased magic in place of what thing? In place of Tawhid, so the price is Tawhid, the price is faith in Allaah alone, and the object (being bought) is magic... so it means the one who gave his religion as consideration (something of value) for that thing which he took, which is magic...</blockquote>    <P>
And there are numerous views on the meaning of "khalaaq" (<span class='arb'>&#1582;&#1614;&#1604;&#1575;&#1614;&#1602;&#1613;</span>) such as "naseeb" (portion, share, part) or "hujjah" (proof), meaning such a one has no proof on the Day of Judgement or "deen" (religion), meaning that such a one has no deen. But at-Tabari says what is most correct is that it means "naseeb", that such a one will have no share in the Hereafter.    <P>
At-Tabari then says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He means that such a one will have no share of reward and recompense (jazaa', thawaab) or <a href='tags/paradise.html' class='tagLink'><font class='tagLink'>Paradise</font></a>, besides his share of the Hellfire... He means that they have no share of good deeds, as for evil deeds then they have their share of them.</blockquote>    <P>
<b><u>Magicians Sell Their Souls</u></b>    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1604;&#1614;&#1576;&#1616;&#1574;&#1618;&#1587;&#1614; &#1605;&#1614;&#1575; &#1588;&#1614;&#1585;&#1614;&#1608;&#1618;&#1575;&#1618; &#1576;&#1616;&#1607;&#1616; &#1571;&#1614;&#1606;&#1601;&#1615;&#1587;&#1614;&#1607;&#1615;&#1605;&#1618; &#1604;&#1614;&#1608;&#1618; &#1603;&#1614;&#1575;&#1606;&#1615;&#1608;&#1575;&#1618; &#1610;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And how bad indeed was that for which they sold their own selves, if they but knew. </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So He informed about them that they knew that whoever purchased of magic, that he would have no share in the Hereafter, and He described them that they commit disobedience to Allaah, out of full knowledge of it, and they disbelieve in Allaah and His Messengers, and they prefer following the devils and acting upon what they have introduced of magic over His Book, His inspiration and His revelation, out of stubborn opposition on their behalf and transgression against His Messengers, and transgressing His limits, and with their full knowledge of the punishment that lies for them with Allaah for whoever does that....</blockquote>    <P>
And in clarification of Allaah first affirming knowledge for them and then negating knowledge from in the end of this verse, at-Tabari says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Allaah negated knowledge from them by saying, "...<b>if they but knew</b>...", after he had described tehm that they knew, by saying, "...<b>and indeed they knew</b>...", for the reason that they did not act upon what they knew. And the aalim (scholar) is the one who acts upon his knowledge. When his action opposes his knowledge, then he falls amongst the meanings of "the ignorant".  </blockquote>    <P>
Also <a href=index933b.html?qovvu>refer to this article</a> on how a person becomes a magician and when the <a href='tags/jinn.html' class='tagLink'><font class='tagLink'>Jinn</font></a> are ready to serve the magicians.    <P>
<font class='titleHeadline'>Ibrahim, King Nimrod and <a href="tags/babylon.html" class="tagLink"><font class="tagLink">Babylon</font></a></font>    <P>
We mentioned earlier that the Qur'an does not generally make specific mention of place-names when imparting lessons and morals and admonitions through the recounting of history. However, specific mention was made of <a href='tags/baabil.html' class='tagLink'><font class='tagLink'>Baabil</font></a> (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>) in relation to magic and the exoneration of <a href='tags/sulayman.html' class='tagLink'><font class='tagLink'>Sulayman</font></a> from magic. In this section we bring some background information about Babil (<a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>). You should recall that in the time of Nuh, the people turned away from the worship of Allaah to the worship of others, to venerating, and worshipping the righteous dead. After the flood, the offspring of Nuh spread through the earth and a few generations later a tyrant appeared by the name of Nimrod (he was a descendant of Nuh by four generations), who revived and continued the rebellion against Allaah, the Most High.    <P>
Allaah says in the Qur'an:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1571;&#1614;&#1604;&#1614;&#1605;&#1618; &#1578;&#1614;&#1585;&#1614; &#1573;&#1616;&#1604;&#1614;&#1609; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1581;&#1614;&#1570;&#1580;&#1617;&#1614; &#1573;&#1616;&#1576;&#1618;&#1585;&#1614;&#1575;&#1607;&#1616;&#1610;&#1605;&#1614; &#1601;&#1616;&#1610; &#1585;&#1616;&#1576;&#1617;&#1616;&#1607;&#1616; &#1571;&#1614;&#1606;&#1618; &#1570;&#1578;&#1614;&#1575;&#1607;&#1615; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1575;&#1604;&#1618;&#1605;&#1615;&#1604;&#1618;&#1603;&#1614; &#1573;&#1616;&#1584;&#1618; &#1602;&#1614;&#1575;&#1604;&#1614; &#1573;&#1616;&#1576;&#1618;&#1585;&#1614;&#1575;&#1607;&#1616;&#1610;&#1605;&#1615; &#1585;&#1614;&#1576;&#1617;&#1616;&#1610;&#1614; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1610;&#1615;&#1581;&#1618;&#1610;&#1616;&#1600;&#1610; &#1608;&#1614;&#1610;&#1615;&#1605;&#1616;&#1610;&#1578;&#1615; &#1602;&#1614;&#1575;&#1604;&#1614; &#1571;&#1614;&#1606;&#1614;&#1575; &#1571;&#1615;&#1581;&#1618;&#1610;&#1616;&#1600;&#1610; &#1608;&#1614;&#1571;&#1615;&#1605;&#1616;&#1610;&#1578;&#1615; &#1602;&#1614;&#1575;&#1604;&#1614; &#1573;&#1616;&#1576;&#1618;&#1585;&#1614;&#1575;&#1607;&#1616;&#1610;&#1605;&#1615; &#1601;&#1614;&#1573;&#1616;&#1606;&#1617;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1614; &#1610;&#1614;&#1571;&#1618;&#1578;&#1616;&#1610; &#1576;&#1616;&#1575;&#1604;&#1588;&#1617;&#1614;&#1605;&#1618;&#1587;&#1616; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1614;&#1588;&#1618;&#1585;&#1616;&#1602;&#1616; &#1601;&#1614;&#1571;&#1618;&#1578;&#1616; &#1576;&#1616;&#1607;&#1614;&#1575; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1605;&#1614;&#1594;&#1618;&#1585;&#1616;&#1576;&#1616; &#1601;&#1614;&#1576;&#1615;&#1607;&#1616;&#1578;&#1614; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610; &#1603;&#1614;&#1601;&#1614;&#1585;&#1614; &#1608;&#1614;&#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1604;&#1575;&#1614; &#1610;&#1614;&#1607;&#1618;&#1583;&#1616;&#1610; &#1575;&#1604;&#1618;&#1602;&#1614;&#1608;&#1618;&#1605;&#1614; &#1575;&#1604;&#1592;&#1617;&#1614;&#1575;&#1604;&#1616;&#1605;&#1616;&#1610;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> Have you not looked at him who disputed with Ibrahim (Abraham) about his Lord (Allah), because Allah had given him the kingdom? When Ibrahim (Abraham) said (to him): "My Lord (Allah) is He Who gives life and causes death." He said, "I give life and cause death." Ibrahim (Abraham) said, "Verily! Allah causes the sun to rise from the east; then cause it you to rise from the west." So the disbeliever was utterly defeated. And Allah guides not the people, who are wrong-doers.  (Al-Baqarah 2:258) </b><img src='images/qnend.gif'></blockquote>    <P>
At-Tabari says that this is a tyrant from <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a> called Nimrod, the son of Kan'aan, the son of Kush, the son of Saam, the son of Nuh (Noah). And he brings narrations regarding who this king was:    <P>
<blockquote><u>Mujaahid</u>: It is Nimrod the son of Kan'aan. <u>Qataadah</u>: We used to discuss that it was a king called Nimrod, and he was the first king that was tyrannical upon the earth and he is the builder of the tower at <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>. <u>Qataadah</u>: His name is Nimrod, and he is the first king that was tyrannical upon the earth and he disputed with Ibrahim regarding his Lord. <u>Ar-Rabee</u>: It has been mentioned to us that the one who argued with Ibrahim regarding his Lord was a king called Nimrod, and he is the first tyrant that was tyrannical upon the earth, and he is the builder of the tower of <a href='tags/babylon.html' class='tagLink'><font class='tagLink'>Babylon</font></a>. <u>Ibn Juraij</u>: Abdullaah bin Kathir informed me that he heard Mujahid say, "He is Nimrod". <u>Ibn Juraij</u>: He is Nimrod, and it is said he is the first king on the earth.</blockquote>    <P>
And at-Tabari also brings narrations from the early commentators explaining the dispute between Ibrahim (alayhis salaam) and Nimrod in that Nimrod claimed that he could bring forth two men, kill one and leave the other, thus proving that he gives life and takes life, and he also claimed he can take four people, feed two of them and starve the other two, thus having control over life and death. So Ibrahim confounded him by asking him to make the sun rise from the West instead of the East, and thus was Nimrod defeated in argument.    <P>
Shaykh ul-Islam Ibn Taymiyyah says in al-Hamawiyyah (p. 13, Dar ul-Kutub al-Ilmiyyah), whilst discussing the origins of the negation of Allaah being above the heaven, above His Throne:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The first of when this saying was manifested was from al-Ja'da bin Dirham, and al-Jahm bin Safwan took it from him, and he proclaimed, and the saying of the Jahmiyyah was attributed to him [thereafter]. And it has been said that al-Ja'd took his saying from Abbaan bin Sam'aan, and Abbaan took it from Talut, the nephew of Labeed bin al-A'sam, and Talut took it from Labeed bin al-A'sam, the Jew sorcerer who put magic upon the Prophet (sallallaahu alayhi wasallam), and al-Ja'd bin Dirham - in what has been said - was from the land of Harraan, <b>and there used to be amongst them a great portion of the Sabeans and Philosophers from the remmants of the religion of Nimrod, and the Kan'aanites, and some of the later ones authored [works] on the magic (sihr) of those people</b> - and Nimrod is the King of the Chaldean Sabean Pagans.</blockquote>    <P>
And Ibn Taymiyyah also says in Majmoo' al-Fataawaa (35/195):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>For Nimrod bin Kan'aan was the king of those (star and planet worshippers), and the Scholars of the Sabeans were the astrologers and their likes. And have idols been worshipped overwhelmingly except on account of the viewpoint (teaching) of this vile faction who consume the wealth of people in falsehood and hinder (others) from the path of Allaah.</blockquote>    <P>
So it is clear that the legacy of Nimrod and his people was one of astrology, star and planet worship, magic, and arrogance towards Allaah's authority and dominion over the universe. After his death, Nimrod became deified and worshipped in different nations through a certain mythology involving the sun which denotes "birth" and "rebirth" (rising and setting of the sun) through different names such as Baal, Adonis, Dionysis, Bacchus. Around the same era as Nimrod, a similar mythology appeared out of Egypt in relation to Osiris (a "sun god") and Horus (Osiris reborn in his son, Horus, giving the "birth, rebirth" doctrine) This mythology features very heavily in magic and the occult right until this day and it is behind the belief of reaching "immortality" or "becoming angels" through successive cycles of birth and rebirth. Please refer to this article for related information on how <a href='tags/iblis.html' class='tagLink'><font class='tagLink'>Iblis</font></a> caused <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> to err through these types of promises:    <P>
<ul><li> The Whispering of <a href='tags/iblis.html' class='tagLink'><font class='tagLink'>Iblis</font></a> (<a href='tags/satan.html' class='tagLink'><font class='tagLink'>Satan</font></a>) To <a href='tags/adam.html' class='tagLink'><font class='tagLink'>Adam</font></a> With Four Matters - (<a href=indexe4af.html?bgxjt>see here</a>)  </ul>    <P>
This subject will be expounded upon in other articles inshaa'Allaah.    <P>
    <P>
 <P> 

</div>
<br>


<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/feicu-prophet-solomon-the-devils-shayaateen-magic-the-angels-harut-and-marut-and-baabil-babylon.html">Prophet Solomon, the Devils (Shayaateen), Magic, the Angels Harut and Marut and Baabil (Babylon)</a><BR>
https://www.dajjaal.com/liar/?feicu<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.dajjaal.com/liar/print.cfm?feicu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:12:32 GMT -->
</html>


