

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.nabahani.com/articles/amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:18 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>

	<title>Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</title>
	
	
	<meta name="Keywords" content="Ibn Taymiyyah">
	<meta name="Description" content="Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies.  ...">
	
	<style>body {background-image:url("../assets/backgrounds/white-grey-bg.gif");background-repeat:repeat-x;background-color:#666666;}</style>

	<link rel="STYLESHEET" type="text/css" href="../css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../layout/nabahani/style.css">
</head>

<body>

<div align="center">


<br>
 
<table width="1100" cellpadding="0" cellspacing="0" border="0">
<tr>




<td align="right" class="textSmall">


&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monday, 18 August 2025&nbsp;&nbsp;&nbsp;



</td>
</tr>
</table>

<img src="../images/spacer.gif" width="10" height="9">





<table width="1100" cellpadding="0" cellspacing="0" border="0" background="../assets/banners/nabahani-banner.gif">
<tr><td width="1"><img src="../images/spacer.gif" alt="" border="0" width="1" height="180"></td>


<td width="999" valign="middle">



<table cellpadding="0" cellspacing="0" width="100%" border="0" height=""><tr><td><img src="../images/spacer.gif" alt="" border="0" width="15" height="15"></td><td valign="middle"><img src="../images/spacer.gif" alt="" border="0" width="5" height="5"><BR><font style="font-size:40px;font-family:Book Antiqua" color="#ffffff"><em><strong></strong></em></font><BR>
<img src="../images/spacer.gif" width="10" height="12"><BR>
<font style="font-size:23px" color="#ffffff"></font><BR><BR>



</td>
<td valign="top" valign="middle" align="right">




<BR>

</td></tr></table>




 
</td>
</tr></table>



 
 
 

<table width="1100" cellpadding="0" cellspacing="0" border="0">
<tr>

<td>
<ul class="solidblockmenu">

<li><a href="../index.html">HOME</a></li> <li><a href="../categories/cc-al-nabahani.html">AL-NABAHANI</a></li><li><a href="../categories/os-the-hizb.html">THE HIZB</a></li><li><a href="../categories/is-cult-members.html">THE CULT CLINIC</a></li><li><a href="../categories/cz-the-rulers.html">THE RULERS & RULERSHIP</a></li><li><a href="../categories/gm-politics.html">POLITICS</a></li><li><a href="../categories/yb-articles.html">ARTICLES</a></li> <li><a href="../reports.html">REPORTS</a></li> <li><a href="../contact.html"><span>CONTACT</span></a></li>

</ul>
<br style="clear: left" />
</td>


<td align="right" nowrap>
<ul class="solidblockmenu2">


 

 <li><a href="../tags.html">TAGS</a></li> 
 <li><a href="../rss.html">RSS</a></li> 
</ul><br style="clear: right" />
</td>
</tr>
<tr bgcolor="Gray"><td colspan="2"><img src="../images/spacer.gif" width="1" height="1" border="0" alt=""></td></tr>
</table>


<table width="1100" cellpadding="0" cellspacing="0" bgcolor="#ffffff">
<tr><td><img src="../images/spacer.gif" width="1" height="10" border="0" alt=""></td></tr>
</table>
 



<table width="1100" cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr>

<td><img src="../images/spacer.gif" width="15" height="1"></td>
<td valign="top" width="100%">




<font style="font-size:12px;">
You are here: </font>



<font style="font-size:12px;">
<a href="../index.html">Home</a> <img src="../images/crumb.gif" class="pb-1"> 
<a href="../categories/yb-articles.html">Articles</a> 

</font>
<BR>




<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff" width="100%">
<tr>


<td valign="top" width="100%">

<span class="articleTitle">Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</span>  





<BR>



 <span style="font-size:11px;">Posted by <a href="../authors/Abu.Iyaad.html">Abu.Iyaad</a>, Editor in <a href="../categories/yb-articles.html">Articles</a></span><BR>
 
 


<span style="font-size:11px;">
Topics: <a href="../tags/ibn-taymiyyah.html">
Ibn Taymiyyah 
</a> </span><BR> 



</td>
<td><img src="../images/spacer.gif" width="15" height="1"></td>
</tr>
</table>

<hr size="1" noshade style="margin-top:12" color="#cdcdcd">

<table cellpadding="0" cellspacing="0" width="625"><tr>



  

<td  nowrap><a href="mailto:Enter_Email?subject=Nabahani.Com | Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies&body=I found this great article:%0D%0A%0D%0AIbn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies%0D%0A//www.nabahani.com/?amqxrhq"><img src="../images/mail-icon-16.gif" border="0"></a>&nbsp;</td>
<td valign="top"  nowrap><a href="mailto:Enter_Email?subject=Nabahani.Com | Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies&body=You may be interested in this article:%0D%0A%0D%0AIbn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies%0D%0A//www.nabahani.com/?amqxrhq"><font class="f12">Mail To Friend</font></a>&nbsp;</td>
<td nowrap><a href="../print3b23.html?amqxrhq"><img src="../images/print-icon-16.gif" border="0"></a>&nbsp;</td>
<td  nowrap><a href="../print3b23.html?amqxrhq"><font class="f12">Printer Friendly</font></a> 
</td>


<td valign="top" nowrap align="right" width="100%">


<!-- AddThis Button BEGIN -->
<a class="addthis_button" href="http://addthis.com/bookmark.php?v=250&amp;pub=xa-4b1aa87179c845dd"><img src="../../s7.addthis.com/static/btn/v2/lg-share-en.gif" width="125" height="16" alt="Bookmark and Share" style="border:0"/></a><script type="text/javascript" src="../../s7.addthis.com/js/250/addthis_widget.js#pub=xa-4b1aa87179c845dd"></script>
<!-- AddThis Button END --> 




</td>


</td></tr></table>


<br>



<div align=center><img src=../assets/sysimages/aal-hamd.gif border=0></div>    <P>
<blockquote>The Shari'ah explanation behind the rise, fall, success, failure of nations, and the explanation of the emergence of tyrannical rule, or an enemy that is granted ascendancy and authority, is very apparent in the texts of the Book, the Sunnah and in the statements of the Sahaabah and Taabi'een. These explanations and the divine laws upon which they are based are blatantly denied (and if not, then cheap lip-service is paid to them) by these groups who emerged in the 20th century, who brought "fikr" (ideology) into the Muslim Ummah, and who incorporated the Marxist-Leninist revolutionary thought into their methodologies of reform. At the same time, they ignored the fact that much of the Ummah is steeped in shirk (polytheism), bid'ah (innovation) and ilhaad (heresy). These thinkers (like <a href='../tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, Mawdudi and al-Nabahani) thought they could meet the same success as those Communists did in their lands. Shaykh al-Islaam <a href='../tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'>Ibn Taymiyyah</font></a> said in a lengthy passage in Majmu' al-Fataawaa (13/177-182), in explanation of the divine law (we have simply quoted the relevant excerpts for our purpose in this article):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1580;&#1593;&#1583; &#1575;&#1604;&#1610;&#1607; &#1610;&#1606;&#1587;&#1576; &#1605;&#1585;&#1608;&#1575;&#1606; &#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#1575;&#1604;&#1580;&#1593;&#1583;&#1610; &#1570;&#1582;&#1585; &#1582;&#1604;&#1601;&#1575;&#1569; &#1576;&#1606;&#1609; &#1571;&#1605;&#1610;&#1577; &#1608;&#1603;&#1575;&#1606; &#1588;&#1572;&#1605;&#1607; &#1593;&#1575;&#1583; &#1593;&#1604;&#1610;&#1607; &#1581;&#1578;&#1609; &#1586;&#1575;&#1604;&#1578; &#1575;&#1604;&#1583;&#1608;&#1604;&#1577; &#1601;&#1573;&#1606;&#1607; &#1573;&#1584;&#1575; &#1592;&#1607;&#1585;&#1578; &#1575;&#1604;&#1576;&#1583;&#1593; &#1575;&#1604;&#1578;&#1609; &#1578;&#1582;&#1575;&#1604;&#1601; &#1583;&#1610;&#1606; &#1575;&#1604;&#1585;&#1587;&#1604; &#1575;&#1606;&#1578;&#1602;&#1605; &#1575;&#1604;&#1604;&#1607; &#1605;&#1605;&#1606; &#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1585;&#1587;&#1604; &#1608;&#1575;&#1606;&#1578;&#1589;&#1585; &#1604;&#1607;&#1605; ... &#1601;&#1604;&#1605;&#1575; &#1592;&#1607;&#1585; &#1575;&#1604;&#1606;&#1601;&#1575;&#1602; &#1608;&#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1575;&#1604;&#1601;&#1580;&#1608;&#1585; &#1575;&#1604;&#1605;&#1582;&#1575;&#1604;&#1601; &#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1587;&#1604;&#1591;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569; &#1601;&#1582;&#1585;&#1580;&#1578; &#1575;&#1604;&#1585;&#1608;&#1605; &#1575;&#1604;&#1606;&#1589;&#1575;&#1585;&#1609; &#1575;&#1604;&#1609; &#1575;&#1604;&#1588;&#1575;&#1605; &#1608;&#1575;&#1604;&#1580;&#1586;&#1610;&#1585;&#1577; &#1605;&#1585;&#1577; &#1576;&#1593;&#1583; &#1605;&#1585;&#1577; &#1608;&#1571;&#1582;&#1584;&#1608;&#1575; &#1575;&#1604;&#1579;&#1594;&#1608;&#1585; &#1575;&#1604;&#1588;&#1575;&#1605;&#1610;&#1577; &#1588;&#1610;&#1574;&#1575;&#1611; &#1576;&#1593;&#1583; &#1588;&#1610;&#1569; &#1575;&#1604;&#1609; &#1571;&#1606; &#1571;&#1582;&#1584;&#1608;&#1575; &#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1602;&#1583;&#1587; &#1601;&#1609; &#1571;&#1608;&#1575;&#1582;&#1585; &#1575;&#1604;&#1605;&#1575;&#1574;&#1577; &#1575;&#1604;&#1585;&#1575;&#1576;&#1593;&#1577; &#1608;&#1576;&#1593;&#1583; &#1607;&#1584;&#1575; &#1576;&#1605;&#1583;&#1577; &#1581;&#1575;&#1589;&#1585;&#1608;&#1575; &#1583;&#1605;&#1588;&#1602; &#1608;&#1603;&#1575;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1588;&#1575;&#1605; &#1576;&#1571;&#1587;&#1608;&#1571; &#1581;&#1575;&#1604; &#1576;&#1610;&#1606; &#1575;&#1604;&#1603;&#1601;&#1575;&#1585; &#1575;&#1604;&#1606;&#1589;&#1575;&#1585;&#1609; &#1608;&#1575;&#1604;&#1605;&#1606;&#1575;&#1601;&#1602;&#1610;&#1606; &#1575;&#1604;&#1605;&#1604;&#1575;&#1581;&#1583;&#1577; ... &#1608;&#1603;&#1584;&#1604;&#1603; &#1604;&#1605;&#1575; &#1603;&#1575;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1605;&#1588;&#1585;&#1602; &#1602;&#1575;&#1574;&#1605;&#1610;&#1606; &#1576;&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1603;&#1575;&#1606;&#1608;&#1575; &#1605;&#1606;&#1589;&#1608;&#1585;&#1610;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1601;&#1575;&#1585; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1578;&#1585;&#1603; &#1608;&#1575;&#1604;&#1607;&#1606;&#1583; &#1608;&#1575;&#1604;&#1589;&#1610;&#1606; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1601;&#1604;&#1605;&#1575; &#1592;&#1607;&#1585; &#1605;&#1606;&#1607;&#1605; &#1605;&#1575; &#1592;&#1607;&#1585; &#1605;&#1606; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1575;&#1604;&#1573;&#1604;&#1581;&#1575;&#1583; &#1608;&#1575;&#1604;&#1601;&#1580;&#1608;&#1585; &#1587;&#1604;&#1591; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1603;&#1601;&#1575;&#1585; &#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;: {&#1608;&#1614;&#1602;&#1614;&#1590;&#1614;&#1610;&#1618;&#1606;&#1614;&#1575; &#1573;&#1616;&#1604;&#1614;&#1609; &#1576;&#1614;&#1606;&#1616;&#1610; &#1573;&#1616;&#1587;&#1618;&#1585;&#1614;&#1575;&#1574;&#1616;&#1610;&#1604;&#1614; &#1601;&#1616;&#1610; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1616; &#1604;&#1614;&#1578;&#1615;&#1601;&#1618;&#1587;&#1616;&#1583;&#1615;&#1606;&#1614;&#1617; &#1601;&#1616;&#1610; &#1575;&#1604;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; &#1605;&#1614;&#1585;&#1614;&#1617;&#1578;&#1614;&#1610;&#1618;&#1606;&#1616; &#1608;&#1614;&#1604;&#1614;&#1578;&#1614;&#1593;&#1618;&#1604;&#1615;&#1606;&#1614;&#1617; &#1593;&#1615;&#1604;&#1615;&#1608;&#1611;&#1617;&#1575; &#1603;&#1614;&#1576;&#1616;&#1610;&#1585;&#1611;&#1575; &#1601;&#1614;&#1573;&#1616;&#1584;&#1614;&#1575; &#1580;&#1614;&#1575;&#1569; &#1608;&#1614;&#1593;&#1618;&#1583;&#1615; &#1571;&#1615;&#1608;&#1604;&#1575;&#1607;&#1615;&#1605;&#1614;&#1575; &#1576;&#1614;&#1593;&#1614;&#1579;&#1618;&#1606;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1603;&#1615;&#1605;&#1618; &#1593;&#1616;&#1576;&#1614;&#1575;&#1583;&#1611;&#1575; &#1604;&#1614;&#1617;&#1606;&#1614;&#1575; &#1571;&#1615;&#1608;&#1618;&#1604;&#1616;&#1610; &#1576;&#1614;&#1571;&#1618;&#1587;&#1613; &#1588;&#1614;&#1583;&#1616;&#1610;&#1583;&#1613; &#1601;&#1614;&#1580;&#1614;&#1575;&#1587;&#1615;&#1608;&#1575;&#1618; &#1582;&#1616;&#1604;&#1575;&#1614;&#1604;&#1614; &#1575;&#1604;&#1583;&#1616;&#1617;&#1610;&#1614;&#1575;&#1585;&#1616; &#1608;&#1614;&#1603;&#1614;&#1575;&#1606;&#1614; &#1608;&#1614;&#1593;&#1618;&#1583;&#1611;&#1575; &#1605;&#1614;&#1617;&#1601;&#1618;&#1593;&#1615;&#1608;&#1604;&#1575; &#1579;&#1615;&#1605;&#1614;&#1617; &#1585;&#1614;&#1583;&#1614;&#1583;&#1618;&#1606;&#1614;&#1575; &#1604;&#1614;&#1603;&#1615;&#1605;&#1615; &#1575;&#1604;&#1618;&#1603;&#1614;&#1585;&#1614;&#1617;&#1577;&#1614; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1607;&#1616;&#1605;&#1618; &#1608;&#1614;&#1571;&#1614;&#1605;&#1618;&#1583;&#1614;&#1583;&#1618;&#1606;&#1614;&#1575;&#1603;&#1615;&#1605; &#1576;&#1616;&#1571;&#1614;&#1605;&#1618;&#1608;&#1614;&#1575;&#1604;&#1613; &#1608;&#1614;&#1576;&#1614;&#1606;&#1616;&#1610;&#1606;&#1614; &#1608;&#1614;&#1580;&#1614;&#1593;&#1614;&#1604;&#1618;&#1606;&#1614;&#1575;&#1603;&#1615;&#1605;&#1618; &#1571;&#1614;&#1603;&#1618;&#1579;&#1614;&#1585;&#1614; &#1606;&#1614;&#1601;&#1616;&#1610;&#1585;&#1611;&#1575; &#1573;&#1616;&#1606;&#1618; &#1571;&#1614;&#1581;&#1618;&#1587;&#1614;&#1606;&#1578;&#1615;&#1605;&#1618; &#1571;&#1614;&#1581;&#1618;&#1587;&#1614;&#1606;&#1578;&#1615;&#1605;&#1618; &#1604;&#1616;&#1571;&#1614;&#1606;&#1601;&#1615;&#1587;&#1616;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1573;&#1616;&#1606;&#1618; &#1571;&#1614;&#1587;&#1614;&#1571;&#1618;&#1578;&#1615;&#1605;&#1618; &#1601;&#1614;&#1604;&#1614;&#1607;&#1614;&#1575; &#1601;&#1614;&#1573;&#1616;&#1584;&#1614;&#1575; &#1580;&#1614;&#1575;&#1569; &#1608;&#1614;&#1593;&#1618;&#1583;&#1615; &#1575;&#1604;&#1570;&#1582;&#1616;&#1585;&#1614;&#1577;&#1616; &#1604;&#1616;&#1610;&#1614;&#1587;&#1615;&#1608;&#1572;&#1615;&#1608;&#1575;&#1618; &#1608;&#1615;&#1580;&#1615;&#1608;&#1607;&#1614;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1616;&#1610;&#1614;&#1583;&#1618;&#1582;&#1615;&#1604;&#1615;&#1608;&#1575;&#1618; &#1575;&#1604;&#1618;&#1605;&#1614;&#1587;&#1618;&#1580;&#1616;&#1583;&#1614; &#1603;&#1614;&#1605;&#1614;&#1575; &#1583;&#1614;&#1582;&#1614;&#1604;&#1615;&#1608;&#1607;&#1615; &#1571;&#1614;&#1608;&#1614;&#1617;&#1604;&#1614; &#1605;&#1614;&#1585;&#1614;&#1617;&#1577;&#1613; &#1608;&#1614;&#1604;&#1616;&#1610;&#1615;&#1578;&#1614;&#1576;&#1616;&#1617;&#1585;&#1615;&#1608;&#1575;&#1618; &#1605;&#1614;&#1575; &#1593;&#1614;&#1604;&#1614;&#1608;&#1618;&#1575;&#1618; &#1578;&#1614;&#1578;&#1618;&#1576;&#1616;&#1610;&#1585;&#1611;&#1575; &#1593;&#1614;&#1587;&#1614;&#1609; &#1585;&#1614;&#1576;&#1615;&#1617;&#1603;&#1615;&#1605;&#1618; &#1571;&#1614;&#1606; &#1610;&#1614;&#1585;&#1618;&#1581;&#1614;&#1605;&#1614;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1573;&#1616;&#1606;&#1618; &#1593;&#1615;&#1583;&#1578;&#1615;&#1617;&#1605;&#1618; &#1593;&#1615;&#1583;&#1618;&#1606;&#1614;&#1575; &#1608;&#1614;&#1580;&#1614;&#1593;&#1614;&#1604;&#1618;&#1606;&#1614;&#1575; &#1580;&#1614;&#1607;&#1614;&#1606;&#1614;&#1617;&#1605;&#1614; &#1604;&#1616;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1616;&#1610;&#1606;&#1614; &#1581;&#1614;&#1589;&#1616;&#1610;&#1585;&#1611;&#1575;} ... &#1608;&#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1607;&#1606;&#1575; &#1571;&#1606; &#1583;&#1608;&#1604;&#1577; &#1576;&#1606;&#1609; &#1571;&#1605;&#1610;&#1577; &#1603;&#1575;&#1606; &#1575;&#1606;&#1602;&#1585;&#1575;&#1590;&#1607;&#1575; &#1576;&#1587;&#1576;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1580;&#1593;&#1583; &#1575;&#1604;&#1605;&#1593;&#1591;&#1604; &#1608;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1575;&#1604;&#1571;&#1587;&#1576;&#1575;&#1576; &#1575;&#1604;&#1578;&#1609; &#1571;&#1608;&#1580;&#1576;&#1578; &#1573;&#1583;&#1576;&#1575;&#1585;&#1607;&#1575; &#1608;&#1601;&#1609; &#1570;&#1582;&#1585; &#1583;&#1608;&#1604;&#1578;&#1607;&#1605; &#1592;&#1607;&#1585; &#1575;&#1604;&#1580;&#1607;&#1605; &#1576;&#1606; &#1589;&#1601;&#1608;&#1575;&#1606; &#1576;&#1582;&#1585;&#1587;&#1575;&#1606; ...</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>And this al-Ja'd [bin Dirham] to whom Marwan bin Muhammad al-Ja'dee, the last of the khalifahs of Bani Umayyah, ascribed [himself], his [al-Ja'd's] evil returned upon him [the khalifah] until the entire [Umayyad] state came to an end, for verily, when innovations which oppose the deen of the Messengers emerge, Allaah seeks vengeance from whoever opposes the Messengers and He aids them [the Messengers]...So when hypocrisy, innovations, and sin that oppose the deen of the Messenger emerged, the enemies were given ascendancy, mastery over them, and thus Christian Rome departed to Shaam and the [Arabian] peninsula, time after time, and they took the Syrian ports progressively until they took Bayt al-Maqdis at the end of the fourth century (hijrah), and they also lay siege to Damascus shortly after, and the people of Shaam were in the worst situation, in between the Christian disbelievers and the Heretical Hypocrites (i.e. the Baatiniyyah)... And likewise, when the people in the East were established upon Islaam, they were aided against the pagan disbelievers from the Turks and (from) India and China and other than them. But when there appeared from them what appeared of innovations, heresy and sinfulness, the disbelievers were empowered over them, He, the Exalted said:    <P>
<blockquote class='quotequran'><img src='../images/qnstart.gif'><b> And We decreed for the Children of Israel in the Scripture, that indeed you would do mischief on the earth twice and you will become tyrants and extremely arrogant! So, when the promise came for the first of the two, We sent against you slaves of Ours given to terrible warfare. They entered the very innermost parts of your homes. And it was a promise (completely) fulfilled. Then We gave you once again, a return of victory over them. And We helped you with wealth and children and made you more numerous in man power. (And We said): "If you do good, you do good for your ownselves, and if you do evil (you do it) against yourselves." Then, when the second promise came to pass, (We permitted your enemies) to make your faces sorrowful and to enter the mosque (of Jerusalem) as they had entered it before, and to destroy with utter destruction all that fell in their hands. [And We said in the Torah]: "It may be that your Lord may show mercy unto you, but if you return (to sins), We shall return (to Our Punishment)." And We have made Hell a prison for the disbelievers. (al-Israa 17:4-8) </b><img src='../images/qnend.gif'></blockquote>    <P>
... and the intent here is that the state of Bani Umayyah its demise was on account of this al-Ja'd, the divester [of Allaah's attributes] and other such causes which necessitated its retreat (i.e. decline into non-existence)...</blockquote>    <P>
The deviation mentioned here by Shaykh al-Islaam, which is that of ta'teel (denial of Allaah's attributes), ilhaad (heresy, statements of disbelief such as al-ittihaad, and al-hulool and so on), and likewise clear shirk, and much fujoor (sin) amongst the common-folk, then this is what is found in abundance today yet this is ignored by these "thinkers" who brought "fikr" (ideology) into the Ummah in their vain attempts to bring reform as they claimed. What they are attempting is impossible and clashes with the clear divine law in Allaah's creation. It is clearly stated by Hizb al-Tahrir in much of their literature, that their movement is <u>purely political</u>, that they are not interested in preaching and in rectifying beliefs, and in cultivating Muslims upon Tawheed, Eemaan and the Sunnah. They actually see this to be an impediment to their political work - which according to them is the only way that khilaafah can be established. They, like all 20th century political movements masquerading as Islamic reformers, rely upon large numbers to implement their goals. Realizing that purifying the beliefs of the Muslims, calling them to single out their worship for Allaah alone, and making them abide by the Sunnah and abandoning blind-following and partisanship is not going to be very fruitful for their objectives and will not lead to the required large numbers, they do not make these matters as the foundational basis of their da'wah. Rather, it is the last thing they have in mind. As such, they are attempting the impossible. And so they involve and distract the average common Muslim away from the true basis of rectification and play with their minds using psychological and emotional games by using the sorry and sad state of the Muslim ummah and its turmoil to argue that a Muslim is obligated to be a member of a party, meaning their party, and by not joining and getting involved they are sinful!    <P>
</blockquote> <P>

<hr size="1" noshade color="#cdcdcd">

<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'//www.nabahani.com/articles/amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.cfm\'>Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//www.nabahani.com/articles/amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//www.nabahani.com/?amqxrhq'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="max-width:450px;width:100%;" value="<a href='amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.html'>Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</a>" onFocus="this.select()" onClick="this.select()"></form>

<table cellpadding="0" cellspacing="0" style="max-width:450px;width:100%;"><tr><td valign="top" class="f13" style="line-height:18px;">
<strong><font color="#565656">Share or Bookmark this page:</strong> You will need to have an account with the selected service in order to post links or bookmark this page.<BR>
<img src="../images/spacer.gif" width="12" height="6"><BR>
<a href="http://twitter.com/home?status=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies%20%2F%2Fnabahani%2Ecom%2F%3Famqxrhq"><img src="../images/social/social-twitter.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww%2Enabahani%2Ecom%2Farticles%2Famqxrhq%2Dibn%2Dtaymiyyah%2Don%2Dthe%2Dtrue%2Dreasons%2Dfor%2Dthe%2Ddecline%2Dof%2Dislamic%2Dnations%2Dand%2Dsocieties%2Ecfm&amp;t=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies"><img src="../images/social/social-facebook.png" border="0"></a>&nbsp;&nbsp;
<a href="http://delicious.com/save?url=http%3A%2F%2Fwww%2Enabahani%2Ecom%2Farticles%2Famqxrhq%2Dibn%2Dtaymiyyah%2Don%2Dthe%2Dtrue%2Dreasons%2Dfor%2Dthe%2Ddecline%2Dof%2Dislamic%2Dnations%2Dand%2Dsocieties%2Ecfm&amp;title=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies&amp;notes=I+found+this+article+very+informative+and+helpful"><img src="../images/social/social-delicious.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.dzone.com/links/add.html?url=http%3A%2F%2Fwww%2Enabahani%2Ecom%2Farticles%2Famqxrhq%2Dibn%2Dtaymiyyah%2Don%2Dthe%2Dtrue%2Dreasons%2Dfor%2Dthe%2Ddecline%2Dof%2Dislamic%2Dnations%2Dand%2Dsocieties%2Ecfm&amp;title=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies&amp;description=I+found+this+article+very+informative+and+helpful"><img src="../images/social/social-dzone.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.stumbleupon.com/submit?url=http%3A%2F%2Fwww%2Enabahani%2Ecom%2Farticles%2Famqxrhq%2Dibn%2Dtaymiyyah%2Don%2Dthe%2Dtrue%2Dreasons%2Dfor%2Dthe%2Ddecline%2Dof%2Dislamic%2Dnations%2Dand%2Dsocieties%2Ecfm&amp;title=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies"><img src="../images/social/social-stumbleupon.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.reddit.com/submit?url=http%3A%2F%2Fwww%2Enabahani%2Ecom%2Farticles%2Famqxrhq%2Dibn%2Dtaymiyyah%2Don%2Dthe%2Dtrue%2Dreasons%2Dfor%2Dthe%2Ddecline%2Dof%2Dislamic%2Dnations%2Dand%2Dsocieties%2Ecfm&amp;title=Ibn%20Taymiyyah%20on%20the%20True%20Reasons%20for%20the%20Decline%20of%20Islamic%20Nations%20and%20Societies"><img src="../images/social/social-reddit.png" border="0"></a>&nbsp;&nbsp;
</td>

<td>&nbsp;&nbsp;</td>

<td valign="top" width=230 class="f13" style="line-height:18px;">
<div >
<strong><font color="#565656">Subscribe via RSS or email:</strong><br>
Follow us through RSS or email. Click the RSS icon to subscribe to our feed. <BR>
<img src="../images/spacer.gif" width="12" height="6"><BR>
<a href="../rss/index.html"><img src="../images/social/social-rss.png" border="0"></a>&nbsp;&nbsp;
<a href="mailto:Enter_Email?subject=Nabahani.Com | Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies&body=I found this great article:%0D%0A%0D%0AIbn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies%0D%0A%2F%2Fnabahani%2Ecom%2F%3Famqxrhq"><img src="../images/social/social-email.png" border="0"></a>&nbsp;&nbsp;
</td>
</tr></table>
<hr size="1" noshade color="#cdcdcd">


<span class="smallHeadline">Related Articles:</span><BR>
<ul style="list-style-image:url(../images/crumb.gif)"> 
<li><a href="amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.html">Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</a>

</ul>

<a name="comment"></a><font class="smallHeadline">Add a Comment</font> 


<br>





You must be registered and logged in to comment.<BR>
<font class="f12">
</font>



<br>
<br>
<br>

</td>


<td><img src="../images/spacer.gif" width="10" height="1"></td>
<td valign="top" width="420">

<img src="../images/spacer.gif" width="420" height="1"><BR>



<div style="margin: 0 10 0 0;">

<table cellpadding="0" cellspacing="0">
<form action="http://www.nabahani.com/search.cfm"><tr><td></td>
<td><input type="text" name="q" size="25"  maxlength="45" value="Enter phrase and hit enter" onfocus="this.value='';" style="height:32px;padding:4px 10px 4px 4px;width:283px;background:#FFFFFF;border-top:1px solid #990000;border-bottom:1px solid #990000;border-left:1px solid #990000;font-family:arial;font-size:17px;color:#898989;;" border="0"></td><td><input type="image" src="../images/searchbutton.gif"></td>
</tr>
</form>
</table>

 </div>
 <img src="../images/spacer.gif" width="3" height="8"><BR>




 <div style="margin: 0 10 0 0;">
<div class="pageleafbox2">
<table cellpadding="0" cellspacing="0"><tr>
<td width="200" valign="top">

	
	
	<table width="100%">
	
<tr><td colspan="2" style="border-bottom:1px solid #ababab;"><span class="smallHeadline">Topics</span></td></tr>
			
		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/cc-al-nabahani.html"><font class="categorychild">Al-Nabahani</font></a></td></tr>

		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/os-the-hizb.html"><font class="categorychild">The Hizb</font></a></td></tr>

		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/is-cult-members.html"><font class="categorychild">The Cult Clinic</font></a></td></tr>

		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/cz-the-rulers.html"><font class="categorychild">The Rulers & Rulership</font></a></td></tr>

		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/gm-politics.html"><font class="categorychild">Politics</font></a></td></tr>

		<tr><td style="border-bottom:1px solid #ababab;"><a href="../categories/yb-articles.html"><font class="categorychild">Articles</font></a></td></tr>

</table> 
		

<BR>

<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Latest Articles</span></td></tr>

<tr>
<td><a href="maediii-hizb-ut-tahrir-and-the-rafidah-shiah-enemies-of-the-sahaabah-part-2---concerning-muaawiyah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Hizb ut-Tahrir and the Rafidah Shi'ah, Enemies of the Sahaabah: Part 2 - Concerning Mu'aawiyah</font></a>
</td>
</tr>

<tr>
<td><a href="gnlgwnw-hizb-ut-tahrir-and-the-rafidah-shiah-enemies-of-the-sahaabah-part-1.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Hizb ut-Tahrir and the Rafidah Shi'ah, Enemies of the Sahaabah: Part 1</font></a>
</td>
</tr>

<tr>
<td><a href="gwxjsdy-al-nabahanis-creed-part-3----the-mutazili-ashari-doctrine-that-the-akhbaar-ul-aahaad-are-not-proof-in-beliefs-aqaaid.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Al-Nabahani's Creed: Part 3 - The Mu'tazili, Ash'ari Doctrine That The Akhbaar al-Aahaad Are Not Proof in Beliefs (Aqaa'id)</font></a>
</td>
</tr>

<tr>
<td><a href="poejysi-al-nabahanis-creed-part-2---the-deen-of-the-jahmiyyah-mutazilah-and-ashariyyah-that-the-intellect-aql-is-the-absolute-foundation-for-the-islamic-aqidah.1c.delay" class="articleTitleListLatest"><font class="articleTitleListLatest">Al-Nabahani's Creed: Part 2 - The Deen of the Jahmiyyah, Mu'tazilah and Ash'ariyyah That the Intellect (Aql) Is the Absolute Foundation for the Islamic Aqidah</font></a>
</td>
</tr>

<tr>
<td><a href="wwmefwq-nabahanis-creed-the-atheistic-and-creeds-of-disbelief-of-the-jahmiyyah-mutazilah-and-qadariyyah-are-all-islamic-and-non-conflicting.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Al-Nabahani's Creed: Part 1 - The Atheistic Creed of the Jahmiyyah and the Creeds of the Mu'tazilah and Qadariyyah Are All Islamic Creeds Despite Their Mutual Contradiction</font></a>
</td>
</tr>

<tr>
<td><a href="lfnppnj-the-last-prophet-and-messenger-against-al-nabahani-and-hizb-cultists-the-true-and-real-reason-for-tyrannical-rulers-and-their-oppression.html" class="articleTitleListLatest"><font class="articleTitleListLatest">The Last Prophet and Messenger Against Al-Nabahani and Followers: The True and Real Reason for Tyrannical Rulers and Their Oppression</font></a>
</td>
</tr>

<tr>
<td><a href="bqppsge-ibn-al-qayyim-d-751h-verses-al-nabahani-and-the-hizb-cult-the-kings-and-rulers-are-simply-a-manifestation-of-the-actions-of-the-servants.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Ibn Al-Qayyim (d. 751H) Verses Al-Nabahani and Followers: The Kings and Rulers Are Simply a Manifestation of the Actions of the Servants</font></a>
</td>
</tr>

<tr>
<td><a href="xnyprqo-imaam-al-tahawi-d-321h-and-ibn-abil-izz-al-hanafi-verses-al-nabahani-and-the-hizb-cultists.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Imaam Al-Tahawi (d. 321H) and Ibn Abil-Izz Al-Hanafi (d. 792H) Verses Al-Nabahani and Followers: Allaah Empowers Tyrannical, Oppressive Rulers Over the Subjects Due to Their Own Oppression and Corruption</font></a>
</td>
</tr>

<tr>
<td><a href="whkjsfv-the-imaam-al-hasan-al-basree-d-110h-verses-al-nabahani-and-the-hizb-cultists-al-hajjaaj-bin-yusuf-is-the-punishment-of-allaah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">The Imaam Al-Hasan Al-Basree (d. 110H) Verses Al-Nabahani and Followers: Al-Hajjaaj Bin Yusuf Is the Punishment of Allaah - an Illustration of the Divine Law</font></a>
</td>
</tr>

<tr>
<td><a href="amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</font></a>
</td>
</tr>


</table>

<BR>










 


















</div>
 
</td>
<td style="border-right:1px solid #cdcdcd;"><img src="../images/spacer.gif" width="5" height="1"></td>
<td><img src="../images/spacer.gif" width="5" height="1"></td>
<td width="200" valign="top">



<table width="100%">


<tr><td colspan="2"><span class="smallHeadline">Pages</b></span></td></tr>
<tr><td>No pages found.</td></tr>


</table>



<BR>



<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Most Popular</span></td></tr>


<tr>
<td>
<a href="hgkkkoc-who-is-taqi--al-din-al-nabahani-and-what-fountains-did-he-drink-from.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Taqi  Al-Din Al-Nabahani and the Ba'thist Communist Influence Behind His Political Party (Hizb Al-Tahrir)</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Ibn Taymiyyah on the True Reasons for the Decline of Islamic Nations and Societies</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="lfnppnj-the-last-prophet-and-messenger-against-al-nabahani-and-hizb-cultists-the-true-and-real-reason-for-tyrannical-rulers-and-their-oppression.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Last Prophet and Messenger Against Al-Nabahani and Followers: The True and Real Reason for Tyrannical Rulers and Their Oppression</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="gnlgwnw-hizb-ut-tahrir-and-the-rafidah-shiah-enemies-of-the-sahaabah-part-1.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Hizb ut-Tahrir and the Rafidah Shi'ah, Enemies of the Sahaabah: Part 1</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="maediii-hizb-ut-tahrir-and-the-rafidah-shiah-enemies-of-the-sahaabah-part-2---concerning-muaawiyah.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Hizb ut-Tahrir and the Rafidah Shi'ah, Enemies of the Sahaabah: Part 2 - Concerning Mu'aawiyah</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="wwmefwq-nabahanis-creed-the-atheistic-and-creeds-of-disbelief-of-the-jahmiyyah-mutazilah-and-qadariyyah-are-all-islamic-and-non-conflicting.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Al-Nabahani's Creed: Part 1 - The Atheistic Creed of the Jahmiyyah and the Creeds of the Mu'tazilah and Qadariyyah Are All Islamic Creeds Despite Their Mutual Contradiction</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="bqppsge-ibn-al-qayyim-d-751h-verses-al-nabahani-and-the-hizb-cult-the-kings-and-rulers-are-simply-a-manifestation-of-the-actions-of-the-servants.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Ibn Al-Qayyim (d. 751H) Verses Al-Nabahani and Followers: The Kings and Rulers Are Simply a Manifestation of the Actions of the Servants</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="xnyprqo-imaam-al-tahawi-d-321h-and-ibn-abil-izz-al-hanafi-verses-al-nabahani-and-the-hizb-cultists.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Imaam Al-Tahawi (d. 321H) and Ibn Abil-Izz Al-Hanafi (d. 792H) Verses Al-Nabahani and Followers: Allaah Empowers Tyrannical, Oppressive Rulers Over the Subjects Due to Their Own Oppression and Corruption</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="whkjsfv-the-imaam-al-hasan-al-basree-d-110h-verses-al-nabahani-and-the-hizb-cultists-al-hajjaaj-bin-yusuf-is-the-punishment-of-allaah.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Imaam Al-Hasan Al-Basree (d. 110H) Verses Al-Nabahani and Followers: Al-Hajjaaj Bin Yusuf Is the Punishment of Allaah - an Illustration of the Divine Law</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="poejysi-al-nabahanis-creed-part-2---the-deen-of-the-jahmiyyah-mutazilah-and-ashariyyah-that-the-intellect-aql-is-the-absolute-foundation-for-the-islamic-aqidah.1c.delay" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Al-Nabahani's Creed: Part 2 - The Deen of the Jahmiyyah, Mu'tazilah and Ash'ariyyah That the Intellect (Aql) Is the Absolute Foundation for the Islamic Aqidah</b></font></a>
</td>
</tr>


</table>



<BR>

<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Archives</span>  <font class="f11">(<a href="../archives.html" class="f11">View more</a>)</font></td></tr>
<tr>

<td>


<a href="../archives/2014/02/index.html">2014 &#149; February </a><BR>

<a href="../archives/2012/04/index.html">2012 &#149; April </a><BR>


</td>
</tr>
</table>


</td>
</tr></table>
<img src="../images/spacer.gif" width="3" height="8"><BR>
</div>
</div>
<img src="../images/spacer.gif" width="3" height="8"><BR>





 <div style="margin: 0 10 0 0;">
 <div class="pageleafbox">


<table>
<tr><td colspan="2"><span class="smallHeadline">Key Topics</span></td></tr>
<tr>
<td> <a href="../tags/ahl-al-kalam-nu.html">ahl al-kalam</a> &#149; <a href="../tags/al-hajjaaj.html">al-hajjaaj</a> &#149; <a href="../tags/al-hasan-al-basree.html">al-hasan al-basree</a> &#149; <a href="../tags/al-tahawi.html">al-tahawi</a> &#149; <a href="../tags/ashariyyah.html">ash'ariyyah</a> &#149; <a href="../tags/communism.html">communism</a> &#149; <a href="../tags/ibn-abil-izz-al-hanafi.html">ibn abil-izz al-hanafi</a> &#149; <a href="../tags/ibn-al-qayyim.html">ibn al-qayyim</a> &#149; <a href="../tags/ibn-taymiyyah.html">ibn taymiyyah</a> &#149; <a href="../tags/jahmiyyah.html">jahmiyyah</a> &#149; <a href="../tags/marxism.html">marxism</a> &#149; <a href="../tags/mutazilah.html">mu'tazilah</a> &#149; <a href="../tags/shiah-sk.html">shi'ah</a> &#149; <a href="../tags/taqi-al-din-al-nabahani.html">taqi al-din al-nabahani</a> &#149; 
</td>
</tr>
</table>



</div>
</div>

</td>


<td><img src="../images/spacer.gif" width="5" height="1"></td>
</tr>
</table>





<table width="1100" cellpadding="0" cellspacing="0">
<tr bgcolor="#ffffff"><td colspan="3"><img src="../images/spacer.gif" width="15" height="15" border="0" alt=""></td></tr>
<tr>
<td><img src="../images/white-corner-bot-left.gif" alt="" border="0"></td>
<td width="100%" bgcolor="#ffffff"></td>
<td><img src="../images/white-corner-bot-right.gif" alt="" border="0"></td></tr></table>




 

<img src="../images/spacer.gif" width="15" height="10" border="0" alt="">

<table width="1100" cellpadding="0" cellspacing="0"><tr><td>
<div class="textsmall" style="color:#ababab;">
Copyright &copy; 2025 <a href="../index.html"><font color="#ababab"></font></a>. All rights reserved.
<a href="../rss.html"><font color="#ababab">RSS</font></a> &#149; 
<a href="../tags.html"><font color="#ababab">Tags</font></a> &#149;
<a href="../privacy-policy.html"><font color="#ababab">Privacy</font></a> &#149;
<a href="../legal-and-terms-of-use.html"><font color="#ababab">Legal and Terms of Use</font></a>  

 &#149; 
<a href="../sitemap/sitemap-gd.html"><font color="#ababab">Sitemap</font></a>



</div><BR>


</td></tr></table>



</div>



</body>

<!-- Mirrored from www.nabahani.com/articles/amqxrhq-ibn-taymiyyah-on-the-true-reasons-for-the-decline-of-islamic-nations-and-societies.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:15:19 GMT -->
</html>
