

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.salafis.com/articles/nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:25 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>

	<title>Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'</title>
	
	
	<meta name="Keywords" content="Imaam al-Albaanee">
	<meta name="Description" content="Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'.  ...">
	
	<style>body {background-image:url("../../salafis.com/assets/backgrounds/white-grey-bg.gif");background-repeat:repeat-x;background-color:#666666;}</style>

	<link rel="STYLESHEET" type="text/css" href="../../salafis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../../salafis.com/layout/salafis/style.css">
</head>

<body>

<div align="center">


<br>
 
<table width="1100" cellpadding="0" cellspacing="0" border="0">
<tr>




<td align="right" class="textSmall">


&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monday, 18 August 2025&nbsp;&nbsp;&nbsp;



</td>
</tr>
</table>

<img src="../../salafis.com/images/spacer.gif" width="10" height="9">





<table width="1100" cellpadding="0" cellspacing="0" border="0" background="../../salafis.com/assets/banners/salafis-com-banner.gif">
<tr><td width="1"><img src="../../salafis.com/images/spacer.gif" alt="" border="0" width="1" height="180"></td>


<td width="999" valign="bottom">



<table cellpadding="0" cellspacing="0" width="100%" border="0" height=""><tr><td><img src="../../salafis.com/images/spacer.gif" alt="" border="0" width="15" height="15"></td><td valign="middle"><img src="../../salafis.com/images/spacer.gif" alt="" border="0" width="5" height="5"><BR><font style="font-size:40px;font-family:Book Antiqua" color="#ffffff"><em><strong></strong></em></font><BR>
<img src="../../salafis.com/images/spacer.gif" width="10" height="12"><BR>
<font style="font-size:23px" color="#ffffff"></font><BR><BR>



</td>
<td valign="top" valign="middle" align="right">




<BR>

</td></tr></table>


<div id="tabs">
  <ul>
    <li></li>
	<li><a href="../../salafis.com/index.html"><span>Home</span></a></li> <li><a href="../categories/cp-the-salaf.html"><span>The Salaf</span></a></li><li><a href="../categories/hq-salafiyyah.html"><span>Salafiyyah</span></a></li><li><a href="../categories/xu-ascription.html"><span>Ascription</span></a></li><li><a href="../categories/hs-extremism--terrorism.html"><span>Extremism & Terrorism</span></a></li><li><a href="../categories/nf-clarifications.html"><span>Clarifications</span></a></li><li><a href="../categories/xi-articles.html"><span>Articles</span></a></li><li><a href="../categories/bn-news.html"><span>News</span></a></li> 
  </ul>
</div>
 

 
</td>
</tr></table>



 
 
 
<table width="1100" cellpadding="0" cellspacing="0" border="0" bgcolor="#898989">
<tr><td>
<img src="../../salafis.com/images/spacer.gif" width="1" height="1" border="0" alt=""><BR>
</td></tr></table>
<table width="1100" cellpadding="0" cellspacing="0" bgcolor="#ffffff">
<tr><td><img src="../../salafis.com/images/spacer.gif" width="1" height="10" border="0" alt=""></td></tr>
</table>
 



<table width="1100" cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr>

<td><img src="../../salafis.com/images/spacer.gif" width="15" height="1"></td>
<td valign="top" width="100%">




<font style="font-size:12px;">
You are here: </font>



<font style="font-size:12px;">
<a href="../../salafis.com/index.html">Home</a> <img src="../../salafis.com/images/crumb.gif" class="pb-1"> 
<a href="../categories/xu-ascription.html">Ascription</a> 

</font>
<BR>




<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff" width="100%">
<tr>


<td valign="top" width="100%">

<span class="articleTitle">Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'</span>  





<BR>



 <span style="font-size:11px;">Posted by <a href="../authors/Abu.Iyaad.html">Abu.Iyaad</a>, Editor in <a href="../categories/xu-ascription.html">Ascription</a></span><BR>
 
 


<span style="font-size:11px;">
Topics: <a href="../tags/imaam-al-albaanee.html">
Imaam Al-Albaanee 
</a> </span><BR> 



</td>
<td><img src="../../salafis.com/images/spacer.gif" width="15" height="1"></td>
</tr>
</table>

<hr size="1" noshade style="margin-top:12" color="#cdcdcd">

<table cellpadding="0" cellspacing="0" width="625"><tr>



  

<td  nowrap><a href="mailto:Enter_Email?subject=Salafis.Com | Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'&body=I found this great article:%0D%0A%0D%0AImaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'%0D%0A//salafis.com/?nsphcpi"><img src="../../salafis.com/images/mail-icon-16.gif" border="0"></a>&nbsp;</td>
<td valign="top"  nowrap><a href="mailto:Enter_Email?subject=Salafis.Com | Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'&body=You may be interested in this article:%0D%0A%0D%0AImaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'%0D%0A//salafis.com/?nsphcpi"><font class="f12">Mail To Friend</font></a>&nbsp;</td>
<td nowrap><a href="../print39eb.html?nsphcpi"><img src="../../salafis.com/images/print-icon-16.gif" border="0"></a>&nbsp;</td>
<td  nowrap><a href="../print39eb.html?nsphcpi"><font class="f12">Printer Friendly</font></a> 
</td>


<td valign="top" nowrap align="right" width="100%">


<!-- AddThis Button BEGIN -->
<a class="addthis_button" href="http://addthis.com/bookmark.php?v=250&amp;pub=xa-4b1aa87179c845dd"><img src="../../s7.addthis.com/static/btn/v2/lg-share-en.gif" width="125" height="16" alt="Bookmark and Share" style="border:0"/></a><script type="text/javascript" src="../../s7.addthis.com/js/250/addthis_widget.js#pub=xa-4b1aa87179c845dd"></script>
<!-- AddThis Button END --> 




</td>


</td></tr></table>


<br>



<div align=center><img src=../../salafis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
Imaam al-Albaani (rahimahullaah) has an excellent explanation of the necessity of the term 'Salafi' in terms of the underlying conceptual reason behind it.     <P>
In response to the question:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1604;&#1605;&#1575;&#1584;&#1575; &#1575;&#1604;&#1578;&#1587;&#1605;&#1610; &#1576;&#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; &#1567; &#1571;&#1607;&#1610; &#1583;&#1593;&#1608;&#1577; &#1581;&#1586;&#1576;&#1610;&#1577; &#1571;&#1605; &#1591;&#1575;&#1574;&#1601;&#1610;&#1577; &#1571;&#1608; &#1605;&#1584;&#1607;&#1576;&#1610;&#1577; &#1567; &#1571;&#1605; &#1607;&#1610; &#1601;&#1585;&#1602;&#1577; &#1580;&#1583;&#1610;&#1583;&#1577; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1567;</div></blockquote>    <P>
<blockquote class='quote'><img src='../../salafis.com/images/quote-start.gif'>Why the label of <a href='../tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a>? Is this a partisan call or a doctrinal one? Or is it a new sect in Islaam?</blockquote>    <P>
He replied, as documented in <i>al-Tuhfah al-Mahdiyah Liman Sa'ala an Ma'naa al-Salafiyyah</i> (p. 34), cited from al-Asaalah, (Volume 9, pp. 86-90):    <P>
<blockquote class='quote'><img src='../../salafis.com/images/quote-start.gif'>Indeed, the word 'al-Salaf' is known in the language of the Arabs and in the language of the [Divine] Shar' (legislation), and what concerns us here is to investigate it from the legislative aspect:    <P>
For it is authentically related from the Prophet (sallallaahu alayhi wasallam) that during the illness (preceding) his death he said to Sayyidah Faatimah (radiallaahu anhaa), "So fear Allaah and have patience for an excellent 'salaf' I am for you." And the Scholars' usage of the word 'al-Salaf' is abundant, and it is more abundant than can be enumerated. But sufficient for us is a single example, and it is what they use in combatting innovation (bid'ah):    <P>
And every good is in following the Salaf and every evil is in the innovation of the later ones (or those who turned away).    <P>
There is however, from those who claim knowledge, who rejects this ascription claiming that it has not basis! So he says, "It is not permissible for a Muslim to say, 'I am Salafi'," and it is as if he is saying, "It is not permissible for a Muslim to say: I am a follower of the Righteous Salaf in what they were upon of creed, worship and behaviour."    <P>
<b>No doubt the likes of this rejection - if he was intending it - would make it binding upon him to free himself from the authentic Islaam which our Righteous Salaf used to be upon, and at the head of them, the Prophet (sallallaahu alayhi wasallam)</b>, just as is indicated by the mutawaatir hadaeeth which is in the two Saheehs (of al-Bukhari and Muslim) and others, from [the Prophet] (sallallaahu alayhi wasallam), "<i>The best of generations is my generation. Then those who follow them. Then those who follow them</i>." Hence, it is not permissible for a Muslim to free himself from ascribing to the Righteous Salaf. On the other hand, if he was to free himself from any other ascription, it would not be possible for any of the people of knowledge to ascribe disbelief and sin to him. But the one who rejects this ascription (to the Salaf), do you see that he does not ascribe to any particular school from amongst the schools?! Irrespective of whether this school is connected to creed or to jurisprudence?    <P>
For he will either be an Ash'aree or Maatureedee (in creed), or he may be from Ahl al-Hadeeth (in jurisprudence) or a Hanafi, Shaafi'ee, Maalikee or Hanbali from those (schools of jurisprudence) that enter into the meaning of Ahl al-Sunnah wal-Jamaa'ah [i.e. because they do not oppose the usool of Ahl al-Sunnah wal-Jamaa'ah even if they have different approaches in jurisprudence]. And alongside this, the one who ascribes to the Ash'aree madhhab or (any) of the four schools (of jurisprudence), then he undoubtedly ascribes to individuals who are not infallible (free of making mistakes), even if there are scholars amongst them who arrive at the truth (in matters), <b>so I wish I knew why he does not reject the likes of these ascriptions to individuals who are not infallible?</b>    <P>
But as for the one who ascribes to the Righteous Salaf, then he ascribes to that which is infallible - <u>in a generalized sense</u> - and the Prophet (sallallaahu alayhi wasallam) mentioned that from the signs of the Saved Sect (al-Firqah al-Najiyah) is that it holds fast to what the Messenger of Allaah (sallallaahu alayhi wasallam) and his Companions were upon.     <P>
So whoever held fast to it, out of certainty, then he is upon guidance from his Lord and there is no doubt that the clear, manifest, distinguishing, plain appellation (title) is that we say, "<i>I am a Muslim upon the Book and the Sunnah upon the methodology of our Righteous Salaf</i>" and this is said concisely as "<i>I am a Salafi</i>."</blockquote>    <P>
<u><b>An important note</b></u> here is that just as Shaykh al-Islaam <a href='../tags/ibn-taymiyyah.html' class='tagLink'><font class='tagLink'><a href="../tags/ibn-taymiyyah-ik.html" class="tagLink"><font class="tagLink">Ibn Taymiyyah</font></a></font></a>, in the 8th century hijrah, reconnected the Ummah back to the Salaf, after the <a href='../tags/ahl-al-kalaam.html' class='tagLink'><font class='tagLink'>Ahl al-Kalaam</font></a> and other factions of Innovators had severed the Ummah from them, likewise, <a href='../tags/imaam-al-albaanee.html' class='tagLink'><font class='tagLink'>Imaam al-Albaanee</font></a> reconnected the Ummah back to the Salaf and to the Prophetic Sunnah, and he received much abuse and antagonism from various factions of the Innovators from the <a href='../tags/ashariyyah.html' class='tagLink'><font class='tagLink'>Ash'ariyyah</font></a>, Sufiyyah, Muqallidah, Takfiriyyah, Jihadiyyah, Rafidah and many others.     <P>
Here is the Arabic text of the answer:    <P>
 <blockquote><div class='arabic' align='right' lang='AR-SA'>&#1573;&#1606; &#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1587;&#1604;&#1601; &#1605;&#1593;&#1585;&#1608;&#1601;&#1577; &#1601;&#1610; &#1604;&#1594;&#1577; &#1575;&#1604;&#1593;&#1585;&#1576; &#1608;&#1601;&#1610; &#1604;&#1594;&#1577; &#1575;&#1604;&#1588;&#1585;&#1593; &#1563; &#1608;&#1605;&#1575; &#1610;&#1607;&#1605;&#1606;&#1575; &#1607;&#1606;&#1575; &#1607;&#1608; &#1576;&#1581;&#1579;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1581;&#1610;&#1577; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610;&#1577; :    <P>
&#1601;&#1602;&#1583; &#1589;&#1581; &#1593;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1606;&#1607; &#1602;&#1575;&#1604; &#1601;&#1610; &#1605;&#1585;&#1590; &#1605;&#1608;&#1578;&#1607; &#1604;&#1604;&#1587;&#1610;&#1583;&#1577; &#1601;&#1575;&#1591;&#1605;&#1577; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1575; : "&#1601;&#1575;&#1578;&#1602;&#1610; &#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1589;&#1576;&#1585;&#1610; &#1548; &#1608;&#1606;&#1593;&#1605; &#1575;&#1604;&#1587;&#1604;&#1601; &#1571;&#1606;&#1575; &#1604;&#1603; " .  &#1608;&#1610;&#1603;&#1579;&#1585; &#1575;&#1587;&#1578;&#1593;&#1605;&#1575;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1604;&#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1587;&#1604;&#1601; &#1548; &#1608;&#1607;&#1584;&#1575; &#1571;&#1603;&#1579;&#1585; &#1605;&#1606; &#1571;&#1606; &#1610;&#1593;&#1583; &#1608;&#1610;&#1581;&#1589;&#1609; &#1548; &#1608;&#1581;&#1587;&#1576;&#1606;&#1575; &#1605;&#1579;&#1575;&#1604;&#1575;&#1611; &#1608;&#1575;&#1581;&#1583;&#1575;&#1611; &#1608;&#1607;&#1608; &#1605;&#1575; &#1610;&#1581;&#1578;&#1580;&#1608;&#1606; &#1576;&#1607; &#1601;&#1610; &#1605;&#1581;&#1575;&#1585;&#1576;&#1577; &#1575;&#1604;&#1576;&#1583;&#1593; :    <P>
&#1608;&#1603;&#1604; &#1582;&#1610;&#1585; &#1601;&#1610; &#1575;&#1578;&#1576;&#1575;&#1593; &#1605;&#1606; &#1587;&#1604;&#1601; &#1608;&#1603;&#1604; &#1588;&#1585; &#1601;&#1610; &#1575;&#1576;&#1578;&#1583;&#1575;&#1593; &#1605;&#1606; &#1582;&#1604;&#1601;    <P>
&#1608;&#1604;&#1603;&#1606; &#1607;&#1606;&#1575;&#1603; &#1605;&#1606; &#1605;&#1583;&#1593;&#1610; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1610;&#1606;&#1603;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1586;&#1575;&#1593;&#1605;&#1575;&#1611; &#1571;&#1606; &#1604;&#1575; &#1571;&#1589;&#1604; &#1604;&#1607;&#1575;! &#1601;&#1610;&#1602;&#1608;&#1604; : (&#1604;&#1575;&#1610;&#1580;&#1608;&#1586; &#1604;&#1604;&#1605;&#1587;&#1604;&#1605; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; : &#1571;&#1606;&#1575; &#1587;&#1604;&#1601;&#1610; ) &#1608;&#1603;&#1571;&#1606;&#1607; &#1610;&#1602;&#1608;&#1604; : (&#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1605;&#1587;&#1604;&#1605; : &#1571;&#1606;&#1575; &#1605;&#1578;&#1576;&#1593; &#1604;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1601;&#1610;&#1605;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1593;&#1604;&#1610;&#1607; &#1605;&#1606; &#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1593;&#1576;&#1575;&#1583;&#1577; &#1608;&#1587;&#1604;&#1608;&#1603;) .    <P>
&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1605;&#1579;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1573;&#1606;&#1603;&#1575;&#1585; &#1600; &#1604;&#1608; &#1603;&#1575;&#1606; &#1610;&#1593;&#1606;&#1610;&#1607; &#1600; &#1610;&#1604;&#1586;&#1605; &#1605;&#1606;&#1607; &#1575;&#1604;&#1578;&#1576;&#1585;&#1572; &#1605;&#1606; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1575;&#1604;&#1584;&#1610; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1587;&#1604;&#1601;&#1606;&#1575; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1548; &#1608;&#1593;&#1604;&#1609; &#1585;&#1571;&#1587;&#1607;&#1605; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1603;&#1605;&#1575; &#1610;&#1588;&#1610;&#1585; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1605;&#1578;&#1608;&#1575;&#1578;&#1585; &#1575;&#1604;&#1584;&#1610; &#1601;&#1610; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1610;&#1606; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1575; &#1593;&#1606;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; : "&#1582;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1602;&#1585;&#1606;&#1610; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; " .  &#1601;&#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1604;&#1605;&#1587;&#1604;&#1605; &#1571;&#1606; &#1610;&#1578;&#1576;&#1585;&#1571; &#1605;&#1606; &#1575;&#1604;&#1575;&#1606;&#1578;&#1587;&#1575;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1548; &#1576;&#1610;&#1606;&#1605;&#1575; &#1604;&#1608; &#1578;&#1576;&#1585;&#1571; &#1605;&#1606; &#1571;&#1610;&#1577; &#1606;&#1587;&#1576;&#1577; &#1571;&#1582;&#1585;&#1609; &#1604;&#1605; &#1610;&#1605;&#1603;&#1606; &#1604;&#1571;&#1581;&#1583; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1571;&#1606; &#1610;&#1606;&#1587;&#1576;&#1607; &#1573;&#1604;&#1609; &#1603;&#1601;&#1585; &#1571;&#1608; &#1601;&#1587;&#1608;&#1602; .  &#1608;&#1575;&#1604;&#1584;&#1610; &#1610;&#1606;&#1603;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1587;&#1605;&#1610;&#1577; &#1606;&#1601;&#1587;&#1607; &#1548; &#1578;&#1585;&#1609; &#1571;&#1604;&#1575; &#1610;&#1606;&#1578;&#1587;&#1576; &#1573;&#1604;&#1609; &#1605;&#1584;&#1607;&#1576; &#1605;&#1606; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1567;! &#1587;&#1608;&#1575;&#1569; &#1571;&#1603;&#1575;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576; &#1605;&#1578;&#1593;&#1604;&#1602;&#1575;&#1611; &#1576;&#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1571;&#1608; &#1576;&#1575;&#1604;&#1601;&#1602;&#1607; &#1567;    <P>
&#1601;&#1607;&#1608; &#1573;&#1605;&#1575; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1571;&#1588;&#1593;&#1585;&#1610;&#1575;&#1611; &#1571;&#1608; &#1605;&#1575;&#1578;&#1585;&#1610;&#1583;&#1610;&#1575;&#1611; &#1548; &#1608;&#1573;&#1605;&#1575; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1571;&#1608; &#1581;&#1606;&#1601;&#1610;&#1575;&#1611; &#1571;&#1608; &#1588;&#1575;&#1601;&#1593;&#1610;&#1575;&#1611; &#1571;&#1608; &#1605;&#1575;&#1604;&#1603;&#1610;&#1575;&#1611; &#1571;&#1608; &#1581;&#1606;&#1576;&#1604;&#1610;&#1575;&#1611; &#1563; &#1605;&#1605;&#1575; &#1610;&#1583;&#1582;&#1604; &#1601;&#1610; &#1605;&#1587;&#1605;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1548; &#1605;&#1593; &#1571;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1606;&#1578;&#1587;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1571;&#1588;&#1593;&#1585;&#1610; &#1571;&#1608; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593;&#1577; &#1548; &#1601;&#1607;&#1608; &#1610;&#1606;&#1578;&#1587;&#1576; &#1573;&#1604;&#1609; &#1571;&#1588;&#1582;&#1575;&#1589; &#1594;&#1610;&#1585; &#1605;&#1593;&#1589;&#1608;&#1605;&#1610;&#1606; &#1576;&#1604;&#1575; &#1588;&#1603; &#1548; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1605;&#1606;&#1607;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1589;&#1610;&#1576;&#1608;&#1606; &#1548; &#1601;&#1604;&#1610;&#1578; &#1588;&#1593;&#1585;&#1610; &#1607;&#1604;&#1575; &#1571;&#1606;&#1603;&#1585; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1575;&#1606;&#1578;&#1587;&#1575;&#1576;&#1575;&#1578; &#1573;&#1604;&#1609; &#1575;&#1604;&#1571;&#1601;&#1585;&#1575;&#1583; &#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1593;&#1589;&#1608;&#1605;&#1610;&#1606; &#1567;    <P>
&#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1610;&#1606;&#1578;&#1587;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1548; &#1601;&#1573;&#1606;&#1607; &#1610;&#1606;&#1578;&#1587;&#1576; &#1573;&#1604;&#1609; &#1575;&#1604;&#1593;&#1589;&#1605;&#1577; &#1600; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607; &#1575;&#1604;&#1593;&#1605;&#1608;&#1605; &#1600; &#1608;&#1602;&#1583; &#1584;&#1603;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1605;&#1606; &#1593;&#1604;&#1575;&#1605;&#1575;&#1578; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; &#1575;&#1604;&#1606;&#1575;&#1580;&#1610;&#1577; &#1571;&#1606;&#1607;&#1575; &#1578;&#1578;&#1605;&#1587;&#1603; &#1576;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1571;&#1589;&#1581;&#1575;&#1576;&#1607; .    <P>
&#1601;&#1605;&#1606; &#1578;&#1605;&#1587;&#1603; &#1576;&#1607; &#1603;&#1575;&#1606; &#1610;&#1602;&#1610;&#1606;&#1575;&#1611; &#1593;&#1604;&#1609; &#1607;&#1583;&#1609; &#1605;&#1606; &#1585;&#1576;&#1607; &#1608;&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1575;&#1604;&#1578;&#1587;&#1605;&#1610;&#1577; &#1575;&#1604;&#1608;&#1575;&#1590;&#1581;&#1577; &#1575;&#1604;&#1580;&#1604;&#1610;&#1577; &#1575;&#1604;&#1605;&#1605;&#1610;&#1586;&#1577; &#1575;&#1604;&#1576;&#1610;&#1606;&#1577; &#1607;&#1610; &#1571;&#1606; &#1606;&#1602;&#1608;&#1604; : &#1571;&#1606;&#1575; &#1605;&#1587;&#1604;&#1605; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1593;&#1604;&#1609; &#1605;&#1606;&#1607;&#1580; &#1587;&#1604;&#1601;&#1606;&#1575; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1548; &#1608;&#1607;&#1610; &#1571;&#1606; &#1578;&#1602;&#1608;&#1604; &#1576;&#1575;&#1582;&#1578;&#1589;&#1575;&#1585; : &#1571;&#1606;&#1575; &#1587;&#1604;&#1601;&#1610;</div>    <P>
</blockquote>    <P>
 <P>

<hr size="1" noshade color="#cdcdcd">

<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'//salafis.com/articles/nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.cfm\'>Imaam al-Albaanee: Compelling Argument for the Usage of the Term \'Salafi\'</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//salafis.com/articles/nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//salafis.com/?nsphcpi'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="max-width:450px;width:100%;" value="<a href='nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.html'>Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'</a>" onFocus="this.select()" onClick="this.select()"></form>

<table cellpadding="0" cellspacing="0" style="max-width:450px;width:100%;"><tr><td valign="top" class="f13" style="line-height:18px;">
<strong><font color="#565656">Share or Bookmark this page:</strong> You will need to have an account with the selected service in order to post links or bookmark this page.<BR>
<img src="../../salafis.com/images/spacer.gif" width="12" height="6"><BR>
<a href="http://twitter.com/home?status=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27%20%2F%2Fsalafis%2Ecom%2F%3Fnsphcpi"><img src="../../salafis.com/images/social/social-twitter.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww%2Esalafis%2Ecom%2Farticles%2Fnsphcpi%2Dimaam%2Dal%2Dalbaanee%2Dcompelling%2Dargument%2Dfor%2Dthe%2Dusage%2Dof%2Dthe%2Dterm%2Dsalafi%2Ecfm&amp;t=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27"><img src="../../salafis.com/images/social/social-facebook.png" border="0"></a>&nbsp;&nbsp;
<a href="http://delicious.com/save?url=http%3A%2F%2Fwww%2Esalafis%2Ecom%2Farticles%2Fnsphcpi%2Dimaam%2Dal%2Dalbaanee%2Dcompelling%2Dargument%2Dfor%2Dthe%2Dusage%2Dof%2Dthe%2Dterm%2Dsalafi%2Ecfm&amp;title=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27&amp;notes=I+found+this+article+very+informative+and+helpful"><img src="../../salafis.com/images/social/social-delicious.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.dzone.com/links/add.html?url=http%3A%2F%2Fwww%2Esalafis%2Ecom%2Farticles%2Fnsphcpi%2Dimaam%2Dal%2Dalbaanee%2Dcompelling%2Dargument%2Dfor%2Dthe%2Dusage%2Dof%2Dthe%2Dterm%2Dsalafi%2Ecfm&amp;title=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27&amp;description=I+found+this+article+very+informative+and+helpful"><img src="../../salafis.com/images/social/social-dzone.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.stumbleupon.com/submit?url=http%3A%2F%2Fwww%2Esalafis%2Ecom%2Farticles%2Fnsphcpi%2Dimaam%2Dal%2Dalbaanee%2Dcompelling%2Dargument%2Dfor%2Dthe%2Dusage%2Dof%2Dthe%2Dterm%2Dsalafi%2Ecfm&amp;title=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27"><img src="../../salafis.com/images/social/social-stumbleupon.png" border="0"></a>&nbsp;&nbsp;
<a href="http://www.reddit.com/submit?url=http%3A%2F%2Fwww%2Esalafis%2Ecom%2Farticles%2Fnsphcpi%2Dimaam%2Dal%2Dalbaanee%2Dcompelling%2Dargument%2Dfor%2Dthe%2Dusage%2Dof%2Dthe%2Dterm%2Dsalafi%2Ecfm&amp;title=Imaam%20al%2DAlbaanee%3A%20Compelling%20Argument%20for%20the%20Usage%20of%20the%20Term%20%27Salafi%27"><img src="../../salafis.com/images/social/social-reddit.png" border="0"></a>&nbsp;&nbsp;
</td>

<td>&nbsp;&nbsp;</td>

<td valign="top" width=230 class="f13" style="line-height:18px;">
<div >
<strong><font color="#565656">Subscribe via RSS or email:</strong><br>
Follow us through RSS or email. Click the RSS icon to subscribe to our feed. <BR>
<img src="../../salafis.com/images/spacer.gif" width="12" height="6"><BR>
<a href="../../salafis.com/rss/index.html"><img src="../../salafis.com/images/social/social-rss.png" border="0"></a>&nbsp;&nbsp;
<a href="mailto:Enter_Email?subject=Salafis.Com | Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'&body=I found this great article:%0D%0A%0D%0AImaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'%0D%0A%2F%2Fsalafis%2Ecom%2F%3Fnsphcpi"><img src="../../salafis.com/images/social/social-email.png" border="0"></a>&nbsp;&nbsp;
</td>
</tr></table>
<hr size="1" noshade color="#cdcdcd">


<span class="smallHeadline">Related Articles:</span><BR>
<ul style="list-style-image:url(../../salafis.com/images/crumb.gif)"> 
<li><a href="nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.html">Imaam al-Albaanee: Compelling Argument for the Usage of the Term 'Salafi'</a>

</ul>

<a name="comment"></a><font class="smallHeadline">Add a Comment</font> 


<br>





You must be registered and logged in to comment.<BR>
<font class="f12">
</font>



<br>
<br>
<br>

</td>


<td><img src="../../salafis.com/images/spacer.gif" width="10" height="1"></td>
<td valign="top" width="420">

<img src="../../salafis.com/images/spacer.gif" width="420" height="1"><BR>



<div style="margin: 0 10 0 0;">

<table cellpadding="0" cellspacing="0">
<form action="http://salafis.com/search.cfm"><tr><td></td>
<td><input type="text" name="q" size="25"  maxlength="45" value="Enter phrase and hit enter" onfocus="this.value='';" style="height:32px;padding:4px 10px 4px 4px;width:283px;background:#FFFFFF;border-top:1px solid #009900;border-bottom:1px solid #009900;border-left:1px solid #009900;font-family:arial;font-size:17px;color:#009900;;" border="0"></td><td><input type="image" src="../../salafis.com/images/searchbutton.gif"></td>
</tr>
</form>
</table>

 </div>
 <img src="../../salafis.com/images/spacer.gif" width="3" height="8"><BR>




 <div style="margin: 0 10 0 0;">
<div class="pageleafbox2">
<table cellpadding="0" cellspacing="0"><tr>
<td width="200" valign="top">

	
	
	<table width="100%">
	
<tr><td colspan="2"><span class="smallHeadline">Topics</span></td></tr>
<tr><td>No Categories</td></tr>

</table> 
	<BR>

<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Latest Articles</span></td></tr>

<tr>
<td><a href="rjfiewo-shaykh-salih-al-fawzan-on-saying-i-am-salafi.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Salih Al-Fawzan on Saying 'I Am Salafi'</font></a>
</td>
</tr>

<tr>
<td><a href="xfeyttp-shaykh-salih-al-fawzaan-on-the-claim-that-salafiyyah-was-a-phase-that-has-come-and-gone.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Salih Al-Fawzaan on the Claim That Salafiyyah Was a Phase That Has Come and Gone</font></a>
</td>
</tr>

<tr>
<td><a href="hmyxoij-shaykh-salih-al-fawzaan-saying-i-am-salafi-means-following-the-salaf-with-precision.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Salih Al-Fawzaan: Saying 'I Am Salafi' Means Following the Salaf With Precision, in Knowledge and Action</font></a>
</td>
</tr>

<tr>
<td><a href="oqbwhdj-shaykh-salih-al-fawzaan-on-the-word-salafii-and-the-claim-that-it-causes-separation.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Salih Al-Fawzaan on the Word 'Salafi' and the Claim That It Causes Separation</font></a>
</td>
</tr>

<tr>
<td><a href="araufda-refuting-yasir-qadhi-and-the-orientalists-ibn-taymiyyah-on--salafiyyah-being-the-prophetic-way.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Refuting Yasir Qadhi and the Orientalists: Ibn Taymiyyah on  'Salafiyyah' Being the Prophetic Way</font></a>
</td>
</tr>

<tr>
<td><a href="hpfuzdn-yasir-qadhi-salafiyyah-is-a-fallible-human-trend-equivalent-to-historical-and-modern-sects.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Yasir Qadhi: Salafiyyah Is a Fallible Human Trend Equivalent to Historical and Modern Sects</font></a>
</td>
</tr>

<tr>
<td><a href="puesiwh-1st-open-letter-to-abu-eesa-niamatullah-to-make-tawbah-to-allaah-and-apologise-for-his-slanders.html" class="articleTitleListLatest"><font class="articleTitleListLatest">1st Open Letter to Abu Eesa Niamatullah to Make Tawbah to Allaah and Apologise for His Slanders</font></a>
</td>
</tr>

<tr>
<td><a href="yqxfcbi-evaluating-the-claim-of-salafiyyah-by-abu-eesa-niamatullah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Evaluating the Claim of Salafiyyah by Abu Eesa Niamatullah and His Slanders Against the Adherents to the Salafi Methodology: Part 4</font></a>
</td>
</tr>

<tr>
<td><a href="gutdibl-clarifications-evaluating-the-claim-of-salafiyyah-by-abu-eesa-niamatullah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Evaluating the Claim of Salafiyyah by Abu Eesa Niamatullah and His Slanders Against the Adherents to the Salafi Methodology: Part 3</font></a>
</td>
</tr>

<tr>
<td><a href="sbnafnr-evaluating-the-claim-of-salafiyyah-by-abu-eesa-niamatullah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Evaluating the Claim of Salafiyyah by Abu Eesa Niamatullah and His Slanders Against the Adherents to the Salafi Methodology: Part 2</font></a>
</td>
</tr>


</table>

<BR>










 


















</div>
 
</td>
<td style="border-right:1px solid #cdcdcd;"><img src="../../salafis.com/images/spacer.gif" width="5" height="1"></td>
<td><img src="../../salafis.com/images/spacer.gif" width="5" height="1"></td>
<td width="200" valign="top">



<table width="100%">


<tr><td colspan="2"><span class="smallHeadline">Pages</b></span></td></tr>
<tr><td>No pages found.</td></tr>


</table>



<BR>



<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Most Popular</span></td></tr>


<tr>
<td>
<a href="araufda-refuting-yasir-qadhi-and-the-orientalists-ibn-taymiyyah-on--salafiyyah-being-the-prophetic-way.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Refuting Yasir Qadhi and the Orientalists: Ibn Taymiyyah on  'Salafiyyah' Being the Prophetic Way</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="bejkozd-evaluating-the-claim-of-salafiyyah-by-abu-eesa-niamatullah.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Evaluating the Claim of Salafiyyah by Abu Eesa Niamatullah and His Slanders Against the Adherents to the Salafi Methodology: Part 1 - Introduction</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="puesiwh-1st-open-letter-to-abu-eesa-niamatullah-to-make-tawbah-to-allaah-and-apologise-for-his-slanders.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>1st Open Letter to Abu Eesa Niamatullah to Make Tawbah to Allaah and Apologise for His Slanders</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="sswicax-shaykh-al-albaanee-on-the-doubt-allaah-has-named-us-muslims-so-why-use-the-label-salafi.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Shaykh Al-Albaanee on the Doubt: Allaah Has Named Us Muslims So Why Use the Label 'Salafi'?</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="abzqejd-yasir-qadhi-intellectual-stimulation-and-salafiyyah-part-1---introduction.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Yasir Qadhi, Intellectual Stimulation and Salafiyyah: Part 1 - Salafiyyah by Definition Is Authentic Islam</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="gutdibl-clarifications-evaluating-the-claim-of-salafiyyah-by-abu-eesa-niamatullah.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Evaluating the Claim of Salafiyyah by Abu Eesa Niamatullah and His Slanders Against the Adherents to the Salafi Methodology: Part 3</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="hpfuzdn-yasir-qadhi-salafiyyah-is-a-fallible-human-trend-equivalent-to-historical-and-modern-sects.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Yasir Qadhi: Salafiyyah Is a Fallible Human Trend Equivalent to Historical and Modern Sects</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="rjfiewo-shaykh-salih-al-fawzan-on-saying-i-am-salafi.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Shaykh Salih Al-Fawzan on Saying 'I Am Salafi'</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="ydtsjtx-yasir-qadhi-intellectual-stimulation-and-salafiyyah-part-3c---yasir-qadhis-fabrication-against-the-prophetic-methodology.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Yasir Qadhi, Intellectual Stimulation and Salafiyyah: Part 3c - Yasir Qadhi's Fabrication Against the Prophetic Methodology</b></font></a>
</td>
</tr>

<tr>
<td>
<a href="fqyafwl-yasir-qadhi-intellectual-stimulation-and-salafiyyah-part-3b---the-oppression-of-the-rulers-open-rejection-and-demonstrations.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Yasir Qadhi, Intellectual Stimulation and Salafiyyah: Part 3b - the Oppression of the Rulers, Open Rejection and Demonstrations</b></font></a>
</td>
</tr>


</table>



<BR>

<table width="100%">
<tr><td colspan="2"><span class="smallHeadline">Archives</span>  <font class="f11">(<a href="../archives.html" class="f11">View more</a>)</font></td></tr>
<tr>

<td>


<a href="../../salafis.com/archives/2014/07/index.html">2014 &#149; July </a><BR>

<a href="../../salafis.com/archives/2014/04/index.html">2014 &#149; April </a><BR>

<a href="../../salafis.com/archives/2014/03/index.html">2014 &#149; March </a><BR>

<a href="../../salafis.com/archives/2013/09/index.html">2013 &#149; September </a><BR>

<a href="../../salafis.com/archives/2013/08/index.html">2013 &#149; August </a><BR>

<a href="../../salafis.com/archives/2013/04/index.html">2013 &#149; April </a><BR>


</td>
</tr>
</table>


</td>
</tr></table>
<img src="../../salafis.com/images/spacer.gif" width="3" height="8"><BR>
</div>
</div>
<img src="../../salafis.com/images/spacer.gif" width="3" height="8"><BR>





 <div style="margin: 0 10 0 0;">
 <div class="pageleafbox">


<table>
<tr><td colspan="2"><span class="smallHeadline">Key Topics</span></td></tr>
<tr>
<td> <a href="../tags/abu-eesa-niamatullah.html">abu eesa niamatullah</a> &#149; <a href="../tags/al-samani.html">al-sam'ani</a> &#149; <a href="../tags/green-lane-mosque.html">green lane mosque</a> &#149; <a href="../tags/ibn-taymiyyah-ik.html">ibn taymiyyah</a> &#149; <a href="../tags/imaam-al-albaanee.html">imaam al-albaanee</a> &#149; <a href="../tags/imaam-ibn-baz.html">imaam ibn baz</a> &#149; <a href="../tags/salafism.html">salafism</a> &#149; <a href="../tags/salafiyyah.html">salafiyyah</a> &#149; <a href="../tags/shaykh-saalih-al-fawzaan.html">shaykh saalih al-fawzaan</a> &#149; <a href="../tags/tawfique-chowdhury.html">tawfique chowdhury</a> &#149; <a href="../tags/waleed-basyouni.html">waleed basyouni</a> &#149; <a href="../tags/yasir-qadhi.html">yasir qadhi</a> &#149; 
</td>
</tr>
</table>



</div>
</div>

</td>


<td><img src="../../salafis.com/images/spacer.gif" width="5" height="1"></td>
</tr>
</table>





<table width="1100" cellpadding="0" cellspacing="0">
<tr bgcolor="#ffffff"><td colspan="3"><img src="../../salafis.com/images/spacer.gif" width="15" height="15" border="0" alt=""></td></tr>
<tr>
<td><img src="../../salafis.com/images/white-corner-bot-left.gif" alt="" border="0"></td>
<td width="100%" bgcolor="#ffffff"></td>
<td><img src="../../salafis.com/images/white-corner-bot-right.gif" alt="" border="0"></td></tr></table>




 

<img src="../../salafis.com/images/spacer.gif" width="15" height="10" border="0" alt="">

<table width="1100" cellpadding="0" cellspacing="0"><tr><td>
<div class="textsmall" style="color:#ababab;">
Copyright &copy; 2025 <a href="../../salafis.com/index.html"><font color="#ababab"></font></a>. All rights reserved.
<a href="../rss.html"><font color="#ababab">RSS</font></a> &#149; 
<a href="../tags.html"><font color="#ababab">Tags</font></a> &#149;
<a href="../privacy-policy.html"><font color="#ababab">Privacy</font></a> &#149;
<a href="../legal-and-terms-of-use.html"><font color="#ababab">Legal and Terms of Use</font></a>  

 &#149; 
<a href="../../salafis.com/sitemap/sitemap-mp.xml"><font color="#ababab">Sitemap</font></a>



</div><BR>


</td></tr></table>



</div>



</body>

<!-- Mirrored from www.salafis.com/articles/nsphcpi-imaam-al-albaanee-compelling-argument-for-the-usage-of-the-term-salafi.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:50:26 GMT -->
</html>
