




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?bufxq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | The Alleged Tawassuls of the Scholars: Part 1 - al-Haafidh Ibraaheem al-Harbee</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Alleged Tawassuls of the Scholars: Part 1 - al-Haafidh Ibraaheem al-Harbee</span><BR>
Saturday, April 17 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>An excellent series of rebuttals against the allegations that certain Scholars performed <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a> (i.e. the innovated form of <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a>, not the legislated, legitimate form) has been posted in one of the forums in Arabic (<a href=http://www.soufia-h.net/showthread.php?t=1764>here is original link</a>), by "Abu Uthmaan". Inshaa'Allaah we will serialize this valuable material, since these types of doubts are frequently used by English-speakers too.</div>    <P>
Before proceeding it should be made clear that:    <P>
<blockquote>In Islaam, <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> (<a href='tags/ibaadah.html' class='tagLink'><font class='tagLink'>ibaadah</font></a>) has been thoroughly explained, its definition, its pillars, its conditions, its types and forms. And as such there is a clear criterion in the matter of legitimate and illegitimate <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>. With respect to "<i><a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a></i>" which simply means to seek a means of nearness and approach, and then there is a <u>legitimate</u> form of <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a>, which is seeking nearness to Allaah through <b>a)</b> Calling upon Him by way of His Names and Attributes <b>b)</b> Doing sincere, righteous correct deeds and calling upon Him by way of them, and these righteous deeds include having faith in the Prophets and having love of them, all of which can be used as a means of nearness to Allaah <b>c)</b> the <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> of a righteous person. As for the <u>innovated</u> forms of <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a>, some of which are avenues leading to major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> and some of which constitute major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> (and these are covered in other articles), then they involve the physical bodies, or the "status", or the "honour", or the "right", of the Prophets or the Righteous, and this is not the place to go into this subject in detail, but will be addressed in other articles inshaa'Allaah, however it is important to realize some of them fall into the ruling of innovation (which open up the avenues that lead to shirk) and others are major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> (giving <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to others besides Allaah).     <P>
Those who fall into these illegitimate forms of <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a> have their doubts and misconceptions and they often attempt to argue through certain narrations to justify their practices. There are also a restricted number of isolated sayings on this subject from some of the Scholars of the past which these people have misunderstood and misapplied, and that will be the subject of a separate set of articles.     <P>
Also an act of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> is established by <u>a verse of the Qur'an</u> or <u>an authentic hadeeth</u> of the Messenger (alayhis salaam), and as you will see, in most of these examples, these doubts are simply alleged actions of some of the Scholars - and that is not an independent proof for an act of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> - but that's discounting the fact that most of these alleged actions are reported through unacceptable inauthentic narrations.</blockquote> <P> 


<p><font class='titleHeadline'>The Alleged <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a> Of al-Haafidh <a href="tags/ibraaheem-al-harbee.html" class="tagLink"><font class="tagLink">Ibraaheem al-Harbee</font></a></font>    <P>
Here is the allegation:    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1581;&#1575;&#1601;&#1592; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1575;&#1604;&#1581;&#1585;&#1576;&#1609; : &#1578;&#1608;&#1587;&#1604; &#1576;&#1602;&#1608;&#1604;&#1607; " &#1602;&#1600;&#1576;&#1585; &#1605;&#1593;&#1585;&#1608;&#1601; &#1575;&#1604;&#1603;&#1585;&#1582;&#1609; &#1607;&#1608; &#1575;&#1604;&#1578;&#1585;&#1610;&#1575;&#1602; &#1575;&#1604;&#1605;&#1580;&#1585;&#1576;" - &#1578;&#1575;&#1585;&#1610;&#1582; &#1576;&#1594;&#1600;&#1583;&#1575;&#1583;  1/122 </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Al-Hafidh <a href='tags/ibraaheem-al-harbee.html' class='tagLink'><font class='tagLink'>Ibraaheem al-Harbee</font></a> made <a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a> by his saying, "The grave of Ma'roof al-Karkhee is a tried and tested antidote." (Taarikh Bagdhaad 1/122)</blockquote>    <P>
<b><u>Rebuttal</u></b>    <P>
Al-Khateeb al-Baghdaadee relates it as follows:    <P>
<div class='arabic' align='right'>&#1571;&#1582;&#1576;&#1585;&#1606;&#1575; &#1573;&#1587;&#1605;&#1575;&#1593;&#1610;&#1604; &#1576;&#1606; &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1581;&#1610;&#1585;&#1610; &#1602;&#1575;&#1604; &#1571;&#1606;&#1576;&#1571;&#1606;&#1575; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1575;&#1604;&#1581;&#1587;&#1610;&#1606; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1602;&#1575;&#1604; &#1587;&#1605;&#1593;&#1578; &#1571;&#1576;&#1575; &#1575;&#1604;&#1581;&#1587;&#1606; &#1576;&#1606; &#1605;&#1602;&#1587;&#1605; &#1610;&#1602;&#1608;&#1604; &#1587;&#1605;&#1593;&#1578; &#1571;&#1576;&#1575; &#1593;&#1604;&#1610; &#1575;&#1604;&#1589;&#1601;&#1575;&#1585; &#1610;&#1602;&#1608;&#1604; &#1587;&#1605;&#1593;&#1578; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1575;&#1604;&#1581;&#1585;&#1576;&#1610; &#1610;&#1602;&#1608;&#1604; &#1602;&#1576;&#1585; &#1605;&#1593;&#1585;&#1608;&#1601; &#1575;&#1604;&#1578;&#1585;&#1610;&#1575;&#1602; &#1575;&#1604;&#1605;&#1580;&#1585;&#1576;</div>    <P>
The chain of narration includes: (<span class='arb'>&#1571;&#1576;&#1608; &#1593;&#1576;&#1583; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1575;&#1604;&#1581;&#1587;&#1610;&#1606;</span>), Abu Abdur-Rahmaan as-Sullamee Muhammad bin al-Hussain.    <P>
The ruling upon him is that he is "da'eef" at least. And here are the views of the Scholars regarding him:    <P>
<ul><li><b>Ibn al-Jawzee:</b> (<span class='arb'>&#1603;&#1575;&#1606; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1594;&#1610;&#1585; &#1579;&#1602;&#1577; &#1608;&#1603;&#1575;&#1606; &#1610;&#1590;&#1593; &#1604;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579;</span>), "As-Sullamee was not trustworthy, and he used to fabricated ahaadeeth for the Sufis". (Ad-Du'afaa wal-Matrookeen, 3/52).    <P>
<li> <b>Adh-Dhahabi:</b> (<span class='arb'>&#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1575;&#1604;&#1581;&#1587;&#1610;&#1606; &#1571;&#1576;&#1608; &#1593;&#1576;&#1583; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1589;&#1608;&#1601;&#1610; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1605;&#1589;&#1606;&#1601;&#1575;&#1578; &#1578;&#1603;&#1604;&#1605; &#1601;&#1610;&#1607; &#1608;&#1605;&#1575; &#1607;&#1608; &#1576;&#1575;&#1604;&#1581;&#1580;&#1577; &#1608;&#1602;&#1575;&#1604; &#1575;&#1604;&#1582;&#1591;&#1610;&#1576; &#1602;&#1575;&#1604; &#1604;&#1610; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1610;&#1608;&#1587;&#1601; &#1575;&#1604;&#1602;&#1591;&#1575;&#1606; &#1603;&#1575;&#1606; &#1610;&#1590;&#1593; &#1575;&#1604;&#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1604;&#1604;&#1589;&#1608;&#1601;&#1610;&#1577;&#1548; &#1602;&#1604;&#1578;: &#1608;&#1604;&#1607; &#1601;&#1610; &#1581;&#1602;&#1575;&#1574;&#1602; &#1575;&#1604;&#1578;&#1601;&#1587;&#1610;&#1585; &#1578;&#1581;&#1585;&#1610;&#1601; &#1603;&#1579;&#1610;&#1585;</span>), "Muhammad bin al-Hussain Abu Abdur-Rahmaan as-Sullamee as-Sufi, the author of works, they spoke about him, and he is not a proof. And al-Khateeb said: Muhammad bin Yusuf al-Qattaan said: "<i>He used to fabricate hadeeths for the Sufis</i>." I say: And he has, in regard to the realities of tafseer, a great deal of distortion (deviance)." (Al-Mughni 2/571)    <P>
<li><b> Ibn Hajar:</b> (<span class='arb'>&#1578;&#1603;&#1604;&#1605;&#1608;&#1575; &#1601;&#1610;&#1607; &#1608;&#1604;&#1610;&#1587; &#1576;&#1593;&#1605;&#1583;&#1577;</span>), "They spoke about him and he is not to be relied upon." (Lisaan ul-Meezaan 5/140).</ul>    <P>
Then there is a second person in the chain of narration: (<span class='arb'>   &#1571;&#1576;&#1608; &#1575;&#1604;&#1581;&#1587;&#1606; &#1571;&#1581;&#1605;&#1583; &#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1610;&#1593;&#1602;&#1608;&#1576; &#1576;&#1606; &#1605;&#1602;&#1587;&#1605; &#1575;&#1604;&#1605;&#1602;&#1585;&#1610;</span>), Abu al-Hasan Ahmad bin Muhammad bin Ya'qub bin Muqsim al-Muqri, and his condition is worse than as-Sullamee.     <P>
<ul><li> <b>al-Khateeb al-Baghdaadee:</b> (<span class='arb'>&#1608;&#1603;&#1575;&#1606; &#1610;&#1592;&#1607;&#1585; &#1575;&#1604;&#1606;&#1587;&#1603; &#1608;&#1575;&#1604;&#1589;&#1604;&#1575;&#1581; &#1608;&#1604;&#1605; &#1610;&#1603;&#1606; &#1601;&#1610; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1579;&#1602;&#1577;</span>), "He used to display devotion and rectitude, and he was not trustworthy in hadeeth." (Tareekh Bagdhaad 4/429). He also narrates from Abu Nu'aym al-Haafidh, (<span class='arb'> &#1587;&#1571;&#1604;&#1578; &#1571;&#1576;&#1575; &#1606;&#1593;&#1610;&#1605; &#1575;&#1604;&#1581;&#1575;&#1601;&#1592; &#1593;&#1606; &#1575;&#1581;&#1605;&#1583; &#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1605;&#1602;&#1587;&#1605; &#1601;&#1602;&#1575;&#1604; &#1604;&#1610;&#1606; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1587;&#1605;&#1593;&#1578; &#1571;&#1576;&#1575; &#1575;&#1604;&#1602;&#1575;&#1587;&#1605; &#1575;&#1604;&#1571;&#1586;&#1607;&#1585;&#1610; &#1610;&#1602;&#1608;&#1604; &#1604;&#1605; &#1610;&#1603;&#1606; &#1571;&#1576;&#1608; &#1575;&#1604;&#1581;&#1587;&#1606; &#1576;&#1606; &#1605;&#1602;&#1587;&#1605; &#1579;&#1602;&#1577; &#1608;&#1602;&#1583; &#1585;&#1575;&#1610;&#1578;&#1607; &#1608;&#1587;&#1605;&#1593;&#1578;&#1607; &#1584;&#1603;&#1585;&#1607; &#1605;&#1585;&#1577; &#1571;&#1582;&#1585;&#1609; &#1601;&#1602;&#1575;&#1604; &#1603;&#1575;&#1606; &#1603;&#1584;&#1575;&#1576;&#1575;</span>), "I asked Abu Nu'aym al-Haafidh about Ahmad bin Muhammad bin Muqsim, so he said, 'He is layyin [in] hadeeth (meaning a low status in his acceptability), I heard Abu al-Qasim al-Azhari say: Abu al-Hasan bin Muqsim was not trustworthy, and I saw him and heard him another time, he said, he (Abu al-Hasan bin Muqsim) was a liar'." (Taareekh 4/429), and al-Khateeb also wrote, (<span class='arb'>&#1608;&#1602;&#1575;&#1604; &#1576;&#1606; &#1571;&#1576;&#1609; &#1575;&#1604;&#1601;&#1608;&#1575;&#1585;&#1587; &#1571;&#1610;&#1590;&#1575; &#1603;&#1575;&#1606; &#1587;&#1610;&#1569; &#1575;&#1604;&#1581;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1605;&#1584;&#1605;&#1608;&#1605;&#1575; &#1584;&#1575;&#1607;&#1576;&#1575; &#1604;&#1605; &#1610;&#1603;&#1606; &#1576;&#1588;&#1610;&#1569; &#1575;&#1604;&#1576;&#1578;&#1577;</span>), "And also Bin Abi al-Fawaaris said, 'He was of a bad status with respect to hadeeth, blameworthy, a departer, he was not anything at all, ever." (Taareekh 4/429).    <P>
<li> <b>Hamzah bin Yusuf as-Sahmee:</b> (<span class='arb'>&#1581;&#1583;&#1579; &#1593;&#1606; &#1605;&#1606; &#1604;&#1605; &#1610;&#1585;&#1607; &#1548; &#1608;&#1605;&#1606; &#1605;&#1575;&#1578; &#1602;&#1576;&#1604; &#1571;&#1606; &#1610;&#1608;&#1604;&#1583;</span>), "He narrated from the one he never saw and from the one who died before he (Abu al-Hasan) was even born." (Su'aalaat as-Sahmee, p. 152). And he also said, (<span class='arb'>&#1608;&#1587;&#1605;&#1593;&#1578; &#1575;&#1604;&#1583;&#1575;&#1585;&#1602;&#1591;&#1606;&#1610; &#1608;&#1580;&#1605;&#1575;&#1593;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1588;&#1575;&#1610;&#1582; &#1578;&#1603;&#1604;&#1605;&#1608;&#1575; &#1601;&#1610; &#1576;&#1606; &#1605;&#1602;&#1587;&#1605; &#1608;&#1603;&#1575;&#1606; &#1571;&#1605;&#1585;&#1607; &#1571;&#1576;&#1610;&#1606; &#1605;&#1606; &#1607;&#1584;&#1575; </span>), "And I heard ad-Darqutnee and a group amongst the Mashaayikh (Scholars) [who] spoke about bin Muqsim and his affairs was more apparent than this." (p. 153).    <P>
</ul>    <P>
From what has preceded, the narration is not authentic regarding <a href='tags/ibraaheem-al-harbee.html' class='tagLink'><font class='tagLink'>Ibraaheem al-Harbee</font></a>, and even if it was authentic, there is nothing within it that is evidence for the permissibility of <i><a href='tags/tawassul.html' class='tagLink'><font class='tagLink'>tawassul</font></a></i> or <i>istighaathah </i>(seeking rescue) by way of the physical essences (which is what the dispute is about). <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/bufxq-the-alleged-tawassuls-of-the-scholars-part-1---al-haafidh-ibraaheem-al-harbee.html">The Alleged Tawassuls of the Scholars: Part 1 - al-Haafidh Ibraaheem al-Harbee</a><BR>
//www.tawhidfirst.com/monotheism/?bufxq<BR>

<li><a href="articles/ufkjv-shaykh-ul-islam-ibn-taymiyyah-on-intercession-and-the-affirmed-and-rejected-types-of-intermediaries.html">Shaykh ul-Islam Ibn Taymiyyah on Intercession and the Affirmed and Rejected Types of Intermediaries</a><BR>
//www.tawhidfirst.com/monotheism/?ufkjv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?bufxq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


