




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?kcqzx by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | Shaykh Saalih Aal al-Shaykh on The Ruling on Requesting the Prophet's Supplication After His Death</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Saalih Aal al-Shaykh on The Ruling on Requesting the Prophet's Supplication After His Death</span><BR>
Friday, July 26 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
This is an answer given by the Shaykh to the issue of requesting the <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> of those who have passed away and entered the barzakh. The Shaykh was asked (during his explanation of Aqidah al-Tahaawiyyah), in the print version 2/1029 (Dar al-Mawaddah, Egypt):    <P>
<blockquote><div class='arabic' align='right'>&#1605;&#1606; &#1587;&#1571;&#1604; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1604;&#1607; &#1608;&#1571;&#1606; &#1610;&#1591;&#1604;&#1576; &#1604;&#1607; &#1575;&#1604;&#1605;&#1594;&#1601;&#1585;&#1577; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607; &#1576;&#1593;&#1583; &#1605;&#1608;&#1578;&#1607;&#1548; &#1607;&#1604; &#1607;&#1584;&#1575; &#1588;&#1585;&#1603;&#1567;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The one who asked the Prophet (sallallaahu alayhi wasallam) to supplicate for him and to ask for his forgiveness from Allaah after his (the Prophet's) death, is this shirk?</blockquote>    <P>
The Shaykh's answer:    <P>
<blockquote><div class='arabic' align='right'>&#1606;&#1593;&#1605;&#1548; &#1607;&#1608; &#1588;&#1585;&#1603; &#1571;&#1603;&#1576;&#1585; &#1604;&#1571;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1604;&#1575; &#1610;&#1615;&#1583;&#1593;&#1609; &#1576;&#1593;&#1583; &#1605;&#1608;&#1578;&#1607;&#1548; &#1601;&#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578;&#1548; &#1608;&#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1576;&#1575;&#1604;&#1573;&#1594;&#1575;&#1579;&#1577; &#1571;&#1608; &#1575;&#1604;&#1575;&#1587;&#1578;&#1587;&#1602;&#1575;&#1569;&#1563; &#1610;&#1593;&#1606;&#1610; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1610;&#1594;&#1610;&#1579;&#1548; &#1571;&#1608; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1610;&#1594;&#1601;&#1585;&#1548; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1610;&#1593;&#1591;&#1610; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603;&#1548; &#1607;&#1584;&#1575; &#1603;&#1604;&#1607; &#1583;&#1575;&#1582;&#1604; &#1601;&#1610; &#1604;&#1601;&#1592; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1608;&#1575;&#1604;&#1604;&#1607; - &#1593;&#1586; &#1608;&#1580;&#1604; - &#1602;&#1575;&#1604; {&#1608;&#1614;&#1571;&#1614;&#1606;&#1614;&#1617; &#1575;&#1604;&#1618;&#1605;&#1614;&#1587;&#1614;&#1575;&#1580;&#1616;&#1583;&#1614; &#1604;&#1616;&#1604;&#1614;&#1617;&#1607;&#1616; &#1601;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1583;&#1618;&#1593;&#1615;&#1608;&#1575; &#1605;&#1614;&#1593;&#1614; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1571;&#1614;&#1581;&#1614;&#1583;&#1611;&#1575;} [&#1575;&#1604;&#1580;&#1606;:18] &#1548; &#1608;&#1575;&#1604;&#1584;&#1610; &#1610;&#1602;&#1608;&#1604; &#1573;&#1606;&#1617; &#1607;&#1584;&#1607; &#1575;&#1604;&#1589;&#1608;&#1585;&#1577; &#1608;&#1607;&#1610; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1578;&#1582;&#1585;&#1580; &#1593;&#1606; &#1575;&#1604;&#1591;&#1604;&#1576; &#1575;&#1604;&#1584;&#1610; &#1576;&#1607; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1588;&#1585;&#1603;&#1611;&#1575; &#1601;&#1573;&#1606;&#1607; &#1610;&#1606;&#1602;&#1590; &#1571;&#1589;&#1604; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1603;&#1604;&#1607; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1576;&#1575;&#1576;&#1548; &#1601;&#1603;&#1604; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1591;&#1604;&#1576;&#1563; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1610;&#1593;&#1606;&#1610; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578;&#1548; &#1591;&#1604;&#1576; &#1575;&#1604;&#1605;&#1594;&#1601;&#1585;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578;&#1548; &#1571;&#1608; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606; &#1610;&#1594;&#1601;&#1585;&#1548; &#1571;&#1608; &#1591;&#1604;&#1576; &#1575;&#1604;&#1573;&#1594;&#1575;&#1579;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1571;&#1608; &#1591;&#1604;&#1576; &#1575;&#1604;&#1573;&#1593;&#1575;&#1606;&#1577; &#1571;&#1608; &#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1603;&#1604;&#1607;&#1575; &#1576;&#1575;&#1576; &#1608;&#1575;&#1581;&#1583; &#1607;&#1610; &#1591;&#1604;&#1576;&#1548; &#1608;&#1575;&#1604;&#1591;&#1604;&#1576; &#1583;&#1593;&#1575;&#1569; &#1601;&#1583;&#1575;&#1582;&#1604;&#1577; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; {&#1608;&#1614;&#1605;&#1614;&#1606;&#1618; &#1610;&#1614;&#1583;&#1618;&#1593;&#1615; &#1605;&#1614;&#1593;&#1614; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1573;&#1616;&#1604;&#1614;&#1607;&#1611;&#1575; &#1570;&#1582;&#1614;&#1585;&#1614; &#1604;&#1614;&#1575; &#1576;&#1615;&#1585;&#1618;&#1607;&#1614;&#1575;&#1606;&#1614; &#1604;&#1614;&#1607;&#1615; &#1576;&#1616;&#1607;&#1616; &#1601;&#1614;&#1573;&#1616;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1581;&#1616;&#1587;&#1614;&#1575;&#1576;&#1615;&#1607;&#1615; &#1593;&#1616;&#1606;&#1618;&#1583;&#1614; &#1585;&#1614;&#1576;&#1616;&#1617;&#1607;&#1616; &#1573;&#1616;&#1606;&#1614;&#1617;&#1607;&#1615; &#1604;&#1614;&#1575; &#1610;&#1615;&#1601;&#1618;&#1604;&#1616;&#1581;&#1615; &#1575;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1615;&#1608;&#1606;&#1614;} [&#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1608;&#1606;:117] &#1548; &#1608;&#1601;&#1610; &#1602;&#1608;&#1604;&#1607; {&#1608;&#1614;&#1571;&#1614;&#1606;&#1614;&#1617; &#1575;&#1604;&#1618;&#1605;&#1614;&#1587;&#1614;&#1575;&#1580;&#1616;&#1583;&#1614; &#1604;&#1616;&#1604;&#1614;&#1617;&#1607;&#1616; &#1601;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1583;&#1618;&#1593;&#1615;&#1608;&#1575; &#1605;&#1614;&#1593;&#1614; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1571;&#1614;&#1581;&#1614;&#1583;&#1611;&#1575;} &#1548; &#1608;&#1601;&#1610; &#1602;&#1608;&#1604;&#1607; {&#1608;&#1614;&#1575;&#1604;&#1614;&#1617;&#1584;&#1616;&#1610;&#1606;&#1614; &#1578;&#1614;&#1583;&#1618;&#1593;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618; &#1583;&#1615;&#1608;&#1606;&#1616;&#1607;&#1616; &#1605;&#1614;&#1575; &#1610;&#1614;&#1605;&#1618;&#1604;&#1616;&#1603;&#1615;&#1608;&#1606;&#1614; &#1605;&#1616;&#1606;&#1618; &#1602;&#1616;&#1591;&#1618;&#1605;&#1616;&#1610;&#1585;&#1613;} [&#1601;&#1575;&#1591;&#1585;:13] &#1548; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1605;&#1606; &#1575;&#1604;&#1570;&#1610;&#1575;&#1578;&#1548; &#1601;&#1575;&#1604;&#1578;&#1601;&#1585;&#1610;&#1602; &#1605;&#1590;&#1575;&#1583; &#1604;&#1604;&#1583;&#1604;&#1610;&#1604;&#1548; &#1608;&#1605;&#1606; &#1601;&#1607;&#1605; &#1605;&#1606; &#1603;&#1604;&#1575;&#1605; &#1576;&#1593;&#1590; &#1571;&#1574;&#1605;&#1578;&#1606;&#1575; &#1575;&#1604;&#1578;&#1601;&#1585;&#1610;&#1602; &#1571;&#1608; &#1571;&#1606; &#1607;&#1584;&#1575; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1571;&#1606;&#1607; &#1576;&#1583;&#1593;&#1577; &#1604;&#1575; &#1610;&#1593;&#1606;&#1610; &#1571;&#1606;&#1607; &#1604;&#1610;&#1587; &#1576;&#1588;&#1585;&#1603; &#1576;&#1604; &#1607;&#1608; &#1576;&#1583;&#1593;&#1577; &#1588;&#1585;&#1603;&#1610;&#1577;, &#1610;&#1593;&#1606;&#1610; &#1605;&#1575; &#1603;&#1575;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1610;&#1601;&#1593;&#1604;&#1608;&#1606;&#1607;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1578;&#1602;&#1585;&#1576;&#1608;&#1606; &#1604;&#1610;&#1583;&#1593;&#1608;&#1575; &#1604;&#1607;&#1605;&#1548; &#1604;&#1603;&#1606; &#1571;&#1606; &#1610;&#1615;&#1591;&#1618;&#1604;&#1614;&#1576;&#1614; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1607;&#1584;&#1575; &#1576;&#1583;&#1593;&#1577; &#1605;&#1575; &#1603;&#1575;&#1606;&#1578; &#1571;&#1589;&#1604;&#1611;&#1575; &#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1604;&#1575; &#1593;&#1606;&#1583; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1610;&#1606; &#1608;&#1604;&#1575; &#1593;&#1606;&#1583; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1601;&#1581;&#1583;&#1579;&#1578; &#1601;&#1607;&#1610; &#1576;&#1583;&#1593;&#1577; &#1608;&#1604;&#1575;&#1588;&#1603;&#1548; &#1608;&#1604;&#1603;&#1606;&#1607;&#1575; &#1576;&#1583;&#1593;&#1577; &#1588;&#1585;&#1603;&#1610;&#1577; &#1603;&#1601;&#1585;&#1610;&#1577; &#1608;&#1607;&#1610; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577;&#1548; &#1573;&#1610;&#1588; &#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1575;&#1604;&#1578;&#1610; &#1605;&#1606; &#1591;&#1604;&#1576;&#1607;&#1575; &#1605;&#1606; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1601;&#1602;&#1583; &#1571;&#1588;&#1585;&#1603;&#1567; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569;&#1548; &#1591;&#1604;&#1576; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1607;&#1608; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577;.</div></blockquote>    <P>
<b>Translation:</b>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Yes, it is major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> because the Prophet (sallallaahu alayhi wasallam) is not to be called upon after his death. Requesting <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> from the dead and requesting (their) <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> (for them to) request rescue and sending of rain, meaning, that he supplicates to Allaah that He grants relief or he supplicates to Allaah to forgive (the person making the request), that he supplicates to Allaah to give (to that person) and what is like this, all of it is enters into the word "<a href="tags/dua.html" class="tagLink"><font class="tagLink">du'a</font></a>" (<a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>) and Allaah, the Mighty and Majestic said, "<b>And the  mosques are for Allaah, so do not invoke anyone alongside Allaah</b>" (72:18).     <P>
<b>And the one who says that this form, which is to request the <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> (of the deceased) is excluded from that (type of) request through which <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> is actually <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, then he has demolished the entire foundation of Tawheed in this particular topic.</b>    <P>
For all types of request (talab), requesting <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>, meaning requesting <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> from the dead or requesting aid and what is like that, all of it is included within the same subject area, which is (making) request (talab), and requesting is supplicating (<a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a>), so it is included within His, the Most High's saying, "<b>And whoever invokes besides Allah, any other ilah (god) of whom he has no proof then his reckoning is only with his Lord. Surely, the disbelievers will not be successful</b>." (23:117) and it is also included within His saying, "<b>And the  mosques are for Allaah, so do not invoke anyone alongside Allaah</b>" (72:18) and into His saying "<b>And those, whom you invoke or call upon instead of Him, own not even the thin membrane over the dateýstone</b>" (35:13) and other similar verses.    <P>
Hence, making this distinction clashes with the evidence and whoever understood from some of the speech of our Scholars (this) separation or that this requesting of <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> from the dead is a bid'ah (innovation), this does not mean it is not (at the same time) <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, rather it is an innovated (form) of <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, with the meaning that the people of Jaahiliyyah did not used to perform this (particular type of shirk). They used to seek nearness to (their deities) so they in turn would supplicate for them. However, that the dead are requested to supplicate, this is a bid'ah, it was not present originally, neither with the people of Jaahiliyyah and nor with the Muslims, then it occurred, and so it is an innovation no doubt (from this angle), however it is an innovation of <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> and kufr. And this is the (very) meaning of <a href='tags/shafaaah.html' class='tagLink'><font class='tagLink'>shafaa'ah</font></a> (<a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>), what is the meaning of <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>, that (<a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>) which if a person seeks from other than Allaah he becomes a mushrik? <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> (means) to request <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>, requesting <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> from the dead, this is (the meaning) of <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>.  </blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/trupt-shaykh-al-islam-ibn-taymiyyah-on-requesting-the-dead-to-supplicate-to-allaah.html">Shaykh al-Islam Ibn Taymiyyah on Requesting the Dead to Supplicate to Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?trupt<BR>

<li><a href="articles/ftwqp-shaykh-al-islam-ibn-taymiyyah-on-asking-intermediaries-to-ask-allaah-on-their-behalf.html">Shaykh al-Islam Ibn Taymiyyah on Asking Intermediaries to Ask Allaah on Their Behalf</a><BR>
//www.tawhidfirst.com/monotheism/?ftwqp<BR>

<li><a href="articles/kcqzx-shaykh-saalih-aal-al-shaykh-on-the-ruling-on-requesting-the-prophets-supplication-after-his-death.html">Shaykh Saalih Aal al-Shaykh on The Ruling on Requesting the Prophet's Supplication After His Death</a><BR>
//www.tawhidfirst.com/monotheism/?kcqzx<BR>

<li><a href="articles/rbduh-shaykh-al-islam-ibn-taymiyyah-on-those-seeking-supplication-and-intercession-from-inhabitants-of-graves.html">Shaykh al-Islam Ibn Taymiyyah on Those Requesting Supplication and Intercession From Inhabitants of Graves</a><BR>
//www.tawhidfirst.com/monotheism/?rbduh<BR>

<li><a href="articles/wlxwy-ibn-taymiyyah-on-asking-the-dead-to-supplicate-to-allaah-for-them.html">Ibn Taymiyyah on Various Manifestations of Shirk: Seeking Intercession and Requesting Supplication From the Dead</a><BR>
//www.tawhidfirst.com/monotheism/?wlxwy<BR>

<li><a href="articles/sqjxj-shaykh-saalih-aal-al-shaykh-clarifying-statement-of-ibn-taymiyyah-regarding-shafaaah-and-bidah.html">Shaykh Saalih Aal al-Shaykh Clarifying Statement of Ibn Taymiyyah Regarding Requesting the Dead's Supplication and Bid'ah</a><BR>
//www.tawhidfirst.com/monotheism/?sqjxj<BR>

<li><a href="articles/vqroj-between-fakhr-al-din-al-razi-d-606h-and-abdul-aziz-bin-muhammad-bin-saud-d-1218h-on--seeking-shafaaah-from-other-than-allaah.html">Between Fakhr al-Din al-Razi (d. 606H) and Abdul-Aziz bin Muhammad bin Saud (d. 1218H) on  Seeking Shafaa'ah From Other Than Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?vqroj<BR>

<li><a href="articles/pmtvz-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-7.1f.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 7 </a><BR>
//www.tawhidfirst.com/monotheism/?pmtvz<BR>

<li><a href="articles/ebzse-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-6.20.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 6</a><BR>
//www.tawhidfirst.com/monotheism/?ebzse<BR>

<li><a href="articles/asmag-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-5.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 5</a><BR>
//www.tawhidfirst.com/monotheism/?asmag<BR>

<li><a href="articles/pqwqp-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-4.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 4</a><BR>
//www.tawhidfirst.com/monotheism/?pqwqp<BR>

<li><a href="articles/fgnbc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-3.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 3</a><BR>
//www.tawhidfirst.com/monotheism/?fgnbc<BR>

<li><a href="articles/ysquc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-2.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 2</a><BR>
//www.tawhidfirst.com/monotheism/?ysquc<BR>

<li><a href="articles/qhxzs-fakhr-ud-din-ar-razi-d-606h-on-shafaaah-from-intermediaries---part-1.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 1</a><BR>
//www.tawhidfirst.com/monotheism/?qhxzs<BR>

<li><a href="articles/ufkjv-shaykh-ul-islam-ibn-taymiyyah-on-intercession-and-the-affirmed-and-rejected-types-of-intermediaries.html">Shaykh ul-Islam Ibn Taymiyyah on Intercession and the Affirmed and Rejected Types of Intermediaries</a><BR>
//www.tawhidfirst.com/monotheism/?ufkjv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?kcqzx by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


