




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?hppmn by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | Explanation of the Verse 'Is there Any Doubt Concerning Allaah, the Originator of the Heavens and Earth?'</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Explanation of the Verse 'Is there Any Doubt Concerning Allaah, the Originator of the Heavens and Earth?'</span><BR>
Thursday, April 15 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>There Is No Doubt Concerning Allaah, the Originator and Creator</font>    <P>
Overwhelmingly, belief in a creator has never been the point of contention in the history of nations and civilizations, and for this reason the focus of the call of the Messengers was not upon this subject, but something that follows on from it by necessity, which is to whom does the right of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> belong uniquely.  Allaah  said, regarding the saying of the Messengers to their peoples:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1602;&#1614;&#1575;&#1604;&#1614;&#1578;&#1618; &#1585;&#1615;&#1587;&#1615;&#1604;&#1615;&#1607;&#1615;&#1605;&#1618; &#1571;&#1614;&#1601;&#1616;&#1610; &#1575;&#1604;&#1604;&#1617;&#1607;&#1616; &#1588;&#1614;&#1603;&#1617;&#1612; &#1601;&#1614;&#1575;&#1591;&#1616;&#1585;&#1616; &#1575;&#1604;&#1587;&#1617;&#1614;&#1605;&#1614;&#1575;&#1608;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1571;&#1614;&#1585;&#1618;&#1590;&#1616; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> Their Messengers said: "<i>What! Can there be a doubt about Allaah, the Originator (Creator) of the heavens and the earth?</i>" (Ibrahim 14:10) </b><img src='images/qnend.gif'></blockquote>    <P>
The exegete Ibn Katheer commented on this verse:    <P>
<div class='arabic' align='right'>&#1610;&#1582;&#1576;&#1585; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1605;&#1575; &#1583;&#1575;&#1585; &#1576;&#1610;&#1606; &#1575;&#1604;&#1603;&#1601;&#1575;&#1585; &#1608;&#1576;&#1610;&#1606; &#1585;&#1587;&#1604;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1605;&#1580;&#1575;&#1583;&#1604;&#1577; &#1608;&#1584;&#1604;&#1603; &#1571;&#1606; &#1571;&#1605;&#1605;&#1607;&#1605; &#1604;&#1605;&#1575; &#1608;&#1575;&#1580;&#1607;&#1608;&#1607;&#1605; &#1576;&#1575;&#1604;&#1588;&#1603; &#1601;&#1610;&#1605;&#1575; &#1580;&#1575;&#1569;&#1608;&#1607;&#1605; &#1576;&#1607; &#1605;&#1606; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1604;&#1607; &#1608;&#1581;&#1583;&#1607; &#1604;&#1575; &#1588;&#1585;&#1610;&#1603; &#1604;&#1607; &#1602;&#1575;&#1604;&#1578; &#1575;&#1604;&#1585;&#1587;&#1604; " &#1571;&#1601;&#1610; &#1575;&#1604;&#1604;&#1607; &#1588;&#1603; " &#1608;&#1607;&#1584;&#1575; &#1610;&#1581;&#1578;&#1605;&#1604; &#1588;&#1610;&#1574;&#1610;&#1606;" &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; " &#1571;&#1601;&#1610; &#1608;&#1580;&#1608;&#1583;&#1607; &#1588;&#1603; &#1601;&#1573;&#1606; &#1575;&#1604;&#1601;&#1591;&#1585; &#1588;&#1575;&#1607;&#1583;&#1577; &#1576;&#1608;&#1580;&#1608;&#1583;&#1607; &#1608;&#1605;&#1580;&#1576;&#1608;&#1604;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1602;&#1585;&#1575;&#1585; &#1576;&#1607; &#1601;&#1573;&#1606; &#1575;&#1604;&#1575;&#1593;&#1578;&#1585;&#1575;&#1601; &#1576;&#1607; &#1590;&#1585;&#1608;&#1585;&#1610; &#1601;&#1610; &#1575;&#1604;&#1601;&#1591;&#1585; &#1575;&#1604;&#1587;&#1604;&#1610;&#1605;&#1577; &#1608;&#1604;&#1603;&#1606; &#1602;&#1583; &#1610;&#1593;&#1585;&#1590; &#1604;&#1576;&#1593;&#1590;&#1607;&#1575; &#1588;&#1603; &#1608;&#1575;&#1590;&#1591;&#1585;&#1575;&#1576; &#1601;&#1578;&#1581;&#1578;&#1575;&#1580; &#1573;&#1604;&#1609; &#1575;&#1604;&#1606;&#1592;&#1585; &#1601;&#1610; &#1575;&#1604;&#1583;&#1604;&#1610;&#1604; &#1575;&#1604;&#1605;&#1608;&#1589;&#1604; &#1573;&#1604;&#1609; &#1608;&#1580;&#1608;&#1583;&#1607; &#1608;&#1604;&#1607;&#1584;&#1575; &#1602;&#1575;&#1604;&#1578; &#1604;&#1607;&#1605; &#1575;&#1604;&#1585;&#1587;&#1604; &#1578;&#1585;&#1588;&#1583;&#1607;&#1605; &#1573;&#1604;&#1609; &#1591;&#1585;&#1610;&#1602; &#1605;&#1593;&#1585;&#1601;&#1578;&#1607; &#1576;&#1571;&#1606;&#1607; " &#1601;&#1575;&#1591;&#1585; &#1575;&#1604;&#1587;&#1605;&#1575;&#1608;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1585;&#1590; " &#1575;&#1604;&#1584;&#1610; &#1582;&#1604;&#1602;&#1607;&#1605;&#1575; &#1608;&#1575;&#1576;&#1578;&#1583;&#1593;&#1607;&#1605;&#1575; &#1593;&#1604;&#1609; &#1594;&#1610;&#1585; &#1605;&#1579;&#1575;&#1604; &#1587;&#1576;&#1602; &#1601;&#1573;&#1606; &#1588;&#1608;&#1575;&#1607;&#1583; &#1575;&#1604;&#1581;&#1583;&#1608;&#1579; &#1608;&#1575;&#1604;&#1582;&#1604;&#1602; &#1608;&#1575;&#1604;&#1578;&#1587;&#1582;&#1610;&#1585; &#1592;&#1575;&#1607;&#1585; &#1593;&#1604;&#1610;&#1607;&#1605;&#1575; &#1601;&#1604;&#1575; &#1576;&#1583; &#1604;&#1607;&#1605;&#1575; &#1605;&#1606; &#1589;&#1575;&#1606;&#1593; &#1608;&#1607;&#1608; &#1575;&#1604;&#1604;&#1607; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1607;&#1608; &#1582;&#1575;&#1604;&#1602; &#1603;&#1604; &#1588;&#1610;&#1569; &#1608;&#1573;&#1604;&#1607;&#1607; &#1608;&#1605;&#1604;&#1610;&#1603;&#1607;  &#1608;&#1575;&#1604;&#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607;&#1605; " &#1571;&#1601;&#1610; &#1575;&#1604;&#1604;&#1607; &#1588;&#1603; " &#1571;&#1610; &#1571;&#1601;&#1610; &#1573;&#1604;&#1607;&#1610;&#1578;&#1607; &#1608;&#1578;&#1601;&#1585;&#1583;&#1607; &#1576;&#1608;&#1580;&#1608;&#1576; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1607; &#1588;&#1603; &#1608;&#1607;&#1608; &#1575;&#1604;&#1582;&#1575;&#1604;&#1602; &#1604;&#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1605;&#1608;&#1580;&#1608;&#1583;&#1575;&#1578; &#1608;&#1604;&#1575; &#1610;&#1587;&#1578;&#1581;&#1602; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1573;&#1604;&#1575; &#1607;&#1608; &#1608;&#1581;&#1583;&#1607; &#1604;&#1575; &#1588;&#1585;&#1610;&#1603; &#1604;&#1607; &#1601;&#1573;&#1606; &#1594;&#1575;&#1604;&#1576; &#1575;&#1604;&#1571;&#1605;&#1605; &#1603;&#1575;&#1606;&#1578; &#1605;&#1602;&#1585;&#1577; &#1576;&#1575;&#1604;&#1589;&#1575;&#1606;&#1593; &#1608;&#1604;&#1603;&#1606; &#1578;&#1593;&#1576;&#1583; &#1605;&#1593;&#1607; &#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1575;&#1604;&#1608;&#1587;&#1575;&#1574;&#1591; &#1575;&#1604;&#1578;&#1610; &#1610;&#1592;&#1606;&#1608;&#1606;&#1607;&#1575; &#1578;&#1606;&#1601;&#1593;&#1607;&#1605; &#1571;&#1608; &#1578;&#1602;&#1585;&#1576;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1604;&#1607; &#1586;&#1604;&#1601;&#1609;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He, the most high, informs about what occurred between the disbelievers and their [respective] Messengers of argumentation. When their nations faced them [the Messengers] with doubt concerning what they brought to them of (the invitation) to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> Allaah alone, without there being any partners to him (in worship), the Messengers said: "<i>Is there any doubt concerning Allaah</i>?", and this carries two things:    <P>
<blockquote><b>The first of them:</b> "Is there any doubt about His existence, for the innate (human) disposition testifies to His existence, and it (the innate disposition) is naturally inclined to affirm Him, since acknowledging Him is a necessity in the sound innate disposition".  However, doubt and confusion can sometimes occur to some of (the people) which requires inspection into the evidence that leads to (acknowledgment) of His existence. For this reason their Messengers said to them, in order to direct them to the path of knowing that He is "<i>the Originator of the heavens and the Earth</i>", the one who created them, originated them (from nothing), without (there being) any previous likeness for them. For the evidential witness by way of the newly-arising things, of creation and of (its) subjection [to mankind] is manifest for them both (the heavens and Earth). Hence, it is inevitable for them to have a Maker, who is Allaah, there is none which has the right to be worshipped except He, the Creator of everything thing, its Deity and Master.    <P>
<b>And the second meaning: </b>Regarding their saying, "Is there any doubt concerning Allaah", meaning is  there any doubt in his Ilaahiyyah (right of worship), and in his uniqueness in the obligation of giving <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to Him (alone), whilst He is the Creator of all existing things and no one is deserving of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> except Him alone, without any partners. For the majority of nations used to affirm a Maker, but they used to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> others alongside Him, as <a href='tags/intermediaries.html' class='tagLink'><font class='tagLink'>intermediaries</font></a> which they thought would benefit them or bring them closer to Allaah.</blockquote></blockquote>    <P>
The exegete, Ibn Jareer at-Tabari explains that the meaning of this verse:    <P>
<div class='arabic' align='right'>&#1602;&#1575;&#1604;&#1578; &#1585;&#1587;&#1604; &#1575;&#1604;&#1571;&#1605;&#1605; &#1575;&#1604;&#1578;&#1610; &#1571;&#1578;&#1578;&#1607;&#1575; &#1585;&#1587;&#1604;&#1607;&#1575; : &#1571;&#1601;&#1610; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606;&#1607; &#1575;&#1604;&#1605;&#1587;&#1578;&#1581;&#1602; &#1593;&#1604;&#1610;&#1603;&#1605; &#1571;&#1610;&#1607;&#1575; &#1575;&#1604;&#1606;&#1575;&#1587; &#1575;&#1604;&#1571;&#1604;&#1608;&#1607;&#1577; &#1608;&#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1583;&#1608;&#1606; &#1580;&#1605;&#1610;&#1593; &#1582;&#1604;&#1602;&#1607; , &#1588;&#1603; &#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Messengers of the nations to whom messengers came said: "Is there any doubt regarding Allaah that He (alone) is the one deserving of servitude and <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> from you, O people, as opposed to all [others from] His creation?"</blockquote>   <P> 

</div>
<br>





</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?hppmn by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


