




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?jghdc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | Ibn Battah al-Ukbari (d. 387H) on the Three Aspects of The Tawhid of the Messengers</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Ibn Battah al-Ukbari (d. 387H) on the Three Aspects of The Tawhid of the Messengers</span><BR>
Wednesday, April 14 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>Ibn Battah al-Ukbari (d. 387H) on the Three Aspects of The Tawhid of the Messengers</font>    <P>
Ibn Battah is one of the great scholars from the fourth century (304H-387H), and he was a student of Abu al-Qasim al-Baghawi and amongst his students was Abu Nu'aym al-Asbahani. He was a righteous man and despite some weakness in his memory, he was an Imaam of the Sunnah, he authored his great work "al-Ibaanah" in compiling the aqidah of the Muslims and in refutation of the deviant sects that had emerged from the Jahmiyyah, Qadariyyah, Mu'tazilah, Muri'ah, Khawaarij, Raafidah and others. <a href='tags/ibn-battah.html' class='tagLink'><font class='tagLink'>Ibn Battah</font></a> al-Ukbaree said in his work (<span class='arb'>&#1575;&#1604;&#1573;&#1576;&#1575;&#1606;&#1577; &#1593;&#1606; &#1588;&#1585;&#1610;&#1593;&#1577; &#1575;&#1604;&#1601;&#1585;&#1602;&#1577; &#1575;&#1604;&#1606;&#1575;&#1580;&#1610;&#1577;</span>), "<i>al-Ibaanah</i>", (2/172-173):    <P>
<div class='arabic' align='right'>&#1608;&#1584;&#1604;&#1603; &#1571;&#1606; &#1571;&#1589;&#1604; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1584;&#1610; &#1610;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1582;&#1604;&#1602; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607; &#1601;&#1610; &#1573;&#1579;&#1576;&#1575;&#1578; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1607; &#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1588;&#1610;&#1575;&#1569;:  &#1571;&#1581;&#1583;&#1607;&#1575;: &#1571;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1575;&#1604;&#1593;&#1576;&#1583; &#1585;&#1576;&#1575;&#1606;&#1610;&#1578;&#1607;&#1563; &#1604;&#1610;&#1603;&#1608;&#1606; &#1576;&#1584;&#1604;&#1603; &#1605;&#1576;&#1575;&#1610;&#1606;&#1575;&#1611; &#1604;&#1605;&#1584;&#1607;&#1576; &#1571;&#1607;&#1604; &#1575;&#1604;&#1578;&#1593;&#1591;&#1610;&#1604; &#1575;&#1604;&#1584;&#1610;&#1606; &#1604;&#1575; &#1610;&#1579;&#1576;&#1578;&#1608;&#1606; &#1589;&#1575;&#1606;&#1593;&#1575;&#1611;.  &#1608;&#1575;&#1604;&#1579;&#1575;&#1606;&#1610;: &#1571;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583; &#1608;&#1581;&#1583;&#1575;&#1606;&#1610;&#1578;&#1607;&#1563; &#1604;&#1610;&#1603;&#1608;&#1606; &#1576;&#1584;&#1604;&#1603; &#1605;&#1576;&#1575;&#1610;&#1606;&#1575;&#1611; &#1604;&#1571;&#1607;&#1604; &#1575;&#1604;&#1588;&#1585;&#1603; &#1575;&#1604;&#1584;&#1610;&#1606; &#1571;&#1602;&#1585;&#1608;&#1575; &#1576;&#1575;&#1604;&#1589;&#1575;&#1606;&#1593; &#1608;&#1571;&#1588;&#1585;&#1603;&#1608;&#1575; &#1605;&#1593;&#1607; &#1601;&#1610; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1594;&#1610;&#1585;&#1607;.  &#1608;&#1575;&#1604;&#1579;&#1575;&#1604;&#1579;: &#1571;&#1606; &#1610;&#1593;&#1578;&#1602;&#1583;&#1607; &#1605;&#1608;&#1589;&#1608;&#1601;&#1575;&#1611; &#1576;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1573;&#1604;&#1575; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1605;&#1608;&#1589;&#1608;&#1601;&#1575;&#1611; &#1576;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1602;&#1583;&#1585;&#1577; &#1608;&#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1608;&#1587;&#1575;&#1574;&#1585; &#1605;&#1575; &#1608;&#1589;&#1601; &#1576;&#1607; &#1606;&#1601;&#1587;&#1607; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576;&#1607;.  &#1573;&#1584; &#1602;&#1583; &#1593;&#1604;&#1605;&#1606;&#1575; &#1571;&#1606; &#1603;&#1579;&#1610;&#1585;&#1575;&#1611; &#1605;&#1605;&#1606; &#1610;&#1602;&#1585; &#1576;&#1607; &#1608;&#1610;&#1608;&#1581;&#1583;&#1607; &#1576;&#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1605;&#1591;&#1604;&#1602; &#1602;&#1583; &#1610;&#1604;&#1581;&#1583; &#1601;&#1610; &#1589;&#1601;&#1575;&#1578;&#1607; &#1601;&#1610;&#1603;&#1608;&#1606; &#1573;&#1604;&#1581;&#1575;&#1583;&#1607; &#1601;&#1610; &#1589;&#1601;&#1575;&#1578;&#1607; &#1602;&#1575;&#1583;&#1581;&#1575;&#1611; &#1601;&#1610; &#1578;&#1608;&#1581;&#1610;&#1583;&#1607;.  &#1608;&#1604;&#1571;&#1606;&#1575; &#1606;&#1580;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1602;&#1583; &#1582;&#1575;&#1591;&#1576; &#1593;&#1576;&#1575;&#1583;&#1607; &#1576;&#1583;&#1593;&#1575;&#1574;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1603;&#1604; &#1608;&#1575;&#1581;&#1583;&#1577; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579; &#1608;&#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1607;&#1575;.  &#1601;&#1571;&#1605;&#1575; &#1583;&#1593;&#1575;&#1572;&#1607; &#1573;&#1610;&#1575;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1573;&#1602;&#1585;&#1575;&#1585; &#1576;&#1585;&#1576;&#1575;&#1606;&#1610;&#1578;&#1607; &#1608;&#1608;&#1581;&#1583;&#1575;&#1606;&#1610;&#1578;&#1607; &#1601;&#1604;&#1587;&#1606;&#1575; &#1606;&#1584;&#1603;&#1585; &#1607;&#1584;&#1575; &#1607;&#1575;&#1607;&#1606;&#1575; &#1604;&#1591;&#1608;&#1604;&#1607; &#1608;&#1587;&#1593;&#1577; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1601;&#1610;&#1607;&#1548; &#1608;&#1604;&#1571;&#1606; &#1575;&#1604;&#1580;&#1607;&#1605;&#1610; &#1610;&#1583;&#1593;&#1610; &#1604;&#1606;&#1601;&#1587;&#1607; &#1575;&#1604;&#1573;&#1602;&#1585;&#1575;&#1585; &#1576;&#1607;&#1605;&#1575; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1580;&#1581;&#1583;&#1607; &#1604;&#1604;&#1589;&#1601;&#1575;&#1578; &#1602;&#1583; &#1571;&#1576;&#1591;&#1604; &#1583;&#1593;&#1608;&#1575;&#1607; &#1604;&#1607;&#1605;&#1575;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And this is because the foundation of al-eemaan (faith) in Allah whose belief is obligatory upon the creation in affirmation of of belief in Him is [comprised of] three things:    <P>
<blockquote><b>The first of them:</b> That the slave believe in his <i>Rabbaaniyyah</i> (his <a href='tags/lordship.html' class='tagLink'><font class='tagLink'>Lordship</font></a> over all creation) so that by this he separates from the doctrine of the negators who do not affirm a maker (creator).    <P>
<b>And the second:</b> That he believes in his <i>Wahdaaniyyah</i> (his sole right to be worshipped) so that by this he separates from the people of <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> (associationism) who affirm the Maker (Creator) but they associated others with Him in <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>.    <P>
<b>And the third:</b> That he believes Him be to be described with [such] attributes which are not permitted except for Him to be described with, such as knowledge (ilm), power (qudrah), wisdom (hikmah) and all of what He has descrbed Himself with in His Book.</blockquote>    <P>
Since we know that many of those who affirm Him (in His Rabbaaniyyah) and single Him out [in His Wahdaaniyyah] with a generalized saying, but who deviate in [the subject of] His Attributes, and thus his deviation in the Attributes is damaging to His Tawhid. And also because we find that Allaah, the Most High, has addressed His slaves by inviting them <b>to have belief in all of these three types</b> and to have faith in them.    <P>
As for His inviting them to affirm His <i>Rabbaaniyyah</i> (<a href='tags/lordship.html' class='tagLink'><font class='tagLink'>Lordship</font></a>) and His <i>Wahdaaniyyah</i> (sole right to be worshipped alone), then we shall not mention this here due to its length and the vastness of the speech regarding it. And also because the Jahmee claims the affirmation of them both for himself, even if his denial of the Attributes invalidates his claim regarding them both.</blockquote>    <P>
And thus it is established that this particular understanding of Tawhid was present amongst the Salaf in the fourth century and was certainly not an innovation of those Scholars who came three to seven centuries later (the 8th and 12th centures after hijrah). You may also want to read <a href=http://www.asharis.com/creed/?sortp>this article</a> which indicates that the <u>early Kullaabi Ash'arites</u>, despite their deviation in aspects of creed (aqidah) were nevertheless still clear about the true nature of the Tawhid of the Messengers with respect to His Wahdaaniyyah, Uloohiyyah, Uboodiyyah (sole right to worship). They were free and innocent of the deviations of some of the later hybridized Ash'aris - [they combined aspects of the creed of the Jahmiyyah and Mu'tazilah with that of Ibn Kullaab] - who incorporated <u>gnostic mysticism</u> into their religion and through this were led to further aberrations in Tawhid.   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/jghdc-ibn-battah-al-ukbari-d-387h-on-the-three-aspects-of-the-tawhid-of-the-messengers.html">Ibn Battah al-Ukbari (d. 387H) on the Three Aspects of The Tawhid of the Messengers</a><BR>
//www.tawhidfirst.com/monotheism/?jghdc<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?jghdc by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


