




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?sqjxj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | Shaykh Saalih Aal al-Shaykh Clarifying Statement of Ibn Taymiyyah Regarding Requesting the Dead's Supplication and Bid'ah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Saalih Aal al-Shaykh Clarifying Statement of Ibn Taymiyyah Regarding Requesting the Dead's Supplication and Bid'ah</span><BR>
Friday, July 26 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>In the writings of Shaykh al-Islaam Ibn Taymiyyah when he speaks of matters that are major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, he often describes them with numerous terms, such as "<i>innovations</i>", "<i>a means towards shirk</i>", "<i>not practiced by the Salaf</i>" and so on - which has led some to claim that Ibn Taymiyyah does not hold asking the dead to supplicate to Allaah to be major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>. In this article, Shaykh Saalih Aal al-Shaykh deals with the issue of Ibn Taymiyyah describing some of these actions as "bid'ah" and explains that this does not mean these acts described as "bid'ah" cannot be major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>.</blockquote></div>    <P>
During his explanation of Kashf al-Shubuhaat, Shaykh Saalih Aal al-Shaykh was asked a question regarding some statements of Shaykh al-Islaam Ibn Taymiyyah (rahimahullaah):    <P>
<blockquote><div class='arabic' align='right'>&#1605;&#1575; &#1585;&#1571;&#1610;&#1603; &#1601;&#1610;&#1605;&#1606; &#1610;&#1606;&#1587;&#1576; &#1604;&#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1571;&#1606; &#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1605;&#1610;&#1578; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1604;&#1603; &#1604;&#1610;&#1587; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1575;&#1604;&#1571;&#1603;&#1576;&#1585; &#1576;&#1604; &#1607;&#1608; &#1576;&#1583;&#1593;&#1577;&#1567;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>What is your view regarding the one who ascribes to Shaykh al-Islaam Ibn Taymiyyah that asking the dead to supplicate Allaah (for him) is not from the Major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> but only an innovation?</blockquote>    <P>
The Shaykh answered:    <P>
<blockquote><div class='arabic' align='right'>&#1607;&#1584;&#1575; &#1580;&#1575;&#1569; &#1601;&#1610; &#1603;&#1604;&#1575;&#1605; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1589;&#1581;&#1610;&#1581; &#1604;&#1603;&#1606; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1610;&#1585;&#1610;&#1583; &#1576;&#1607;&#1575; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1575;&#1604;&#1581;&#1575;&#1583;&#1579;&#1577;&#1563; &#1610;&#1593;&#1606;&#1610; &#1575;&#1604;&#1578;&#1610; &#1581;&#1583;&#1579;&#1578; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1571;&#1605;&#1577;&#1548; &#1608;&#1604;&#1610;&#1587; &#1605;&#1585;&#1575;&#1583;&#1607; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1576;&#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1571;&#1606;&#1607;&#1575; &#1575;&#1604;&#1576;&#1583;&#1593;&#1577; &#1575;&#1604;&#1578;&#1610; &#1604;&#1610;&#1587;&#1578; &#1588;&#1585;&#1603;&#1575; &#1604;&#1571;&#1606; &#1575;&#1604;&#1576;&#1583;&#1593; &#1575;&#1604;&#1578;&#1610; &#1581;&#1583;&#1579;&#1578; &#1601;&#1610; &#1575;&#1604;&#1571;&#1605;&#1577; &#1605;&#1606;&#1607;&#1575; &#1576;&#1583;&#1593; &#1603;&#1601;&#1585;&#1610;&#1577; &#1588;&#1585;&#1603;&#1610;&#1577; &#1608;&#1605;&#1606;&#1607;&#1575; &#1576;&#1583;&#1593; &#1583;&#1608;&#1606; &#1584;&#1604;&#1603; &#1601;&#1573;&#1584;&#1606; &#1602;&#1608;&#1604;&#1607;: &#1608;&#1571;&#1605;&#1575; &#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1605;&#1610;&#1578; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1604;&#1604;&#1587;&#1575;&#1574;&#1604; &#1601;&#1573;&#1606;&#1607; &#1576;&#1583;&#1593;&#1577;. &#1610;&#1593;&#1606;&#1610; &#1607;&#1584;&#1575; &#1581;&#1583;&#1579; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1605;&#1577; &#1581;&#1578;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1605;&#1575; &#1610;&#1601;&#1593;&#1604;&#1608;&#1606; &#1607;&#1584;&#1575;&#1548; &#1605;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1571;&#1583;&#1593;&#1608; &#1575;&#1604;&#1604;&#1607; &#1604;&#1606;&#1575;&#1548; &#1573;&#1606;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1575;&#1588;&#1601;&#1593; &#1604;&#1606;&#1575;.  &#1601;&#1605;&#1587;&#1571;&#1604;&#1577; &#1571;&#1606; &#1610;&#1591;&#1604;&#1576; &#1605;&#1606; &#1575;&#1604;&#1605;&#1610;&#1578; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1607;&#1584;&#1607; &#1576;&#1583;&#1593;&#1577; &#1581;&#1583;&#1579;&#1578;&#1548; &#1581;&#1578;&#1609; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1604;&#1610;&#1587;&#1578; &#1593;&#1606;&#1583;&#1607;&#1605;&#1548; &#1608;&#1571;&#1607;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1604;&#1610;&#1587;&#1578; &#1593;&#1606;&#1583;&#1607;&#1605; &#1576;&#1604; &#1581;&#1583;&#1579;&#1578; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1605;&#1577;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583; &#1571;&#1607;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1575;&#1604;&#1591;&#1604;&#1576; &#1576;&#1604;&#1601;&#1592; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1575;&#1588;&#1601;&#1593; &#1604;&#1606;&#1575;&#1548; &#1610;&#1571;&#1578;&#1608;&#1606; &#1608;&#1610;&#1578;&#1602;&#1585;&#1576;&#1608;&#1606; &#1604;&#1571;&#1580;&#1604; &#1571;&#1606; &#1610;&#1588;&#1601;&#1593;&#1548; &#1610;&#1578;&#1593;&#1576;&#1583;&#1608;&#1606; &#1604;&#1571;&#1580;&#1604; &#1571;&#1606; &#1610;&#1588;&#1601;&#1593; &#1571;&#1608; &#1610;&#1582;&#1575;&#1591;&#1576;&#1608;&#1606;&#1607; &#1576;&#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1608;&#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1575;&#1588;&#1601;&#1593; &#1604;&#1606;&#1575; &#1576;&#1603;&#1584;&#1575; &#1608;&#1603;&#1584;&#1575;&#1548; &#1571;&#1605;&#1575; &#1571;&#1583;&#1593; &#1575;&#1604;&#1604;&#1607; &#1604;&#1606;&#1575; &#1607;&#1584;&#1607; &#1576;&#1583;&#1593;&#1577; &#1581;&#1583;&#1579;&#1578; &#1601;&#1610; &#1575;&#1604;&#1571;&#1605;&#1577;.  &#1601;&#1603;&#1604;&#1575;&#1605; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1589;&#1581;&#1610;&#1581; &#1571;&#1606;&#1607;&#1575; &#1576;&#1583;&#1593;&#1577; &#1605;&#1581;&#1583;&#1579;&#1577;&#1548; &#1608;&#1603;&#1608;&#1606;&#1607;&#1575; &#1576;&#1583;&#1593;&#1577; &#1604;&#1575; &#1610;&#1593;&#1606;&#1610; &#1571;&#1606; &#1604;&#1575; &#1578;&#1603;&#1608;&#1606; &#1588;&#1585;&#1603;&#1575; &#1571;&#1603;&#1576;&#1585;&#1548; &#1601;&#1576;&#1606;&#1575;&#1569; &#1575;&#1604;&#1602;&#1576;&#1575;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1587;&#1572;&#1575;&#1604; &#1571;&#1589;&#1581;&#1575;&#1576;&#1607;&#1575; &#1608;&#1575;&#1604;&#1578;&#1608;&#1580;&#1607; &#1573;&#1604;&#1610;&#1607;&#1575; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1581;&#1608; &#1575;&#1604;&#1584;&#1610; &#1578;&#1585;&#1575;&#1607; &#1605;&#1606; &#1605;&#1588;&#1575;&#1607;&#1583; &#1608;&#1575;&#1604;&#1581;&#1580; &#1573;&#1604;&#1609; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1588;&#1575;&#1607;&#1583; &#1608;&#1580;&#1593;&#1604; &#1604;&#1607;&#1575; &#1605;&#1606;&#1575;&#1587;&#1603; &#1603;&#1604;&#1607;&#1575; &#1576;&#1583;&#1593;&#1577;&#1548; &#1606;&#1602;&#1608;&#1604; &#1576;&#1583;&#1593;&#1577; &#1581;&#1583;&#1579;&#1578; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1605;&#1577;&#1548; &#1608;&#1607;&#1610; &#1610;&#1593;&#1606;&#1610; &#1587;&#1572;&#1575;&#1604; &#1571;&#1589;&#1581;&#1575;&#1576; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1588;&#1575;&#1607;&#1583; &#1608;&#1575;&#1604;&#1584;&#1576;&#1581; &#1604;&#1607;&#1575; &#1608;&#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1581;&#1608; &#1575;&#1604;&#1605;&#1608;&#1580;&#1608;&#1583; &#1604;&#1605; &#1610;&#1603;&#1606; &#1605;&#1608;&#1580;&#1608;&#1583;&#1575; &#1601;&#1610; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1581;&#1608;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1603;&#1575;&#1606;&#1578; &#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1605; &#1604;&#1604;&#1571;&#1605;&#1608;&#1575;&#1578; &#1593;&#1604;&#1609; &#1588;&#1603;&#1604; &#1571;&#1589;&#1606;&#1575;&#1605; &#1608;&#1571;&#1608;&#1579;&#1575;&#1606; &#1608;&#1575;&#1604;&#1578;&#1580;&#1575;&#1569; &#1604;&#1604;&#1602;&#1576;&#1608;&#1585; &#1608;&#1571;&#1588;&#1576;&#1575;&#1607; &#1584;&#1604;&#1603;&#1563; &#1604;&#1603;&#1606; &#1604;&#1610;&#1587; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1581;&#1608;&#1548; &#1601;&#1604;&#1605; &#1610;&#1603;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1610;&#1581;&#1580;&#1608;&#1606; &#1603;&#1575;&#1604;&#1581;&#1580; &#1573;&#1604;&#1609; &#1576;&#1610;&#1578; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1585;&#1575;&#1605; &#1610;&#1581;&#1580;&#1608;&#1606; &#1573;&#1604;&#1609; &#1605;&#1588;&#1607;&#1583; &#1571;&#1608; &#1573;&#1604;&#1609; &#1602;&#1576;&#1585; &#1571;&#1608; &#1605;&#1575; &#1571;&#1588;&#1576;&#1607; &#1584;&#1604;&#1603;.&#1606;&#1602;&#1608;&#1604; &#1607;&#1584;&#1607; &#1576;&#1583;&#1593;&#1577;&#1563; &#1604;&#1603;&#1606; &#1607;&#1604; &#1610;&#1593;&#1606;&#1610; &#1571;&#1606; &#1607;&#1584;&#1575; &#1604;&#1610;&#1587; &#1588;&#1585;&#1603;&#1575; &#1571;&#1603;&#1576;&#1585;&#1563; &#1604;&#1575;&#1567; &#1604;&#1571;&#1606; &#1575;&#1604;&#1576;&#1583;&#1593; &#1605;&#1606;&#1607;&#1575; &#1605;&#1575; &#1607;&#1608; &#1605;&#1603;&#1601;&#1616;&#1617;&#1585;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Correct, this (wording) has come in the speech of Shaykh al-Islaam, however, innovation (bid'ah), he intends by this the newly arising innovation, meaning that which occurred in this ummah [i.e. he intends to show that it is newly-arising affair in the ummah not known prior] and it is not his intent (rahimahullah) through the word "bid'ah" that it is the bid'ah that is not <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, because the innovations that occurred in the Ummah, from them are innovations which are kufr and <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> and amongst them are those which are less than that. Hence, his saying, "<i>As for asking the dead to supplicate to Allaah for the questioner, then it is a bid'ah</i>" he means that this is a newly-arising affair in this ummah, until even the people of Jaahiliyyah did not used to do this. They would not say, "<i>Call upon Allaah for us</i>," they would say, "<i>Intercede for us</i>." Hence, the issue of asking the dead to supplicate, this is an innovation that arose, until even amongst the pagans, it was not something (found) with them. The people of Jaahiliyyah, it was not (found) with them, rather it arose in this ummah (as something new). With the people of Jaahiliyyah it used to be a request through the word of "<a href="tags/shafaaah.html" class="tagLink"><font class="tagLink">shafaa'ah</font></a>" (<a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>), "<i>intercede for us</i>", they would come, seek nearness (to the deity) so that he intercedes (for them), they would give devotion so that he would intercede for them, or they would address him with the issue of <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>, "intercede for us with such and such and such and such."    <P>
As for "<i>supplicate to Allaah for us</i>", this is an innovation that occurred in the ummah. Hence, the saying of Shaykh al-Islaam is correct in that it is a newly-arising innovation, and that it is a bid'ah does not mean it is not major <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>. For building domes upon graves and asking their inhabitants and turning towards them upon this manner that you see in the various shrines (mashaahid) and making pilgrimage to these shrines and setting up rituals all of it is an innovation, we say it is an innovation that occurred in this ummah, and he  means that asking the inhabitants of these shrines, sacrificing to them, upon this manner that is present, it was not present in Jaahiliyyah in this manner. Their <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of the dead represented by idols and statues and turning to their graves and what resembles that, but it was not upon this (innovated) way.     <P>
The people of Jaahiliyyah would not make pilgrimage to a shrine, or a grave or what resembles this just like Hajj (is made) to the Sacred House of Allaah, we say that this is an innovation. However, does this mean that it is not Major Shirk? No, because from the innovations are those which expel from Islaam.</blockquote>    <P>
<b>Cassette:</b> <i>Sharh Kashf al-Shubuhaat</i>. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/trupt-shaykh-al-islam-ibn-taymiyyah-on-requesting-the-dead-to-supplicate-to-allaah.html">Shaykh al-Islam Ibn Taymiyyah on Requesting the Dead to Supplicate to Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?trupt<BR>

<li><a href="articles/ftwqp-shaykh-al-islam-ibn-taymiyyah-on-asking-intermediaries-to-ask-allaah-on-their-behalf.html">Shaykh al-Islam Ibn Taymiyyah on Asking Intermediaries to Ask Allaah on Their Behalf</a><BR>
//www.tawhidfirst.com/monotheism/?ftwqp<BR>

<li><a href="articles/kcqzx-shaykh-saalih-aal-al-shaykh-on-the-ruling-on-requesting-the-prophets-supplication-after-his-death.html">Shaykh Saalih Aal al-Shaykh on The Ruling on Requesting the Prophet's Supplication After His Death</a><BR>
//www.tawhidfirst.com/monotheism/?kcqzx<BR>

<li><a href="articles/rbduh-shaykh-al-islam-ibn-taymiyyah-on-those-seeking-supplication-and-intercession-from-inhabitants-of-graves.html">Shaykh al-Islam Ibn Taymiyyah on Those Requesting Supplication and Intercession From Inhabitants of Graves</a><BR>
//www.tawhidfirst.com/monotheism/?rbduh<BR>

<li><a href="articles/wlxwy-ibn-taymiyyah-on-asking-the-dead-to-supplicate-to-allaah-for-them.html">Ibn Taymiyyah on Various Manifestations of Shirk: Seeking Intercession and Requesting Supplication From the Dead</a><BR>
//www.tawhidfirst.com/monotheism/?wlxwy<BR>

<li><a href="articles/sqjxj-shaykh-saalih-aal-al-shaykh-clarifying-statement-of-ibn-taymiyyah-regarding-shafaaah-and-bidah.html">Shaykh Saalih Aal al-Shaykh Clarifying Statement of Ibn Taymiyyah Regarding Requesting the Dead's Supplication and Bid'ah</a><BR>
//www.tawhidfirst.com/monotheism/?sqjxj<BR>

<li><a href="articles/vqroj-between-fakhr-al-din-al-razi-d-606h-and-abdul-aziz-bin-muhammad-bin-saud-d-1218h-on--seeking-shafaaah-from-other-than-allaah.html">Between Fakhr al-Din al-Razi (d. 606H) and Abdul-Aziz bin Muhammad bin Saud (d. 1218H) on  Seeking Shafaa'ah From Other Than Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?vqroj<BR>

<li><a href="articles/pmtvz-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-7.1f.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 7 </a><BR>
//www.tawhidfirst.com/monotheism/?pmtvz<BR>

<li><a href="articles/ebzse-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-6.20.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 6</a><BR>
//www.tawhidfirst.com/monotheism/?ebzse<BR>

<li><a href="articles/asmag-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-5.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 5</a><BR>
//www.tawhidfirst.com/monotheism/?asmag<BR>

<li><a href="articles/pqwqp-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-4.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 4</a><BR>
//www.tawhidfirst.com/monotheism/?pqwqp<BR>

<li><a href="articles/fgnbc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-3.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 3</a><BR>
//www.tawhidfirst.com/monotheism/?fgnbc<BR>

<li><a href="articles/ysquc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-2.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 2</a><BR>
//www.tawhidfirst.com/monotheism/?ysquc<BR>

<li><a href="articles/qhxzs-fakhr-ud-din-ar-razi-d-606h-on-shafaaah-from-intermediaries---part-1.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 1</a><BR>
//www.tawhidfirst.com/monotheism/?qhxzs<BR>

<li><a href="articles/ufkjv-shaykh-ul-islam-ibn-taymiyyah-on-intercession-and-the-affirmed-and-rejected-types-of-intermediaries.html">Shaykh ul-Islam Ibn Taymiyyah on Intercession and the Affirmed and Rejected Types of Intermediaries</a><BR>
//www.tawhidfirst.com/monotheism/?ufkjv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?sqjxj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


