




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?ebzse by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>TawhidFirst.Com | Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 6</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 6</span><BR>
Wednesday, November 10 2010 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at TawhidFirst.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><b>Read:</b> <a href=indexdfc4.html?qhxzs>Part 1</a>, <a href=index4857.html?ysquc>Part 2</a>, <a href=index7248.html?fgnbc>Part 3</a>, <a href=index6578.html?pqwqp>Part 4</a>, <a href=index0b41.html?asmag>Part 5</a>, <a href=index3141.html?ebzse>Part 6</a>, <a href=indexeeff.html?pmtvz>Part 7</a></div>    <P>
<font class='titleHeadline'>Background and Introduction</font>    <P>
<img src=assets/images/razi-tafsir-cover.gif border=1 align=right hspace=8 vspace=6 border=0> To the right is a cover page for the book "<b>Tafsir ar-Razi</b>", also known as "<b>Mafaateeh al-Ghayb</b>" belonging to <a href='tags/fakhr-ud-din-ar-razi.html' class='tagLink'><font class='tagLink'>Fakhr ud-Din <a href="tags/ar-razi.html" class="tagLink"><font class="tagLink">ar-Razi</font></a></font></a> who is a prominent Imaam for the Ash'aris of today and he died in 606H. We will be quoting from it further below to prove that "Tawhid al-Ibadah" is not an invention of Ibn Taymiyyah (rahimahullaah), nor Ibn Abdul-Wahhaab (rahimahullaah). <a href='tags/ar-razi.html' class='tagLink'><font class='tagLink'>Ar-Razi</font></a> was present in a time when <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of other than Allaah within the Muslim Ummah had spread and thus, even amongst the As'hari scholars prior to this era, there exist clear indications in their books and writings that they (unlike the later Ash'aris) understood Tawhid al-Ibaadah, and explained it, and spoke against its violation, even if they erred in other aspects of creed.     <P>
Historically, the innovations of the first century were light innovations (Khawarij, Shi'ah, Qadariyyah, Murji'ah), in that they did not directly relate to Allaah Himself. Those that came in the second century hijrah were more severe in that they related directly to the belief in Allaah Himself (His Names, Attributes, His Uluww, His Speech), and then from this period the introduction of philosophy and gnosticism (mystical esoteric knowledge) led to further deviations. However, it took around six centuries for <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> (associationism) to spread amongst the Muslims on a wide scale. The seeds of this <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> were spread initially by the Ismaa'eelee Baatiniyyah known as Ikhwan al-Safaa (Brethren of Purity) in the third and fourth centuries, and they were given support by the Ubaidiyyah (Shii'ite rulers of Egypt) when they took power. Prior to this time (before the fifth century, i.e. 400H), whilst the variuos sects had deviations in issues of aqidah, the understanding of Tawhid al-Ibaadah was still relatively firm.     <P>
<div class='sidebar'>In light of this, the earliest Ash'aris had the least deviance, they were following the madhhab of Ibn Kullaab (d. 240H). The Ash'aris of the 5th and 6th centuries, hybridized their belief with that of the Mu'tazilah and Jahmiyyah (and thus deviated from the early Kullabi creed), and under the influence of gnostic mysticism, the Ash'aris who came later (7th, 8th century onwards) fell into saint and grave <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>, which had started to spread in the time of <a href='tags/ar-razi.html' class='tagLink'><font class='tagLink'>ar-Razi</font></a> (d. 606H) - thereby surpassing all previous Ash'aris in deviation. It is for this reason that what is known today as "Ash'ariyyah" is not a uniform consistent belief or practice, rather it is a hotch-potch of views, many of which are inconsistent, and you find great differences between the early (original) Kullaabi Ash'aris, and those who came later.</div>     <P>
This shows that the greater deviations occurred when the people were further away from the era of revelation, and this is simply a cycle of history. This has always occurred after the sending of Prophets and Messengers, and it is indicated in the Prophetic texts for this ummah, such as those texts that mention that this (Muslim) nation will follow the footsteps of those (nations) that came before them (such as the Jews and Christians). For this reason, the greatest deviation, <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> with Allaah, was the last of the affairs to enter into the Ummah - long after the era of Prophethood.    <P>
<!---<div class='sidebar'>Now <a href='//www.tawhidfirst.com/monotheism/tags/fakhr-ud-din-ar-razi.cfm' class='tagLink'><font class='tagLink'>Fakhr ud-Din <a href="//www.tawhidfirst.com/monotheism/tags/ar-razi.cfm" class="tagLink"><font class="tagLink">ar-Razi</font></a></font></a> is a colorful figure, his books are warned against by later Ash'aris such as as-Sanusi (d. 895H), and this is because often, <a href='//www.tawhidfirst.com/monotheism/tags/ar-razi.cfm' class='tagLink'><font class='tagLink'>ar-Razi</font></a> had no scruples and for the sake of refuting, he would bring together the arguments of the Philosophers, as well as those of the Mutakallimeen (theologians), when attempting to refute, which is what he did in his book "<i>Asaas at-Taqdees</i>", an attempt at refuting Allaah being above His Throne, with His Essence, and which Shaykh ul-Islaam Ibn Taymiyyah demolished in his "<i>Bayaan Talbees al-Jahmiyyah</i>". This book of <a href='//www.tawhidfirst.com/monotheism/tags/ar-razi.cfm' class='tagLink'><font class='tagLink'>ar-Razi</font></a> became an important reference work for all of the arguments against the creed of Ahl us-Sunnah wal-Jamaa'ah, the Righteous Salaf, that Allaah Himself, with His Essence, is above the Throne, to such a degree that today they are even prepared to utilize the arguments of the Philosophers made against them (the Mutakallimeen, the Ash'arites), as a basis for attacking the creed of Ahl us-Sunnah, which is academic dishonesty. A good example of this was illustrated when a contemporary intellectual fraudster going by the name of Abu Adam Naruiji, was caught and exposed in a scandal with respect to this particular subject, <a href=http://www.asharis.com/creed/?cdaws>you can refer to that episode here</a>. </div> //--->    <P>
Coming to the subject of this series of articles now, we present in this some quotations from the <u>Tafseer of ar-Razi</u> pertaining to the core arguments for the justification of supplicating to those besides Allaah and seeking their <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>, and through this we illustrate that this type of refutation against the grave and saint worshippers precedes Ibn Taymiyyah (rahimahullaah) by a century and Ibn Abdul-Wahhaab (rahimahullaah) by six centuries, and it also uncovers the academic and intellectual fraud of today's grave and saint-worshippers against the Scholars of Tawheed.  <P> 


<p><font class='titleHeadline'>The Intent of Those Who <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> Idols is Not to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> the Idols But The Saints Whom They Represent</font>    <P>
We have established previously that al-Razi, the Ash'ari scholar of the 6th and early 7th centuries, affirmed: <b>a)</b> That <a href='tags/shafaaah.html' class='tagLink'><font class='tagLink'>shafaa'ah</font></a> (<a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>) belongs to none but Allaah alone, and <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> can never take place except with Allah's permission - (<a href=index6578.html?pqwqp>see this article</a>),  <b>b)</b> That <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> (<a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>) is the loftiest of the stations of al-ubudiyyah (servitude, worship), is the  most excellent of the types of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>, and the reality of <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> is such that incorporates other forms of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> such as humility (dhull), servitude (uboodiyyah), incapacity (inkisaar), poverty, need (maskanah) - (<a href=index0b41.html?asmag>see this article</a>), <b>c)</b> That none of the pagans ever intended to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> the statues or idols, rather the acts of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> they performed were directed to those in the graves, and their reason was that they were intending to solicit their <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> - (see <a href=index7248.html?fgnbc>this article</a> and <a href=index6578.html?pqwqp>this article</a>), <b>d)</b> That many were found in the time of al-Razi who flocked to the graves and venerated them with the desire of soliciting the <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> of the righteous dead - (<a href=indexdfc4.html?qhxzs>see here</a>).    <P>
<div class='sidebar'>Each of these four issues are ones in which al-Razi's statements directly clash with much of what the Ash'arites who came later and who claimed that <b>a)</b> <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> is not <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> (ibadah), <b>b)</b> that it is permissible to ask for <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> from other than Allaah (besides the permitted type of asking which is asking the living to make supplication), <b>c)</b> that the pagans worshipped idols, not the righteous dead. These are all erroneous and concerning the latter point, the pagans did not actually intend <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of the statues, idols, graves and the likes, they intended <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of the righteous dead and the idols, statues and graves are merely focal points for them. This is the subject of this article where al-Razi elaborates on this further. And this is similar to when the Muslims use the ka'bah as the qiblah and focal point, they do not <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> it, but they <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> Allaah, Most High. And this is what is intended by those who <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> the dead by venerating their graves. Do they expect the grave is going to intercede for them? No pagan ever believed that, rather they directed <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to their deities, be they Angels, Jinns, Prophets, the righteous, or the heavenly spirits they thought were occupying the stars and planets, and the idols, statues, graves were merely focal points for them.</div>    <P>
<font class='titleHeadline'>Clarification From al-Razi in This Regard</font>    <P>
In his tafsir (Dar Kutub al-Ilmiyyah, Beirut, 1st edition, 2000), al-Razi explains (2/103 onwards) in relation to the saying of Allaah "<b>Therefore do not set up rivals for Allaah whilst you know</b>" (2:22):    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577; &#1575;&#1604;&#1571;&#1608;&#1604;&#1609; &#1575;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1604;&#1610;&#1587; &#1601;&#1610; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1571;&#1581;&#1583; &#1610;&#1579;&#1576;&#1578; &#1604;&#1604;&#1607; &#1588;&#1585;&#1610;&#1603;&#1575;&#1611; &#1610;&#1587;&#1575;&#1608;&#1610;&#1607; &#1601;&#1610; &#1575;&#1604;&#1608;&#1580;&#1608;&#1583; &#1608;&#1575;&#1604;&#1602;&#1583;&#1585;&#1577; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1608;&#1607;&#1584;&#1575; &#1605;&#1605;&#1575; &#1604;&#1605; &#1610;&#1608;&#1580;&#1583; &#1573;&#1604;&#1609; &#1575;&#1604;&#1570;&#1606; &#1604;&#1603;&#1606; &#1575;&#1604;&#1579;&#1606;&#1608;&#1610;&#1577; &#1610;&#1579;&#1576;&#1578;&#1608;&#1606; &#1573;&#1604;&#1607;&#1610;&#1606; &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1581;&#1604;&#1610;&#1605; &#1610;&#1601;&#1593;&#1604; &#1575;&#1604;&#1582;&#1610;&#1585; &#1608;&#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1587;&#1601;&#1610;&#1607; &#1610;&#1601;&#1593;&#1604; &#1575;&#1604;&#1588;&#1585; &#1608;&#1571;&#1605;&#1575; &#1575;&#1578;&#1582;&#1575;&#1584; &#1605;&#1593;&#1576;&#1608;&#1583; &#1587;&#1608;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1601;&#1601;&#1610; &#1575;&#1604;&#1584;&#1575;&#1607;&#1576;&#1610;&#1606; &#1573;&#1604;&#1609; &#1584;&#1604;&#1603; &#1603;&#1579;&#1585;&#1577; &#1575;&#1604;&#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1571;&#1608;&#1604; &#1593;&#1576;&#1583;&#1577; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1608;&#1607;&#1605; &#1575;&#1604;&#1589;&#1575;&#1576;&#1574;&#1577; &#1601;&#1573;&#1606;&#1607;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1582;&#1604;&#1602; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1608;&#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1607;&#1610; &#1575;&#1604;&#1605;&#1583;&#1576;&#1585;&#1575;&#1578; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1602;&#1575;&#1604;&#1608;&#1575; &#1601;&#1610;&#1580;&#1576; &#1593;&#1604;&#1610;&#1606;&#1575; &#1571;&#1606; &#1606;&#1593;&#1576;&#1583; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1608;&#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1578;&#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1575;&#1604;&#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1575;&#1604;&#1606;&#1589;&#1575;&#1585;&#1609; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1593;&#1576;&#1583;&#1608;&#1606; &#1575;&#1604;&#1605;&#1587;&#1610;&#1581; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1608;&#1575;&#1604;&#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1579;&#1575;&#1604;&#1579; &#1593;&#1576;&#1583;&#1577; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1608;&#1575;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1604;&#1575; &#1583;&#1610;&#1606; &#1571;&#1602;&#1583;&#1605; &#1605;&#1606; &#1583;&#1610;&#1606; &#1593;&#1576;&#1583;&#1577; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1608;&#1584;&#1604;&#1603; &#1604;&#1571;&#1606; &#1571;&#1602;&#1583;&#1605; &#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1606;&#1602;&#1604; &#1573;&#1604;&#1610;&#1606;&#1575; &#1578;&#1575;&#1585;&#1610;&#1582;&#1607;&#1605; &#1607;&#1608; &#1606;&#1608;&#1581; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1608;&#1607;&#1608; &#1573;&#1606;&#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1575;&#1604;&#1585;&#1583; &#1593;&#1604;&#1610;&#1607;&#1605; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1582;&#1576;&#1585; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1606; &#1602;&#1608;&#1605;&#1607; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1608;&#1614;&#1602;&#1614;&#1575;&#1604;&#1615;&#1608;&#1575;&#1618; &#1604;&#1575;&#1614; &#1578;&#1614;&#1584;&#1614;&#1585;&#1615;&#1606;&#1617;&#1614; &#1569;&#1575;&#1604;&#1616;&#1607;&#1614;&#1578;&#1614;&#1603;&#1615;&#1605;&#1618; &#1608;&#1614;&#1604;&#1575;&#1614; &#1578;&#1614;&#1584;&#1614;&#1585;&#1615;&#1606;&#1617;&#1614; &#1608;&#1614;&#1583;&#1617;&#1575;&#1611; &#1608;&#1614;&#1604;&#1575;&#1614; &#1587;&#1615;&#1608;&#1614;&#1575;&#1593;&#1575;&#1611; &#1608;&#1614;&#1604;&#1575;&#1614; &#1610;&#1614;&#1594;&#1615;&#1608;&#1579;&#1614; &#1608;&#1614;&#1610;&#1614;&#1593;&#1615;&#1608;&#1602;&#1614; &#1608;&#1614;&#1606;&#1614;&#1587;&#1618;&#1585;&#1575;&#1611; ( &#1606;&#1608;&#1581; 23 ) &#1601;&#1593;&#1604;&#1605;&#1606;&#1575; &#1571;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;&#1577; &#1603;&#1575;&#1606;&#1578; &#1605;&#1608;&#1580;&#1608;&#1583;&#1577; &#1602;&#1576;&#1604; &#1606;&#1608;&#1581; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1587;&#1604;&#1575;&#1605; &#1608;&#1607;&#1610; &#1576;&#1575;&#1602;&#1610;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1570;&#1606; &#1576;&#1604; &#1571;&#1603;&#1579;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1605;&#1587;&#1578;&#1605;&#1585;&#1608;&#1606; &#1593;&#1604;&#1609; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;&#1577; &#1608;&#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1584;&#1607;&#1576; &#1575;&#1604;&#1584;&#1610; &#1607;&#1584;&#1575; &#1588;&#1571;&#1606;&#1607; &#1610;&#1587;&#1578;&#1581;&#1610;&#1604; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1576;&#1581;&#1610;&#1579; &#1610;&#1593;&#1585;&#1601; &#1601;&#1587;&#1575;&#1583;&#1607; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1604;&#1603;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1580;&#1585; &#1575;&#1604;&#1605;&#1606;&#1581;&#1608;&#1578; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1587;&#1575;&#1593;&#1577; &#1604;&#1610;&#1587; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1582;&#1604;&#1602;&#1606;&#1610; &#1608;&#1582;&#1604;&#1602; &#1575;&#1604;&#1587;&#1605;&#1608;&#1575;&#1578; &#1608;&#1575;&#1604;&#1571;&#1585;&#1590; &#1593;&#1604;&#1605; &#1590;&#1585;&#1608;&#1585;&#1610; &#1601;&#1610;&#1587;&#1578;&#1581;&#1610;&#1604; &#1573;&#1591;&#1576;&#1575;&#1602; &#1575;&#1604;&#1580;&#1605;&#1593; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1593;&#1604;&#1610;&#1607; &#1601;&#1608;&#1580;&#1576; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1604;&#1593;&#1576;&#1583;&#1577; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1594;&#1585;&#1590; &#1570;&#1582;&#1585; &#1587;&#1608;&#1609; &#1584;&#1604;&#1603; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1584;&#1603;&#1585;&#1608;&#1575; &#1601;&#1610;&#1607; &#1608;&#1580;&#1608;&#1607;&#1575;&#1611;</div>    <P>
A summary of the above is that there is not in existence any person who affirms that Allah has any partner in knowledge, power, wisdom and the likes, and that this has never been found to date, except for the Dualists who believe in a god of good and a god of evil. [Note here that al-Razi is saying that no one in history has every claimed that others share with Allaah in aspects of His Ruboobiyyah]. But as for taking a deity for <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> besides Allaah, then there are many factions who have fallen into this [Note here al-Razi is speaking about <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a> in Uloohiyyah]. Then he mentions three categories. <b>The first</b> are the Sabeans who <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> the stars [believing they are inhabited by the spirits, angels], and that by worshipping the stars, the stars in turn <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> Allaah. <b>The second</b> are those who <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> Eesaa (alayhis salaam). <b>The third</b> are those who worshipped idols, who he says which is the oldest of the religions of the pagans, and he makes reference to the people of Nuh (alayhis salaam). Then a little later he says that most of the people of the earth remain upon this way of the people of Nuh. He then says:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The knowledge (of a person) that this sculptured stone (idol) at this hour is not the one that created me and created the heavens and the earth is necessary knowledge. Thus it is impossible for a large multitude to come to agreement over [such a false religion]. Hence, it is necessary that the worshippers of idols have some other objective besides that. And the Scholars have mentioned a number of angles in this regard...</blockquote>    <P>
What he means that it is impossible for such a large number of misguided people to have come together to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> something about which they know for sure that it did not create them or the heavens and the earth. This means that there is definitely another objective or goal that these people have in mind. Then he explains the views of the Scholars in this regard with respect to types he mentioned earlier (Sabeans, Christians, Pagans).    <P>
<div class='arabic' align='right'>&#1571;&#1581;&#1583;&#1607;&#1575; &#1605;&#1575; &#1584;&#1603;&#1585;&#1607; &#1571;&#1576;&#1608; &#1605;&#1593;&#1588;&#1585; &#1580;&#1593;&#1601;&#1585; &#1576;&#1606; &#1605;&#1581;&#1605;&#1583; &#1575;&#1604;&#1605;&#1606;&#1580;&#1605; &#1575;&#1604;&#1576;&#1604;&#1582;&#1610; &#1601;&#1610; &#1576;&#1593;&#1590; &#1605;&#1589;&#1606;&#1601;&#1575;&#1578;&#1607; &#1571;&#1606; &#1603;&#1579;&#1610;&#1585;&#1575;&#1611; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1589;&#1610;&#1606; &#1608;&#1575;&#1604;&#1607;&#1606;&#1583; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1604;&#1575;&#1574;&#1603;&#1578;&#1607; &#1608;&#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1606; &#1571;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1580;&#1587;&#1605; &#1608;&#1584;&#1608; &#1589;&#1608;&#1585;&#1577; &#1603;&#1571;&#1581;&#1587;&#1606; &#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1589;&#1608;&#1585; &#1608;&#1607;&#1603;&#1584;&#1575; &#1581;&#1575;&#1604; &#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1571;&#1610;&#1590;&#1575;&#1611; &#1601;&#1610; &#1589;&#1608;&#1585;&#1607;&#1605; &#1575;&#1604;&#1581;&#1587;&#1606;&#1577; &#1608;&#1571;&#1606;&#1607;&#1605; &#1603;&#1604;&#1607;&#1605; &#1602;&#1583; &#1575;&#1581;&#1578;&#1580;&#1576;&#1608;&#1575; &#1593;&#1606;&#1575; &#1576;&#1575;&#1604;&#1587;&#1605;&#1575;&#1569; &#1608;&#1571;&#1606; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1593;&#1604;&#1610;&#1607;&#1605; &#1571;&#1606; &#1610;&#1589;&#1608;&#1594;&#1608;&#1575; &#1578;&#1605;&#1575;&#1579;&#1610;&#1604; &#1571;&#1606;&#1610;&#1602;&#1577; &#1575;&#1604;&#1605;&#1606;&#1592;&#1585; &#1581;&#1587;&#1606;&#1577; &#1575;&#1604;&#1585;&#1608;&#1575;&#1569; &#1593;&#1604;&#1609; &#1575;&#1604;&#1607;&#1610;&#1574;&#1577; &#1575;&#1604;&#1578;&#1610; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1606;&#1607;&#1575; &#1605;&#1606; &#1589;&#1608;&#1585; &#1575;&#1604;&#1573;&#1604;&#1607; &#1608;&#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1601;&#1610;&#1593;&#1603;&#1601;&#1608;&#1606; &#1593;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1575; &#1602;&#1575;&#1589;&#1583;&#1610;&#1606; &#1591;&#1604;&#1576; &#1575;&#1604;&#1586;&#1604;&#1601;&#1609; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1605;&#1604;&#1575;&#1574;&#1603;&#1578;&#1607; &#1601;&#1573;&#1606; &#1589;&#1581; &#1605;&#1575; &#1584;&#1603;&#1585;&#1607; &#1571;&#1576;&#1608; &#1605;&#1593;&#1588;&#1585; &#1601;&#1575;&#1604;&#1587;&#1576;&#1576; &#1601;&#1610; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1575;&#1604;&#1588;&#1576;&#1607; &#1608;&#1579;&#1575;&#1606;&#1610;&#1607;&#1575; &#1605;&#1575; &#1584;&#1603;&#1585;&#1607; &#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1607;&#1608; &#1571;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1585;&#1571;&#1608;&#1575; &#1578;&#1594;&#1610;&#1585;&#1575;&#1578; &#1571;&#1581;&#1608;&#1575;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1605;&#1585;&#1576;&#1608;&#1591;&#1577; &#1576;&#1578;&#1594;&#1610;&#1585;&#1575;&#1578; &#1571;&#1581;&#1608;&#1575;&#1604; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1601;&#1573;&#1606; &#1576;&#1581;&#1587;&#1576; &#1602;&#1585;&#1576; &#1575;&#1604;&#1588;&#1605;&#1587; &#1608;&#1576;&#1593;&#1583;&#1607;&#1575; &#1593;&#1606; &#1587;&#1605;&#1578; &#1575;&#1604;&#1585;&#1571;&#1587; &#1578;&#1581;&#1583;&#1579; &#1575;&#1604;&#1601;&#1589;&#1608;&#1604; &#1575;&#1604;&#1605;&#1582;&#1578;&#1604;&#1601;&#1577; &#1608;&#1575;&#1604;&#1571;&#1581;&#1608;&#1575;&#1604; &#1575;&#1604;&#1605;&#1578;&#1576;&#1575;&#1610;&#1606;&#1577; &#1579;&#1605; &#1573;&#1606;&#1607;&#1605; &#1585;&#1589;&#1583;&#1608;&#1575; &#1571;&#1581;&#1608;&#1575;&#1604; &#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1601;&#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1575;&#1585;&#1578;&#1576;&#1575;&#1591; &#1575;&#1604;&#1587;&#1593;&#1575;&#1583;&#1577; &#1608;&#1575;&#1604;&#1606;&#1581;&#1608;&#1587;&#1577; &#1601;&#1610; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1576;&#1603;&#1610;&#1601;&#1610;&#1577; &#1608;&#1602;&#1608;&#1593;&#1607;&#1575; &#1601;&#1610; &#1591;&#1608;&#1575;&#1604;&#1593; &#1575;&#1604;&#1606;&#1575;&#1587; &#1601;&#1604;&#1605;&#1575; &#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1584;&#1604;&#1603; &#1576;&#1575;&#1604;&#1594;&#1608;&#1575; &#1601;&#1610; &#1578;&#1593;&#1592;&#1610;&#1605;&#1607;&#1575; &#1601;&#1605;&#1606;&#1607;&#1605; &#1605;&#1606; &#1575;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606;&#1607;&#1575; &#1571;&#1588;&#1610;&#1575;&#1569; &#1608;&#1575;&#1580;&#1576;&#1577; &#1575;&#1604;&#1608;&#1580;&#1608;&#1583; &#1604;&#1584;&#1608;&#1575;&#1578;&#1607;&#1575; &#1608;&#1607;&#1610; &#1575;&#1604;&#1578;&#1610; &#1582;&#1604;&#1602;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1593;&#1608;&#1575;&#1604;&#1605; &#1608;&#1605;&#1606;&#1607;&#1605; &#1605;&#1606; &#1575;&#1593;&#1578;&#1602;&#1583; &#1571;&#1606;&#1607;&#1575; &#1605;&#1582;&#1604;&#1608;&#1602;&#1577; &#1604;&#1604;&#1573;&#1604;&#1607; &#1575;&#1604;&#1571;&#1603;&#1576;&#1585; &#1604;&#1603;&#1606;&#1607;&#1575; &#1582;&#1575;&#1604;&#1602;&#1577; &#1604;&#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1601;&#1575;&#1604;&#1571;&#1608;&#1604;&#1608;&#1606; &#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1571;&#1606;&#1607;&#1575; &#1607;&#1610; &#1575;&#1604;&#1573;&#1604;&#1607; &#1601;&#1610; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1608;&#1575;&#1604;&#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1571;&#1606;&#1607;&#1575; &#1607;&#1610; &#1575;&#1604;&#1608;&#1587;&#1575;&#1574;&#1591; &#1576;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1608;&#1576;&#1610;&#1606; &#1575;&#1604;&#1576;&#1588;&#1585; &#1601;&#1604;&#1575; &#1580;&#1585;&#1605; &#1575;&#1588;&#1578;&#1594;&#1604;&#1608;&#1575; &#1576;&#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1575; &#1608;&#1575;&#1604;&#1582;&#1590;&#1608;&#1593; &#1604;&#1607;&#1575; &#1579;&#1605; &#1604;&#1605;&#1575; &#1585;&#1571;&#1608;&#1575; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1605;&#1587;&#1578;&#1578;&#1585;&#1577; &#1601;&#1610; &#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1571;&#1608;&#1602;&#1575;&#1578; &#1593;&#1606; &#1575;&#1604;&#1571;&#1576;&#1589;&#1575;&#1585; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1604;&#1607;&#1575; &#1571;&#1589;&#1606;&#1575;&#1605;&#1575;&#1611; &#1608;&#1571;&#1602;&#1576;&#1604;&#1608;&#1575; &#1593;&#1604;&#1609; &#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1575; &#1602;&#1575;&#1589;&#1583;&#1610;&#1606; &#1576;&#1578;&#1604;&#1603; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1575;&#1578; &#1578;&#1604;&#1603; &#1575;&#1604;&#1571;&#1580;&#1585;&#1575;&#1605; &#1575;&#1604;&#1593;&#1575;&#1604;&#1610;&#1577; &#1608;&#1605;&#1578;&#1602;&#1585;&#1576;&#1610;&#1606; &#1573;&#1604;&#1609; &#1571;&#1588;&#1576;&#1575;&#1581;&#1607;&#1575; &#1575;&#1604;&#1594;&#1575;&#1574;&#1576;&#1577; &#1579;&#1605; &#1604;&#1605;&#1575; &#1591;&#1575;&#1604;&#1578; &#1575;&#1604;&#1605;&#1583;&#1577; &#1571;&#1604;&#1594;&#1608;&#1575; &#1584;&#1603;&#1585; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1608;&#1578;&#1580;&#1585;&#1583;&#1608;&#1575; &#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1578;&#1604;&#1603; &#1575;&#1604;&#1578;&#1605;&#1575;&#1579;&#1610;&#1604; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1601;&#1610; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1593;&#1576;&#1583;&#1577; &#1575;&#1604;&#1603;&#1608;&#1575;&#1603;&#1576; &#1608;&#1579;&#1575;&#1604;&#1579;&#1607;&#1575; &#1571;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1571;&#1581;&#1603;&#1575;&#1605; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1593;&#1610;&#1606;&#1608;&#1606; &#1571;&#1608;&#1602;&#1575;&#1578;&#1575;&#1611; &#1601;&#1610; &#1575;&#1604;&#1587;&#1606;&#1610;&#1606; &#1575;&#1604;&#1605;&#1578;&#1591;&#1575;&#1608;&#1604;&#1577; &#1606;&#1581;&#1608; &#1575;&#1604;&#1571;&#1604;&#1601; &#1608;&#1575;&#1604;&#1571;&#1604;&#1601;&#1610;&#1606; &#1608;&#1610;&#1586;&#1593;&#1605;&#1608;&#1606; &#1571;&#1606; &#1605;&#1606; &#1575;&#1578;&#1582;&#1584; &#1591;&#1604;&#1587;&#1605;&#1575;&#1611; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1608;&#1602;&#1578; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607; &#1582;&#1575;&#1589; &#1601;&#1573;&#1606;&#1607; &#1610;&#1606;&#1578;&#1601;&#1593; &#1576;&#1607; &#1601;&#1610; &#1571;&#1581;&#1608;&#1575;&#1604; &#1605;&#1582;&#1589;&#1608;&#1589;&#1577; &#1606;&#1581;&#1608; &#1575;&#1604;&#1587;&#1593;&#1575;&#1583;&#1577; &#1608;&#1575;&#1604;&#1582;&#1589;&#1576; &#1608;&#1583;&#1601;&#1593; &#1575;&#1604;&#1570;&#1601;&#1575;&#1578; &#1608;&#1603;&#1575;&#1606;&#1608;&#1575; &#1573;&#1584;&#1575; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1584;&#1604;&#1603; &#1575;&#1604;&#1591;&#1604;&#1587;&#1605; &#1593;&#1592;&#1605;&#1608;&#1607; &#1604;&#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607;&#1605; &#1571;&#1606;&#1607;&#1605; &#1610;&#1606;&#1578;&#1601;&#1593;&#1608;&#1606; &#1576;&#1607; &#1601;&#1604;&#1605;&#1575; &#1576;&#1575;&#1604;&#1594;&#1608;&#1575; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1578;&#1593;&#1592;&#1610;&#1605; &#1589;&#1575;&#1585; &#1584;&#1604;&#1603; &#1603;&#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1608;&#1604;&#1605;&#1575; &#1591;&#1575;&#1604;&#1578; &#1605;&#1583;&#1577; &#1584;&#1604;&#1603; &#1575;&#1604;&#1601;&#1593;&#1604; &#1606;&#1587;&#1608;&#1575; &#1605;&#1576;&#1583;&#1571; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1575;&#1588;&#1578;&#1594;&#1604;&#1608;&#1575; &#1576;&#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1580;&#1607;&#1575;&#1604;&#1577; &#1576;&#1571;&#1589;&#1604; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1585;&#1575;&#1576;&#1593;&#1607;&#1575; &#1571;&#1606;&#1607; &#1605;&#1578;&#1609; &#1605;&#1575;&#1578; &#1605;&#1606;&#1607;&#1605; &#1585;&#1580;&#1604; &#1603;&#1576;&#1610;&#1585; &#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1606; &#1601;&#1610;&#1607; &#1571;&#1606;&#1607; &#1605;&#1580;&#1575;&#1576; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1608;&#1605;&#1602;&#1576;&#1608;&#1604; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1589;&#1606;&#1605;&#1575;&#1611; &#1593;&#1604;&#1609; &#1589;&#1608;&#1585;&#1578;&#1607; &#1610;&#1593;&#1576;&#1583;&#1608;&#1606;&#1607; &#1593;&#1604;&#1609; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1571;&#1606; &#1584;&#1604;&#1603; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1610;&#1603;&#1608;&#1606; &#1588;&#1601;&#1610;&#1593;&#1575;&#1611; &#1604;&#1607;&#1605; &#1610;&#1608;&#1605; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1582;&#1576;&#1585; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1606;&#1607;&#1605; &#1576;&#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;&#1577; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1607;&#1614;&#1572;&#1615;&#1604;&#1575;&#1569; &#1588;&#1615;&#1601;&#1614;&#1593;&#1614;&#1575;&#1572;&#1615;&#1606;&#1614;&#1575; &#1593;&#1616;&#1606;&#1583;&#1614; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; ( &#1610;&#1608;&#1606;&#1587; 18 ) &#1608;&#1582;&#1575;&#1605;&#1587;&#1607;&#1575; &#1604;&#1593;&#1604;&#1607;&#1605; &#1575;&#1578;&#1582;&#1584;&#1608;&#1607;&#1575; &#1605;&#1581;&#1575;&#1585;&#1610;&#1576; &#1604;&#1589;&#1604;&#1608;&#1575;&#1578;&#1607;&#1605; &#1608;&#1591;&#1575;&#1593;&#1575;&#1578;&#1607;&#1605; &#1608;&#1610;&#1587;&#1580;&#1583;&#1608;&#1606; &#1573;&#1604;&#1610;&#1607;&#1575; &#1604;&#1575; &#1604;&#1607;&#1575; &#1603;&#1605;&#1575; &#1571;&#1606;&#1575; &#1606;&#1587;&#1580;&#1583; &#1573;&#1604;&#1609; &#1575;&#1604;&#1602;&#1576;&#1604;&#1577; &#1604;&#1575; &#1604;&#1604;&#1602;&#1576;&#1604;&#1577; &#1608;&#1604;&#1605;&#1575; &#1575;&#1587;&#1578;&#1605;&#1585;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1575;&#1604;&#1577; &#1592;&#1606; &#1575;&#1604;&#1580;&#1607;&#1575;&#1604; &#1605;&#1606; &#1575;&#1604;&#1602;&#1608;&#1605; &#1571;&#1606;&#1607; &#1610;&#1580;&#1576; &#1593;&#1576;&#1575;&#1583;&#1578;&#1607;&#1575; &#1608;&#1587;&#1575;&#1583;&#1587;&#1607;&#1575; &#1604;&#1593;&#1604;&#1607;&#1605; &#1603;&#1575;&#1606;&#1608;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1580;&#1587;&#1605;&#1577; &#1601;&#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1580;&#1608;&#1575;&#1586; &#1581;&#1604;&#1608;&#1604; &#1575;&#1604;&#1585;&#1576; &#1601;&#1610;&#1607;&#1575; &#1601;&#1593;&#1576;&#1583;&#1608;&#1607;&#1575; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1571;&#1608;&#1610;&#1604; &#1601;&#1607;&#1584;&#1607; &#1607;&#1610; &#1575;&#1604;&#1608;&#1580;&#1608;&#1607; &#1575;&#1604;&#1578;&#1610; &#1610;&#1605;&#1603;&#1606; &#1581;&#1605;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;&#1577; &#1593;&#1604;&#1610;&#1607;&#1575; &#1581;&#1578; &#1609; &#1604;&#1610;&#1589;&#1610;&#1585; &#1576;&#1581;&#1610;&#1579; &#1610;&#1593;&#1604;&#1605; &#1576;&#1591;&#1604;&#1575;&#1606;&#1607; &#1576;&#1590;&#1585;&#1608;&#1585;&#1577; &#1575;&#1604;&#1593;&#1602;&#1604;</div>    <P>
Al-Razi has provided six explanations as to what the objective of these people might be:    <P>
<ul><li> <b>The first</b>, regarding a people who believe in Allah and the Angels, and believe that Allah and the Angels have beautiful forms, and that the Angels are veiled behind the heaven and inaccessible, so they make statues of them in the form and shape they believed those Angels to be, and then they give <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to them, seeking nearness to Allaah and those Angels, so their reason here was that they believed in resemblance between the statues they created and the Angels.    <P>
<li> <b>The second</b>, that many people saw the changes and events taking place in the world connected to changes in the positions of the stars, and the nearness and distance to the sun to the polar axis determines the variation in the seasons and the likes. Then they observed the positions of all of the stars and believed that good fortune and bad fortune in the world is tied to how they appear in relation to the people (their births and the likes). So when they believed this, they exaggerated in venerating these stars, and some of them believed that these entities are obligatory in their existence, and they created the universe, and others believed they are created by the greatest deity, but that they in turn created this universe. So the first group treated them as creators and deities and the second group treated them as <a href='tags/intermediaries.html' class='tagLink'><font class='tagLink'>intermediaries</font></a> (wasaa'it) between Allaah and mankind, and thus there is no harm in worshipping them and humbling to them. Then when they saw that the stars are not visible to them for most of the time (except at night), they set up idols for them, and directed <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to them, but in reality intending <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of those planetary bodies. Then when time passed over them, after the passing of generations, they abolished the mention of the stars, and worshipped just those idols, and they in reality are worshippers of the stars.    <P>
<li> <b>The third</b>, a people who used to specify certain times, through a period of lengthy years, such as a thousand, or two-thousand, and claimed that whoever took up a talisman in a particular form in that particular time would benefit in specific ways, such as in being happy and being fertile and the likes. Thus, they venerated these talismans and exaggerated until it became <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>, and then when a lengthy time passed by, their descendants forgot the initial reason, and they became occupied with worshipping them, ignorant of the original matter.    <P>
<li> <b>The fifth</b>, perhaps they took their niches (mihrabs) as their places of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> and their acts of obedience, and prostration towards them, but not for them, just like we prostrate towards the qiblah, not for the qiblah. And then the situation continued like this, perhaps the ignorants from the people thought that it was obligatory to <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> them.    <P>
<li> <b>The sixth</b>, perhaps they used to be Mujassimah who beleived that Allaah indwells in their statues and so they worshipped them upon this ta'wil (interpretation).   </ul>    <P>
As for <b>the fourth</b>, he said regarding it:    <P>
<div class='arabic' align='right'>&#1608;&#1585;&#1575;&#1576;&#1593;&#1607;&#1575; &#1571;&#1606;&#1607; &#1605;&#1578;&#1609; &#1605;&#1575;&#1578; &#1605;&#1606;&#1607;&#1605; &#1585;&#1580;&#1604; &#1603;&#1576;&#1610;&#1585; &#1610;&#1593;&#1578;&#1602;&#1583;&#1608;&#1606; &#1601;&#1610;&#1607; &#1571;&#1606;&#1607; &#1605;&#1580;&#1575;&#1576; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1608;&#1605;&#1602;&#1576;&#1608;&#1604; &#1575;&#1604;&#1588;&#1601;&#1575;&#1593;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1575;&#1578;&#1582;&#1584;&#1608;&#1575; &#1589;&#1606;&#1605;&#1575;&#1611; &#1593;&#1604;&#1609; &#1589;&#1608;&#1585;&#1578;&#1607; &#1610;&#1593;&#1576;&#1583;&#1608;&#1606;&#1607; &#1593;&#1604;&#1609; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1571;&#1606; &#1584;&#1604;&#1603; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1610;&#1603;&#1608;&#1606; &#1588;&#1601;&#1610;&#1593;&#1575;&#1611; &#1604;&#1607;&#1605; &#1610;&#1608;&#1605; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1604;&#1609; &#1605;&#1575; &#1571;&#1582;&#1576;&#1585; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1593;&#1606;&#1607;&#1605; &#1576;&#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1604;&#1577; &#1601;&#1610; &#1602;&#1608;&#1604;&#1607; &#1607;&#1614;&#1572;&#1615;&#1604;&#1575;&#1569; &#1588;&#1615;&#1601;&#1614;&#1593;&#1614;&#1575;&#1572;&#1615;&#1606;&#1614;&#1575; &#1593;&#1616;&#1606;&#1583;&#1614; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; ( &#1610;&#1608;&#1606;&#1587; 18 )</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the fourth of them, that when a senior man died amongst them, and they believed that his <a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a> is answered and his <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> is accepted with Allaah, the Exalted, they took an idol in his form, and worshipped it upon the belief that that man will be an intercessor for them with Allaah on the Day of Judgement, upon what Allaah, the Exalted, has informed abuot them in this statement in His saying, "<b>[They say], these are our intercessors with Allaah</b>" (10:18).</blockquote>    <P>
As has preceded, and as is clear from this entire section, these people do not actually intend <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of the idols in and of themselves, and their <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> is not actually directed to the idols, they are in fact worshipping the righteous dead man from whom they are hoping to solicit <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>. However, there may be people who forgot the original intent and ended up being devoted to idols, as al-Razi has indicated with some of those people, but certainly most of those who <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> other than Allaah simply use representations, be they idols, statues,  pictures, photos and graves and tombs as mere focal points for <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> which they are really directing to the angels, prophets or righteous. And this <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> includes <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> (<a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>) and the types of fear, hope, aspiration, humility and the likes which are due only for Allaah, which often accompany <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> (<a href='tags/supplication.html' class='tagLink'><font class='tagLink'>supplication</font></a>) - and al-Razi clearly holds that <a href='tags/dua.html' class='tagLink'><font class='tagLink'>du'a</font></a> is from the greatest of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a>, is from its essence and is inextricably tied to those states and feelings of the heart which are in themselves <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> (<a href=index0b41.html?asmag >see this article</a>).    <P>
<div class='sidebar'><b>Summary</b>    <P>
In summary of this article, al-Razi has indicated the action of those people who solicit the <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> of the righteous dead, using a statue or idol as the focal point. And the objection of the saint worshippers of today is to say that they do not <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> idols, hence are not committing <a href='tags/shirk.html' class='tagLink'><font class='tagLink'>shirk</font></a>, and nor do they believe these in the power of benefit or harm for any besides Allaah. The answer to them is the very answer of al-Razi in <a href=index7248.html?fgnbc>this article</a> and <a href=index6578.html?pqwqp>this article</a> and from what he said was, in addressing this very matter:    <P>
<blockquote>And know that the Kuffar posed a question to this speech [i.e. concerning the <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of inanimate things], so they said: We do not <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> these idols due to a belief that they are deities that can harm or benefit. We <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> them because they are representations of individuals who are near ones to Allaah. So we <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> them (the representations) for the reason that those senior ones (al-akaabir) become intercessors for us with Allaah. So Allaah the Most High replied saying: "<b>Have they taken others as intercessors besides Allah? Say: "Even if they have power over nothing whatever and have no intelligence?</b>" </blockquote>    <P>
And also:    <P>
<blockquote>And it is possible for it to be said that the intelligent being does not <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> an idol in the sense that it is mere wood or stone, but they <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> it due to their belief that these [things] are representations of the stars, or representations of the heavenly spirits, or representations of the Prophets and righteous (dead) who have passed away. And their intent behind worshipping them (the statues, idols, representations) is to direct those acts of <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to those things [the stars, heavenly spirits, prophets, righteous] for which they have made these representations as [tangible] forms for them. </blockquote>    <P>
And also:    <P>
<blockquote>And the fourth of them: That they made these idols and statues upon the form and shape of their Prophets and senior [righteous] ones (al-akaabir), and they claimed that when they occupied themselves with the <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> of these statues, then those senior [righteous] ones (al-akaabir) will be intercessors for them with Allaah. <b>And the equivalent of this in our time is the occupation of many of the creation with the veneration of the graves of the senior [righteous] ones, upon the belief that when they venerate their graves, then they (the deceased) will become intercessors for them with Allaah</b>.</blockquote>    <P>
Thus, the idol, or statue, or picture, or grave, or tomb, is merely the focal point - just like a Muslim turns towards the qiblah, but is not worshipping the qiblah (ka'bah) - then likewise with these people who seek <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>, they are worshipping the righteous dead by supplicating to them directly and seeking istighaathah, and asking them directly to intercede for them, or to relieve them of calamity and the likes, and they will sacrifice an animal at the grave, or direct such actions of the heart such as fear and hope towards that righteous dead person, which is only befitting for Allaah - and in all of that it is the tomb, or grave which is merely a focal point. No one of sound intelligence worships a statue, or idol, or a grave, or a tomb thinking it has power over good and evil or harm and benefit - as al-Razi has stated a few times as we have quoted from him in this series of articles - rather, they affirm only Allaah has power over harm and benefit, but they solicit <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a> through the righteous dead, directing what is no doubt <a href='tags/worship.html' class='tagLink'><font class='tagLink'>worship</font></a> to them, hoping that they might receive their <a href='tags/intercession.html' class='tagLink'><font class='tagLink'>intercession</font></a>.    <P>
These meanings outlined in these statements of al-Razi (d. 606H) are no different to what is found in the writings of Ibn Taymiyyah (d. 728H) and of Ibn Abdul-Wahhab (d. 1175H).</div>    <P>
    <P>
    <P>
    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/trupt-shaykh-al-islam-ibn-taymiyyah-on-requesting-the-dead-to-supplicate-to-allaah.html">Shaykh al-Islam Ibn Taymiyyah on Requesting the Dead to Supplicate to Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?trupt<BR>

<li><a href="articles/ftwqp-shaykh-al-islam-ibn-taymiyyah-on-asking-intermediaries-to-ask-allaah-on-their-behalf.html">Shaykh al-Islam Ibn Taymiyyah on Asking Intermediaries to Ask Allaah on Their Behalf</a><BR>
//www.tawhidfirst.com/monotheism/?ftwqp<BR>

<li><a href="articles/kcqzx-shaykh-saalih-aal-al-shaykh-on-the-ruling-on-requesting-the-prophets-supplication-after-his-death.html">Shaykh Saalih Aal al-Shaykh on The Ruling on Requesting the Prophet's Supplication After His Death</a><BR>
//www.tawhidfirst.com/monotheism/?kcqzx<BR>

<li><a href="articles/rbduh-shaykh-al-islam-ibn-taymiyyah-on-those-seeking-supplication-and-intercession-from-inhabitants-of-graves.html">Shaykh al-Islam Ibn Taymiyyah on Those Requesting Supplication and Intercession From Inhabitants of Graves</a><BR>
//www.tawhidfirst.com/monotheism/?rbduh<BR>

<li><a href="articles/wlxwy-ibn-taymiyyah-on-asking-the-dead-to-supplicate-to-allaah-for-them.html">Ibn Taymiyyah on Various Manifestations of Shirk: Seeking Intercession and Requesting Supplication From the Dead</a><BR>
//www.tawhidfirst.com/monotheism/?wlxwy<BR>

<li><a href="articles/sqjxj-shaykh-saalih-aal-al-shaykh-clarifying-statement-of-ibn-taymiyyah-regarding-shafaaah-and-bidah.html">Shaykh Saalih Aal al-Shaykh Clarifying Statement of Ibn Taymiyyah Regarding Requesting the Dead's Supplication and Bid'ah</a><BR>
//www.tawhidfirst.com/monotheism/?sqjxj<BR>

<li><a href="articles/vqroj-between-fakhr-al-din-al-razi-d-606h-and-abdul-aziz-bin-muhammad-bin-saud-d-1218h-on--seeking-shafaaah-from-other-than-allaah.html">Between Fakhr al-Din al-Razi (d. 606H) and Abdul-Aziz bin Muhammad bin Saud (d. 1218H) on  Seeking Shafaa'ah From Other Than Allaah</a><BR>
//www.tawhidfirst.com/monotheism/?vqroj<BR>

<li><a href="articles/pmtvz-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-7.1f.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 7 </a><BR>
//www.tawhidfirst.com/monotheism/?pmtvz<BR>

<li><a href="articles/ebzse-between-fakhr-ud-din-ar-razi-d-606h-ibn-taymiyyah-d-728h-and-ibn-abdul-wahhaab-d-1175h-on-seeking-shafaaah-from-intermediaries---part-6.20.delaye">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 6</a><BR>
//www.tawhidfirst.com/monotheism/?ebzse<BR>

<li><a href="articles/asmag-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-5.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 5</a><BR>
//www.tawhidfirst.com/monotheism/?asmag<BR>

<li><a href="articles/pqwqp-fakhr-ud-din-ar-razi-d-606h-on-seeking-shafaaah-from-intermediaries---part-4.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 4</a><BR>
//www.tawhidfirst.com/monotheism/?pqwqp<BR>

<li><a href="articles/fgnbc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-3.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 3</a><BR>
//www.tawhidfirst.com/monotheism/?fgnbc<BR>

<li><a href="articles/ysquc-fakhr-ud-din-ar-razi-on-seeking-shafaaah-from-intermediaries---part-2.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 2</a><BR>
//www.tawhidfirst.com/monotheism/?ysquc<BR>

<li><a href="articles/qhxzs-fakhr-ud-din-ar-razi-d-606h-on-shafaaah-from-intermediaries---part-1.html">Between Fakhr ud-Din ar-Razi (d. 606H), Ibn Taymiyyah (d. 728H) and Ibn Abdul-Wahhaab (d. 1175H) on Seeking Shafaa'ah From Intermediaries - Part 1</a><BR>
//www.tawhidfirst.com/monotheism/?qhxzs<BR>

<li><a href="articles/ufkjv-shaykh-ul-islam-ibn-taymiyyah-on-intercession-and-the-affirmed-and-rejected-types-of-intermediaries.html">Shaykh ul-Islam Ibn Taymiyyah on Intercession and the Affirmed and Rejected Types of Intermediaries</a><BR>
//www.tawhidfirst.com/monotheism/?ufkjv<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.tawhidfirst.com/monotheism/print.cfm?ebzse by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 13:17:38 GMT -->
</html>


