

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?gcadj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:48 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Shaykh Ibn Uthaymeen: Is the Science of al-Jarh wal-Ta'deel Dead?</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ibn Uthaymeen: Is the Science of al-Jarh wal-Ta'deel Dead?</span><BR>
Thursday, December 16 2010 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
This was published on <a href=http://www.sahab.net/home/index.php?Site=News&amp;Show=928>Sahab.Net</a> and is a nice refutation of those the who are upon the manhaj of the likes of al-Ar'oor, al-Ma'ribee, al-Halabee and others.    <P>
<div class='arabic' dir='rtl' align='right'>&#1601;&#1590;&#1610;&#1604;&#1577; &#1575;&#1604;&#1593;&#1604;&#1575;&#1605;&#1577; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1593;&#1579;&#1610;&#1605;&#1610;&#1606; :  &#1571;&#1606;&#1575; &#1571;&#1582;&#1588;&#1609; &#1571;&#1606; &#1578;&#1603;&#1608;&#1606; &#1607;&#1584;&#1607; &#1603;&#1604;&#1605;&#1577; &#1581;&#1602; &#1571;&#1585;&#1610;&#1583; &#1576;&#1607;&#1575; &#1576;&#1575;&#1591;&#1604; &#1548; &#1575;&#1604;&#1580;&#1585;&#1581; &#1608;&#1575;&#1604;&#1578;&#1593;&#1583;&#1610;&#1604; &#1604;&#1605; &#1610;&#1614;&#1605;&#1615;&#1578; &#1608;&#1604;&#1605; &#1610;&#1583;&#1601;&#1606; &#1608;&#1604;&#1605; &#1610;&#1605;&#1585;&#1590; &#1608;&#1604;&#1604;&#1607; &#1575;&#1604;&#1581;&#1605;&#1583; &#1548; &#1607;&#1608; &#1602;&#1575;&#1574;&#1605; &#1548; &#1575;&#1604;&#1580;&#1585;&#1581; &#1608;&#1575;&#1604;&#1578;&#1593;&#1583;&#1610;&#1604; &#1610;&#1603;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1588;&#1607;&#1608;&#1583; &#1593;&#1606;&#1583; &#1575;&#1604;&#1602;&#1575;&#1590;&#1610; &#1548; &#1610;&#1605;&#1603;&#1606; &#1610;&#1580;&#1585;&#1581;&#1608;&#1606; &#1575;&#1604;&#1582;&#1589;&#1605; &#1608;&#1610;&#1591;&#1604;&#1576; &#1605;&#1606;&#1607;&#1605; &#1575;&#1604;&#1576;&#1610;&#1606;&#1577; &#1548; &#1608;&#1610;&#1603;&#1608;&#1606; - &#1571;&#1610;&#1590;&#1611;&#1575; - &#1601;&#1610; &#1575;&#1604;&#1585;&#1608;&#1575;&#1610;&#1577; &#1548; &#1608;&#1602;&#1583; &#1587;&#1605;&#1593;&#1606;&#1575; &#1602;&#1585;&#1575;&#1569;&#1577; &#1573;&#1605;&#1575;&#1605;&#1606;&#1575; &#1602;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; : ( &#1610;&#1614;&#1575; &#1571;&#1614;&#1610;&#1615;&#1617;&#1607;&#1614;&#1575; &#1575;&#1604;&#1614;&#1617;&#1584;&#1616;&#1610;&#1606;&#1614; &#1570;&#1605;&#1614;&#1606;&#1615;&#1608;&#1575; &#1573;&#1616;&#1606;&#1618; &#1580;&#1614;&#1575;&#1569;&#1614;&#1603;&#1615;&#1605;&#1618; &#1601;&#1614;&#1575;&#1587;&#1616;&#1602;&#1612; &#1576;&#1616;&#1606;&#1614;&#1576;&#1614;&#1573;&#1613; &#1601;&#1614;&#1578;&#1614;&#1576;&#1614;&#1610;&#1614;&#1617;&#1606;&#1615;&#1608;&#1575; ) .    <P>
&#1601;&#1575;&#1604;&#1580;&#1585;&#1581; &#1608;&#1575;&#1604;&#1578;&#1593;&#1583;&#1610;&#1604; &#1604;&#1575; &#1610;&#1586;&#1575;&#1604; &#1576;&#1575;&#1602;&#1610;&#1611;&#1575; &#1605;&#1575; &#1583;&#1575;&#1605; &#1606;&#1608;&#1593; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1576;&#1575;&#1602;&#1610;&#1611;&#1575; &#1548; &#1605;&#1575; &#1583;&#1575;&#1605; &#1606;&#1608;&#1593; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1576;&#1575;&#1602;&#1610;&#1611;&#1575; &#1563; &#1601;&#1575;&#1604;&#1580;&#1585;&#1581; &#1608;&#1575;&#1604;&#1578;&#1593;&#1583;&#1610;&#1604; &#1576;&#1575;&#1602;&#1610;&#1611;&#1575; . &#1604;&#1603;&#1606; &#1571;&#1606;&#1575; &#1571;&#1582;&#1588;&#1609; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1602;&#1575;&#1574;&#1604; : &#1573;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1605;&#1580;&#1585;&#1608;&#1581; &#1608;&#1604;&#1610;&#1587; &#1576;&#1605;&#1580;&#1585;&#1608;&#1581; &#1601;&#1610;&#1578;&#1582;&#1584; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1601;&#1578;&#1608;&#1609; &#1608;&#1587;&#1610;&#1604;&#1577; &#1604;&#1606;&#1588;&#1585; &#1605;&#1593;&#1575;&#1610;&#1576; &#1575;&#1604;&#1582;&#1604;&#1602; .    <P>
&#1608;&#1604;&#1607;&#1584;&#1575; &#1571;&#1602;&#1608;&#1604; : &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1601;&#1610; &#1588;&#1582;&#1589; &#1593;&#1610;&#1576; &#1605;&#1575; &#1548; &#1601;&#1573;&#1606; &#1575;&#1602;&#1578;&#1590;&#1578; &#1575;&#1604;&#1605;&#1589;&#1604;&#1581;&#1577; &#1548; &#1571;&#1608; &#1575;&#1604;&#1581;&#1575;&#1580;&#1577; &#1548; &#1571;&#1608; &#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1573;&#1604;&#1609; &#1576;&#1610;&#1575;&#1606;&#1607; . &#1601;&#1604;&#1575; &#1576;&#1571;&#1587; &#1576;&#1607; &#1548; &#1604;&#1575; &#1576;&#1571;&#1587; &#1605;&#1606; &#1576;&#1610;&#1575;&#1606;&#1607; &#1548; &#1608;&#1604;&#1603;&#1606; &#1575;&#1604;&#1571;&#1581;&#1587;&#1606; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; : &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1601;&#1593;&#1604; &#1603;&#1584;&#1575; &#1548; &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1602;&#1608;&#1604; &#1603;&#1584;&#1575; &#1548; &#1604;&#1587;&#1576;&#1576;&#1610;&#1606; :    <P>
&#1575;&#1604;&#1587;&#1576;&#1576; &#1575;&#1604;&#1571;&#1608;&#1604; : &#1571;&#1606; &#1610;&#1587;&#1604;&#1605; &#1605;&#1606; &#1602;&#1590;&#1610;&#1577; &#1575;&#1604;&#1578;&#1593;&#1610;&#1610;&#1606; .    <P>
&#1608;&#1575;&#1604;&#1587;&#1576;&#1576; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; : &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1618;&#1581;&#1603;&#1605; &#1588;&#1575;&#1605;&#1604;&#1575; &#1604;&#1607; &#1608;&#1604;&#1594;&#1610;&#1585;&#1607; .    <P>
&#1573;&#1604;&#1575; &#1573;&#1584;&#1575; &#1585;&#1571;&#1610;&#1606;&#1575; &#1588;&#1582;&#1589;&#1611;&#1575; &#1605;&#1593;&#1610;&#1606;&#1611;&#1575; &#1602;&#1583; &#1601;&#1615;&#1578;&#1616;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1607; &#1548; &#1608;&#1607;&#1608; &#1610;&#1583;&#1593;&#1608; &#1573;&#1604;&#1609; &#1576;&#1616;&#1583;&#1618;&#1593;&#1577; &#1571;&#1608; &#1573;&#1604;&#1609; &#1590;&#1604;&#1575;&#1604;&#1577; &#1548; &#1601;&#1581;&#1610;&#1606;&#1574;&#1584; &#1604;&#1575; &#1576;&#1583; &#1605;&#1606; &#1575;&#1604;&#1578;&#1593;&#1610;&#1610;&#1606; &#1581;&#1578;&#1609; &#1604;&#1575; &#1610;&#1594;&#1578;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1607;</div>    <P>
Here is the translation:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I fear that this is a statement of truth by which falsehood is intended. <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>Al-Jarh wal-Ta'deel</font></a> has not died and nor has it been buried, and nor has it become ill, and all praise is due to Allaah. It is established, <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>al-Jarh wal-Ta'deel</font></a> occurs with respect to witnesses with the judge, it is possible that they are disparaging a disputant and they are requested for evidence, and it also occurs in reports (riwaayah) and we have heard  the recitation of our imaam [referring to the prayer they must have just prayed in which this verse was recited by the imaam], "<b>O you who believe, when a faasiq comes to you with news, then verify it</b>" (49:6).    <P>
So <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>al-Jarh wal-Ta'deel</font></a> has never ceased to remain, so long as something from humanity remains, so long as something from humanity remains, then <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>al-Jarh wal-Ta'deel</font></a> remains. However, I fear that a person might say, "This person is disparaged" but he is not disparaged, and hence this fatwa is taken as a means to spread the faults of the creation.    <P>
For this reason, I say: When there is a fault in a person, if the best interest, or need,  or necessity requires for it to be explained, then there is no harm in that, there is no harm in it being explained (to the people), however it is better for it to be said, "Some people do such and such, and some people say such and such" for two reasons. The first reason is that avoids the issue of specifying (names) and the second reason is that this ruling incorporates (the person intended) and others (to whom it would also apply).    <P>
Except that when  we see a specific person by which the people have been put to trial, and he is calling to his innovation or to misguidance, then there is no escape from specifying (his person) so that the people are not put to trial by him.  </blockquote>    <P>
From this statement are benefits:    <P>
<ul><li> That <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>al-Jarh wal-Ta'deel</font></a> will remain so long as humanity remains, it is neither abrogated, dead, buried or sick. Rather, it is an established, ongoing affair.    <P>
<li> That where the best interest, need, or necessity requires that a fault in a person be clarified to the people, it is best done without specifying that person, so that the correction achieved by this clarification is of benefit to all others who may also have this same fault.    <P>
<li> Unless, it is a case of person calling to innovation and misguidance, in that case, it is absolutely necessary to specify his name and warn from his innovation or misguidance to protect the people.</ul> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/gcadj-shaykh-ibn-uthaymeen-is-the-science-of-al-jarh-wal-tadeel-dead.html">Shaykh Ibn Uthaymeen: Is the Science of al-Jarh wal-Ta'deel Dead?</a><BR>
https://www.manhaj.com/manhaj/?gcadj<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?gcadj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:48 GMT -->
</html>


