

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?mnekq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:19 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Message of Advice from al-All&#257;mah Rab&#299; bin H&#257;d&#299; to &#703;Abd al-Ra&#7717;m&#257;n al-&#703;Umays&#257;n and a Response to a Doubt Regarding the Bay&#257;n of Maktabah Salafiyyah&#703;</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Message of Advice from al-All&#257;mah Rab&#299; bin H&#257;d&#299; to &#703;Abd al-Ra&#7717;m&#257;n al-&#703;Umays&#257;n and a Response to a Doubt Regarding the Bay&#257;n of Maktabah Salafiyyah&#703;</span><BR>
Wednesday, May 16 2018 - by Admin 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><div class='sidebar'><blockquote>This article contains the recent advice of al-&#703;All&#257;mah Rab&#299; bin H&#257;d&#299; to &#703;Abd al-Ra&#7717;m&#257;n al-&#703;Umays&#257;n who is a leader of confusion in the West in the affair of unjustly labelling Salafis as "&#7778;a&#703;&#257;fiqah" and also a response to a doubt being spread, which is that we never sat with Shaykh Mu&#7717;ammad bin H&#257;d&#299; or the allegation that <u>we requested proof from</u> him but he did not provide it.</blockquote> </div>    <P>
<b>Message of Advice from al-&#703;All&#257;mah Rab&#299; bin H&#257;d&#299; al-Madkhal&#299; to &#703;Abd al-Ra&#7717;m&#257;n al-&#703;Umays&#257;n</b>    <P>
<a href=assets/audio/rabee-advice-umaysan.mp3>Listen to MP3 audio</a>    <P>
<a href=assets/images/rabee-advice-umaysan-01.png><img src=assets/images/rabee-advice-umaysan-01.png width="480" border=0></a>  <a href=assets/images/rabee-advice-umaysan-02.png><img src=assets/images/rabee-advice-umaysan-02.png width="480" border=0></a>    <P>
<b>Response to a Doubt Regarding the Bay&#257;n of Maktabah <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> Regarding Labelling Others as "&#7778;a&#703;&#257;fiqah"</b>    <P>
<a href=assets/images/shk-muhamm-rep-sp-bayaan-01.png><img src=assets/images/shk-muhamm-rep-sp-bayaan-01.png width="480" border=0></a>  <a href=assets/images/shk-muhamm-rep-sp-bayaan-02.png><img src=assets/images/shk-muhamm-rep-sp-bayaan-02.png width="480" border=0></a>    <P>
<b><a href=assets/docs/bayan-clarification.pdf>Download PDF file of our clarification</a></b>    <P>
<blockquote><b>NOTES:</b>    <P>
Our bay&#257;n simply states that some of us sat with Shaykh Mu&#7717;ammad bin H&#257;d&#299;--as we routinely do on our visits during Umrah and Hajj--and that when he invited us [Abu Khad&#299;jah, Ab&#363; &#7716;ak&#299;m, Hasan al-Som&#257;l&#299;, Abdulil&#257;h, Uways and Isaam  al-Maghrabi] to his house last year [on the night of 15 Rajab 1438, 11 April 2017, the day after <a href=https://twitter.com/AbuKhadeejahSP/status/851510533606002689>he gave a lecture for us</a> at our dawrah], he raised the issue himself. He began speaking against the students of knowledge in question, refuting them and disparaging them but did not make apparent evidences which necessitated that they be boycotted and warned against. Hence, our statement in the bay&#257;n.    <P>
<b>Further, this point is meaningless and is a diversion from the fact that Shaykh Rab&#299;&#703; bin H&#257;d&#299; rejected the notion that Shaykh Mu&#7717;ammad can just disparage well-known Salafi students who are recognised for knowledge, possess qualifications and have efforts in da&#703;wah without having to provide evidence. When the alleged evidence was brought to him in a compiled file and he read it all, from beginning to end, letter by letter  (as the Shaykh has himself repeatedly affirmed), he found that there is no evidence in reality and that Shaykh Mu&#7717;ammad has wronged those whom he spoke about. </b>    <P>
So making an issue about our bay&#257;n is just a diversion and is invalid from two angles:     <P>
<ol><li> Our bay&#257;n did not state that Maktabah <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a>, "asked Shaykh Mu&#7717;ammad for proofs but he did not provide them" at all. Rather it stated that "he did not make apparent any evidences which necessitate revilement and warning".    <P>
<li> Regardless, the fact remains that Shaykh Mu&#7717;ammad has no proof for the serious revilement and warning he has made against Salafi shaykhs and students of knowledge. He has called for them to  be boycotted without a shred of proof that necessitates such a severe warning.</ol>    <P>
The reality is that Shaykh Rab&#299;&#703; received evidences from Shaykh Mu&#7717;ammad but there was nothing in them to warrant his stance. If that is the case, then of what benefit is it to allege that Maktabah <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> claimed in their bay&#257;n that "<b>they requested him for evidences but he did not provide them</b>", when:    <P>
<ol><li> There is no such statement in our bay&#257;n at all, and     <P>
<li> Someone <u>much greater than us</u>, Shaykh Rab&#299;&#703;, received evidences from Shaykh Mu&#7717;ammad which he dismissed and rejected because they amounted to nothing in reality.    <P>
<li> Shaykh Rab&#299;&#703; has repeatedly asked for valid evidences to be provided by the Musa&#703;fiqah, yet they have failed to do so and not brought anything that justifies their attacks upon other Salafis, students of knowledge and shaykhs.  </ol>    <P>
As for us, we simply sat with Shaykh Mu&#7717;ammad during our visits and in the course of such sittings when he raised the topic with us of his own accord, he did not bring such evidences that necessitate the nature and severity of the disparagement that he has entered into. And that is exactly what we stated.    <P>
Finally, where is the proof for calling for a boycott against Salafi students of knowledge, claiming that they are bankrupt (empty-pocketed) in knowledge (when that is patently false), and treating them as if they are people of desires and innovations? This is what Shaykh Rab&#299;&#703; has demanded, the proof for these severe judgements. So either the proof is brought, in which case the major scholars like Shaykh Rab&#299;&#703; will be the first to follow it, and we likewise will follow it, or it is upon the one in error to recant and repent from his error as Shaykh Rab&#299;&#703; has stated. This is where the situation stands as it is and irrelevant technicalities such as this one regarding our bay&#257;n is not going to change the situation one bit.    <P>
In conclusion,  the respected reader should understand that it was Shaykh Mu&#7717;ammad Ibn H&#257;d&#299; who invited us to his home and it was he who disparaged the students of knowledge in our presence and it was he who, since that time, has not provided the Salafis and their Scholars with valid proof to justify his severe disparagement and warning. For this reason, it has been rejected by other scholars and Shaykh Rab&#299;&#703; has requested him to recant from this unjustified <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a>.     <P>
Maktabah Salafiyyah  29th Sha&#703;ban 1439H  </blockquote> <P> 

</div>
<br>





</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?mnekq by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:19 GMT -->
</html>


