

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?wwqny by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Takfir and the Excuse of Ignorance: Shaykh Muhammad bin Abd al-Wahhaab</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Takfir and the Excuse of Ignorance: Shaykh Muhammad bin Abd al-Wahhaab</span><BR>
Wednesday, November 30 2011 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>In this series of articles we present the statements of the Scholars of Ahl al-Sunnah which clarify and explain the issue of (<span class='arb' dir='rtl'>&#1575;&#1604;&#1593;&#1584;&#1585; &#1576;&#1575;&#1604;&#1580;&#1607;&#1604;</span>), the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a>, and also (<span class='arb' dir='rtl'>&#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605; &#1605;&#1606; &#1575;&#1604;&#1583;&#1610;&#1606; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577;</span>), that which is known from the religion by necessity. There is much confusion and speculation about this issue, despite the fact that it is very clear in the speech of the Scholars. One should also be aware of factions of the <b>Takfiris, Qutbis</b> who allege that the Scholars of Ahl al-Sunnah such as Imaam Ibn Baz, Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a>, Imaam al-Albaani, Shaykh Abd al-Muhsin al-Abbaad and many other contemporary Scholars are "revisionists," a charge levelled because these Scholars did not agree to their methodologies and positions (of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of nations and societies or <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of certain rulers). Hence, they extended this claim of revisionism beyond the issue of the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the rulers into other issues (such as the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> and that which is known from the religion by necessity) in order to discredit these Scholars and make the people not take from them and instead to drive the people towards the Harakiyyeen and their figureheads. These Qutbis and Takfiris are ignorant people, they are pretenders to knowledge, and they employ much deception. Instead of being honest and saying that difference in this issue can be found right through the history of the da'wah of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> in Najd, and varying sayings can be found amongst the Scholars of the da'wah, they opted for their usual trait of deception and lies and tried to attack those Scholars who spoke against their Qutbi da'wah by accusing them of being "revisionists" merely because they held the view of granting the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> in matters of kufr and shirk within certain circumstances. Addressing their falsehood and their conniving in detail is for another place. Here we want to systematically document the sayings of the scholars for the purposes of building a record and at a later time, we will inshaa'Allaah, discuss some of these issues with the purpose of clarification.</blockquote></div> <P> 


<p><font class='titleHeadline'>Shaykh Muhammad bin Abd al-Wahhaab on the <a href="tags/excuse-of-ignorance.html" class="tagLink"><font class="tagLink">excuse of ignorance</font></a></font>    <P>
  Shaykh Ibn Abd al-Wahhaab (rahimahullaah) said in (<span class='arb' dir='rtl'>&#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;</span>), a collection of his works and writings, in his letter to Muhammad bin 'Eed (7/25):    <P>
<div class='arabic' dir='rtl' align='right'>&#1608;&#1571;&#1605;&#1575; &#1605;&#1575; &#1584;&#1603;&#1585; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569; &#1593;&#1606;&#1610;: &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1617;&#1585; &#1576;&#1575;&#1604;&#1592;&#1606;&#1548; &#1608;&#1576;&#1575;&#1604;&#1605;&#1608;&#1575;&#1604;&#1575;&#1577;&#1548; &#1571;&#1608; &#1571;&#1603;&#1601;&#1617;&#1585; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1575;&#1604;&#1584;&#1610; &#1604;&#1605; &#1578;&#1602;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1601;&#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;&#1548; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1576;&#1607; &#1578;&#1606;&#1601;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;.   </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for what the enemies have mentioned about me: That I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> on the basis of presumption, and on the basis of loyalty, or that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the ignorant person upon whom the proof has not been established, then this is a mighty slander. They desire to make the people flee from the deen of Allaah and His Messenger by it.</blockquote>    <P>
And Shaykh Ibn Abd al-Wahhaab also said (7/60):    <P>
<div class='arabic' dir='rtl' align='right'>&#1608;&#1603;&#1584;&#1604;&#1603; &#1578;&#1605;&#1608;&#1610;&#1607;&#1607; &#1593;&#1604;&#1609; &#1575;&#1604;&#1591;&#1594;&#1575;&#1605; &#1576;&#1571;&#1606; &#1575;&#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1610;&#1602;&#1608;&#1604;: &#1575;&#1604;&#1584;&#1610; &#1605;&#1575; &#1610;&#1583;&#1582;&#1604; &#1578;&#1581;&#1578; &#1591;&#1575;&#1593;&#1578;&#1610; &#1603;&#1575;&#1601;&#1585;&#1548; &#1608;&#1606;&#1602;&#1608;&#1604;: &#1587;&#1576;&#1581;&#1575;&#1606;&#1603; &#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;! &#1576;&#1604; &#1606;&#1588;&#1607;&#1583; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1610;&#1593;&#1604;&#1605;&#1607; &#1605;&#1606; &#1602;&#1604;&#1608;&#1576;&#1606;&#1575;&#1548; &#1576;&#1571;&#1606; &#1605;&#1606; &#1593;&#1605;&#1604; &#1576;&#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583;&#1548; &#1608;&#1578;&#1576;&#1585;&#1571; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1571;&#1607;&#1604;&#1607;&#1548; &#1601;&#1607;&#1608; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1601;&#1610; &#1571;&#1610; &#1586;&#1605;&#1575;&#1606; &#1608;&#1571;&#1610; &#1605;&#1603;&#1575;&#1606;. &#1608;&#1573;&#1606;&#1605;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1614;&#1606; &#1571;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1573;&#1604;&#1607;&#1610;&#1578;&#1607;&#1548; &#1576;&#1593;&#1583; &#1605;&#1575; &#1606;&#1576;&#1610;&#1606; &#1604;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1593;&#1604;&#1609; &#1576;&#1591;&#1604;&#1575;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603;. </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And likewise, his distortion upon the common people that Ibn Abd al-Wahhaab says, "Whoever does not come under my obedience is a disbeliever." And we say: Sublime are you (O Lord), this is a mighty slander! Rather, we call Allaah to witness over what he knows from our hearts that whoever acts upon <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and frees himself from Shirk and its people, then he is a Muslim in whatever time and place (he maybe in). But we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who associates partners with Allaah in His Ilaayhiyyah (sole right of worship), after we have made clear to him the proof for the futility of Shirk.</blockquote>    <P>
And Shaykh Ibn Abd al-Wahhaab said (in the section, <i>Fataawaa wa Masaa'il</i>, 4/11):    <P>
<div class='arabic' dir='rtl' align='right'>&#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1603;&#1584;&#1576; &#1608;&#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606;&#1548; &#1601;&#1605;&#1579;&#1604; &#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1575; &#1606;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1608;&#1606;&#1608;&#1580;&#1576; &#1575;&#1604;&#1607;&#1580;&#1585;&#1577; &#1573;&#1604;&#1610;&#1606;&#1575; &#1593;&#1604;&#1609; &#1605;&#1606; &#1602;&#1583;&#1585; &#1593;&#1604;&#1609; &#1573;&#1592;&#1607;&#1575;&#1585; &#1583;&#1610;&#1606;&#1607;&#1548; &#1608;&#1571;&#1606;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1603;&#1601;&#1617;&#1585; &#1608;&#1605;&#1606; &#1604;&#1605; &#1610;&#1602;&#1575;&#1578;&#1604;&#1548; &#1608;&#1605;&#1579;&#1604; &#1607;&#1584;&#1575; &#1608;&#1571;&#1590;&#1593;&#1575;&#1601; &#1571;&#1590;&#1593;&#1575;&#1601;&#1607;. &#1601;&#1603;&#1604; &#1607;&#1584;&#1575; &#1605;&#1606; &#1575;&#1604;&#1603;&#1584;&#1576; &#1608;&#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1589;&#1583;&#1608;&#1606; &#1576;&#1607; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;. &#1608;&#1573;&#1584;&#1575; &#1603;&#1606;&#1575; &#1604;&#1575; &#1606;&#1603;&#1601;&#1617;&#1585; &#1605;&#1614;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1602;&#1576;&#1585; &#1593;&#1576;&#1583; &#1575;&#1604;&#1602;&#1575;&#1583;&#1585;&#1548; &#1608;&#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1602;&#1576;&#1585; &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1576;&#1583;&#1608;&#1610;&#1548; &#1608;&#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1605;&#1575;&#1548; &#1604;&#1571;&#1580;&#1604; &#1580;&#1607;&#1604;&#1607;&#1605; &#1608;&#1593;&#1583;&#1605; &#1605;&#1606; &#1610;&#1606;&#1576;&#1607;&#1607;&#1605;&#1548; &#1601;&#1603;&#1610;&#1601; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1607;&#1575;&#1580;&#1585; &#1573;&#1604;&#1610;&#1606;&#1575;&#1548; &#1608;&#1604;&#1605; &#1610;&#1603;&#1601;&#1617;&#1585; &#1608;&#1610;&#1602;&#1575;&#1578;&#1604;&#1567; &#1587;&#1615;&#1576;&#1618;&#1581;&#1614;&#1575;&#1606;&#1614;&#1603;&#1614; &#1607;&#1614;&#1584;&#1614;&#1575; &#1576;&#1615;&#1607;&#1618;&#1578;&#1614;&#1575;&#1606;&#1612; &#1593;&#1614;&#1592;&#1616;&#1610;&#1605;&#1612;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And as for the lie and slander, then it is like their saying that we make generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> (of the masses), and that we make emigration (hijrah) obligatory towards us for the one who is able to manifest his religion, and that we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and who does not fight, and multiple times the likes of this (type of lying and slander). All of this  is from lying and slander by which they hinder the people from the deen of Allaah and His Messenger. And when it is the case that we do not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who worships the idol (i.e. tomb) which is on the grave of Abd al-Qadir, and the idol which is on the grave of Ahmad al-Badawi and their likes, due to their ignorance, and the absence of the one to notify them (of their opposition), then how could we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of  the one who does not associate partners with Allaah, when he does not emigrate to us and who does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and does not fight? "<b>Glory be to you (O Lord), this is a mighty slander</b>." (24:16)</blockquote>    <P>
And in al-Durar al-Saniyyah (10/131), there occurs the statement of Shaykh Ibn Abd al-Wahhaab in one of his letters;    <P>
<div class='arabic' dir='rtl' align='right'>&#1605;&#1575; &#1584;&#1603;&#1585; &#1604;&#1603;&#1605; &#1593;&#1606;&#1610; &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1601;&#1607;&#1584;&#1575; &#1605;&#1606; &#1576;&#1607;&#1578;&#1575;&#1606; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1605;&#1606; &#1578;&#1576;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1608;&#1607;&#1608; &#1587;&#1575;&#1603;&#1606; &#1601;&#1610; &#1576;&#1604;&#1583;&#1607; &#1571;&#1606;&#1607; &#1605;&#1575; &#1610;&#1603;&#1601;&#1610;&#1607; &#1581;&#1578;&#1609; &#1610;&#1580;&#1610;&#1569; &#1593;&#1606;&#1583;&#1610;&#1548; &#1601;&#1607;&#1584;&#1575; &#1571;&#1610;&#1590;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606;&#1548; &#1573;&#1606;&#1605;&#1575; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1575;&#1578;&#1576;&#1575;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1601;&#1610; &#1571;&#1610; &#1571;&#1585;&#1590; &#1603;&#1575;&#1606;&#1578;. &#1608;&#1604;&#1603;&#1606; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1571;&#1602;&#1585; &#1576;&#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1579;&#1605; &#1593;&#1575;&#1583;&#1575;&#1607; &#1608;&#1589;&#1583; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606;&#1607; &#1608;&#1603;&#1584;&#1604;&#1603; &#1605;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1576;&#1593;&#1583;&#1605;&#1575; &#1593;&#1585;&#1601; &#1571;&#1606;&#1607; &#1583;&#1610;&#1606; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1608;&#1586;&#1610;&#1606;&#1607; &#1604;&#1604;&#1606;&#1575;&#1587; &#1601;&#1607;&#1584;&#1575; &#1575;&#1604;&#1584;&#1610; &#1571;&#1603;&#1601;&#1585;&#1607; &#1608;&#1603;&#1604; &#1593;&#1575;&#1604;&#1605; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607; &#1575;&#1604;&#1571;&#1585;&#1590; &#1610;&#1603;&#1601;&#1585; &#1607;&#1572;&#1604;&#1575;&#1569; &#1573;&#1604;&#1575; &#1585;&#1580;&#1604;&#1575; &#1605;&#1593;&#1575;&#1606;&#1583;&#1575; &#1571;&#1608; &#1580;&#1575;&#1607;&#1604;&#1575;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>What has been mentioned to you that I  make generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> (of the masses), this is from the slanders of the enemies. Likewise, their saying that I say whoever follows the deen of Allaah and His Messenger whilst resident in his own land, this is not sufficient until he comes (emigrates) to me. This is also from slandder. Rather, the intent is for [a person] to follow the deen of Allaah and His Messenger in whichever land it may be. However, we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who affirmed the deen of Allaah and His Messenger, then showed enmity towards it and prevented the people from (following) it. Likewise the one whow worships idols (awthaan) after he came to know that it is the deen of the pagans, and who then beautified it to the people. This is the one that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of, and every scholar on the facce of the earth makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of (the likes of) these, except a stubborn opposer or an ignoramus.</blockquote>    <P>
<font class='titleHeadline'>Notes</font>    <P>
<blockquote>Refer to <a href=index81cd.html?xwouo>the article</a> from <a href='tags/shaykh-ibn-uthaymeen.html' class='tagLink'><font class='tagLink'>Shaykh Ibn Uthaymeen</font></a> (rahimahullaah) for some further clarification. Shaykh al-Islam Muhammad bin Abd al-Wahhaab does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of those who fall into shirk except after the establishment of the proof, and the proof is established upon a person's mere realization that he is acting in opposition to the deen of the Messengers. He is not required to understand or fathom anything more or deeper than this. From here, he will <b><u>a)</u></b> ignore and not pursue the matter to remove himself from the ignorance and shubhah (doubt) that should have been generated by this realization (and this would be kufr of <i>i'raad</i>, turning away), or <b><u>b)</u></b> he may show opposition (juhood, inaad) or <b><u>c)</u></b> he may educate himself and abandon what he was upon, since he is seeking to follow the deen of Islaam and this was his intent all along, but he was simply misguided and the reality of the deen of the Messengers had not reached him or been explained to him.    <P>
Whatever the case, the person's actions were no doubt shirk and disbelief, but the actual ruling upon him that he is a disbeliever, is only  made after establishment of the proof.    <P>
In all the above, one should also keep in mind that what counts as "<i>known from the religion by necessity</i>" (and therefore "<i>establishment of the proof</i>") fluctuates and varies according to time, place and person and is not a fixed, static thing. It is not to be said absolutely "<i>an ignorant person is excused</i>" and nor is it to be said absolutely "<i>an ignorant person is not excused</i>" but there is tafseel (detail to the matter). This topic will be taken up in other articles inshaa'Allaah.    <P>
  </blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/xyjjc-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5---on-those-who-worship-the-righteous.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5) - On Those Who Worship the Righteous Upon Ignorance</a><BR>
https://www.manhaj.com/manhaj/?xyjjc<BR>

<li><a href="articles/zmhyr-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen-2.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen (2)</a><BR>
https://www.manhaj.com/manhaj/?zmhyr<BR>

<li><a href="articles/uufmf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5)</a><BR>
https://www.manhaj.com/manhaj/?uufmf<BR>

<li><a href="articles/wvnjp-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-aziz-bin-baz.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Aziz Bin Baz</a><BR>
https://www.manhaj.com/manhaj/?wvnjp<BR>

<li><a href="articles/illhh-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-4---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (4) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?illhh<BR>

<li><a href="articles/gzrsz-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-3---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (3) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?gzrsz<BR>

<li><a href="articles/dkhtd-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-2.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (2) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?dkhtd<BR>

<li><a href="articles/obkwf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (1)</a><BR>
https://www.manhaj.com/manhaj/?obkwf<BR>

<li><a href="articles/uncnb-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-muhsin-al-abbaad.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?uncnb<BR>

<li><a href="articles/ecksy-takfir-and-the-excuse-of-ignorance-shaykh-rabee-bin-haadee.html">Takfir and the Excuse of Ignorance: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?ecksy<BR>

<li><a href="articles/wwqny-takfir-and-the-excuse-of-ignorance-shaykh-muhammad-bin-abd-al-wahhaab.html">Takfir and the Excuse of Ignorance: Shaykh Muhammad bin Abd al-Wahhaab</a><BR>
https://www.manhaj.com/manhaj/?wwqny<BR>

<li><a href="articles/xwouo-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?xwouo<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?wwqny by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


