

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?hzsbd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | The Permanent Committee on Differentiating Between Aqidah and Manhaj</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">The Permanent Committee on Differentiating Between Aqidah and Manhaj</span><BR>
Thursday, July 01 2010 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>The <a href='tags/permanent-committee.html' class='tagLink'><font class='tagLink'>Permanent Committee</font></a> For Research and Verdicts was asked the following question pertaining to aqidah (creed) and manhaj (methodology) in fatwa no. 18870:    <P>
<div class='arabic' dir='rtl' align='right'>&#1603;&#1579;&#1585; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1610;&#1575;&#1605; &#1593;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1575;&#1604;&#1605;&#1606;&#1607;&#1580;&#1548; &#1581;&#1578;&#1609; &#1576;&#1583;&#1571; &#1575;&#1604;&#1606;&#1575;&#1587; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: &#1601;&#1604;&#1575;&#1606; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1593;&#1602;&#1610;&#1583;&#1577; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1571;&#1608; ( &#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577; )&#1548; &#1608;&#1604;&#1603;&#1606; &#1604;&#1610;&#1587; &#1605;&#1606;&#1607;&#1580;&#1607; &#1605;&#1606;&#1607;&#1580; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1601;&#1605;&#1579;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606; &#1593;&#1606; &#1576;&#1593;&#1590; &#1605;&#1606; &#1610;&#1606;&#1578;&#1587;&#1576;&#1608;&#1606; &#1573;&#1604;&#1609; &#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1578;&#1576;&#1604;&#1610;&#1594; &#1571;&#1608; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1571;&#1608; &#1593;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; &#1607;&#1584;&#1575; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605;. &#1601;&#1607;&#1604; &#1607;&#1606;&#1575;&#1603; &#1590;&#1575;&#1576;&#1591; &#1606;&#1593;&#1585;&#1601; &#1576;&#1607; &#1605;&#1606;&#1607;&#1580; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1571;&#1608; &#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1577;&#1567; &#1608;&#1607;&#1604; &#1610;&#1589;&#1581; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1601;&#1585;&#1610;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1575;&#1604;&#1605;&#1606;&#1607;&#1580;&#1567;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There has been much speech these days about the difference between aqidah (creed) and manhaj (methodology), until the people have begun to say, "So and so's aqidah is the aqidah of Ahl us-Sunnah wal-Jamaa'ah" or of <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a>, however his manhaj is not the manhaj of Ahl us-Sunnah wal-Jamaa'ah. So for example, they say this speech about some of those ascribing to Jamaa'at ut-Tableegh, or al-Ikhwan al-Muslimeen, or some of the other <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a>. So is there any principle by which can know the manhaj of Ahl us-Sunnah wal-Jamaa'ah or <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a>. And is this separation between aqidah and manhaj correct?</blockquote>    <P>
To which they replied:    <P>
<div class='arabic' dir='rtl' align='right'>&#1593;&#1602;&#1610;&#1583;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1608;&#1605;&#1606;&#1607;&#1580;&#1607; &#1588;&#1610;&#1569; &#1608;&#1575;&#1581;&#1583;&#1548; &#1608;&#1607;&#1608; &#1605;&#1575; &#1610;&#1593;&#1578;&#1602;&#1583;&#1607; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1601;&#1610; &#1602;&#1604;&#1576;&#1607; &#1608;&#1610;&#1606;&#1591;&#1602; &#1576;&#1607; &#1576;&#1604;&#1587;&#1575;&#1606;&#1607; &#1608;&#1610;&#1593;&#1605;&#1604; &#1576;&#1607; &#1576;&#1580;&#1608;&#1575;&#1585;&#1581;&#1607; &#1605;&#1606; &#1608;&#1581;&#1583;&#1575;&#1606;&#1610;&#1577; &#1575;&#1604;&#1604;&#1607; - &#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609;- &#1601;&#1610; &#1575;&#1604;&#1585;&#1576;&#1608;&#1576;&#1610;&#1577; &#1608;&#1575;&#1604;&#1573;&#1604;&#1607;&#1610;&#1577; &#1608;&#1575;&#1604;&#1571;&#1587;&#1605;&#1575;&#1569; &#1608;&#1575;&#1604;&#1589;&#1601;&#1575;&#1578;&#1548; &#1608;&#1573;&#1601;&#1585;&#1575;&#1583;&#1607; &#1576;&#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1608;&#1575;&#1604;&#1578;&#1605;&#1587;&#1603; &#1576;&#1588;&#1585;&#1610;&#1593;&#1578;&#1607; &#1601;&#1610; &#1575;&#1604;&#1602;&#1608;&#1604; &#1608;&#1575;&#1604;&#1593;&#1605;&#1604; &#1608;&#1575;&#1604;&#1575;&#1593;&#1578;&#1602;&#1575;&#1583; &#1593;&#1604;&#1609; &#1605;&#1575; &#1580;&#1575;&#1569; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1604;&#1607; &#1608;&#1587;&#1606;&#1577; &#1585;&#1587;&#1608;&#1604;&#1607; - &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;-&#1548; &#1608;&#1587;&#1575;&#1585; &#1593;&#1604;&#1610;&#1607; &#1587;&#1604;&#1601; &#1575;&#1604;&#1571;&#1605;&#1577; &#1608;&#1571;&#1574;&#1605;&#1578;&#1607;&#1575;&#1548; &#1608;&#1576;&#1584;&#1604;&#1603; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1604;&#1575; &#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1575;&#1604;&#1605;&#1606;&#1607;&#1580;&#1548; &#1576;&#1604; &#1607;&#1605;&#1575; &#1588;&#1610;&#1569; &#1608;&#1575;&#1581;&#1583; &#1610;&#1580;&#1576; &#1571;&#1606; &#1610;&#1604;&#1578;&#1586;&#1605;&#1607; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1608;&#1610;&#1587;&#1578;&#1602;&#1610;&#1605; &#1593;&#1604;&#1610;&#1607;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The aqidah of a Muslim and his manhaj are a single thing, and it is:    <P>
<blockquote>Whatever a person believes in his heart, and speak with by his tongue, and acts upon with his limbs (in relation to) the wahdaaniyyah (uniqueness) of Allaah, the Sublime and Exalted, in Ruboobiyyah (lordship over the universe), an Ilaahiyyah (right to be worshipped alone), and al-Asmaa was-Sifaat (names and attributes), and singling Him out in worship, and holding fast to His Sharee'ah in speech, action and belief, upon what has come in the Book of Allaah and the Sunnah of His Messenger (sallallaahu alayhi wasallam) - and what the Salaf of this Ummah and its (leading) Imaams traversed upon.</blockquote>    <P>
And with that it is known that there is no difference between aqidah and manhaj, rather they are both a single thing, it is obligatory that a Muslim adhere to it, and remain steadfast upon it.</blockquote>    <P>
<b>Source:</b> Fataawaa <a href='tags/al-lajnah-ad-daaimah.html' class='tagLink'><font class='tagLink'>al-Lajnah ad-Daa'imah</font></a> (2/40-41).   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/otddj-shaykh-ubayd-al-jaabiree-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Ubayd al-Jaabiree on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?otddj<BR>

<li><a href="articles/vnbnh-shaykh-saalih-al-fawzaan-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Saalih al-Fawzaan on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?vnbnh<BR>

<li><a href="articles/xyzse-shaykh-ibn-uthaymeen-errors-in-manhaj-occur-due-to-underlying-errors-in-aqidah.html">Shaykh Ibn Uthaymeen: Errors in Manhaj Occur Due to Underlying Errors in Aqidah</a><BR>
https://www.manhaj.com/manhaj/?xyzse<BR>

<li><a href="articles/hzsbd-the-permanent-committee-on-differentiating-between-aqidah-and-manhaj.html">The Permanent Committee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?hzsbd<BR>

<li><a href="articles/lvzvm-shaykh-al-albaanee-on-differentiating-between-aqidah-and-manhaj.html">Shaykh al-Albaanee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?lvzvm<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?hzsbd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


