

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?pdziw by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</span><BR>
Monday, September 30 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>Following the role of Ahl al-Sunnah in the West of conveying the speech of the Scholars regarding certain figureheads who went astray, the followers of many of these figureheads spread doubts about some of the callers in the West, with respect to teaching and giving da'wah, claiming that a person must have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> to teach, or he  must have graduated from an institution and so on. <b>However, the reality of the matter is that those whom they target in this way actually have  connections with the Scholars, they travel to them, and take knowledge from them in aqidah, manhaj and fiqh, even if they have not formally studied in an institution, or graduated or have a specific tazkiyah</b>. The real reason for these doubts is to undermine what the callers do in the West (in addition to calling to the Sunnah) of warning from doubts, innovations and desires and warning from the people who are upon them or promote them. The articles in these series will shed light on this matter and repel the doubts spread. No one article in this series should be read in isolation as it is possible for <u>a person with ulterior motives</u> to utilize some of these fatwas from the scholars to justify isolation and separation away from the main body of Salafis in that land and from their centres and mosques with the claim that everybody has the green light to teach, and so some of them teach in the mosques and centres of the hizbees and others teach in their homes (often secretly) whilst spreading poison that aims to isolate people from the students of knowledge. Rather, all the statements of all the Shaykhs <b>should be put together and understood collectively</b> to get a clearer picture of this whole affair. This is because there are generalizations in some fatwas, clarifications in others, important minor details in others, and contexts in some fatwas not found in others. All of this should be put together to get a full, comprehensive picture. <u>Alongside the clarifications in these articles</u>, it should be still be stressed that seeking knowledge from the Scholars, by travelling to them and sitting in their lessons is of utmost importance and should not be neglected as it is <u>the primary route</u> of seeking knowledge. And for those who are unable to do this, <b>then they should take from the students of knowledge in their lands, those who have connections with the Scholars, have studied with them and take from them.</b> So they should attend their lessons, in the Salafi mosques and centres, and any issues that arise such as requiring a fatwa, or removal of a <i>shubhah</i> or clarification in an issue of knowledge, then those students of knowledge can return these questions to the Scholars on behalf of the people of that land if the answer is not already known.     <P>
Here are links to all articles so far for easy reference:     <P>
<b>Shaykh Abd al-Muhsin al-Abbaad</b> (<a href=index67d0.html?fpjyl>see here</a>)  <b>Shaykh Zayd al-Madkhali</b> (<a href=index292c.html?xkdrv>see here</a>)  <b>Shaykh Muhammad bin Haadee</b> (<a href=index7c01.html?rqltx>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5b8a.html?pdziw>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index4f73.html?xkjsh>see here</a>)   <b>Shaykh Ubayd al-Jaabiree</b> (<a href=index3c84.html?laknb>see here</a>)   <b>Shaykh Abdullah al-Ghudayan</b> (<a href=indexbaf0.html?cajxz>see here</a>)  <b>Shaykh Rabee bin Haadee</b> (<a href=indexa1a5.html?iknhb>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5ea5.html?ccblo>see here</a>)  <b>Shaykh Ahmad Bazmul</b> (<a href=indexd377.html?ibtpx>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index3ed6.html?aninc>see here</a>).    <P>
.    <P>
<!---The bottom line is that knowledge can be sought from books and cassettes where it is not possible to take it directly from the scholars, though this is a longer and more burdensome route than taking it from the scholars directly. And it is not a condition that a person  must have a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar prior to teaching or giving da'wah. However, a person must know his limit and capability and not transgress it and not speak about matters he does not know and he must also seek to understand thoroughly that which he conveys so that where explanation is required he is able to explain that knowledge, and further, he must only resort to books of trusted, deeply-rooted scholars. <b>In all cases, the seeking of knowledge from the scholars directly is the quickest,  easiest route as it allows discussion and for clarifications to be made</b>. Whether a person is fit to convey and teach is known by two ways, either a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar or by it being it well known by the people of his land that he has knowledge, understanding and ability. //--->  </blockquote></div> <P> 


<p>The following are a series of questions and answers found in <i>Kitab al-Ilm</i> of Shaykh Muhammad bin Salih al-Uthaymeen (rahimahullaah). They have a connection to the topic of this series and so they have been included here, and the issue here is that of acquisition of knowledge in a scenario where it is not possible to take it directly from the scholars, so the issue of their books and cassettes is raised and whether it is possible to acquire knowledge and be a student of knowledge through this route.    <P>
Question:    <P>
<div class='arabic' dir='rtl' align='right'>&#1576;&#1593;&#1590; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1610;&#1603;&#1578;&#1601;&#1608;&#1606; &#1576;&#1587;&#1605;&#1575;&#1593; &#1571;&#1588;&#1585;&#1591;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1583;&#1585;&#1608;&#1587;&#1607;&#1605; &#1601;&#1607;&#1604; &#1578;&#1603;&#1601;&#1610; &#1601;&#1610; &#1578;&#1604;&#1602;&#1610; &#1575;&#1604;&#1593;&#1604;&#1605;&#1567; &#1608;&#1607;&#1604; &#1610;&#1593;&#1578;&#1576;&#1585;&#1608;&#1606; &#1591;&#1604;&#1575;&#1576; &#1593;&#1604;&#1605;&#1567; &#1608;&#1607;&#1604; &#1610;&#1572;&#1579;&#1585; &#1601;&#1610; &#1605;&#1593;&#1578;&#1602;&#1583;&#1607;&#1605;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Some seekers of knowledge suffice with listenting to the cassettes of the Scholars in the course of their studies (lessons), so is this sufficient for acquiring knowledge? And are they considered students of knowledge? And does this have an effect upon their belief?</blockquote>    <P>
The Shaykh answered this question:    <P>
<div class='arabic' dir='rtl' align='right'>&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1588;&#1585;&#1591;&#1577; &#1578;&#1603;&#1601;&#1610;&#1607;&#1605; &#1593;&#1606; &#1575;&#1604;&#1581;&#1590;&#1608;&#1585; &#1573;&#1604;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1604;&#1575; &#1610;&#1605;&#1603;&#1606;&#1607;&#1605; &#1575;&#1604;&#1581;&#1590;&#1608;&#1585;&#1548; &#1608;&#1573;&#1604;&#1575; &#1601;&#1573;&#1606; &#1575;&#1604;&#1581;&#1590;&#1608;&#1585; &#1573;&#1604;&#1609; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1601;&#1590;&#1604; &#1608;&#1571;&#1581;&#1587;&#1606; &#1608;&#1571;&#1602;&#1585;&#1576; &#1604;&#1604;&#1601;&#1607;&#1605; &#1608;&#1575;&#1604;&#1605;&#1606;&#1575;&#1602;&#1588;&#1577;&#1548; &#1604;&#1603;&#1606; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1605;&#1603;&#1606;&#1607;&#1605; &#1575;&#1604;&#1581;&#1590;&#1608;&#1585; &#1601;&#1607;&#1584;&#1575; &#1610;&#1603;&#1601;&#1610;&#1607;&#1605;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There is no doubt that these cassettes will suffice them from being present (directly) with the people of knowledge when it is not possible for them to attend. Otherwise, attending with the Scholars is superior, better and is closer to (gaining) understanding and (being able to) discuss (matters). However, when they are not able to attend, then this suffices them.</blockquote>    <P>
Question:    <P>
<div class='arabic' dir='rtl' align='right'>&#1579;&#1605; &#1607;&#1604; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606;&#1608;&#1575; &#1591;&#1604;&#1576;&#1577; &#1593;&#1604;&#1605; &#1608;&#1607;&#1605; &#1610;&#1602;&#1578;&#1589;&#1585;&#1608;&#1606; &#1593;&#1604;&#1609; &#1607;&#1584;&#1575; &#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Then is it possible for them to be students of knowledge whilst they limit themselves to this (medium of study)?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'>&#1606;&#1602;&#1608;&#1604;: &#1606;&#1593;&#1605; &#1610;&#1605;&#1603;&#1606; &#1573;&#1584;&#1575; &#1575;&#1580;&#1578;&#1607;&#1583; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1575;&#1580;&#1578;&#1607;&#1575;&#1583;&#1611;&#1575; &#1603;&#1579;&#1610;&#1585;&#1611;&#1575; &#1603;&#1605;&#1575; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1593;&#1575;&#1604;&#1605;&#1611;&#1575; &#1573;&#1584;&#1575; &#1571;&#1582;&#1584; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1603;&#1578;&#1576;&#1548; &#1604;&#1603;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1571;&#1582;&#1584; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1603;&#1578;&#1576; &#1608;&#1575;&#1604;&#1571;&#1588;&#1585;&#1591;&#1577; &#1608;&#1576;&#1610;&#1606; &#1575;&#1604;&#1578;&#1604;&#1602;&#1610; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1576;&#1575;&#1588;&#1585;&#1577;&#1548; &#1571;&#1606; &#1575;&#1604;&#1578;&#1604;&#1602;&#1610; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1576;&#1575;&#1588;&#1585;&#1577; &#1571;&#1602;&#1585;&#1576; &#1573;&#1604;&#1609; &#1581;&#1589;&#1608;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1563; &#1604;&#1571;&#1606;&#1607; &#1591;&#1585;&#1610;&#1602; &#1587;&#1607;&#1604; &#1578;&#1605;&#1603;&#1606; &#1601;&#1610;&#1607; &#1575;&#1604;&#1605;&#1606;&#1575;&#1602;&#1588;&#1577; &#1576;&#1582;&#1604;&#1575;&#1601; &#1575;&#1604;&#1605;&#1587;&#1578;&#1605;&#1593; &#1571;&#1608; &#1575;&#1604;&#1602;&#1575;&#1585;&#1574; &#1601;&#1573;&#1606;&#1607; &#1610;&#1581;&#1578;&#1575;&#1580; &#1573;&#1604;&#1609; &#1593;&#1606;&#1575;&#1569; &#1603;&#1576;&#1610;&#1585; &#1601;&#1610; &#1580;&#1605;&#1593; &#1571;&#1591;&#1585;&#1575;&#1601; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1610;&#1607;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>We say: Yes, it is possible when a person strives with a great deal of striving, just as it is possible for a person to be a scholar when he takes knowledge from books. However, the difference between taking knowledge from books and cassettes and between taking directly from the scholars (in person) is that seeking knowledge directly from the scholars is closer to acquisition of knowledge because it is an easier route wherein discussion is possible, as opposed to the one who listens or reads (from the scholars), for he requires (to go through) a great deal of hardship in bringing together the various aspects of knowledge and acquiring it.</blockquote>    <P>
Question:    <P>
<div class='arabic' dir='rtl' align='right'>&#1608;&#1571;&#1605;&#1575; &#1602;&#1608;&#1604; &#1575;&#1604;&#1587;&#1575;&#1574;&#1604;: &#1607;&#1604; &#1610;&#1572;&#1579;&#1585; &#1575;&#1604;&#1575;&#1603;&#1578;&#1601;&#1575;&#1569; &#1576;&#1575;&#1604;&#1571;&#1588;&#1585;&#1591;&#1577; &#1601;&#1610; &#1605;&#1593;&#1578;&#1602;&#1583;&#1607;&#1605;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And what about the saying of the questioner, does sufficing with cassettes affect their belief?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'>&#1601;&#1575;&#1604;&#1580;&#1608;&#1575;&#1576;: &#1606;&#1593;&#1605; &#1610;&#1572;&#1579;&#1585; &#1601;&#1610; &#1605;&#1593;&#1578;&#1602;&#1583;&#1607;&#1605; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1587;&#1578;&#1605;&#1593;&#1608;&#1606; &#1573;&#1604;&#1609; &#1571;&#1588;&#1585;&#1591;&#1577; &#1576;&#1583;&#1593;&#1610;&#1577; &#1608;&#1610;&#1578;&#1576;&#1593;&#1608;&#1606;&#1607;&#1575;&#1548; &#1571;&#1605;&#1575; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1587;&#1578;&#1605;&#1593;&#1608;&#1606; &#1573;&#1604;&#1609; &#1571;&#1588;&#1585;&#1591;&#1577; &#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1608;&#1579;&#1608;&#1602; &#1576;&#1607;&#1605;&#1548; &#1601;&#1604;&#1575; &#1610;&#1572;&#1579;&#1585; &#1593;&#1604;&#1609; &#1605;&#1593;&#1578;&#1602;&#1583;&#1575;&#1578;&#1607;&#1605;&#1548; &#1576;&#1604; &#1610;&#1586;&#1610;&#1583;&#1607;&#1605; &#1573;&#1610;&#1605;&#1575;&#1606;&#1611;&#1575; &#1608;&#1585;&#1587;&#1608;&#1582;&#1611;&#1575; &#1608;&#1575;&#1578;&#1576;&#1575;&#1593;&#1611;&#1575; &#1604;&#1604;&#1605;&#1593;&#1578;&#1602;&#1583; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;. </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Then the answer is: Yes, it does affect their belief if they listen to cassettes of innovation and follow them. As for when they listen to cassettes of trusted scholars, then that does not affect their belief. Rather, it increases them in eemaan, in being firmly-grounded and in following the correct creed.</blockquote>    <P>
Question:     <P>
<div class='arabic' dir='rtl' align='right'>&#1607;&#1604; &#1610;&#1580;&#1608;&#1586; &#1578;&#1593;&#1604;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1603;&#1578;&#1576; &#1601;&#1602;&#1591; &#1583;&#1608;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1582;&#1575;&#1589;&#1577; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1610;&#1589;&#1593;&#1576; &#1578;&#1593;&#1604;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1604;&#1606;&#1583;&#1585;&#1578;&#1607;&#1605;&#1567; &#1608;&#1605;&#1575; &#1585;&#1571;&#1610;&#1603; &#1601;&#1610; &#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1602;&#1575;&#1574;&#1604;:&#1605;&#1606; &#1603;&#1575;&#1606; &#1588;&#1610;&#1582;&#1607; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1603;&#1575;&#1606; &#1582;&#1591;&#1572;&#1607; &#1571;&#1603;&#1579;&#1585; &#1573;&#1604;&#1609; &#1575;&#1604;&#1589;&#1608;&#1575;&#1576;&#1567; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Is it permissible to learn knowledge from books only without scholars, especially when it is difficult to learn knowledge from scholars due to them being scarce? And what is your view regarding the saying of a person, "<i>Whoever's shaykh is the book, his error(s) will be more than what he is correct in</i>"? </blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'>&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1610;&#1581;&#1589;&#1604; &#1576;&#1591;&#1604;&#1576;&#1607; &#1593;&#1606;&#1583; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1576;&#1591;&#1604;&#1576;&#1607; &#1601;&#1610; &#1575;&#1604;&#1603;&#1578;&#1576;&#1563; &#1604;&#1571;&#1606; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1607;&#1608; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1606;&#1601;&#1587;&#1607;&#1548; &#1601;&#1607;&#1608; &#1610;&#1581;&#1583;&#1579;&#1603; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1603;&#1578;&#1575;&#1576;&#1607;&#1548; &#1601;&#1573;&#1584;&#1575; &#1578;&#1593;&#1584;&#1585; &#1575;&#1604;&#1591;&#1604;&#1576; &#1593;&#1604;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1601;&#1573;&#1606;&#1607; &#1610;&#1591;&#1604;&#1576; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1603;&#1578;&#1576;&#1548; &#1608;&#1604;&#1603;&#1606; &#1578;&#1581;&#1589;&#1610;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1593;&#1606; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1602;&#1585;&#1576; &#1605;&#1606; &#1578;&#1581;&#1589;&#1610;&#1604;&#1607; &#1593;&#1606; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1603;&#1578;&#1576;&#1563; &#1604;&#1571;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1589;&#1604; &#1593;&#1606; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1603;&#1578;&#1576; &#1610;&#1578;&#1593;&#1576; &#1571;&#1603;&#1579;&#1585; &#1608;&#1610;&#1581;&#1578;&#1575;&#1580; &#1573;&#1604;&#1609; &#1580;&#1607;&#1583; &#1603;&#1576;&#1610;&#1585; &#1580;&#1583;&#1611;&#1617;&#1575;&#1548; &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; &#1601;&#1573;&#1606;&#1607; &#1602;&#1583; &#1578;&#1582;&#1601;&#1609; &#1593;&#1604;&#1610;&#1607; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1603;&#1605;&#1575; &#1601;&#1610; &#1575;&#1604;&#1602;&#1608;&#1575;&#1593;&#1583; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1602;&#1593;&#1614;&#1617;&#1583;&#1607;&#1575; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1590;&#1608;&#1575;&#1576;&#1591;&#1548; &#1601;&#1604;&#1575; &#1576;&#1583; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1604;&#1607; &#1605;&#1585;&#1580;&#1593; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1602;&#1583;&#1585; &#1575;&#1604;&#1573;&#1605;&#1603;&#1575;&#1606;.  &#1608;&#1571;&#1605;&#1575; &#1602;&#1608;&#1604;&#1607;: "&#1605;&#1606; &#1603;&#1575;&#1606; &#1583;&#1604;&#1610;&#1604;&#1607; &#1603;&#1578;&#1575;&#1576;&#1607; &#1601;&#1582;&#1591;&#1572;&#1607; &#1571;&#1603;&#1579;&#1585; &#1605;&#1606; &#1589;&#1608;&#1575;&#1576;&#1607;"&#1548; &#1601;&#1607;&#1584;&#1575; &#1604;&#1610;&#1587; &#1589;&#1581;&#1610;&#1581;&#1611;&#1575; &#1593;&#1604;&#1609; &#1573;&#1591;&#1604;&#1575;&#1602;&#1607; &#1608;&#1604;&#1575; &#1601;&#1575;&#1587;&#1583;&#1611;&#1575; &#1593;&#1604;&#1609; &#1573;&#1591;&#1604;&#1575;&#1602;&#1607;&#1548; &#1571;&#1605;&#1575; &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1571;&#1582;&#1584; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1610;&#1617; &#1603;&#1578;&#1575;&#1576; &#1610;&#1585;&#1575;&#1607; &#1601;&#1604;&#1575; &#1588;&#1603; &#1571;&#1606;&#1607; &#1610;&#1582;&#1591;&#1574; &#1603;&#1579;&#1610;&#1585;&#1611;&#1575;&#1548; &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610; &#1610;&#1593;&#1578;&#1605;&#1583; &#1601;&#1610; &#1578;&#1593;&#1604;&#1615;&#1617;&#1605;&#1607; &#1593;&#1604;&#1609; &#1603;&#1578;&#1576; &#1585;&#1580;&#1575;&#1604; &#1605;&#1593;&#1585;&#1608;&#1601;&#1610;&#1606; &#1576;&#1575;&#1604;&#1579;&#1602;&#1577; &#1608;&#1575;&#1604;&#1571;&#1605;&#1575;&#1606;&#1577; &#1608;&#1575;&#1604;&#1593;&#1604;&#1605; &#1601;&#1573;&#1606; &#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1603;&#1579;&#1585; &#1582;&#1591;&#1572;&#1607; &#1576;&#1604; &#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1605;&#1589;&#1610;&#1576;&#1611;&#1575; &#1601;&#1610; &#1571;&#1603;&#1579;&#1585; &#1605;&#1575; &#1610;&#1602;&#1608;&#1604;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There is no doubt that knowledge is acquired through seeking it from the Scholars and seeking it from books because the book of the scholar is the scholar himself, for he is speaking to you through his book. So when seeking (knowledge) is not possible from the people of knowledge, then he seeks knowledge from  books. However, acquiring knowledge through the route of the scholars is closer to its acquisition than through the route of books because the one who seeks it through books will toil (struggle) more and requires a great deal of striving. And alongside this some affairs might be hidden from him such as Sharee'ah principles and rules that the people of knowledge have laid down. So it is necessary that he has a reference point from the people of knowledge (to return back to) in accordance with ability. As for his saying, "<i>Whosoever's guide is his book then his error(s) will be more than what he is correct in</i>" then this is not correct unrestrictedly and nor corrupt unrestrictedly. As for the person who takes knowledge from any book he sees, then no doubt he will err abundantly. And as for the one who in his learning depends upon the books of men known for trustworthiness, reliability and knowledge then this person's errors will not be many and he will be correct in the majority of what he says.</blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/wpvti-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-12.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?wpvti<BR>

<li><a href="articles/aninc-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-10.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 10: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?aninc<BR>

<li><a href="articles/iknhb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-8.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?iknhb<BR>

<li><a href="articles/cajxz-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-7.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</a><BR>
https://www.manhaj.com/manhaj/?cajxz<BR>

<li><a href="articles/laknb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-6.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 6: Shaykh Ubayd al-Jaabiree</a><BR>
https://www.manhaj.com/manhaj/?laknb<BR>

<li><a href="articles/pdziw-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-5.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?pdziw<BR>

<li><a href="articles/xkdrv-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-4.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 4: Shaykh Zayd al-Madkhali</a><BR>
https://www.manhaj.com/manhaj/?xkdrv<BR>

<li><a href="articles/rqltx-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-3.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 3: Shaykh Muhammad bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?rqltx<BR>

<li><a href="articles/xkjsh-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-2.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 2: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?xkjsh<BR>

<li><a href="articles/fpjyl-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-1.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 1: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?fpjyl<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?pdziw by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


