

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?taggg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:18 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Yahyaa al-Hajuri Establishes Himself a Liar By Trying to Cover Up His Accusation that the Companions Participated in the Murder of Uthmaan</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Yahyaa al-Hajuri Establishes Himself a Liar By Trying to Cover Up His Accusation that the Companions Participated in the Murder of Uthmaan</span><BR>
Monday, March 18 2013 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>In <a href=indexac4b.html?cftvz>a previous article</a> we looked at something explicitly written by Yahyaa al-Hajuri in his book (<span class='arb' dir='rtl'>&#1571;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1580;&#1605;&#1593;&#1577; &#1608;&#1576;&#1583;&#1593;&#1607;&#1575;</span>), "The Rulings of al-Jumu'ah and Its Innovations" where he accuses the Companions of "<i>participating in the murder of Uthmaan</i>." This was in <u>the first edition</u> of his book. Later, al-Hajuri tried to cover this up with what amounts to a clear lie. We will look at this in this article.</div>    <P>
Here is the audio of al-Hajuri trying to explain the issue. Recall that al-Hajuri explicitly stated in his book the following,  "<b>And the participation of some of the Sahaabah in the killing of Uthmaan (radiallaahu anhu)...</b>" and in what follows look at how he blatantly tries to say that this means other than what it actually does mean!    <P>
<object type="application/x-shockwave-flash" data="mp3player.swf" width="200" height="20"><param name="movie" value="mp3player.swf" /><param name="bgcolor" value="#ffffff" /><param name="FlashVars" value="mp3=http://www.manhaj.com/manhaj/assets/audio/hajuri-cover-up-sahabah-uthman.mp3&amp;showvolume=1&amp;loadingcolor=ff75ff" /></object>    <P>
 In this audio al-Hajuri, following the way of <a href='tags/abu-al-hasan-al-maribee.html' class='tagLink'><font class='tagLink'>Abu al-Hasan al-Ma'ribee</font></a>, when he tried to wriggle out of his slander of the Companions, starts to tell his story, saying:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I say: This saying that I say that the Companions participated in the killing of Uthmaan, this occurred becase Ibn Katheer and a group of the people of knowledge mentioned that Muhammad bin Abi Bakr al-Siddeeq (radiallaahu anhu), and specifically this one only, then they mentioned this, and we investigated the issue and found that within (the matter) are (reports) whose chains are not established and we said, it was in the context of the investigation, <b>not that we actually affirm that they participated in the killing of Uthmaan</b>, however in the context of the research, in accordance with what was mentioned by Ibn Katheer in al-Bidaayah wal-Nihaayah and Ibn Sa'd in al-Tabaqaat, then when Shaykh al-Islaam indicated that the chains of narration are not established, we did not say this except upon the (basis of) the apparentness of statements. <b>As for it being said that we speak with this, then never, refuge is from Allaah, the Companions did not participate in the killing of Uthmaan, rather the Khawaarij killed him</b>.</blockquote>    <P>
As you will see from further below, al-Hajuri has blatantly lied without any shame, it is as clear as daylight that he has lied. Al-Hajuri's attempts to cover this matter up has been followed up by some of the people of knowledge and students of knowledge, here we will summarize the essential points from what has been written in exposing al-Hajuri the Mubtadi' and Muhdith:    <P>
<blockquote><b><u>ONE:</u></b> As for al-Hajuri's claim regarding Ibn Katheer, then Ibn Katheer states about Muhammad bin Abi Bakr's birth and age:    <P>
Ibn Katheer said (al-Bidaayah 7/353):    <P>
<span class='arb' dir='rtl'>&#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1575;&#1604;&#1589;&#1583;&#1610;&#1602; &#1608;&#1604;&#1583; &#1601;&#1610; &#1581;&#1610;&#1575;&#1577; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1601;&#1610; &#1581;&#1580;&#1577; &#1575;&#1604;&#1608;&#1583;&#1575;&#1593; &#1578;&#1581;&#1578; &#1575;&#1604;&#1588;&#1580;&#1585;&#1577; &#1593;&#1606;&#1583; &#1575;&#1604;&#1581;&#1585;&#1605; &#1608;&#1571;&#1605;&#1607; &#1571;&#1587;&#1605;&#1575;&#1569; &#1576;&#1606;&#1578; &#1593;&#1605;&#1610;&#1587;&#1548; &#1608;&#1604;&#1605;&#1575; &#1575;&#1581;&#1578;&#1590;&#1585; &#1575;&#1604;&#1589;&#1583;&#1610;&#1602; &#1571;&#1608;&#1589;&#1609; &#1571;&#1606; &#1578;&#1594;&#1587;&#1604;&#1607; &#1601;&#1594;&#1587;&#1604;&#1578;&#1607;&#1548; &#1579;&#1605; &#1604;&#1605;&#1575; &#1575;&#1606;&#1602;&#1590;&#1578; &#1593;&#1583;&#1578;&#1607;&#1575; &#1578;&#1586;&#1608;&#1580;&#1607;&#1575; &#1593;&#1604;&#1610; &#1601;&#1606;&#1588;&#1571; &#1601;&#1610; &#1581;&#1580;&#1585;&#1607;&#1548; &#1601;&#1604;&#1605;&#1575; &#1589;&#1575;&#1585;&#1578; &#1573;&#1604;&#1610;&#1607; &#1575;&#1604;&#1582;&#1604;&#1575;&#1601;&#1577; &#1575;&#1587;&#1578;&#1606;&#1575;&#1576;&#1607; &#1593;&#1604;&#1609; &#1576;&#1604;&#1575;&#1583; &#1605;&#1589;&#1585; &#1576;&#1593;&#1583; &#1602;&#1610;&#1587; &#1576;&#1606; &#1587;&#1593;&#1583; &#1576;&#1606; &#1593;&#1576;&#1575;&#1583;&#1577; &#1603;&#1605;&#1575; &#1602;&#1583;&#1605;&#1606;&#1575;&#1548; &#1601;&#1604;&#1605;&#1575; &#1603;&#1575;&#1606;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1587;&#1606;&#1577; &#1576;&#1593;&#1579; &#1605;&#1593;&#1575;&#1608;&#1610;&#1577; &#1593;&#1605;&#1585;&#1608; &#1576;&#1606; &#1575;&#1604;&#1593;&#1575;&#1589; &#1601;&#1575;&#1587;&#1578;&#1604;&#1576; &#1605;&#1606;&#1607; &#1576;&#1604;&#1575;&#1583; &#1605;&#1589;&#1585; &#1608;&#1602;&#1578;&#1604; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1603;&#1605;&#1575; &#1578;&#1602;&#1583;&#1605;&#1548; &#1608;&#1604;&#1607; &#1605;&#1606; &#1575;&#1604;&#1593;&#1605;&#1585; &#1583;&#1608;&#1606; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1610;&#1606;&#1548; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1590;&#1610; &#1593;&#1606;&#1607;</span>    <P>
And in al-Baa'ith al-Hatheeth (p. 187), Ibn Katheer said:    <P>
<span class='arb' dir='rtl'>&#1608;&#1604;&#1602;&#1583; &#1593;&#1583;&#1617;&#1608;&#1575; &#1601;&#1610;&#1607;&#1605; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1575;&#1604;&#1589;&#1583;&#1610;&#1602; &#1608;&#1573;&#1606;&#1605;&#1575; &#1608;&#1615;&#1604;&#1616;&#1583; &#1593;&#1606;&#1583; &#1575;&#1604;&#1588;&#1580;&#1585;&#1577; &#1608;&#1602;&#1578; &#1575;&#1604;&#1573;&#1581;&#1585;&#1575;&#1605; &#1576;&#1581;&#1580;&#1577; &#1575;&#1604;&#1608;&#1583;&#1575;&#1593; &#1601;&#1604;&#1605; &#1610;&#1583;&#1585;&#1603; &#1605;&#1606; &#1581;&#1610;&#1575;&#1578;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1573;&#1604;&#1575; &#1606;&#1581;&#1608;&#1575;&#1611; &#1605;&#1606; &#1605;&#1575;&#1574;&#1577; &#1610;&#1608;&#1605; &#1608;&#1604;&#1605; &#1610;&#1584;&#1603;&#1585;&#1608;&#1575; &#1571;&#1606;&#1607; &#1571;&#1615;&#1581;&#1618;&#1590;&#1616;&#1585; &#1593;&#1606;&#1583; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1604;&#1575; &#1585;&#1570;&#1607;</span>    <P>
In the above two passages, Ibn Katheer establishes that Muhammad bin Abi Bakr was born during the farewell pilgrimage and that he was present for a hundred days prior to the passing away of the Messenger (sallallaahu alayhi wasallam) and that it is not mentioned by (the historians, muhadditheen) that he was brought before or actually met the Prophet (sallallaahu alayhi wasallam).      <P>
<b><u>TWO:</u></b> The second issue is that Ibn Katheer himself after mentioning what some of the historians mentioned that Muhammad bin Abi Bakr participated in the killing of Uthmaan (radiallaahu anhu) he actually exonerates Muhammad bin Abi Bakr from this claim. He said in al-Bidaayah (7/185):    <P>
<span class='arb' dir='rtl'>&#1608;&#1610;&#1615;&#1585;&#1608;&#1609; &#1571;&#1606; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1591;&#1593;&#1606;&#1607; &#1576;&#1605;&#1588;&#1575;&#1602;&#1589; &#1601;&#1610; &#1571;&#1584;&#1606;&#1607; &#1581;&#1578;&#1609; &#1583;&#1582;&#1604;&#1578; &#1601;&#1610; &#1581;&#1604;&#1602;&#1607; &#1608;&#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1571;&#1606; &#1575;&#1604;&#1584;&#1610; &#1601;&#1593;&#1604; &#1584;&#1604;&#1603; &#1594;&#1610;&#1585;&#1607; &#1608;&#1571;&#1606;&#1607; &#1575;&#1587;&#1578;&#1581;&#1609; &#1608;&#1585;&#1580;&#1593; &#1581;&#1610;&#1606; &#1602;&#1575;&#1604; &#1604;&#1607; &#1593;&#1579;&#1605;&#1575;&#1606; &#1604;&#1602;&#1583; &#1571;&#1582;&#1584;&#1578; &#1576;&#1604;&#1581;&#1610;&#1577; &#1603;&#1575;&#1606; &#1571;&#1576;&#1608;&#1603; &#1610;&#1603;&#1585;&#1605;&#1607;&#1575; &#1601;&#1578;&#1584;&#1605;&#1605; &#1605;&#1606; &#1584;&#1575;&#1603; &#1608;&#1594;&#1591;&#1609; &#1608;&#1580;&#1607;&#1607; &#1608;&#1585;&#1580;&#1593; &#1608;&#1581;&#1575;&#1580;&#1586; &#1583;&#1608;&#1606;&#1607; &#1601;&#1604;&#1605; &#1610;&#1601;&#1583; &#1608;&#1603;&#1575;&#1606; &#1571;&#1605;&#1585; &#1575;&#1604;&#1604;&#1607; &#1602;&#1583;&#1585;&#1575;&#1611; &#1605;&#1602;&#1583;&#1608;&#1585;&#1575;</span>    <P>
In the above passage, Ibn Katheer says, that     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is reported that Muhammad bin Abi Bakr stabbed him with a spear in his ear which penetrated his throat. And what is correct is that the one who did this was other than him (Muhammad) and that he became embarassed and returned when Uthmaan said to him, "You have taken hold of a beard which your father used to honour," so he would blame himself regarding that...</blockquote>    <P>
And in fact a page earlier (7/184), Ibn Katheer said:    <P>
<span class='arb' dir='rtl'>&#1602;&#1575;&#1604; &#1587;&#1610;&#1601; &#1576;&#1606; &#1593;&#1605;&#1585; &#1575;&#1604;&#1578;&#1605;&#1610;&#1605;&#1610; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;: &#1593;&#1606; &#1575;&#1604;&#1593;&#1610;&#1589; &#1576;&#1606; &#1575;&#1604;&#1602;&#1575;&#1587;&#1605;&#1548; &#1593;&#1606; &#1585;&#1580;&#1604;&#1548; &#1593;&#1606; &#1582;&#1606;&#1587;&#1575;&#1569; &#1605;&#1608;&#1604;&#1575;&#1577; &#1571;&#1587;&#1575;&#1605;&#1577; &#1576;&#1606; &#1586;&#1610;&#1583; - &#1608;&#1603;&#1575;&#1606;&#1578; &#1578;&#1603;&#1608;&#1606; &#1605;&#1593; &#1606;&#1575;&#1574;&#1604;&#1577; &#1576;&#1606;&#1578; &#1575;&#1604;&#1601;&#1585;&#1575;&#1601;&#1589;&#1577; &#1575;&#1605;&#1585;&#1571;&#1577; &#1593;&#1579;&#1605;&#1575;&#1606; -: &#1571;&#1606;&#1607;&#1575; &#1603;&#1575;&#1606;&#1578; &#1601;&#1610; &#1575;&#1604;&#1583;&#1575;&#1585;&#1548; &#1608;&#1583;&#1582;&#1604; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1571;&#1576;&#1610; &#1576;&#1603;&#1585; &#1608;&#1571;&#1582;&#1584; &#1576;&#1604;&#1581;&#1610;&#1578;&#1607; &#1608;&#1571;&#1607;&#1608;&#1609; &#1576;&#1605;&#1588;&#1575;&#1602;&#1589; &#1605;&#1593;&#1607; &#1601;&#1610;&#1580;&#1571; &#1576;&#1607;&#1575; &#1601;&#1610; &#1581;&#1604;&#1602;&#1607; .&#1601;&#1602;&#1575;&#1604;: &#1605;&#1607;&#1604;&#1575; &#1610;&#1575; &#1575;&#1576;&#1606; &#1571;&#1582;&#1610;&#1548; &#1601;&#1608;&#1575;&#1604;&#1604;&#1607; &#1604;&#1602;&#1583; &#1571;&#1582;&#1584;&#1578; &#1605;&#1571;&#1582;&#1584;&#1575; &#1605;&#1575; &#1603;&#1575;&#1606; &#1571;&#1576;&#1608;&#1603; &#1604;&#1610;&#1571;&#1582;&#1584; &#1576;&#1607;&#1548; &#1601;&#1578;&#1585;&#1603;&#1607; &#1608;&#1575;&#1606;&#1589;&#1585;&#1601; &#1605;&#1587;&#1578;&#1581;&#1610;&#1610;&#1575; &#1606;&#1575;&#1583;&#1605;&#1575;&#1548; &#1601;&#1575;&#1587;&#1578;&#1602;&#1576;&#1604;&#1607; &#1575;&#1604;&#1602;&#1608;&#1605; &#1593;&#1604;&#1609; &#1576;&#1575;&#1576; &#1575;&#1604;&#1589;&#1601;&#1577; &#1601;&#1585;&#1583;&#1607;&#1605; &#1591;&#1608;&#1610;&#1604;&#1575; &#1581;&#1578;&#1609; &#1594;&#1604;&#1576;&#1608;&#1607; &#1601;&#1583;&#1582;&#1604;&#1608;&#1575;&#1548; &#1608;&#1582;&#1585;&#1580; &#1605;&#1581;&#1605;&#1583; &#1585;&#1575;&#1580;&#1593;&#1575;.</span>    <P>
In which there occurs:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Sayf bin Umar al-Tameemi (rahimahullaah) said: From al-Ayd bin al-Qasim, from a man, from Khansaa', the mawlaah of Usamah bin Zayd - and she was with Naa'ilah bin al-Qaraafisah, the wife of Uthmaan: That she was in the house and Muhammad bin Abi Bakr entered and took hold of his beard and brought a spear that was with him to his (Uthmaan's) throat, so he (Uthmaan) said, "O son of my brother, by Allaah, you have taken a position that you father would not have taken" so he (Muhammad) left him and turned away ashamed and remorseful. Then some people came to him at the doorway so he repelled them for a long while until they overcame him and entered, and Muhammad left (the house) returning back...</blockquote>    <P>
This establishes that al-Hajuri, after slandering the name of the Companions (with his false accusation), then went on fabricate a lie against Ibn Katheer (rahimahullaah) claiming that he affirmed this matter when Ibn Katheer said nothing of the sort. It is clear that al-Hajuri affirms false and baseless things, then when he is caught out, he ascribes them spuriously to others as a means of escape from criticism. This is an example of a devious, treacherous individual.    <P>
<b><u>THREE:</u></b> The context in which al-Hajuri made his claim  "<b>... the participation of some of the Sahaabah in the killing of Uthmaan (radiallaahu anhu)...</b>", this was mentioned by al-Hajuri as one in a around twenty mistakes that al-Hajuri says the Companions fell into and through which he was establishing that they are not infallible from error, and he was using this to set the stage to allow his accusation against Uthmaan (radiallaahu anhu) that he made a bid'ah into the deen of Islaam through sanctioning the second aadhaan for Jumu'ah. After mentioning all of these twenty or so examples, al-Hajuri said:    <P>
<img src=assets/images/hajuri-sahabah-uthmaan-306.png width=450 border=1 border=0>    <P>
<span class='arb' dir='rtl'>&#1608;&#1603;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1583;&#1604;&#1577; &#1575;&#1604;&#1578;&#1610; &#1571;&#1588;&#1585;&#1606;&#1575; &#1573;&#1604;&#1610;&#1607;&#1575; &#1604;&#1605; &#1606;&#1584;&#1603;&#1585; &#1605;&#1606;&#1607;&#1575; &#1588;&#1610;&#1574;&#1575; &#1594;&#1610;&#1585; &#1589;&#1581;&#1610;&#1581; , &#1608;&#1607;&#1610; &#1602;&#1604;&#1610;&#1604; &#1605;&#1606; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1581;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1581;&#1589;&#1604;&#1578; &#1604;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1585;&#1590;&#1608;&#1575;&#1606; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607;&#1605; , &#1608;&#1607;&#1610; &#1576;&#1585;&#1607;&#1575;&#1606; &#1580;&#1604;&#1610; &#1571;&#1606; &#1571;&#1601;&#1585;&#1575;&#1583;&#1607;&#1605; &#1594;&#1610;&#1585; &#1605;&#1593;&#1589;&#1608;&#1605;&#1610;&#1606; &#1593;&#1606; &#1603;&#1576;&#1575;&#1585; &#1575;&#1604;&#1582;&#1591;&#1575;&#1610;&#1575; &#1608;&#1589;&#1594;&#1575;&#1585;&#1607;&#1575; , &#1587;&#1608;&#1575;&#1569; &#1601;&#1610; &#1584;&#1604;&#1603; &#1593;&#1579;&#1605;&#1575;&#1606; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607;</span>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And all of these evidences which we have pointed to, <b>we have not mentioned anything except that which is saheeh (authentic)</b>, and these are just <u>some of many situations which occurred from the Companions</u> (may the pleasure of Allaah be with them), and they are a clear evidence that as individuals they are not infallible from making grave mistakes or minor ones, whether that is regarding Uthmaan (radiallaahu anhu) or other than him.</blockquote>    <P>
This clearly falsifies the claim of al-Hajuri above that he only mentioned the "apparentness" (whatever that means) "of statements" and not that he actually believes in this. This is a clear falsification and an attempt to conceal his mistake and throw it instead onto Ibn Katheer (rahimahullaah), free is Ibn Katheer from the slander of al-Hajuri. This quote also shows that al-Hajuri believed firmly that the Companions participated in the murder of Uthmaan, and that he is a calculated liar who does not feel ashamed of accusing great Scholars like Ibn Katheer of originating the foolish things that arise from himself, from Allaah is the refuge!    <P>
Now, there is more to this issue than the above and inshaa'Allaah we may take it up in another installment of this series.    <P>
</blockquote>    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/cqctr-yahya-al-hajuri-affirms-the-aqidah-of-the-jahmiyyah-and-ashariyyah.html">Yahya al-Hajuri And the Aqidah of the Jahmiyyah and Ash'ariyyah Regarding Negation of Wisdom From Allaah's Actions - Part 3</a><BR>
https://www.manhaj.com/manhaj/?cqctr<BR>

<li><a href="articles/lhoee-yahya-al-hajuri-affirms-the-aqidah-of-the-jahmiyyah-and-ashariyyah.html">Yahya al-Hajuri And the Aqidah of the Jahmiyyah and Ash'ariyyah Regarding Negation of Wisdom From Allaah's Actions - Part 2</a><BR>
https://www.manhaj.com/manhaj/?lhoee<BR>

<li><a href="articles/qvchb-yahya-al-hajuri-affirms-the-aqidah-of-the-jahmiyyah-and-ashariyyah.html">Yahya al-Hajuri And the Aqidah of the Jahmiyyah and Ash'ariyyah Regarding Negation of Wisdom From Allaah's Actions - Part 1</a><BR>
https://www.manhaj.com/manhaj/?qvchb<BR>

<li><a href="articles/ipybg-the-ghuluww-towards-yahyaa-al-haddaadi-part-11.html">Yahyaa al-Hajuri al-Haddaadi and Followers Firing Arrows Whilst Sinking in the Quicksand: The Issue of Istighaathah Revisited</a><BR>
https://www.manhaj.com/manhaj/?ipybg<BR>

<li><a href="articles/qtatm-shaykh-alee-al-hudhayfee-the-usool-of-salafiyyah-opposed-by-yahya-al-hajuri-and-his-followers---part-2.html">Shaykh Alee al-Hudhayfee: The Usool of Salafiyyah Opposed by Yahya al-Hajuri and His Followers - Part 2: Al-Hajuri's Oppression and Transgression Will Fall Back Upon Him</a><BR>
https://www.manhaj.com/manhaj/?qtatm<BR>

<li><a href="articles/dzifv-yahya-al-haddadi-refuted-by-his-students-shaykh-alee-al-hudhayfee.html">Shaykh Alee al-Hudhayfee: The Usool of Salafiyyah Opposed by Yahya al-Hajuri and His Followers - Part 1: Al-Hajuri is Akhbath (Most Vile) of Diseased Souls in His Manhaj</a><BR>
https://www.manhaj.com/manhaj/?dzifv<BR>

<li><a href="articles/mxnee-the-crimes-of-yahya-al-haddadi-in-matters-of-knowledge-and-belief-part-1.html">The Crimes of Yahya al-Haddadi in Matters of Knowledge and Belief: Clipping Citation of Ibn Rajab al-Hanbali Regarding Adhaan for Jumu'ah</a><BR>
https://www.manhaj.com/manhaj/?mxnee<BR>

<li><a href="articles/zzpwe-the-ghuluww-towards-yahyaa-al-haddaadi-part-10---yahya-al-hajuris-shining-brilliance-outweighs-that-of-the-sun-and-moon.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 10 - Yahya al-Hajuri's Shining Brilliance Outweighs that of the Sun and Moon</a><BR>
https://www.manhaj.com/manhaj/?zzpwe<BR>

<li><a href="articles/imbec-the-ghuluww-towards-yahyaa-al-haddaadi-part-9---yahya-al-hajuri-the-musk-of-paradise.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 9 - The Hajaawirah  of London and His 'Highness' Yahya al-Hajuri Exemplifying the Musk of Paradise</a><BR>
https://www.manhaj.com/manhaj/?imbec<BR>

<li><a href="articles/duqsj-the-ghuluww-towards-yahyaa-al-haddaadi-part-8---put-the-sun-and-moon-in-the-hands-of-al-hajuri.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 8 - Put the Sun and Moon in the Hands of al-Hajuri</a><BR>
https://www.manhaj.com/manhaj/?duqsj<BR>

<li><a href="articles/jtltv-shaykh-ahmad-bazmul-on-important-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah---part-6.html">Shaykh Ahmad Bazmul on Yahya al-Hajuri, His Transgressions and His Followers (the Hajaawirah Haddaadiyyah)</a><BR>
https://www.manhaj.com/manhaj/?jtltv<BR>

<li><a href="articles/wtvjf-shaykh-ahmad-bazmul-on-important-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah---part-5.html">Shaykh Ahmad Bazmul on Important Foundations of the Book and Sunnah (Which Oppose and Refute the Mumayyi'ah and Haddaadiyyah) - Part 5</a><BR>
https://www.manhaj.com/manhaj/?wtvjf<BR>

<li><a href="articles/kfauu-shaykh-ahmad-bazmul-on-important-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah---part-4.html">Shaykh Ahmad Bazmul on Important Foundations of the Book and Sunnah (Which Oppose and Refute the Mumayyi'ah and Haddaadiyyah) - Part 4</a><BR>
https://www.manhaj.com/manhaj/?kfauu<BR>

<li><a href="articles/aksda-shaykh-ahmad-bazmul-on-important-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah---part-3.html">Shaykh Ahmad Bazmul on Important Foundations of the Book and Sunnah (Which Oppose and Refute the Mumayyi'ah and Haddaadiyyah) - Part 3</a><BR>
https://www.manhaj.com/manhaj/?aksda<BR>

<li><a href="articles/uqrbd-shaykh-ahmad-bazmul-on-important-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah---part-2.html">Shaykh Ahmad Bazmul on Important Foundations of the Book and Sunnah (Which Oppose and Refute the Mumayyi'ah and Haddaadiyyah) - Part 2</a><BR>
https://www.manhaj.com/manhaj/?uqrbd<BR>

<li><a href="articles/eylta-foundations-of-the-book-and-sunnah-which-oppose-and-refute-the-mumayyiah-and-haddaadiyyah.html">Shaykh Ahmad Bazmul on Important Foundations of the Book and Sunnah (Which Oppose and Refute the Mumayyi'ah and Haddaadiyyah) - Part 1</a><BR>
https://www.manhaj.com/manhaj/?eylta<BR>

<li><a href="articles/mhygy-the-ghuluww-towards-yahyaa-al-haddaadi-part-7---desert-al-hajuri-and-dammaj-and-the-deen-of-allah-on-the-earth-has-been-deserted.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 7 - Abandon al-Hajuri and Dammaj and the Deen of Allah on the Earth Has Been Abandoned!</a><BR>
https://www.manhaj.com/manhaj/?mhygy<BR>

<li><a href="articles/weerq-the-ghuluww-towards-yahyaa-al-haddaadi-part-6---yahya-al-haddadi-worshipped-besides-allaah-with-istighaathah.html">The Ghuluww Towards Yahyaa al-Haddadi: Part 6 - Yahya al-Haddadi Worshipped Besides Allaah With Istighaathah</a><BR>
https://www.manhaj.com/manhaj/?weerq<BR>

<li><a href="articles/rkwbk-the-ghuluww-towards-yahyaa-al-haddaadi-part-5---who-are-al-shafiee-yahya-bin-qattan-al-khatib-and-imaam-ahmad-compared-to-yahyaa-the-superstar.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 5 - Who are al-Shafi'ee, Yahya bin Qattan, al-Khatib and Imaam Ahmad Compared to Yahyaa the 'Superstar'?</a><BR>
https://www.manhaj.com/manhaj/?rkwbk<BR>

<li><a href="articles/mdbmo-the-ghuluww-towards-yahyaa-al-haddaadi-part-4---if-they-were-to-melt-yahya-al-hajuri-his-flesh-would-dissolve-into-the-book-and-the-sunnah.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 4 - If They Were to Melt Yahya al-Hajuri His Flesh Would Dissolve into the Book and the Sunnah!</a><BR>
https://www.manhaj.com/manhaj/?mdbmo<BR>

<li><a href="articles/gxpqv-the-ghuluww-towards-yahyaa-al-haddaadi-part-3---yahya-al-haddadi-has-gathered-the-traits-of-the-prophet-and-the-companions.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 3 - Yahya al-Haddadi, Gemini-Superstar, Has Gathered the Traits of the Prophet, the Companions, the Salaf and the Contemporary Scholars!</a><BR>
https://www.manhaj.com/manhaj/?gxpqv<BR>

<li><a href="articles/mddzw-the-ghuluww-towards-yahyaa-al-haddaadi-part-2---people-flock-to-dammaj-as-if-it-is-makkah-and-people-gather-around-al-hajuri-as-they-do-the-kabah.24d.delay">The Ghuluww Towards Yahyaa al-Haddaadi: Part 2 - People Flock to Dammaj As if it is Makkah and People Gather Around al-Hajuri as They Do the Ka'bah! </a><BR>
https://www.manhaj.com/manhaj/?mddzw<BR>

<li><a href="articles/upjgs-illustration-of-the-ghuluww-towards-the-imaam-of-the-thaqalayn-and-star-amongst-stars-yahyaa-al-hajuri-al-haddaadi-part-1.html">The Ghuluww Towards Yahyaa al-Haddaadi: Part 1 - Shining al-Hajuri's Shoes For A Lifetime Amounts To Nothing Much!</a><BR>
https://www.manhaj.com/manhaj/?upjgs<BR>

<li><a href="articles/gxhvf-shaykh-saalih-al-fawzaan-warns-from-the-likes-of-al-hajuri-who-belittle-the-messenger-of-allaah.html">Shaykh Saalih al-Fawzaan Warns From the Likes of al-Hajuri Who Belittle the Messenger of Allaah and Show Boldness Towards Him</a><BR>
https://www.manhaj.com/manhaj/?gxhvf<BR>

<li><a href="articles/bhbgz-shaykh-al-islaam-ibn-taymiyyah-demolishes-the-basis-of-yahyaa-al-haddaadis-self-defence.html">Shaykh al-Islaam Ibn Taymiyyah Demolishes the Basis of Yahyaa al-Haddaadi's Self-Defence in His Accusation that the Companions Participated in the Murder of Uthmaan</a><BR>
https://www.manhaj.com/manhaj/?bhbgz<BR>

<li><a href="articles/mgwkm-the-five-stages-of-yahyaa-al-haddaadi-in-his-accusation-against-some-of-the-companions.html">The Five Stages of Yahyaa al-Haddaadi in His Accusation Against Some of the Companions That They Participated in the Murder of Uthmaan</a><BR>
https://www.manhaj.com/manhaj/?mgwkm<BR>

<li><a href="articles/taggg-yahyaa-al-hajuri-establishes-himself-a-liar-by-trying-to-cover-up-his-accusation-that-the-companions-participated-in-the-murder-of-uthmaan.html">Yahyaa al-Hajuri Establishes Himself a Liar By Trying to Cover Up His Accusation that the Companions Participated in the Murder of Uthmaan</a><BR>
https://www.manhaj.com/manhaj/?taggg<BR>

<li><a href="articles/cftvz-yahya-al-hajuri-accuses-the-sahabah-of-particpating-in-the-murder-of-the-khalifah-uthmaan.html">Yahya al-Hajuri Accuses the Sahabah of Participating in the Murder of the Khalifah Uthmaan</a><BR>
https://www.manhaj.com/manhaj/?cftvz<BR>

<li><a href="articles/xbajs-shaykh-saalih-al-fawzan-warns-from-studying-with-the-likes-of-al-hajuri-who-have-no-firm-grounding-in-knowledge.html">Shaykh Saalih al-Fawzan Warns From Studying with the Likes of al-Hajuri Who Cause People to Doubt About Their Aqidah</a><BR>
https://www.manhaj.com/manhaj/?xbajs<BR>

<li><a href="articles/dedtt-shaykh-rabee-bin-haadee-warns-against-the-ghuluww-and-haddaadiyyah-of-yahyaa-al-hajuri-and-followers.html">Shaykh Rabee' Bin Haadee Warns Against the Ghuluww and Haddaadiyyah of Yahya al-Hajuri and Followers</a><BR>
https://www.manhaj.com/manhaj/?dedtt<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?taggg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:18 GMT -->
</html>


