

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?otddj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Shaykh Ubayd al-Jaabiree on Differentiating Between Aqidah and Manhaj</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ubayd al-Jaabiree on Differentiating Between Aqidah and Manhaj</span><BR>
Thursday, July 01 2010 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Shaykh <a href='tags/ubayd-al-jaabiree.html' class='tagLink'><font class='tagLink'>Ubayd al-Jaabiree</font></a> (hafidhahullaah) was asked a question regarding differentiating between aqidah (creed) and manhaj (methodology):    <P>
<div class='arabic' dir='rtl' align='right'>&#1607;&#1604; &#1607;&#1606;&#1575;&#1603; &#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1575;&#1604;&#1605;&#1606;&#1607;&#1580;&#1567;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Is there a difference between aqidah and manhaj</blockquote>    <P>
And he replied:    <P>
<div class='arabic' dir='rtl' align='right'> &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1607;&#1610; &#1605;&#1575; &#1610;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1585;&#1569; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607; &#1601;&#1610; &#1575;&#1604;&#1604;&#1607; - &#1593;&#1586; &#1608;&#1580;&#1604;-&#1548; &#1608;&#1601;&#1610; &#1605;&#1575; &#1580;&#1575;&#1569; &#1605;&#1606; &#1593;&#1606;&#1583;&#1607;&#1548; &#1608;&#1605;&#1575; &#1580;&#1575;&#1569;&#1578; &#1576;&#1607; &#1585;&#1587;&#1604;&#1607;&#1548; &#1608;&#1593;&#1605;&#1608;&#1583; &#1584;&#1604;&#1603; &#1608;&#1605;&#1604;&#1582;&#1589;&#1607; &#1571;&#1585;&#1603;&#1575;&#1606; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1575;&#1604;&#1587;&#1578;&#1577;&#1548; &#1575;&#1604;&#1578;&#1610; &#1607;&#1610; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1604;&#1575;&#1574;&#1603;&#1578;&#1607; &#1608;&#1603;&#1578;&#1576;&#1607; &#1608;&#1585;&#1587;&#1604;&#1607; &#1608;&#1575;&#1604;&#1610;&#1608;&#1605; &#1575;&#1604;&#1570;&#1582;&#1585; &#1608;&#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1575;&#1604;&#1602;&#1583;&#1585; &#1582;&#1610;&#1585;&#1607; &#1608;&#1588;&#1585;&#1607;&#1548; &#1579;&#1605; &#1605;&#1575;&#1610;&#1578;&#1576;&#1593; &#1584;&#1604;&#1603; &#1605;&#1605;&#1575; &#1610;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1607;&#1548; &#1608;&#1571;&#1606;&#1607; &#1581;&#1602; &#1608;&#1589;&#1583;&#1602; &#1605;&#1606; &#1571;&#1582;&#1576;&#1575;&#1585; &#1575;&#1604;&#1594;&#1610;&#1576;&#1563; &#1603;&#1581;&#1583;&#1608;&#1579; &#1575;&#1604;&#1601;&#1578;&#1606; &#1575;&#1604;&#1578;&#1610; &#1571;&#1582;&#1576;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610; - &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; - &#1548; &#1571;&#1608; &#1603;&#1571;&#1582;&#1576;&#1575;&#1585; &#1605;&#1606; &#1605;&#1590;&#1609; &#1605;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610;&#1610;&#1606; &#1608;&#1575;&#1604;&#1605;&#1585;&#1587;&#1604;&#1610;&#1606;&#1548; &#1587;&#1608;&#1575;&#1569; &#1605;&#1575; &#1603;&#1575;&#1606; &#1605;&#1606;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1571;&#1608; &#1575;&#1604;&#1587;&#1606;&#1577; &#1548; &#1608;&#1571;&#1581;&#1608;&#1575;&#1604; &#1575;&#1604;&#1576;&#1585;&#1586;&#1582; &#1605;&#1606; &#1606;&#1593;&#1610;&#1605; &#1575;&#1604;&#1602;&#1576;&#1585; &#1608;&#1593;&#1584;&#1575;&#1576;&#1607; &#1548; &#1608;&#1605;&#1575; &#1610;&#1580;&#1585;&#1610; &#1601;&#1610; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577; &#1575;&#1604;&#1603;&#1576;&#1585;&#1609; &#1605;&#1606; &#1606;&#1589;&#1576; &#1575;&#1604;&#1581;&#1608;&#1590; &#1608;&#1575;&#1604;&#1605;&#1610;&#1586;&#1575;&#1606; &#1608;&#1575;&#1604;&#1589;&#1585;&#1575;&#1591; &#1608;&#1594;&#1610;&#1585; &#1584;&#1604;&#1603;.    <P>
&#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1601;&#1607;&#1608; &#1578;&#1602;&#1585;&#1610;&#1585; &#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1601;&#1585;&#1608;&#1593;&#1607;&#1548; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1607;&#1608; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1584;&#1610; &#1610;&#1602;&#1585;&#1585; &#1576;&#1607; &#1575;&#1604;&#1605;&#1585;&#1569; &#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1583;&#1610;&#1606; &#1608;&#1601;&#1585;&#1608;&#1593;&#1607; &#1563; &#1601;&#1573;&#1606; &#1603;&#1575;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602; &#1605;&#1608;&#1575;&#1601;&#1602;&#1575;&#1611; &#1604;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1587;&#1610;&#1585;&#1577; &#1575;&#1604;&#1587;&#1604;&#1601; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581; &#1563; &#1601;&#1607;&#1608; &#1605;&#1606;&#1607;&#1580; &#1581;&#1602;&#1548; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1605;&#1582;&#1575;&#1604;&#1601;&#1575;&#1611; &#1604;&#1584;&#1604;&#1603; &#1563; &#1601;&#1607;&#1608; &#1605;&#1606;&#1607;&#1580; &#1601;&#1575;&#1587;&#1583;.    <P>
&#1608;&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1572;&#1604;&#1601; &#1605;&#1606; &#1607;&#1584;&#1610;&#1606;: &#1589;&#1581;&#1577; &#1575;&#1604;&#1605;&#1593;&#1578;&#1602;&#1583;&#1548; &#1608;&#1587;&#1604;&#1575;&#1605;&#1577; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1608;&#1587;&#1583;&#1575;&#1583;&#1607;&#1548; &#1601;&#1604;&#1575; &#1610;&#1606;&#1601;&#1603; &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1593;&#1606; &#1575;&#1604;&#1570;&#1582;&#1585;&#1548; &#1601;&#1605;&#1606; &#1601;&#1587;&#1583; &#1605;&#1606;&#1607;&#1580;&#1607; &#1563; &#1601;&#1579;&#1602;&#1608;&#1575; &#1571;&#1606; &#1607;&#1584;&#1575; &#1606;&#1575;&#1576;&#1593; &#1605;&#1606; &#1601;&#1587;&#1575;&#1583; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607;&#1548; &#1601;&#1573;&#1584;&#1575; &#1575;&#1587;&#1578;&#1602;&#1575;&#1605;&#1578; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1580;&#1607; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1563; &#1575;&#1587;&#1578;&#1602;&#1575;&#1605; &#1603;&#1584;&#1604;&#1603; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580;    <P>
&#1601;&#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1601;&#1587;&#1583; &#1605;&#1606;&#1607;&#1580;&#1607;&#1605; &#1604;&#1601;&#1587;&#1575;&#1583; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607;&#1605;&#1563; &#1604;&#1571;&#1606;&#1607;&#1605; &#1575;&#1593;&#1578;&#1602;&#1583;&#1608;&#1575; &#1575;&#1587;&#1578;&#1581;&#1604;&#1575;&#1604; &#1583;&#1605;&#1575;&#1569; &#1571;&#1607;&#1604; &#1575;&#1604;&#1603;&#1576;&#1575;&#1574;&#1585;&#1548; &#1601;&#1587;&#1608;&#1594;&#1608;&#1575; &#1602;&#1578;&#1604;&#1607;&#1605; &#1608;&#1602;&#1578;&#1575;&#1604;&#1607;&#1605; &#1608;&#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1593;&#1589;&#1575;&#1577; &#1575;&#1604;&#1601;&#1587;&#1575;&#1602;&#1548; &#1608;&#1575;&#1587;&#1578;&#1581;&#1604;&#1608;&#1575; &#1575;&#1604;&#1571;&#1605;&#1608;&#1575;&#1604; &#1608;&#1575;&#1604;&#1583;&#1605;&#1575;&#1569;&#1563; &#1608;&#1604;&#1607;&#1584;&#1575; &#1602;&#1575;&#1604; &#1605;&#1606; &#1602;&#1575;&#1604; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1571;&#1606;&#1607;&#1605; &#1603;&#1601;&#1575;&#1585;   </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Aqidah is that which obligatory for a man to believe concerning Allaah the Mighty and Majestic, and that which has come from Him and concerning His Messengers and whatever His Messengers came with. And the pillar and summary of is the six pillars of Imaan which are Imaan in Allaah, His Angels, His Books, His Messengers, the Last Day and Imaan in al-Qadar, its good and its bad. Then whatever follows thereafter from that which is obligatory for a Muslim to believe, and that it is true and correct. Such as the affairs of the unseen like the emergence of fitan (tribulations) as was informed by the Prophet (sallallaahu 'alayhi wa Sallam), and the news concerning those who have passed of the Prophets and Messengers, regardless of whether that is in the Book or the Sunnah. Also the situations in the Barzakh, and the punishement and bliss of the grave, and what will take place on the major Judgement day, such as the placing of the Hawd, the Bridge, the Scales and what is besides that.    <P>
As for manhaj, then it is a corroboration, establishment of the usool of the deen and its furoo' (foundations and branches), the manhaj is the path by which a person corroborates the foundations and branches of the deen. So if this path is in agreement with the Book and the Sunnah and the way of the Salaf us-Saalih, then this is a true manhaj. And if it is in opposition to that then it is a corrupt manhaj.    <P>
<b>And Islaam is brought together (composed) of these two, (a) the soundness, correctness in aqidah, and (b) the soundness and safety in manhaj. Therefore, one of them cannot be separated from the other.</b>    <P>
<u>The person whose manhaj is corrupt, have trust that this follows on from the corruption in his aqidah. When the aqidah is upright, in the correct way, then the manhaj will also be upright.</u>     <P>
For the manhaj of the Khawaarij became corrupt because of the corruption in their aqidah. They held the belief of the lawfulness of the blood of those who commit major sins, and thus they permitted fighting and killing them and revolting against the sinful disobedient  rulers. They made lawful the taking of blood and wealth. It is for this reason that it was said "<i>They are disbelievers</i>" by whoever said this from the people of knowledge (i.e. because they, the khawaarij made lawful what Allaah made unlawful, the taking of the blood of a Muslim upon other than a due right).</blockquote>    <P>
Source: The cassette (<span class='arb' dir='rtl'>&#1575;&#1604;&#1573;&#1610;&#1590;&#1575;&#1581; &#1608;&#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1601;&#1610; &#1603;&#1588;&#1601; &#1576;&#1593;&#1590; &#1591;&#1585;&#1575;&#1574;&#1602; &#1601;&#1585;&#1602;&#1577; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606;</span>), "<i>Elucidation and Clarification on Exposing Some of the Ways of the Sect of al-Ikhwaan [al-Muslimoon]</i>". <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/otddj-shaykh-ubayd-al-jaabiree-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Ubayd al-Jaabiree on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?otddj<BR>

<li><a href="articles/vnbnh-shaykh-saalih-al-fawzaan-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Saalih al-Fawzaan on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?vnbnh<BR>

<li><a href="articles/xyzse-shaykh-ibn-uthaymeen-errors-in-manhaj-occur-due-to-underlying-errors-in-aqidah.html">Shaykh Ibn Uthaymeen: Errors in Manhaj Occur Due to Underlying Errors in Aqidah</a><BR>
https://www.manhaj.com/manhaj/?xyzse<BR>

<li><a href="articles/hzsbd-the-permanent-committee-on-differentiating-between-aqidah-and-manhaj.html">The Permanent Committee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?hzsbd<BR>

<li><a href="articles/lvzvm-shaykh-al-albaanee-on-differentiating-between-aqidah-and-manhaj.html">Shaykh al-Albaanee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?lvzvm<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?otddj by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


