

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?uncnb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:18 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Takfir and the Excuse of Ignorance: Shaykh Abd al-Muhsin al-Abbaad</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Takfir and the Excuse of Ignorance: Shaykh Abd al-Muhsin al-Abbaad</span><BR>
Thursday, December 01 2011 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>In this series of articles we present the statements of the Scholars of Ahl al-Sunnah which clarify and explain the issue of (<span class='arb' dir='rtl'>&#1575;&#1604;&#1593;&#1584;&#1585; &#1576;&#1575;&#1604;&#1580;&#1607;&#1604;</span>), the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a>, and also (<span class='arb' dir='rtl'>&#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605; &#1605;&#1606; &#1575;&#1604;&#1583;&#1610;&#1606; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577;</span>), that which is known from the religion by necessity. There is much confusion and speculation about this issue, despite the fact that it is very clear in the speech of the Scholars. One should also be aware of factions of the <b>Takfiris, Qutbis</b> who allege that the Scholars of Ahl al-Sunnah such as Imaam Ibn Baz, Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a>, Imaam al-Albaani, Shaykh Abd al-Muhsin al-Abbaad and many other contemporary Scholars are "revisionists," a charge levelled because these Scholars did not agree to their methodologies and positions (of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of nations and societies or <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of certain rulers). Hence, they extended this claim of revisionism beyond the issue of the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the rulers into other issues (such as the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> and that which is known from the religion by necessity) in order to discredit these Scholars and make the people not take from them and instead to drive the people towards the Harakiyyeen and their figureheads. These Qutbis and Takfiris are ignorant people, they are pretenders to knowledge, and they employ much deception. Instead of being honest and saying that difference in this issue can be found right through the history of the da'wah of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> in Najd, and varying sayings can be found amongst the Scholars of the da'wah, they opted for their usual trait of deception and lies and tried to attack those Scholars who spoke against their Qutbi da'wah by accusing them of being "revisionists" merely because they held the view of granting the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> in matters of kufr and shirk within certain circumstances. Addressing their falsehood and their conniving in detail is for another place. Here we want to systematically document the sayings of the scholars for the purposes of building a record and at a later time, we will inshaa'Allaah, discuss some of these issues with the purpose of clarification.</blockquote></div> <P> 


<p><font class='titleHeadline'>Shaykh Abd al-Muhsin al-Abbaad on the <a href="tags/excuse-of-ignorance.html" class="tagLink"><font class="tagLink">excuse of ignorance</font></a></font>    <P>
In his book (<span class='arb' dir='rtl'>&#1588;&#1585;&#1581; &#1588;&#1585;&#1608;&#1591; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1571;&#1585;&#1603;&#1575;&#1606;&#1607;&#1575; &#1608;&#1608;&#1575;&#1580;&#1576;&#1575;&#1578;&#1607;&#1575;</span>), pp. 70-80, Shaykh Abd al-Muhsin al-Abbaad writes, in clarification of this matter, in what are excellent words:     <blockquote><div class='arabic' dir='rtl' align='right'>&#1608;&#1605;&#1606; &#1589;&#1585;&#1601; &#1588;&#1610;&#1574;&#1575;&#1611; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607;&#1548; &#1601;&#1607;&#1608; &#1605;&#1588;&#1585;&#1603; &#1603;&#1575;&#1601;&#1585;&#1548; &#1608;&#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1603;&#1605; &#1573;&#1606;&#1605;&#1575; &#1607;&#1608; &#1593;&#1604;&#1609; &#1575;&#1604;&#1573;&#1591;&#1604;&#1575;&#1602; &#1608;&#1593;&#1604;&#1609; &#1605;&#1606; &#1576;&#1604;&#1594;&#1578;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1608;&#1571;&#1605;&#1575; &#1575;&#1604;&#1588;&#1582;&#1589; &#1575;&#1604;&#1605;&#1593;&#1610;&#1606; &#1601;&#1573;&#1584;&#1575; &#1581;&#1589;&#1604; &#1605;&#1606;&#1607; &#1589;&#1585;&#1601; &#1588;&#1610;&#1569; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607;&#1548; &#1603;&#1583;&#1593;&#1575;&#1569; &#1575;&#1604;&#1571;&#1605;&#1608;&#1575;&#1578; &#1608;&#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1575;&#1579;&#1577; &#1576;&#1607;&#1605;&#1548; &#1608;&#1607;&#1608; &#1580;&#1575;&#1607;&#1604; &#1601;&#1573;&#1606;&#1607; &#1610;&#1578;&#1608;&#1602;&#1617;&#1601; &#1601;&#1610; &#1578;&#1603;&#1601;&#1610;&#1585;&#1607; &#1581;&#1578;&#1609; &#1610;&#1615;&#1576;&#1614;&#1610;&#1617;&#1614;&#1606; &#1604;&#1607; &#1608;&#1578;&#1602;&#1575;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1617;&#1577;&#1548; &#1608;&#1607;&#1584;&#1575; &#1571;&#1581;&#1583; &#1602;&#1608;&#1604;&#1610;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577;&#1548; &#1584;&#1603;&#1585;&#1607;&#1605;&#1575; &#1588;&#1610;&#1582;&#1606;&#1575; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606; &#1576;&#1575;&#1586; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1580;&#1608;&#1575;&#1576; &#1587;&#1572;&#1575;&#1604; &#1593;&#1606; &#1576;&#1593;&#1590; &#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593;&#1548; &#1580;&#1575;&#1569; &#1601;&#1610;&#1607;: </div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And whoever directs anything from the types of worship to other than Allaah is a mushrik, kafir, and this judgement is one of itlaaq (absolute, unqualified) and upon the one whom the proof has reached. As for the specific person, then when directing any of the types of worship to other than Allaah occurs from him, such as invoking the dead, and seeking rescue from them whilst he is ignorant, then making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of him is withheld from until the matter is clarified to him and the proof is established upon him. And this is one of two sayings in the issue, our Shaykh, Abd al-Aziz bin Baz (rahimahullaah) mentioned them in an answer to a question about some of the people of innovation, and in which there occurs:</blockquote>    <P>
 <blockquote><div class='arabic' dir='rtl' align='right'> &#1603;&#1584;&#1604;&#1603; &#1575;&#1604;&#1578;&#1608;&#1587;&#1604; &#1576;&#1575;&#1604;&#1571;&#1608;&#1604;&#1610;&#1575;&#1569; &#1602;&#1587;&#1605;&#1575;&#1606;: &#1575;&#1604;&#1571;&#1608;&#1604;: &#1575;&#1604;&#1578;&#1608;&#1587;&#1604; &#1576;&#1580;&#1575;&#1607; &#1601;&#1604;&#1575;&#1606; &#1571;&#1608; &#1581;&#1602; &#1601;&#1604;&#1575;&#1606;&#1548; &#1607;&#1584;&#1575; &#1576;&#1583;&#1593;&#1577; &#1608;&#1604;&#1610;&#1587; &#1603;&#1601;&#1585;&#1575;&#1611;. &#1575;&#1604;&#1578;&#1608;&#1587;&#1604; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;:&#1607;&#1608; &#1583;&#1593;&#1575;&#1572;&#1607; &#1576;&#1602;&#1608;&#1604;&#1607;: &#1610;&#1575; &#1587;&#1610;&#1583;&#1610; &#1601;&#1604;&#1575;&#1606; &#1575;&#1606;&#1589;&#1585;&#1606;&#1610; &#1571;&#1608; &#1575;&#1588;&#1601; &#1605;&#1585;&#1610;&#1590;&#1610;&#1548; &#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1588;&#1585;&#1603; &#1575;&#1604;&#1571;&#1603;&#1576;&#1585; &#1608;&#1607;&#1584;&#1575; &#1610;&#1587;&#1605;&#1608;&#1606;&#1607; &#1578;&#1608;&#1587;&#1604;&#1575;&#1611; &#1571;&#1610;&#1590;&#1575;&#1611;&#1548; &#1608;&#1607;&#1584;&#1575; &#1605;&#1606; &#1593;&#1605;&#1604; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577;&#1548; &#1571;&#1605;&#1575; &#1575;&#1604;&#1571;&#1608;&#1604; &#1601;&#1607;&#1608; &#1576;&#1583;&#1593;&#1577;&#1548; &#1608;&#1605;&#1606; &#1608;&#1587;&#1575;&#1574;&#1604; &#1575;&#1604;&#1588;&#1585;&#1603;&#1548; &#1602;&#1610;&#1604; &#1604;&#1607;: &#1608;&#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1605;&#1575; &#1606;&#1583;&#1593;&#1608;&#1607; &#1604;&#1571;&#1606;&#1607; &#1608;&#1604;&#1610; &#1589;&#1575;&#1604;&#1581; &#1608;&#1603;&#1604; &#1588;&#1610;&#1569; &#1576;&#1610;&#1583; &#1575;&#1604;&#1604;&#1607; &#1608;&#1607;&#1584;&#1575; &#1608;&#1575;&#1587;&#1591;&#1577;. &#1602;&#1575;&#1604;: &#1607;&#1584;&#1575; &#1593;&#1605;&#1604; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1575;&#1604;&#1571;&#1608;&#1604;&#1610;&#1606;&#1548; &#1601;&#1602;&#1608;&#1604;&#1607;&#1605;: &#1605;&#1583;&#1583; &#1610;&#1575; &#1576;&#1583;&#1608;&#1610;&#1548; &#1605;&#1583;&#1583; &#1610;&#1575; &#1581;&#1587;&#1610;&#1606;&#1548; &#1607;&#1584;&#1575; &#1580;&#1606;&#1587; &#1593;&#1605;&#1604; &#1571;&#1576;&#1610; &#1580;&#1607;&#1604; &#1608;&#1571;&#1588;&#1576;&#1575;&#1607;&#1607;&#1548; &#1604;&#1571;&#1606;&#1607;&#1605; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: {&#1605;&#1614;&#1575; &#1606;&#1614;&#1593;&#1618;&#1576;&#1615;&#1583;&#1615;&#1607;&#1615;&#1605;&#1618; &#1573;&#1616;&#1604;&#1617;&#1614;&#1575; &#1604;&#1616;&#1610;&#1615;&#1602;&#1614;&#1585;&#1617;&#1616;&#1576;&#1615;&#1608;&#1606;&#1614;&#1575; &#1573;&#1616;&#1604;&#1614;&#1609; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616; &#1586;&#1615;&#1604;&#1618;&#1601;&#1614;&#1609;} [&#1575;&#1604;&#1586;&#1605;&#1585;:3]&#1548; {&#1607;&#1614;&#1572;&#1615;&#1604;&#1575;&#1569;&#1616; &#1588;&#1615;&#1601;&#1614;&#1593;&#1614;&#1575;&#1572;&#1615;&#1606;&#1614;&#1575; &#1593;&#1616;&#1606;&#1618;&#1583;&#1614; &#1575;&#1604;&#1604;&#1617;&#1614;&#1607;&#1616;} [&#1610;&#1608;&#1606;&#1587;:18]&#1548; &#1607;&#1584;&#1575; &#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1603;&#1601;&#1585; &#1608;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1593;&#1586;&#1617; &#1608;&#1580;&#1604;&#1617;. &#1604;&#1603;&#1606; &#1575;&#1582;&#1578;&#1604;&#1601; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1607;&#1604; &#1610;&#1603;&#1601;&#1585; &#1589;&#1575;&#1581;&#1576;&#1607; &#1571;&#1605; &#1610;&#1606;&#1578;&#1592;&#1585; &#1581;&#1578;&#1609; &#1578;&#1602;&#1575;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1617;&#1577; &#1608;&#1581;&#1578;&#1609; &#1610;&#1576;&#1610;&#1617;&#1606; &#1604;&#1607;&#1548; &#1593;&#1604;&#1609; &#1602;&#1608;&#1604;&#1610;&#1606;: &#1571;&#1581;&#1583;&#1607;&#1605;&#1575;: &#1571;&#1606; &#1605;&#1606; &#1602;&#1575;&#1604; &#1607;&#1584;&#1575; &#1610;&#1603;&#1608;&#1606; &#1603;&#1575;&#1601;&#1585;&#1575;&#1611; &#1603;&#1601;&#1585;&#1575;&#1611; &#1571;&#1603;&#1576;&#1585; &#1604;&#1571;&#1606; &#1607;&#1584;&#1575; &#1588;&#1585;&#1603; &#1592;&#1575;&#1607;&#1585; &#1604;&#1575; &#1578;&#1582;&#1601;&#1609; &#1571;&#1583;&#1604;&#1617;&#1578;&#1607;&#1548; &#1608;&#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;: &#1571;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1602;&#1583; &#1610;&#1583;&#1582;&#1604;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1580;&#1607;&#1604; &#1608;&#1593;&#1606;&#1583;&#1607;&#1605; &#1593;&#1604;&#1605;&#1575;&#1569; &#1587;&#1608;&#1569; &#1571;&#1590;&#1604;&#1617;&#1608;&#1607;&#1605;&#1548; &#1601;&#1604;&#1575;&#1576;&#1583; &#1571;&#1606; &#1610;&#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1610;&#1608;&#1590;&#1581; &#1604;&#1607;&#1605; &#1575;&#1604;&#1571;&#1605;&#1585; &#1581;&#1610;&#1579; &#1610;&#1578;&#1590;&#1581; &#1604;&#1607;&#1605;&#1548; &#1601;&#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1602;&#1575;&#1604;: {&#1608;&#1614;&#1605;&#1614;&#1575; &#1603;&#1615;&#1606;&#1617;&#1614;&#1575; &#1605;&#1615;&#1593;&#1614;&#1584;&#1617;&#1616;&#1576;&#1616;&#1610;&#1606;&#1614; &#1581;&#1614;&#1578;&#1617;&#1614;&#1609; &#1606;&#1614;&#1576;&#1618;&#1593;&#1614;&#1579;&#1614; &#1585;&#1614;&#1587;&#1615;&#1608;&#1604;&#1575;&#1611;} [&#1575;&#1604;&#1573;&#1587;&#1585;&#1575;&#1569;:15]&#1548; &#1601;&#1573;&#1584;&#1575; &#1608;&#1590;&#1581; &#1604;&#1607;&#1605; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1602;&#1575;&#1604; &#1604;&#1607;&#1605;: &#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586;&#1548; &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1603;&#1584;&#1575; &#1608;&#1602;&#1575;&#1604; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1603;&#1584;&#1575;&#1548; &#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1575;&#1604;&#1571;&#1583;&#1604;&#1577;&#1548; &#1579;&#1605; &#1571;&#1589;&#1585;&#1608;&#1575; &#1593;&#1604;&#1609; &#1581;&#1575;&#1604;&#1607;&#1605;&#1548; &#1603;&#1601;&#1585;&#1608;&#1575; &#1576;&#1607;&#1584;&#1575;&#1548; &#1608;&#1601;&#1610; &#1603;&#1604; &#1581;&#1575;&#1604; &#1601;&#1575;&#1604;&#1601;&#1593;&#1604; &#1606;&#1601;&#1587;&#1607; &#1603;&#1601;&#1585; &#1588;&#1585;&#1603; &#1571;&#1603;&#1576;&#1585;&#1548; &#1604;&#1603;&#1606; &#1589;&#1575;&#1581;&#1576;&#1607; &#1607;&#1608; &#1605;&#1581;&#1604; &#1606;&#1592;&#1585; &#1607;&#1604; &#1610;&#1603;&#1601;&#1585; &#1571;&#1605; &#1610;&#1602;&#1575;&#1604;: &#1571;&#1605;&#1585;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607;&#1548; &#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1601;&#1578;&#1585;&#1577; &#1604;&#1571;&#1606;&#1607; &#1605;&#1575; &#1576;&#1610;&#1617;&#1606; &#1604;&#1607; &#1575;&#1604;&#1571;&#1605;&#1585; &#1601;&#1610;&#1603;&#1608;&#1606; &#1581;&#1603;&#1605;&#1607; &#1581;&#1603;&#1605; &#1571;&#1607;&#1604; &#1575;&#1604;&#1601;&#1578;&#1585;&#1575;&#1578;&#1548; &#1571;&#1605;&#1585;&#1607; &#1573;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1586;&#1617; &#1608;&#1580;&#1604;&#1617;&#1548; &#1604;&#1571;&#1606;&#1607; &#1576;&#1587;&#1576;&#1576; &#1578;&#1604;&#1576;&#1610;&#1587; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1604;&#1610;&#1607; &#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1587;&#1608;&#1569;" &#1575;&#1606;&#1578;&#1607;&#1609;. &#1606;&#1602;&#1604;&#1575;&#1611; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576; "&#1587;&#1593;&#1577; &#1585;&#1581;&#1605;&#1577; &#1585;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1604;&#1604;&#1580;&#1607;&#1575;&#1604; &#1575;&#1604;&#1605;&#1582;&#1575;&#1604;&#1601;&#1610;&#1606; &#1604;&#1604;&#1588;&#1585;&#1610;&#1593;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;" &#1604;&#1587;&#1610;&#1583; &#1576;&#1606; &#1587;&#1593;&#1583; &#1575;&#1604;&#1583;&#1610;&#1606; &#1575;&#1604;&#1594;&#1576;&#1575;&#1588;&#1610;&#1548; &#1608;&#1601;&#1610; &#1571;&#1608;&#1604; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1585;&#1587;&#1575;&#1604;&#1577; &#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1576;&#1606; &#1576;&#1575;&#1586; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1604;&#1604;&#1605;&#1572;&#1604;&#1601; &#1576;&#1578;&#1575;&#1585;&#1610;&#1582;: 7/5/1403&#1607;&#1600;&#1548; &#1578;&#1578;&#1590;&#1605;&#1606; &#1573;&#1602;&#1585;&#1575;&#1585; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1573;&#1584;&#1606; &#1576;&#1591;&#1576;&#1593;&#1607;.</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'><blockquote>Likewise, making tawassul (using a means of approach) through the awliyaa, it is of two types: The first: Making tawassul through the honour or right of so and so. This is an innovation and is not disbelief. The second tawassul is invoking him by saying, "O my master, aid me, or cure my sickness." This is the major Shirk, and they refer to this as "tawassul" as well, but this is from the actions of jaahiliyyah. As for the first it is an innovation and from the ways leading to shirk. It was said to him: "And their saying that we call upon him because he is a righteous wali, but everything is in the Hand of Allaah, and this is just an intermediate means." He said: This is the action of the very first pagans, for their saying, "<i>Aid, O Badawi</i>", "<i>Aid O Husayn</i>", this is of the same type of action as Abu Jahl and his likes, because they say, "<b>We do not worship them except that they may bring us closer to Allaah</b>" (39:3),  and "<b>These are our intercessors with Allaah</b>" (10:18). However, the scholars have differed as to whether <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> is made of the person or one waits until the proof is established upon him and until the matter is made clear to him, and  (they are) upon two sayings. The first of them: That the one who says this person is a disbeliever with the major disbelief because this is manifest shirk whose evidences are not obscure. And the second: That these people could enter into ignorance and they have evil scholars who have misguided tehm. Therefore, it is necessary that the affair is made clear to them and the affair is made plain to them so that it actually does become clear to them. For Allaah said, "And we do not punish until after we send a Messenger" (17:15). When the affair is clear to them and he says to them, "This is not permissible, Allaah said such and such and the Messenger said such and such", he explains to him the evidences, then they persist upon their way, they disbelieve through that. And in all situations, the action itself is disbelief, major shirk, but its doer is subject to inspection, does he disbelieve, or is it said his affair is with Allaah, he could be from the people of the fatrah [interval in which the remnants of prophetic teachings have diminished], because the affair has not been explained to him, so his ruling would be the ruling of the people of the intervals [between and after prophethood], his affair is with Allaah, the Mighty and Majestic due to people amongst the evil scholars deceiving him. </blockquote>    <P>
End quote from the book "The Vastness of the Mercy of the Lord of the Worlds to the Ignorant Opposers of the Shariah From the Muslims" of Sayyid bin Sa'd al-Deen al-Ghabaashee, and at the beginning of the book is a letter from Shaykh Abd al-Aziz bin Baz (rahimahullaah) to the author dated 7/5/1403H comprising an corroboration of the book and permission for it to be printed.</blockquote>    <P>
<blockquote><div class='arabic' dir='rtl' align='right'>&#1608;&#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610; &#1605;&#1606; &#1575;&#1604;&#1602;&#1608;&#1604;&#1610;&#1606; &#1608;&#1607;&#1608; &#1575;&#1604;&#1578;&#1608;&#1602;&#1601; &#1601;&#1610; &#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585;&#1548; &#1602;&#1585;&#1617;&#1585;&#1607; &#1603;&#1579;&#1610;&#1585;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569;&#1548; &#1605;&#1606;&#1607;&#1605;: &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577;&#1548; &#1608;&#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576;&#1548; &#1602;&#1575;&#1604; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1575;&#1579;&#1577; (2/731): "&#1601;&#1573;&#1606;&#1575; &#1576;&#1593;&#1583; &#1605;&#1593;&#1585;&#1601;&#1577; &#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1607; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1606;&#1593;&#1604;&#1605; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1571;&#1606;&#1607; &#1604;&#1605; &#1610;&#1588;&#1585;&#1593; &#1604;&#1571;&#1605;&#1578;&#1607; &#1571;&#1606; &#1578;&#1583;&#1593;&#1608; &#1571;&#1581;&#1583;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1571;&#1605;&#1608;&#1575;&#1578;&#1548; &#1604;&#1575; &#1575;&#1604;&#1571;&#1606;&#1576;&#1610;&#1575;&#1569; &#1608;&#1604;&#1575; &#1575;&#1604;&#1589;&#1575;&#1604;&#1581;&#1610;&#1606; &#1608;&#1604;&#1575; &#1594;&#1610;&#1585;&#1607;&#1605;&#1548; &#1604;&#1575; &#1576;&#1604;&#1601;&#1592; &#1575;&#1604;&#1575;&#1587;&#1578;&#1594;&#1575;&#1579;&#1577; &#1608;&#1604;&#1575; &#1576;&#1594;&#1610;&#1585;&#1607;&#1575;&#1548; &#1608;&#1604;&#1575; &#1576;&#1604;&#1601;&#1592; &#1575;&#1604;&#1575;&#1587;&#1578;&#1593;&#1575;&#1584;&#1577; &#1608;&#1604;&#1575; &#1576;&#1594;&#1610;&#1585;&#1607;&#1575;&#1548; &#1603;&#1605;&#1575; &#1571;&#1606;&#1607; &#1604;&#1605; &#1610;&#1588;&#1585;&#1593; &#1604;&#1571;&#1605;&#1578;&#1607; &#1575;&#1604;&#1587;&#1580;&#1608;&#1583; &#1604;&#1605;&#1610;&#1578; &#1608;&#1604;&#1575; &#1604;&#1594;&#1610;&#1585; &#1605;&#1610;&#1578; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; &#1576;&#1604; &#1606;&#1593;&#1604;&#1605; &#1571;&#1606;&#1607; &#1606;&#1607;&#1609; &#1593;&#1606; &#1603;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585;&#1548; &#1608;&#1571;&#1606; &#1584;&#1604;&#1603; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1575;&#1604;&#1584;&#1610; &#1581;&#1585;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;&#1548; &#1604;&#1603;&#1606; &#1604;&#1594;&#1604;&#1576;&#1577; &#1575;&#1604;&#1580;&#1607;&#1604;&#1548; &#1608;&#1602;&#1604;&#1617;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1576;&#1570;&#1579;&#1575;&#1585; &#1575;&#1604;&#1585;&#1587;&#1575;&#1604;&#1577; &#1601;&#1610; &#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1605;&#1578;&#1571;&#1582;&#1585;&#1610;&#1606;&#1548; &#1604;&#1605; &#1610;&#1603;&#1606; &#1578;&#1603;&#1601;&#1610;&#1585;&#1607;&#1605; &#1576;&#1584;&#1604;&#1603; &#1581;&#1578;&#1609; &#1610;&#1578;&#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1607; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1605;&#1605;&#1575; &#1610;&#1582;&#1575;&#1604;&#1601;&#1607;&#1548; &#1608;&#1604;&#1607;&#1584;&#1575; &#1605;&#1575; &#1576;&#1610;&#1606;&#1578; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577; &#1602;&#1591; &#1604;&#1605;&#1606; &#1610;&#1593;&#1585;&#1601; &#1571;&#1589;&#1604; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1573;&#1604;&#1575;&#1617; &#1578;&#1601;&#1591;&#1617;&#1606;&#1548; &#1608;&#1602;&#1575;&#1604;: &#1607;&#1584;&#1575; &#1571;&#1589;&#1604; &#1575;&#1604;&#1583;&#1610;&#1606;&#1548; &#1608;&#1603;&#1575;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1571;&#1603;&#1575;&#1576;&#1585; &#1605;&#1606; &#1575;&#1604;&#1588;&#1610;&#1608;&#1582; &#1575;&#1604;&#1593;&#1575;&#1585;&#1601;&#1610;&#1606; &#1605;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576;&#1606;&#1575; &#1610;&#1602;&#1608;&#1604;: &#1607;&#1584;&#1575; &#1571;&#1593;&#1592;&#1605; &#1605;&#1575; &#1576;&#1610;&#1606;&#1578;&#1607; &#1604;&#1606;&#1575;&#1548; &#1604;&#1593;&#1604;&#1605;&#1607; &#1576;&#1571;&#1606; &#1607;&#1584;&#1575; &#1571;&#1589;&#1604; &#1575;&#1604;&#1583;&#1610;&#1606;."</div></blockquote>     <blockquote class='quote'><img src='images/quote-start.gif'>And the second saying of the two sayings of withholding from <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> is affirmed by many of the Scholars, amongst them is Shaykh al-Islam Ibn Taymiyyah, Shaykh al-Islam Muhammad bin Abd al-Wahhaab, Shaykh al-Islam bin Taymiyyah (rahimahullaah) said in Kitab al-Istighaathah (2/731):    <P>
<blockquote>For we, after acquaintance with what the Messenger (sallallaahu alayhi wasallam) came with, know by necessity that he did not legislate for his ummah that they call upon anyone from the dead, neither the prophets, nor the righteous or others besides them, neither with the word istighaathah (seeking rescue) and nor with other than it, and nor with the word isti'aadhah (seeking refuge) or other than it. Just like he did not legislate for his ummah that they prostrate to a dead person or other than a dead person and what is similar to this. Rather, we know that he prohibited from all these matters and that it is from the shirk which Allaah and His Messenger made unlawful. However, due to the preponderance of ignorance, and scant knowledge of the remnants of the messengership amongst many of the latecomers, <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> is not made of them on account (of what has been mentioned) until that which the Messenger (sallallaahu alayhi wasallam) came with is made clear (and distinct) from that which opposes it. For this reason, never did I explain this issue to anyone who understood the foundation of Islaam, ever, except that he grasped it and said, "This (establishment of the proof) is the [very] foundation of the religion," and one of the senior amongst the knowledgeable shaykhs from our associates said, "This is the greatest of what you have explained to us" due to his knowledge that this is the foundation of the religion.</blockquote></blockquote>    <P>
<blockquote><div class='arabic' dir='rtl' align='right'>&#1608;&#1602;&#1575;&#1604; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;: "&#1608;&#1573;&#1584;&#1575; &#1603;&#1606;&#1575; &#1604;&#1575; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1593;&#1576;&#1583; &#1575;&#1604;&#1602;&#1575;&#1583;&#1585;&#1548; &#1608;&#1575;&#1604;&#1589;&#1606;&#1605; &#1575;&#1604;&#1584;&#1610; &#1593;&#1604;&#1609; &#1602;&#1576;&#1585; &#1571;&#1581;&#1605;&#1583; &#1575;&#1604;&#1576;&#1583;&#1608;&#1610;&#1548; &#1608;&#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1605;&#1575; &#1604;&#1571;&#1580;&#1604; &#1580;&#1607;&#1604;&#1607;&#1605; &#1608;&#1593;&#1583;&#1605; &#1605;&#1606; &#1610;&#1606;&#1576;&#1607;&#1607;&#1605;&#1548; &#1601;&#1603;&#1610;&#1601; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1607;&#1575;&#1580;&#1585; &#1573;&#1604;&#1610;&#1606;&#1575; &#1571;&#1608; &#1604;&#1605; &#1610;&#1603;&#1601;&#1585; &#1608;&#1610;&#1602;&#1575;&#1578;&#1604;&#1548; &#1587;&#1576;&#1581;&#1575;&#1606;&#1603; &#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605;". &#1575;&#1604;&#1583;&#1585;&#1585; &#1575;&#1604;&#1587;&#1606;&#1610;&#1577; (1/66)&#1548; &#1608;&#1602;&#1575;&#1604; &#1571;&#1610;&#1590;&#1575;&#1611;: "&#1576;&#1604; &#1606;&#1588;&#1607;&#1583; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1609; &#1605;&#1575; &#1610;&#1593;&#1604;&#1605;&#1607; &#1605;&#1606; &#1602;&#1604;&#1608;&#1576;&#1606;&#1575; &#1576;&#1571;&#1606; &#1605;&#1606; &#1593;&#1605;&#1604; &#1576;&#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1608;&#1578;&#1576;&#1585;&#1571; &#1605;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603; &#1608;&#1571;&#1607;&#1604;&#1607; &#1601;&#1607;&#1608; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1601;&#1610; &#1571;&#1610; &#1586;&#1605;&#1575;&#1606; &#1608;&#1571;&#1610; &#1605;&#1603;&#1575;&#1606;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1571;&#1588;&#1585;&#1603; &#1576;&#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1573;&#1604;&#1607;&#1610;&#1578;&#1607; &#1576;&#1593;&#1583;&#1605;&#1575; &#1606;&#1576;&#1610;&#1606; &#1604;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1593;&#1604;&#1609; &#1576;&#1591;&#1604;&#1575;&#1606; &#1575;&#1604;&#1588;&#1585;&#1603;". &#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; (3/34)&#1548; &#1608;&#1602;&#1575;&#1604; &#1571;&#1610;&#1590;&#1575;&#1611;: "&#1605;&#1575; &#1584;&#1603;&#1585; &#1604;&#1603;&#1605; &#1593;&#1606;&#1610; &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1601;&#1607;&#1584;&#1575; &#1605;&#1606; &#1576;&#1607;&#1578;&#1575;&#1606; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1602;&#1608;&#1604;&#1607;&#1605;: &#1573;&#1606;&#1610; &#1571;&#1602;&#1608;&#1604;: &#1605;&#1606; &#1578;&#1576;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1608;&#1607;&#1608; &#1587;&#1575;&#1603;&#1606; &#1601;&#1610; &#1576;&#1604;&#1583;&#1607; &#1571;&#1606;&#1607; &#1605;&#1575; &#1610;&#1603;&#1601;&#1610;&#1607; &#1581;&#1578;&#1609; &#1610;&#1580;&#1610;&#1569; &#1593;&#1606;&#1583;&#1610;&#1548; &#1601;&#1607;&#1584;&#1575; &#1571;&#1610;&#1590;&#1575;&#1611; &#1605;&#1606; &#1575;&#1604;&#1576;&#1607;&#1578;&#1575;&#1606;&#1548; &#1573;&#1606;&#1605;&#1575; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1575;&#1578;&#1576;&#1575;&#1593; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1601;&#1610; &#1571;&#1610; &#1571;&#1585;&#1590; &#1603;&#1575;&#1606;&#1578;&#1548; &#1608;&#1604;&#1603;&#1606; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1571;&#1602;&#1585;&#1617; &#1576;&#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1579;&#1605; &#1593;&#1575;&#1583;&#1575;&#1607; &#1608;&#1589;&#1583;&#1617; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606;&#1607;&#1548; &#1608;&#1603;&#1584;&#1604;&#1603; &#1605;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1571;&#1608;&#1579;&#1575;&#1606; &#1576;&#1593;&#1583;&#1605;&#1575; &#1593;&#1585;&#1601; &#1571;&#1606;&#1607; &#1583;&#1610;&#1606; &#1575;&#1604;&#1605;&#1588;&#1585;&#1603;&#1610;&#1606; &#1608;&#1586;&#1610;&#1606;&#1607; &#1604;&#1604;&#1606;&#1575;&#1587;&#1548; &#1601;&#1607;&#1584;&#1575; &#1575;&#1604;&#1584;&#1610; &#1571;&#1603;&#1601;&#1585;&#1607; &#1608;&#1603;&#1604; &#1593;&#1575;&#1604;&#1605; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607; &#1575;&#1604;&#1571;&#1585;&#1590; &#1610;&#1603;&#1601;&#1585; &#1607;&#1572;&#1604;&#1575;&#1569; &#1573;&#1604;&#1575;&#1617; &#1585;&#1580;&#1604;&#1575;&#1611; &#1605;&#1593;&#1575;&#1606;&#1583;&#1575;&#1611; &#1571;&#1608; &#1580;&#1575;&#1607;&#1604;&#1575;&#1611;". &#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; (3/33). &#1608;&#1602;&#1575;&#1604; &#1571;&#1610;&#1590;&#1575;&#1611;: "&#1608;&#1571;&#1605;&#1575; &#1605;&#1575; &#1584;&#1603;&#1585; &#1575;&#1604;&#1571;&#1593;&#1583;&#1575;&#1569; &#1593;&#1606;&#1610; &#1571;&#1606;&#1610; &#1571;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1592;&#1606; &#1608;&#1576;&#1575;&#1604;&#1605;&#1608;&#1575;&#1604;&#1575;&#1577; &#1571;&#1608; &#1571;&#1603;&#1601;&#1585; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1575;&#1604;&#1584;&#1610; &#1604;&#1605; &#1578;&#1602;&#1605; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1601;&#1607;&#1584;&#1575; &#1576;&#1607;&#1578;&#1575;&#1606; &#1593;&#1592;&#1610;&#1605; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1576;&#1607; &#1578;&#1606;&#1601;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1593;&#1606; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607;". &#1605;&#1580;&#1605;&#1608;&#1593; &#1605;&#1572;&#1604;&#1601;&#1575;&#1578; &#1575;&#1604;&#1588;&#1610;&#1582; (3/14).</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'> Shaykh al-Islam Muhammad bin Abd al-Wahhab (rahimahullaah) said:    <P>
<blockquote>And when it is the case that we do not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who worships the idol (i.e. tomb) which is on the grave of Abd al-Qadir, and the idol which is on the grave of Ahmad al-Badawi and their likes, due to their ignorance, and the absence of the one to notify them (of their opposition), then how could we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of  the one who does not associate partners with Allaah, when he does not emigrate to us and who does not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> and does not fight? "<b>Glory be to you (O Lord), this is a mighty slander</b>." (24:16). <i>Al-Durar al-Saniyyah (1/66)</i>.</blockquote>    <P>
And he also said:    <P>
<blockquote>Rather, we call Allaah to witness over what he knows from our hearts that whoever acts upon <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and frees himself from Shirk and its people, then he is a Muslim in whatever time and place (he maybe in). But we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who associates partners with Allaah in His Ilaayhiyyah (sole right of worship), after we have made clear to him the proof for the futility of Shirk. <i>Majmoo' Mu'allafaat al-Shaykh Muhammad bin Abd al-Wahhaab (3/34)</i>.</blockquote>    <P>
And he also said:    <P>
<blockquote>What has been mentioned to you that I  make generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> (of the masses), this is from the slanders of the enemies. Likewise, their saying that I say whoever follows the deen of Allaah and His Messenger whilst resident in his own land, this is not sufficient until he comes (emigrates) to me. This is also from slandder. Rather, the intent is for [a person] to follow the deen of Allaah and His Messenger in whichever land it may be. However, we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who affirmed the deen of Allaah and His Messenger, then showed enmity towards it and prevented the people from (following) it. Likewise the one whow worships idols (awthaan) after he came to know that it is the deen of the pagans, and who then beautified it to the people. This is the one that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of, and every scholar on the facce of the earth makes <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of (the likes of) these, except a stubborn opposer or an ignoramus. <i>Majmoo' Mu'allafaat al-Shaykh (3/33)</i>.</blockquote>    <P>
And he also said:    <P>
<blockquote>As for what the enemies have mentioned about me: That I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> on the basis of presumption, and on the basis of loyalty, or that I make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the ignorant person upon whom the proof has not been established, then this is a mighty slander. They desire to make the people flee from the deen of Allaah and His Messenger by it. <i>Majmoo' Mu'allafaat al-Shaykh (3/14)</i>.</blockquote>  </blockquote>    <P>
<blockquote><div class='arabic' dir='rtl' align='right'>&#1608;&#1602;&#1575;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1591;&#1610;&#1601; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1585;&#1581;&#1605;&#1606; &#1576;&#1606; &#1581;&#1587;&#1606; &#1570;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1601;&#1610; &#1603;&#1578;&#1575;&#1576; "&#1605;&#1606;&#1607;&#1575;&#1580; &#1575;&#1604;&#1578;&#1571;&#1587;&#1610;&#1587; &#1608;&#1575;&#1604;&#1578;&#1602;&#1583;&#1610;&#1587; &#1589;: 98-99": "&#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1605;&#1606; &#1571;&#1593;&#1592;&#1605; &#1575;&#1604;&#1606;&#1575;&#1587; &#1578;&#1608;&#1602;&#1601;&#1575;&#1611; &#1608;&#1573;&#1581;&#1580;&#1575;&#1605;&#1575;&#1611; &#1593;&#1606; &#1573;&#1591;&#1604;&#1575;&#1602; &#1575;&#1604;&#1603;&#1601;&#1585;&#1548;&#1581;&#1578;&#1609; &#1571;&#1606;&#1607; &#1604;&#1605; &#1610;&#1580;&#1586;&#1605; &#1576;&#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1575;&#1604;&#1584;&#1610; &#1610;&#1583;&#1593;&#1608; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607;&#1605; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1578;&#1610;&#1587;&#1585; &#1604;&#1607; &#1605;&#1606; &#1610;&#1606;&#1589;&#1581;&#1607; &#1608;&#1610;&#1576;&#1604;&#1594;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1575;&#1604;&#1578;&#1610; &#1610;&#1603;&#1601;&#1585; &#1578;&#1575;&#1585;&#1603;&#1607;&#1575;&#1548; &#1602;&#1575;&#1604; &#1601;&#1610; &#1576;&#1593;&#1590; &#1585;&#1587;&#1575;&#1574;&#1604;&#1607;: "&#1608;&#1573;&#1584;&#1575; &#1603;&#1606;&#1575; &#1604;&#1575; &#1606;&#1602;&#1575;&#1578;&#1604; &#1605;&#1606; &#1610;&#1593;&#1576;&#1583; &#1602;&#1576;&#1617;&#1577; &#1575;&#1604;&#1603;&#1608;&#1575;&#1586;&#1548; &#1581;&#1578;&#1609; &#1606;&#1578;&#1602;&#1583;&#1605; &#1576;&#1583;&#1593;&#1608;&#1578;&#1607; &#1573;&#1604;&#1609; &#1573;&#1582;&#1604;&#1575;&#1589; &#1575;&#1604;&#1583;&#1610;&#1606; &#1604;&#1604;&#1607;&#1548; &#1601;&#1603;&#1610;&#1601; &#1606;&#1603;&#1601;&#1585; &#1605;&#1606; &#1604;&#1605; &#1610;&#1607;&#1575;&#1580;&#1585; &#1573;&#1604;&#1610;&#1606;&#1575; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1605;&#1572;&#1605;&#1606;&#1575;&#1611; &#1605;&#1608;&#1581;&#1583;&#1575;&#1611;". &#1608;&#1602;&#1575;&#1604;: &#1608;&#1602;&#1583; &#1587;&#1574;&#1604; &#1593;&#1606; &#1605;&#1579;&#1604; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1580;&#1607;&#1575;&#1604;&#1548; &#1601;&#1602;&#1585;&#1585; &#1571;&#1606; &#1605;&#1606; &#1602;&#1575;&#1605;&#1578; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1608;&#1578;&#1571;&#1607;&#1604; &#1604;&#1605;&#1593;&#1585;&#1601;&#1578;&#1607;&#1575; &#1610;&#1603;&#1601;&#1585; &#1576;&#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585;".  &#1608;&#1602;&#1575;&#1604; &#1571;&#1610;&#1590;&#1575;&#1611; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; "&#1605;&#1589;&#1576;&#1575;&#1581; &#1575;&#1604;&#1592;&#1604;&#1575;&#1605; &#1589;:  499": "&#1601;&#1605;&#1606; &#1576;&#1604;&#1594;&#1578;&#1607; &#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1585;&#1587;&#1604; &#1573;&#1604;&#1609; &#1578;&#1608;&#1581;&#1610;&#1583; &#1575;&#1604;&#1604;&#1607; &#1608;&#1608;&#1580;&#1608;&#1576; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1604;&#1607;&#1548; &#1608;&#1601;&#1602;&#1607; &#1571;&#1606; &#1575;&#1604;&#1585;&#1587;&#1604; &#1580;&#1575;&#1569;&#1578; &#1576;&#1607;&#1584;&#1575; &#1604;&#1605; &#1610;&#1603;&#1606; &#1604;&#1607; &#1593;&#1584;&#1585; &#1601;&#1610; &#1605;&#1582;&#1575;&#1604;&#1601;&#1578;&#1607;&#1605; &#1608;&#1578;&#1585;&#1603; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1610;&#1580;&#1586;&#1605; &#1576;&#1578;&#1603;&#1601;&#1610;&#1585;&#1607; &#1573;&#1584;&#1575; &#1593;&#1576;&#1583; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607;&#1548; &#1608;&#1580;&#1593;&#1604; &#1605;&#1593;&#1607; &#1575;&#1604;&#1571;&#1606;&#1583;&#1575;&#1583; &#1608;&#1575;&#1604;&#1570;&#1604;&#1607;&#1577;&#1548; &#1608;&#1575;&#1604;&#1588;&#1610;&#1582; &#1608;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1604;&#1575; &#1610;&#1578;&#1608;&#1602;&#1601;&#1608;&#1606; &#1601;&#1610; &#1607;&#1584;&#1575;&#1548; &#1608;&#1588;&#1610;&#1582;&#1606;&#1575; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1602;&#1583; &#1602;&#1585;&#1617;&#1585; &#1607;&#1584;&#1575; &#1608;&#1576;&#1610;&#1606;&#1607; &#1608;&#1601;&#1575;&#1602;&#1575;&#1611; &#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1571;&#1605;&#1577; &#1608;&#1575;&#1602;&#1578;&#1583;&#1575;&#1569; &#1576;&#1607;&#1605; &#1608;&#1604;&#1605; &#1610;&#1603;&#1601;&#1585; &#1573;&#1604;&#1575;&#1617; &#1576;&#1593;&#1583; &#1602;&#1610;&#1575;&#1605; &#1575;&#1604;&#1581;&#1580;&#1577; &#1608;&#1592;&#1607;&#1608;&#1585; &#1575;&#1604;&#1583;&#1604;&#1610;&#1604; &#1581;&#1578;&#1609; &#1573;&#1606;&#1607; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1578;&#1608;&#1602;&#1601; &#1601;&#1610; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1605;&#1606; &#1593;&#1576;&#1575;&#1583; &#1575;&#1604;&#1602;&#1576;&#1608;&#1585; &#1573;&#1584;&#1575; &#1604;&#1605; &#1610;&#1578;&#1610;&#1587;&#1585; &#1604;&#1607; &#1605;&#1606; &#1610;&#1606;&#1576;&#1607;&#1607;&#1548; &#1608;&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1605;&#1585;&#1575;&#1583; &#1576;&#1602;&#1608;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;: &#1581;&#1578;&#1609; &#1610;&#1578;&#1576;&#1610;&#1606; &#1604;&#1607;&#1605; &#1605;&#1575; &#1580;&#1575;&#1569; &#1576;&#1607; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1601;&#1573;&#1584;&#1575; &#1581;&#1589;&#1604; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1601;&#1607;&#1605;&#1607; &#1575;&#1604;&#1605;&#1582;&#1575;&#1591;&#1576; &#1608;&#1610;&#1593;&#1602;&#1604;&#1607; &#1601;&#1602;&#1583; &#1578;&#1576;&#1610;&#1606; &#1604;&#1607;". &#1608;&#1602;&#1575;&#1604; &#1571;&#1610;&#1590;&#1575;&#1611; &#1601;&#1610; "&#1605;&#1589;&#1576;&#1575;&#1581; &#1575;&#1604;&#1592;&#1604;&#1575;&#1605; &#1589;: 516": "&#1608;&#1588;&#1610;&#1582;&#1606;&#1575; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1604;&#1605; &#1610;&#1603;&#1601;&#1585; &#1571;&#1581;&#1583;&#1575; &#1575;&#1576;&#1578;&#1583;&#1575;&#1569; &#1576;&#1605;&#1580;&#1585;&#1583; &#1601;&#1593;&#1604;&#1607; &#1608;&#1588;&#1585;&#1603;&#1607;&#1548; &#1576;&#1604; &#1610;&#1578;&#1608;&#1602;&#1601; &#1601;&#1610; &#1584;&#1604;&#1603; &#1581;&#1578;&#1609; &#1610;&#1593;&#1604;&#1605; &#1602;&#1610;&#1575;&#1605; &#1575;&#1604;&#1581;&#1580;&#1577; &#1575;&#1604;&#1578;&#1610; &#1610;&#1603;&#1601;&#1585; &#1578;&#1575;&#1585;&#1603;&#1607;&#1575;&#1548; &#1608;&#1607;&#1584;&#1575; &#1589;&#1585;&#1610;&#1581; &#1601;&#1610; &#1603;&#1604;&#1575;&#1605;&#1607; &#1601;&#1610; &#1594;&#1610;&#1585; &#1605;&#1608;&#1590;&#1593;&#1548; &#1608;&#1585;&#1587;&#1575;&#1574;&#1604;&#1607; &#1601;&#1610; &#1584;&#1604;&#1603; &#1605;&#1593;&#1585;&#1608;&#1601;&#1577;".</div></blockquote>     <blockquote class='quote'><img src='images/quote-start.gif'>And Shaykh Abd al-Lateef Abd al-Rahman bin Hasan Aal al-Shaykh said in his book "Minhaaj al-Ta'sees wal-Taqdees" (pp. 98-99):    <P>
<blockquote>And Shaykh Muhammad (rahimahullaah) is from the greatest of people in withholding and abstaining from applying (the ruling of) disbelief. To such a degree that he was not resolute in the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the igorant person - from the people (attached) to the graves or other than them -  who calls upon other than Allaah (in the case) where one who could advise them and make such proof reach them - the abandoner of which would fall into disbelief - was not readily available to him. He said in one of his rasaa'il (letters):    <P>
<blockquote>And when we do not fight against the one who worships the shrine of al-Kawaaz until we advance calling him to make the religion sincerely and purely for Allaah (alone), then how can we make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one who did not emigrate to us despite being a believing monotheist.</blockquote>    <P>
And he had been asked about the likes of these ignorant people and he affirmed that the one upon whom the proof had been established and is capable of knowing the proof, he is the who disbelieves by worshipping the graves.  </blockquote>    <P>
And he (rahimahullaah) also said in Misbaah al-Dhalaam (p. 499):    <P>
<blockquote>The one to whom the call of the Messengers to the <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> of Allaah and the obligation of submitting to it has reached and he understands that the Messengers came with this, he does not have an excuse in opposing them and abandoning the worship of Allaah (alone). Resolution is made in the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of such a person when he worships other than Allaah and sets up rivals and deities alongside Him. And the Shaykh (Ibn Abd al-Wahhaab) and others from the Muslims do not withhold from the likes of this one, and our Shaykh (rahimahullaah) has affirmed this and explained it in agreement with the scholars of the Umma, and in following them (in this matter). And he did not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> except after the establishment of the proof and the evidence becoming plain and apparent, until he (rahimahullaah) even withheld from the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the ignorant person from the worshippers of the graves when one who could notify him (of his error) was not readily available to him. This is the intent of the saying of Shaykh al-Islaam Ibn Taymiyyah (rahimahullaah), "... until it is made clear to them what the Messenger (sallallaahu alayhi wasallam) came with, so when this clarification is attained which the one being addressed understands and grasps, then it has been made clear to him..."</blockquote>    <P>
And he also said in Misbaah al-Dhalaam (p. 516):    <P>
<blockquote>And our Shaykh (rahimahullaah) did not make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of anyone through the mere act (of that person) and his (act) of shirk (alone). Rather, he withheld from that until he [the one falling into such an act] knew the establishment of the proof whose abandoner becomes a disbeliever. This is very clear in his speech in more than one place and his written letters in that regard are well known.</blockquote></blockquote>    <P>
<blockquote><div class='arabic' dir='rtl' align='right'>&#1608;&#1573;&#1606;&#1605;&#1575; &#1571;&#1601;&#1590;&#1578; &#1576;&#1584;&#1603;&#1585; &#1575;&#1604;&#1606;&#1602;&#1608;&#1604; &#1593;&#1606; &#1588;&#1610;&#1582; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1601;&#1610; &#1578;&#1602;&#1585;&#1610;&#1585; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1587;&#1571;&#1604;&#1577;&#1548; &#1608;&#1607;&#1610; &#1571;&#1606; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1593;&#1610;&#1606; &#1575;&#1604;&#1584;&#1610; &#1608;&#1602;&#1593; &#1601;&#1610; &#1575;&#1604;&#1588;&#1585;&#1603; &#1601;&#1610; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1580;&#1607;&#1604;&#1607;&#1548; &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1576;&#1593;&#1583; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1604;&#1607; &#1608;&#1573;&#1602;&#1575;&#1605;&#1577; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1604;&#1575; &#1602;&#1576;&#1604; &#1584;&#1604;&#1603;&#1548; &#1604;&#1571;&#1606; &#1605;&#1606; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1606; &#1608;&#1575;&#1604;&#1581;&#1575;&#1602;&#1583;&#1610;&#1606; &#1593;&#1604;&#1610;&#1607; &#1608;&#1593;&#1604;&#1609; &#1583;&#1593;&#1608;&#1578;&#1607;&#1548; &#1575;&#1604;&#1605;&#1576;&#1606;&#1610;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577;&#1548; &#1608;&#1605;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1610;&#1607; &#1587;&#1604;&#1601; &#1575;&#1604;&#1571;&#1605;&#1617;&#1577;&#1548; &#1605;&#1606; &#1610;&#1588;&#1606;&#1593; &#1593;&#1604;&#1610;&#1607; &#1608;&#1610;&#1606;&#1601;&#1617;&#1585; &#1605;&#1606; &#1583;&#1593;&#1608;&#1578;&#1607;&#1548; &#1576;&#1585;&#1605;&#1610;&#1607; &#1576;&#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585; &#1576;&#1575;&#1604;&#1593;&#1605;&#1608;&#1605;&#1548; &#1608;&#1607;&#1608; &#1573;&#1606;&#1605;&#1575; &#1610;&#1603;&#1601;&#1585; &#1605;&#1606; &#1602;&#1575;&#1605;&#1578; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577;&#1548; &#1608;&#1576;&#1575;&#1606;&#1578; &#1604;&#1607; &#1575;&#1604;&#1605;&#1581;&#1580;&#1577;&#1548; &#1608;&#1604;&#1571;&#1606; &#1606;&#1601;&#1585;&#1575;&#1611; &#1610;&#1587;&#1610;&#1585;&#1575;&#1611; &#1605;&#1606; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577; &#1601;&#1610;&#1605;&#1575; &#1593;&#1604;&#1605;&#1578; &#1610;&#1593;&#1610;&#1576;&#1608;&#1606; &#1593;&#1604;&#1609; &#1605;&#1606; &#1610;&#1602;&#1585;&#1617;&#1585; &#1584;&#1604;&#1603; &#1608;&#1607;&#1608; &#1593;&#1610;&#1576; &#1604;&#1605;&#1575; &#1602;&#1585;&#1617;&#1585;&#1607; &#1588;&#1610;&#1582;&#1575; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1548; &#1575;&#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1608;&#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1575; &#1605;&#1606; &#1571;&#1607;&#1604;  &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; &#1601;&#1573;&#1606; &#1575;&#1604;&#1582;&#1591;&#1571; &#1601;&#1610; &#1575;&#1604;&#1593;&#1601;&#1608; &#1601;&#1610; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1575;&#1604;&#1605;&#1588;&#1578;&#1576;&#1607;&#1577;&#1548; &#1582;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1582;&#1591;&#1571; &#1601;&#1610; &#1575;&#1604;&#1593;&#1602;&#1608;&#1576;&#1577;&#1548; &#1608;&#1607;&#1605; &#1601;&#1610; &#1593;&#1610;&#1576;&#1607;&#1605; &#1575;&#1604;&#1602;&#1608;&#1604; &#1575;&#1604;&#1584;&#1610; &#1602;&#1585;&#1617;&#1585;&#1607; &#1575;&#1604;&#1588;&#1610;&#1582;&#1575;&#1606; &#1608;&#1575;&#1604;&#1581;&#1585;&#1589; &#1593;&#1604;&#1609; &#1582;&#1604;&#1575;&#1601;&#1607; &#1610;&#1601;&#1587;&#1581;&#1608;&#1606; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604; &#1604;&#1604;&#1605;&#1578;&#1585;&#1576;&#1589;&#1610;&#1606; &#1576;&#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1589;&#1591;&#1575;&#1583;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1575;&#1604;&#1593;&#1603;&#1585;&#1548; &#1601;&#1610;&#1585;&#1583;&#1617;&#1583;&#1608;&#1606; &#1589;&#1583;&#1609; &#1606;&#1593;&#1610;&#1602; &#1571;&#1593;&#1583;&#1575;&#1569; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1608;&#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1586;&#1593;&#1605;&#1608;&#1606; &#1571;&#1606; &#1578;&#1591;&#1585;&#1601; &#1605;&#1606; &#1575;&#1576;&#1578;&#1604;&#1610; &#1576;&#1575;&#1604;&#1578;&#1601;&#1580;&#1610;&#1585; &#1608;&#1575;&#1604;&#1578;&#1583;&#1605;&#1610;&#1585;&#1548; &#1585;&#1575;&#1580;&#1593; &#1573;&#1604;&#1609; &#1583;&#1585;&#1575;&#1587;&#1577; &#1605;&#1606;&#1575;&#1607;&#1580; &#1575;&#1604;&#1578;&#1593;&#1604;&#1610;&#1605; &#1575;&#1604;&#1605;&#1576;&#1606;&#1610;&#1577; &#1593;&#1604;&#1609; &#1603;&#1578;&#1576; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1608;&#1607;&#1575;&#1576; &#1608;&#1594;&#1610;&#1585;&#1607; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577;&#1548; &#1608;&#1607;&#1608; &#1576;&#1607;&#1578; &#1608;&#1586;&#1608;&#1585; &#1605;&#1605;&#1606; &#1575;&#1601;&#1578;&#1585;&#1575;&#1607; &#1571;&#1608; &#1585;&#1583;&#1617;&#1583;&#1607;&#1548; &#1601;&#1573;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1585;&#1583;&#1617;&#1583;&#1608;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1593;&#1610;&#1602; &#1605;&#1606; &#1571;&#1607;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1576;&#1604;&#1575;&#1583;&#1548; &#1602;&#1583; &#1583;&#1585;&#1587;&#1608;&#1575; &#1603;&#1605;&#1575; &#1583;&#1585;&#1587; &#1594;&#1610;&#1585;&#1607;&#1605; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1606;&#1575;&#1607;&#1580;&#1548; &#1608;&#1604;&#1605; &#1610;&#1581;&#1589;&#1604; &#1604;&#1607;&#1605; &#1590;&#1585;&#1585; &#1605;&#1606;&#1607;&#1575; &#1576;&#1604; &#1581;&#1589;&#1604; &#1575;&#1604;&#1606;&#1601;&#1593; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1605;&#1606;&#1607;&#1575; &#1604;&#1603;&#1604; &#1605;&#1606; &#1588;&#1575;&#1569; &#1575;&#1604;&#1604;&#1607; &#1607;&#1583;&#1575;&#1610;&#1578;&#1607; &#1608;&#1578;&#1608;&#1601;&#1610;&#1602;&#1607;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1581;&#1589;&#1604; &#1575;&#1604;&#1578;&#1591;&#1585;&#1601; &#1605;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1605;&#1578;&#1591;&#1585;&#1601;&#1610;&#1606; &#1604;&#1601;&#1607;&#1608;&#1605;&#1607;&#1605; &#1575;&#1604;&#1582;&#1575;&#1591;&#1574;&#1577; &#1575;&#1604;&#1578;&#1610; &#1588;&#1584;&#1617;&#1608;&#1575; &#1576;&#1607;&#1575; &#1608;&#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1606; &#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1602;&#1583;&#1608;&#1578;&#1607;&#1605; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1575;&#1604;&#1584;&#1610;&#1606; &#1588;&#1584;&#1617;&#1608;&#1575; &#1608;&#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1606;&#1578;&#1610;&#1580;&#1577; &#1604;&#1601;&#1607;&#1608;&#1605;&#1607;&#1605; &#1575;&#1604;&#1582;&#1575;&#1591;&#1574;&#1577;&#1548; &#1608;&#1604;&#1603;&#1604; &#1602;&#1608;&#1605; &#1608;&#1575;&#1585;&#1579;&#1548; &#1608;&#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1605;&#1587;&#1578;&#1593;&#1575;&#1606;.</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I have taken such liberty in mentioning the statements from Shaykh al-Islaam Muhammad bin Abd al-Wahhaab in corroboration of this matter, which is that the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of a specific person who has fallen into shirk in worship due to his ignorance, it is only after clarification is made to him and the proof being established, not before that. This is because from the ignoramuses and the envious against him and his da'wah which was based upon the Book, the Sunnah and what the Salaf were upon, was he who would condemn him and make others flee from his da'wah by accusing him of making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Muslims, and making generalized <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a>. But he would only make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the one upon whom the proof had been established and the clear path had been made clear to him. Also because a small faction of the students of knowledge from Ahl al-Sunnah, from what I know, they find fault with those who affirm this, and this (in reality) is finding fault against what the two Shaykhs of Islaam, Ibn Taymiyyah and Muhammad bin Abd al-Wahhaab have corroborated, as well as others from the people of knowledge. And alongside that, making an error in forgiving in unclear matters is better than making an error in punishment. And in finding fault with what the two Shaykhs have affirmed and being eager in opposing it they open up the space for those who lie in wait for Ahl al-Sunnah, those who stir in murky waters, and so they echo the scream of the enemies of Islaam and the Muslims, those who claim that the extremism of he who has been put to trial with bombings and destruction returns back to the studying the curriculum of education which is based upon the books of Shaykh Muhammad bin Abd al-Wahhaab and others from Ahl al-Sunnah. And this is a slander and false saying from the one who invented it or repeated it. For those who repeat this scream from the people of this land, they have studied from these methodologies just as others have studied, yet no such harm has come from them, rather great benefit (to the society) has come from them to he whom Allaah has willed to grant guidance and success. But this extremism only occurred from those extremists due to their erroneous understandings by which they departed and exited from the body of the Muslims, and their leaders in that are the Khawaarij (of old) who departed and revolted against the Companions as a result of their erroneous understandings. And to every people is an inheritor (to inherit their ways from them), and from Allaah is aid sought.</blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/xyjjc-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5---on-those-who-worship-the-righteous.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5) - On Those Who Worship the Righteous Upon Ignorance</a><BR>
https://www.manhaj.com/manhaj/?xyjjc<BR>

<li><a href="articles/zmhyr-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen-2.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen (2)</a><BR>
https://www.manhaj.com/manhaj/?zmhyr<BR>

<li><a href="articles/uufmf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5)</a><BR>
https://www.manhaj.com/manhaj/?uufmf<BR>

<li><a href="articles/wvnjp-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-aziz-bin-baz.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Aziz Bin Baz</a><BR>
https://www.manhaj.com/manhaj/?wvnjp<BR>

<li><a href="articles/illhh-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-4---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (4) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?illhh<BR>

<li><a href="articles/gzrsz-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-3---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (3) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?gzrsz<BR>

<li><a href="articles/dkhtd-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-2.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (2) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?dkhtd<BR>

<li><a href="articles/obkwf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (1)</a><BR>
https://www.manhaj.com/manhaj/?obkwf<BR>

<li><a href="articles/uncnb-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-muhsin-al-abbaad.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?uncnb<BR>

<li><a href="articles/ecksy-takfir-and-the-excuse-of-ignorance-shaykh-rabee-bin-haadee.html">Takfir and the Excuse of Ignorance: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?ecksy<BR>

<li><a href="articles/wwqny-takfir-and-the-excuse-of-ignorance-shaykh-muhammad-bin-abd-al-wahhaab.html">Takfir and the Excuse of Ignorance: Shaykh Muhammad bin Abd al-Wahhaab</a><BR>
https://www.manhaj.com/manhaj/?wwqny<BR>

<li><a href="articles/xwouo-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?xwouo<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?uncnb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:18 GMT -->
</html>


