

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?xyzse by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Shaykh Ibn Uthaymeen: Errors in Manhaj Occur Due to Underlying Errors in Aqidah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ibn Uthaymeen: Errors in Manhaj Occur Due to Underlying Errors in Aqidah</span><BR>
Thursday, July 01 2010 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>The Shaykh replied to a question regarding aqidah (creed) and manhaj (methodology) and whether the Salaf used to distinguish between them:    <P>
<div class='arabic' dir='rtl' align='right'>&#1575;&#1604;&#1605;&#1606;&#1607;&#1580; - &#1576;&#1575;&#1585;&#1603; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610;&#1603; - &#1605;&#1576;&#1606;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577;&#1548; &#1601;&#1605;&#1606; &#1603;&#1575;&#1606;&#1578; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1587;&#1604;&#1610;&#1605;&#1577;&#1563; &#1601;&#1587;&#1610;&#1603;&#1608;&#1606; &#1605;&#1606;&#1607;&#1580;&#1607; &#1587;&#1604;&#1610;&#1605;&#1575;&#1611; &#1576;&#1604;&#1575; &#1588;&#1603;&#1563; &#1604;&#1571;&#1606; &#1575;&#1604;&#1606;&#1576;&#1610;- &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; - &#1604;&#1605;&#1575; &#1584;&#1603;&#1585; &#1575;&#1601;&#1578;&#1585;&#1575;&#1602; &#1575;&#1604;&#1571;&#1605;&#1577; &#1593;&#1604;&#1609; &#1579;&#1604;&#1575;&#1579; &#1608;&#1587;&#1576;&#1593;&#1610;&#1606; &#1601;&#1585;&#1602;&#1577; &#1603;&#1604;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; &#1573;&#1604;&#1575; &#1608;&#1575;&#1581;&#1583;&#1577;&#1548; &#1602;&#1575;&#1604;&#1608;&#1575;: &#1605;&#1614;&#1606; &#1607;&#1610; &#1610;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607;&#1567; &#1602;&#1575;&#1604;: << &#1605;&#1606; &#1603;&#1575;&#1606; &#1593;&#1604;&#1609; &#1605;&#1579;&#1604;&#1605;&#1575; &#1571;&#1606;&#1575; &#1593;&#1604;&#1610;&#1607; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1610; >> &#1548; &#1601;&#1602;&#1608;&#1604;&#1607;: << &#1593;&#1604;&#1609; &#1605;&#1579;&#1604;&#1605;&#1575; &#1571;&#1606;&#1575; &#1593;&#1604;&#1610;&#1607; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1610; >> &#1610;&#1593;&#1606;&#1610; &#1601;&#1610; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1608;&#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1608;&#1575;&#1604;&#1593;&#1605;&#1604; &#1608;&#1603;&#1604; &#1588;&#1610;&#1569;&#1548; &#1608;&#1604;&#1575; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1610;&#1582;&#1578;&#1604;&#1601; &#1607;&#1584;&#1575; &#1608;&#1607;&#1584;&#1575;&#1548; &#1601;&#1605;&#1579;&#1604;&#1575;&#1611; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606;&#1610;&#1608;&#1606; &#1608;&#1575;&#1604;&#1578;&#1576;&#1604;&#1610;&#1594;&#1610;&#1608;&#1606; &#1608;&#1575;&#1604;&#1573;&#1589;&#1604;&#1575;&#1581;&#1610;&#1608;&#1606; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605;&#1548; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1605;&#1606;&#1607;&#1580;&#1607;&#1605; &#1604;&#1575; &#1610;&#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1588;&#1585;&#1610;&#1593;&#1577;&#1563; &#1601;&#1604;&#1575; &#1576;&#1571;&#1587; &#1576;&#1607;&#1548; &#1608;&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1610;&#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1588;&#1585;&#1610;&#1593;&#1577;&#1563; &#1601;&#1573;&#1606;&#1607; &#1604;&#1575; &#1576;&#1583; &#1571;&#1606; &#1610;&#1589;&#1583;&#1585; &#1593;&#1606; &#1593;&#1602;&#1610;&#1583;&#1577;&#1563; &#1604;&#1571;&#1606; &#1603;&#1604; &#1593;&#1605;&#1604; &#1604;&#1607; &#1606;&#1610;&#1577;&#1548; &#1601;&#1573;&#1584;&#1575; &#1575;&#1578;&#1582;&#1584; &#1573;&#1606;&#1587;&#1575;&#1606; &#1605;&#1606;&#1607;&#1580;&#1575;&#1611; &#1605;&#1582;&#1575;&#1604;&#1601;&#1575;&#1611; &#1604;&#1605;&#1606;&#1607;&#1580; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; - &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605;- &#1608;&#1582;&#1604;&#1601;&#1575;&#1574;&#1607; &#1575;&#1604;&#1585;&#1575;&#1588;&#1583;&#1610;&#1606;&#1563; &#1601;&#1605;&#1593;&#1606;&#1575;&#1607;: &#1571;&#1606;&#1617;&#1614; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607; &#1594;&#1610;&#1585; &#1587;&#1604;&#1610;&#1605;&#1577;&#1548; &#1608;&#1573;&#1604;&#1575;&#1617;&#1614; &#1605;&#1578;&#1609; &#1587;&#1604;&#1605;&#1578; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1587;&#1604;&#1605; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Manhaj - may Allaah bless you - is built upon the aqidah, so whoever's aqidah is sound, then his manhaj will be sound without doubt, because the Prophet (sallallaahu alayhi wasallam), when he mentioned the splittign of the Ummah into seventy-three <a href='tags/sects.html' class='tagLink'><font class='tagLink'>sects</font></a>, all of them in the Fire except for one, they (the Companions) said, "Which one is it O Messenger of Allaah?", and he replied:    <P>
<blockquote><b>Whoever is upon the like of I and my Companions are upon. </b></blockquote>    <P>
So his saying, "<i>Whoever is upon the like of I and my Companions are upon</i>", meaning in aqidah and in manhaj and in action, and in everything. And it is not possible for this (i.e. aqidah) and this (i.e. manhaj) to be divergent.     <P>
So for example, the Ikhwanis and Tablighis and Islahis and other than them, if their manhaj does not oppose the Sharee'ah, then there is no problem in it, and if it opposes the Sharee'ah, then it  necessarily arises from (opposition in the) aqidah, because every action has an intention, <b>and when a person takes a manhaj that opposes the manhaj of the Messenger (alayhis salaatu was salaam), and his rightly-guided Caliphs, then its meaning is that his aqidah is not sound. Otherwise, when the aqidah is sound, the manhaj too will be sound</b>. </blockquote>    <P>
<b>Source:</b> Cassette: <i>Liqaa al-Baab al-Maftooh</i> (no. 128), also <a href=http://www.sahab.net/forums/showthread.php?t=378446>see here</a>.    <P>
As for the manhaj of the Tabligh and Ikhwan and others, then the Scholars of Ahl us-Sunnah have pointed out thoroughly their errors in their aqidah, their understanding of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, and their methodologies in da'wah, and they have entered them into the ranks of the seventy-two <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a> threatened with Hellfire in the authentic texts.     <P>
Compare the above with what has been said by Shaykh <a href='tags/ubayd-al-jaabiree.html' class='tagLink'><font class='tagLink'>Ubayd al-Jaabiree</font></a> (hafidhahullaah) - <a href=index4ac0.html?otddj>which is documented in full here</a> - as occurs in the cassette (<span class='arb' dir='rtl'>&#1575;&#1604;&#1573;&#1610;&#1590;&#1575;&#1581; &#1608;&#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1601;&#1610; &#1603;&#1588;&#1601; &#1576;&#1593;&#1590; &#1591;&#1585;&#1575;&#1574;&#1602; &#1601;&#1585;&#1602;&#1577; &#1575;&#1604;&#1573;&#1582;&#1608;&#1575;&#1606; </span>):    <P>
<div class='arabic' dir='rtl' align='right'>&#1608;&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1572;&#1604;&#1601; &#1605;&#1606; &#1607;&#1584;&#1610;&#1606;: &#1589;&#1581;&#1577; &#1575;&#1604;&#1605;&#1593;&#1578;&#1602;&#1583;&#1548; &#1608;&#1587;&#1604;&#1575;&#1605;&#1577; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; &#1608;&#1587;&#1583;&#1575;&#1583;&#1607;&#1548; &#1601;&#1604;&#1575; &#1610;&#1606;&#1601;&#1603; &#1571;&#1581;&#1583;&#1607;&#1605;&#1575; &#1593;&#1606; &#1575;&#1604;&#1570;&#1582;&#1585;&#1548; &#1601;&#1605;&#1606; &#1601;&#1587;&#1583; &#1605;&#1606;&#1607;&#1580;&#1607; &#1563; &#1601;&#1579;&#1602;&#1608;&#1575; &#1571;&#1606; &#1607;&#1584;&#1575; &#1606;&#1575;&#1576;&#1593; &#1605;&#1606; &#1601;&#1587;&#1575;&#1583; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607;&#1548; &#1601;&#1573;&#1584;&#1575; &#1575;&#1587;&#1578;&#1602;&#1575;&#1605;&#1578; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1580;&#1607; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581;&#1563; &#1575;&#1587;&#1578;&#1602;&#1575;&#1605; &#1603;&#1584;&#1604;&#1603; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And Islaam is composed of these two: correctness in belief and soundness in manhaj (methodology), and its uprightness. One of them does not separate from the other. <b>Thus, whoever's manhaj is corrupt, then have trust that it springs from corruption in his aqidah. So when the aqidah is upright upon the correct manner, then the manhaj will also be upright</b>.</blockquote>   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/otddj-shaykh-ubayd-al-jaabiree-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Ubayd al-Jaabiree on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?otddj<BR>

<li><a href="articles/vnbnh-shaykh-saalih-al-fawzaan-on-differentiating-between-aqidah-and-manhaj.html">Shaykh Saalih al-Fawzaan on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?vnbnh<BR>

<li><a href="articles/xyzse-shaykh-ibn-uthaymeen-errors-in-manhaj-occur-due-to-underlying-errors-in-aqidah.html">Shaykh Ibn Uthaymeen: Errors in Manhaj Occur Due to Underlying Errors in Aqidah</a><BR>
https://www.manhaj.com/manhaj/?xyzse<BR>

<li><a href="articles/hzsbd-the-permanent-committee-on-differentiating-between-aqidah-and-manhaj.html">The Permanent Committee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?hzsbd<BR>

<li><a href="articles/lvzvm-shaykh-al-albaanee-on-differentiating-between-aqidah-and-manhaj.html">Shaykh al-Albaanee on Differentiating Between Aqidah and Manhaj</a><BR>
https://www.manhaj.com/manhaj/?lvzvm<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?xyzse by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


