

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?iknhb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</span><BR>
Friday, October 04 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>Following the role of Ahl al-Sunnah in the West of conveying the speech of the Scholars regarding certain figureheads who went astray, the followers of many of these figureheads spread doubts about some of the callers in the West, with respect to teaching and giving da'wah, claiming that a person must have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> to teach, or he  must have graduated from an institution and so on. <b>However, the reality of the matter is that those whom they target in this way actually have  connections with the Scholars, they travel to them, and take knowledge from them in aqidah, manhaj and fiqh, even if they have not formally studied in an institution, or graduated or have a specific tazkiyah</b>. The real reason for these doubts is to undermine what the callers do in the West (in addition to calling to the Sunnah) of warning from doubts, innovations and desires and warning from the people who are upon them or promote them. The articles in these series will shed light on this matter and repel the doubts spread. No one article in this series should be read in isolation as it is possible for <u>a person with ulterior motives</u> to utilize some of these fatwas from the scholars to justify isolation and separation away from the main body of Salafis in that land and from their centres and mosques with the claim that everybody has the green light to teach, and so some of them teach in the mosques and centres of the hizbees and others teach in their homes (often secretly) whilst spreading poison that aims to isolate people from the students of knowledge. Rather, all the statements of all the Shaykhs <b>should be put together and understood collectively</b> to get a clearer picture of this whole affair. This is because there are generalizations in some fatwas, clarifications in others, important minor details in others, and contexts in some fatwas not found in others. All of this should be put together to get a full, comprehensive picture. <u>Alongside the clarifications in these articles</u>, it should be still be stressed that seeking knowledge from the Scholars, by travelling to them and sitting in their lessons is of utmost importance and should not be neglected as it is <u>the primary route</u> of seeking knowledge. And for those who are unable to do this, <b>then they should take from the students of knowledge in their lands, those who have connections with the Scholars, have studied with them and take from them.</b> So they should attend their lessons, in the Salafi mosques and centres, and any issues that arise such as requiring a fatwa, or removal of a <i>shubhah</i> or clarification in an issue of knowledge, then those students of knowledge can return these questions to the Scholars on behalf of the people of that land if the answer is not already known.     <P>
Here are links to all articles so far for easy reference:     <P>
<b>Shaykh Abd al-Muhsin al-Abbaad</b> (<a href=index67d0.html?fpjyl>see here</a>)  <b>Shaykh Zayd al-Madkhali</b> (<a href=index292c.html?xkdrv>see here</a>)  <b>Shaykh Muhammad bin Haadee</b> (<a href=index7c01.html?rqltx>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5b8a.html?pdziw>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index4f73.html?xkjsh>see here</a>)   <b>Shaykh Ubayd al-Jaabiree</b> (<a href=index3c84.html?laknb>see here</a>)   <b>Shaykh Abdullah al-Ghudayan</b> (<a href=indexbaf0.html?cajxz>see here</a>)  <b>Shaykh Rabee bin Haadee</b> (<a href=indexa1a5.html?iknhb>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5ea5.html?ccblo>see here</a>)  <b>Shaykh Ahmad Bazmul</b> (<a href=indexd377.html?ibtpx>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index3ed6.html?aninc>see here</a>).    <P>
.    <P>
<!---The bottom line is that knowledge can be sought from books and cassettes where it is not possible to take it directly from the scholars, though this is a longer and more burdensome route than taking it from the scholars directly. And it is not a condition that a person  must have a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar prior to teaching or giving da'wah. However, a person must know his limit and capability and not transgress it and not speak about matters he does not know and he must also seek to understand thoroughly that which he conveys so that where explanation is required he is able to explain that knowledge, and further, he must only resort to books of trusted, deeply-rooted scholars. <b>In all cases, the seeking of knowledge from the scholars directly is the quickest,  easiest route as it allows discussion and for clarifications to be made</b>. Whether a person is fit to convey and teach is known by two ways, either a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar or by it being it well known by the people of his land that he has knowledge, understanding and ability. //--->  </blockquote></div> <P> 


<p>Shaykh Rabee' bin Haadee was asked the following question as occurs in the 2nd cassette in the series (<span class='arb' dir='rtl'>&#1575;&#1604;&#1580;&#1608;&#1575;&#1576; &#1575;&#1604;&#1603;&#1575;&#1601;&#1610; &#1604;&#1605;&#1606; &#1587;&#1571;&#1604; &#1593;&#1606; &#1575;&#1604;&#1583;&#1608;&#1575;&#1569; &#1575;&#1604;&#1588;&#1575;&#1601;&#1610;</span>), starting from 9m:15s onwards:    <P>
<div class='arabic' dir='rtl' align='right'>&#1605;&#1578;&#1609; &#1610;&#1581;&#1602; &#1604;&#1591;&#1575;&#1604;&#1576; &#1575;&#1604;&#1593;&#1604;&#1605; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1607;&#1584;&#1575; &#1605;&#1575; &#1578;&#1585;&#1580;&#1581; &#1604;&#1610; &#1571;&#1608; &#1607;&#1584;&#1575; &#1605;&#1575; &#1571;&#1593;&#1578;&#1602;&#1583;&#1607; &#1608;&#1605;&#1578;&#1609; &#1610;&#1587;&#1578;&#1581;&#1602; &#1575;&#1606; &#1610;&#1587;&#1578;&#1602;&#1604; &#1576;&#1581;&#1604;&#1602;&#1577; &#1578;&#1583;&#1585;&#1610;&#1587; &#1601;&#1603;&#1579;&#1610;&#1585; &#1605;&#1606; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1610;&#1578;&#1587;&#1585;&#1593;&#1608;&#1606; &#1575;&#1604;&#1609; &#1578;&#1589;&#1583;&#1585; &#1575;&#1604;&#1605;&#1580;&#1575;&#1604;&#1587; &#1601;&#1605;&#1575; &#1606;&#1589;&#1610;&#1581;&#1578;&#1603;&#1605;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>When is it right for a student of knowledge to say, "This is what appears most correct to me" or "This is what I believe" and when does he deserve to give circles of teaching independently, for many youth hasten to put themselves forward in gatherings (to teach), so what is your advice?</blockquote>    <P>
The Shaykh responded:    <P>
<div class='arabic' dir='rtl' align='right'>&#1606;&#1589;&#1610;&#1581;&#1578;&#1610; &#1604;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1587;&#1604;&#1601;&#1610; &#1575;&#1606; &#1610;&#1588;&#1605;&#1585;&#1608;&#1575; &#1593;&#1604;&#1609; &#1587;&#1575;&#1593;&#1583; &#1575;&#1604;&#1580;&#1583; &#1601;&#1610; &#1578;&#1581;&#1589;&#1610;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608; &#1610;&#1578;&#1593;&#1604;&#1605;&#1608;&#1575; &#1608; &#1604;&#1603;&#1606; &#1575;&#1584;&#1575; &#1603;&#1575;&#1606; &#1601;&#1610; &#1576;&#1604;&#1583; &#1580;&#1607;&#1604;&#1575;&#1569; &#1608; &#1604;&#1610;&#1587; &#1601;&#1610;&#1607;&#1575; &#1593;&#1604;&#1605;&#1575;&#1569; &#1608; &#1601;&#1610;&#1607;&#1605; &#1591;&#1575;&#1604;&#1576; &#1593;&#1604;&#1605; &#1610;&#1581;&#1578;&#1575;&#1580;&#1608;&#1606; &#1573;&#1604;&#1609; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1605;&#1606; &#1593;&#1604;&#1605;&#1607; &#1575;&#1604;&#1602;&#1604;&#1610;&#1604; &#1601;&#1571;&#1606;&#1575; &#1571;&#1585;&#1609; &#1571;&#1606; &#1610;&#1576;&#1584;&#1604; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1605;&#1606; &#1593;&#1604;&#1605; &#1608; &#1604;&#1575; &#1606;&#1593;&#1602;&#1583; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1593;&#1604;&#1609; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1584;&#1610; &#1610;&#1585;&#1609; &#1575;&#1604;&#1583;&#1606;&#1610;&#1575; &#1605;&#1592;&#1604;&#1605;&#1577; &#1576;&#1575;&#1604;&#1582;&#1585;&#1575;&#1601;&#1575;&#1578; &#1608; &#1575;&#1604;&#1580;&#1607;&#1604; &#1608; &#1575;&#1604;&#1588;&#1585;&#1603; &#1601;&#1606;&#1602;&#1608;&#1604; &#1604;&#1607; &#1604;&#1575; &#1578;&#1578;&#1589;&#1583;&#1585; &#1604;&#1578;&#1593;&#1604;&#1610;&#1605; &#1575;&#1604;&#1606;&#1575;&#1587; &#1573;&#1604;&#1575; &#1573;&#1584;&#1575; &#1576;&#1604;&#1594;&#1578; &#1583;&#1585;&#1580;&#1577; &#1576;&#1606; &#1578;&#1610;&#1605;&#1610;&#1577; &#1608; &#1571;&#1581;&#1605;&#1583; &#1576;&#1606; &#1581;&#1606;&#1576;&#1604;  &#1602;&#1575;&#1604; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609;: &#64831;&#1608;&#1614;&#1602;&#1614;&#1583;&#1618; &#1601;&#1614;&#1589;&#1614;&#1617;&#1604;&#1614; &#1604;&#1614;&#1603;&#1615;&#1605;&#1618; &#1605;&#1614;&#1575; &#1581;&#1614;&#1585;&#1614;&#1617;&#1605;&#1614; &#1593;&#1614;&#1604;&#1614;&#1610;&#1618;&#1603;&#1615;&#1605;&#1618; &#1573;&#1616;&#1604;&#1614;&#1617;&#1575; &#1605;&#1614;&#1575; &#1575;&#1590;&#1618;&#1591;&#1615;&#1585;&#1616;&#1585;&#1618;&#1578;&#1615;&#1605;&#1618; &#1573;&#1616;&#1604;&#1614;&#1610;&#1618;&#1607;&#1616;&#64830; [&#1575;&#1604;&#1571;&#1606;&#1593;&#1575;&#1605;:119].  &#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577; &#1578;&#1576;&#1610;&#1581; &#1575;&#1604;&#1605;&#1581;&#1592;&#1608;&#1585; &#1603;&#1605;&#1575; &#1610;&#1602;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1602;&#1575;&#1593;&#1583;&#1577; &#1575;&#1604;&#1588;&#1585;&#1593;&#1610;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>My advice to the Salafi youth is that they prepare themselves to strive (hard) in acquiring knowledge and that they learn. However, when they are in a land where there are ignorant people and there are no scholars (present), but there is a student of knowledge and (those people) are in need of the little knowledge he possesses, then I hold that he should offer what he has of knowledge. And we do not make binding the affairs upon the youth who sees the world darkened with deviations, ignorance and shirk such that we say to him, "<i>Do not put yourself forward to teach the people until  you have reached the level of Ibn Taymiyyah and Ahmad bin Hanbal</i>." Allaah, the Exalted, said, "<b>Allaah has made clear what He has made unlawful to you, except that which you are forced by way of compulsion</b>" (6:119). Necessity makes permissible what is otherwise prohibited as is said in the legislative principle.</blockquote>    <P>
The Shaykh continues:    <P>
<div class='arabic' dir='rtl' align='right'>&#1610;&#1593;&#1606;&#1610; &#1575;&#1584;&#1575; &#1603;&#1575;&#1606; &#1601;&#1610; &#1576;&#1575;&#1583;&#1610;&#1577; &#1610;&#1585;&#1609; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608; &#1610;&#1585;&#1609; &#1578;&#1585;&#1603; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1608;&#1607;&#1608; &#1610;&#1593;&#1604;&#1605; &#1605;&#1575;&#1607;&#1610; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1605;&#1575;&#1607;&#1610; &#1575;&#1604;&#1587;&#1606;&#1606; &#1608;&#1605;&#1575;&#1607;&#1610; &#1603;&#1584;&#1575; &#1610;&#1593;&#1604;&#1605; &#1576;&#1593;&#1590; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; :&#1610;&#1593;&#1604;&#1605;&#1607;&#1605; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1610;&#1593;&#1604;&#1605;&#1607;&#1605; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1578;&#1580;&#1608;&#1610;&#1583; &#1610;&#1583;&#1585;&#1587;&#1607;&#1605; &#1575;&#1604;&#1603;&#1578;&#1576; &#1575;&#1604;&#1578;&#1610; &#1583;&#1585;&#1587;&#1607;&#1575; &#1575;&#1604;&#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1577;&#1548; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583;&#1548; &#1601;&#1571;&#1606;&#1575; &#1604;&#1575; &#1571;&#1588;&#1580;&#1593; &#1591;&#1575;&#1604;&#1576; &#1575;&#1604;&#1593;&#1604;&#1605; &#1571;&#1606; &#1610;&#1606;&#1589;&#1576; &#1606;&#1601;&#1587;&#1607; &#1593;&#1575;&#1604;&#1605;&#1575;. &#1604;&#1575; &#1608;&#1575;&#1606;&#1605;&#1575; &#1573;&#1584;&#1575; &#1571;&#1604;&#1580;&#1571; &#1608;&#1604;&#1575; &#1610;&#1608;&#1580;&#1583; &#1593;&#1575;&#1604;&#1605;&#1575; &#1594;&#1610;&#1585;&#1607; &#1608;&#1593;&#1606;&#1583;&#1607; &#1588;&#1610;&#1569; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1601;&#1604;&#1610;&#1576;&#1584;&#1604; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1605;&#1606; &#1593;&#1604;&#1605; &#1608; &#1604;&#1575; &#1610;&#1578;&#1603;&#1604;&#1605; &#1601;&#1610; &#1583;&#1610;&#1606; &#1575;&#1604;&#1604;&#1607; &#1576;&#1580;&#1607;&#1604; &#1571;&#1576;&#1583;&#1575; &#1581;&#1578;&#1609; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1604;&#1607; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1581;&#1602;  &#1602;&#1575;&#1604;&#1614; &#1578;&#1593;&#1575;&#1604;&#1609; &#64831;&#1602;&#1615;&#1604;&#1618; &#1573;&#1616;&#1606;&#1614;&#1617;&#1605;&#1614;&#1575; &#1581;&#1614;&#1585;&#1614;&#1617;&#1605;&#1614; &#1585;&#1614;&#1576;&#1616;&#1617;&#1610;&#1614; &#1575;&#1604;&#1618;&#1601;&#1614;&#1608;&#1614;&#1575;&#1581;&#1616;&#1588;&#1614; &#1605;&#1614;&#1575; &#1592;&#1614;&#1607;&#1614;&#1585;&#1614; &#1605;&#1616;&#1606;&#1618;&#1607;&#1614;&#1575; &#1608;&#1614;&#1605;&#1614;&#1575; &#1576;&#1614;&#1591;&#1614;&#1606;&#1614; &#1608;&#1614;&#1575;&#1604;&#1573;&#1616;&#1579;&#1618;&#1605;&#1614; &#1608;&#1614;&#1575;&#1604;&#1618;&#1576;&#1614;&#1594;&#1618;&#1610;&#1614; &#1576;&#1616;&#1594;&#1614;&#1610;&#1618;&#1585;&#1616; &#1575;&#1604;&#1618;&#1581;&#1614;&#1602;&#1616;&#1617; &#1608;&#1614;&#1571;&#1614;&#1606;&#1618; &#1578;&#1615;&#1588;&#1618;&#1585;&#1616;&#1603;&#1615;&#1608;&#1575; &#1576;&#1616;&#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1605;&#1614;&#1575; &#1604;&#1614;&#1605;&#1618; &#1610;&#1615;&#1606;&#1614;&#1586;&#1616;&#1617;&#1604;&#1618; &#1576;&#1616;&#1607;&#1616; &#1587;&#1615;&#1604;&#1618;&#1591;&#1614;&#1575;&#1606;&#1575;&#1611; &#1608;&#1614;&#1571;&#1614;&#1606;&#1618; &#1578;&#1614;&#1602;&#1615;&#1608;&#1604;&#1615;&#1608;&#1575; &#1593;&#1614;&#1604;&#1614;&#1609; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1616; &#1605;&#1614;&#1575; &#1604;&#1575;&#1614; &#1578;&#1614;&#1593;&#1618;&#1604;&#1614;&#1605;&#1615;&#1608;&#1606;&#1614;&#64830; (&#1575;&#1604;&#1571;&#1593;&#1585;&#1575;&#1601;:33). &#1601;&#1575;&#1604;&#1602;&#1608;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1576;&#1594;&#1610;&#1585; &#1593;&#1604;&#1605; &#1581;&#1585;&#1575;&#1605; &#1608; &#1571;&#1603;&#1576;&#1585; &#1575;&#1604;&#1603;&#1576;&#1575;&#1574;&#1585; &#1576;&#1604; &#1571;&#1603;&#1576;&#1585; &#1605;&#1606; &#1575;&#1604;&#1603;&#1601;&#1585; &#1576;&#1575;&#1604;&#1604;&#1607; &#1593;&#1586; &#1608; &#1580;&#1604; &#1604;&#1571;&#1606; &#1575;&#1604;&#1603;&#1601;&#1585; &#1608; &#1575;&#1604;&#1590;&#1604;&#1575;&#1604; &#1608; &#1575;&#1604;&#1576;&#1583;&#1593; &#1578;&#1606;&#1588;&#1571; &#1605;&#1606; &#1575;&#1604;&#1602;&#1608;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1576;&#1594;&#1610;&#1585; &#1593;&#1604;&#1605; &#1601;&#1607;&#1608; &#1571;&#1582;&#1576;&#1579; &#1575;&#1604;&#1582;&#1576;&#1575;&#1574;&#1579; &#1608; &#1571;&#1603;&#1576;&#1585; &#1575;&#1604;&#1603;&#1576;&#1575;&#1574;&#1585; &#1587;&#1608;&#1575;&#1569; &#1589;&#1583;&#1585; &#1605;&#1606; &#1593;&#1575;&#1604;&#1605; &#1571;&#1608; &#1580;&#1575;&#1607;&#1604;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Meaning, when he is amongst the peasantry (in desert regions) observating the innovations (that are present), the abandonment of prayer and he knows what are innovations and what are the sunnah affairs, likewise, some of you know something of knowledge, then he teaches something from the Qur'an, something of tajweed, he teaches them the books which he has studied, <i>al-Usool al-Thalaathah</i> (the three principles), <i>Kitab al-Tawhid</i>. Now, I am not encouraging a student of knowledge to position himself as a scholar, not, (but I am saying that) when he is forced, and there is not a scholar other than him, and he has something of knowledge, then let him offer what he has of knowledge and (at the same time) to never speak in the deen of Allaah with ignorance. It is not permissible for him except to ascribe to Allaah except the truth, He, the Exalted said, "<b>Say: "(But) the things that my Lord has indeed forbidden are great evil (lustful) sins, whether committed openly or secretly, sins (of all kinds), unrighteous <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a>, joining partners (in worship) with Allaah for which He has given no authority, and saying things about Allaah of which you have no knowledge</b>." (7:33). So saying things about Allaah without knowledge is unlawful and is from the greatest of major sins. Rather, it is greater than disbelief in Allaah because disbelief in Allaah, misguidance and innovations all arise from speaking about Allaah without knowledge. Hence, it is the vilest of things, and greatest of major sins, irrespective of whether it appears from a scholar or an ignorant person.</blockquote>    <P>
The Shaykh continues:    <P>
<div class='arabic' dir='rtl' align='right'>&#1601;&#1575;&#1584;&#1575; &#1585;&#1571;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1590;&#1591;&#1585;&#1610;&#1606; &#1573;&#1604;&#1609; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1602;&#1604;&#1610;&#1604; &#1601;&#1604;&#1610;&#1578;&#1603;&#1604;&#1605; &#1601;&#1602;&#1591; &#1601;&#1610; &#1581;&#1583;&#1608;&#1583; &#1605;&#1575; &#1610;&#1593;&#1604;&#1605; &#1608;&#1604;&#1575; &#1610;&#1578;&#1580;&#1575;&#1608;&#1586; &#1581;&#1583;&#1607; &#1601;&#1575;&#1584;&#1575; &#1587;&#1574;&#1604; &#1593;&#1605;&#1575; &#1604;&#1575; &#1610;&#1593;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1571;&#1593;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1601;&#1602;&#1583; &#1603;&#1575;&#1606; &#1603;&#1576;&#1585;&#1575;&#1569; &#1575;&#1604;&#1603;&#1576;&#1585;&#1575;&#1569; &#1608; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577; &#1610;&#1602;&#1608;&#1604; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1576;&#1581;&#1610;&#1579; &#1571;&#1606; &#1571;&#1581;&#1583; &#1603;&#1576;&#1575;&#1585; &#1578;&#1604;&#1575;&#1605;&#1610;&#1584; &#1605;&#1575;&#1604;&#1603; &#1610;&#1602;&#1608;&#1604; &#1604;&#1608; &#1588;&#1574;&#1578; &#1571;&#1606; &#1571;&#1605;&#1604;&#1571; &#1571;&#1604;&#1608;&#1575;&#1581;&#1610; &#1605;&#1606; &#1602;&#1608;&#1604; &#1605;&#1575;&#1604;&#1603; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1604;&#1601;&#1593;&#1604;&#1578; &#1608;&#1603;&#1604;&#1603;&#1605; &#1610;&#1593;&#1604;&#1605; &#1575;&#1606;&#1607; &#1587;&#1574;&#1604; &#1593;&#1606; &#1575;&#1585;&#1576;&#1593;&#1610;&#1606; &#1605;&#1587;&#1571;&#1604;&#1577; &#1601;&#1571;&#1580;&#1575;&#1576; &#1593;&#1606; &#1571;&#1585;&#1576;&#1593;&#1577; &#1608;&#1602;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1576;&#1575;&#1602;&#1610; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1608; &#1603;&#1575;&#1606; &#1575;&#1604;&#1585;&#1580;&#1604; &#1601;&#1610; &#1584;&#1604;&#1603; &#1575;&#1604;&#1608;&#1602;&#1578; &#1575;&#1584;&#1575; &#1571;&#1603;&#1579;&#1585;&#1605;&#1606; &#1602;&#1608;&#1604; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1593;&#1592;&#1605; &#1601;&#1610; &#1571;&#1593;&#1610;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1608; &#1571;&#1605;&#1575; &#1575;&#1604;&#1610;&#1608;&#1605; &#1575;&#1584;&#1575; &#1602;&#1575;&#1604; &#1601;&#1610; &#1605;&#1587;&#1571;&#1604;&#1577; &#1608; &#1605;&#1587;&#1571;&#1604;&#1578;&#1610;&#1606; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1602;&#1575;&#1604;&#1608;&#1575; &#1580;&#1575;&#1607;&#1604; &#1610;&#1580;&#1576; &#1593;&#1604;&#1609; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1602;&#1575;&#1610;&#1610;&#1587; &#1575;&#1606; &#1578;&#1593;&#1583;&#1604; &#1608; &#1575;&#1606; &#1604;&#1575; &#1610;&#1583;&#1601;&#1593; &#1575;&#1604;&#1606;&#1575;&#1587; &#1571;&#1606;&#1589;&#1575;&#1601; &#1608; &#1571;&#1585;&#1576;&#1575;&#1593; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1573;&#1604;&#1609; &#1575;&#1604;&#1602;&#1608;&#1604; &#1593;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1576;&#1594;&#1610;&#1585; &#1593;&#1604;&#1605; &#1608; &#1593;&#1604;&#1609; &#1603;&#1604; &#1581;&#1575;&#1604; &#1610;&#1606;&#1576;&#1594;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1575;&#1606; &#1610;&#1585;&#1576;&#1610; &#1578;&#1604;&#1575;&#1605;&#1610;&#1584;&#1607; &#1593;&#1604;&#1609; &#1602;&#1608;&#1604; &#1604;&#1575; &#1571;&#1583;&#1585;&#1610; &#1601;&#1607;&#1610; &#1606;&#1589;&#1601; &#1575;&#1604;&#1593;&#1604;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Hence, when he sees the people (in need) compelled towards the little knowledge he possesses, then let him speak only within the limits of what he knows and not to transgress his limit. So when he is asked about what he does not know, he says, "Allaah knows best", he says, "I do not know", for (indeed) the greatest of the greatest of the scholars and the leading Imaams amongst the Imaams say, "I do not know", where one of the major students of (Imaam) Maalik says, "If I wished to fill my slate (tablet) with the saying of Maalik, '<i>I don't know</i>', I would have done so." And all of you know that he was asked about forty matters, he responded to four of them and said "I don't know" about the rest. And in that time, when a man repeated the saying "I don't know" often, he became great in the eyes of the people. But as for today, if he says "I don't know" in just one or two matters, they say, "Jaahil (ignoramus)". Upon these scales (of measure) it is necessary that one abstains and that (even) half or a quarter of the scholars are not led to speak about Allaah without knowledge on account of the people. But in any case, it is desirable for a scholar to cultivate his students to say "I don't know" for it is one half of knowledge (to not speak without knowledge).  </blockquote>    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/wpvti-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-12.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?wpvti<BR>

<li><a href="articles/aninc-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-10.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 10: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?aninc<BR>

<li><a href="articles/iknhb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-8.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?iknhb<BR>

<li><a href="articles/cajxz-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-7.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</a><BR>
https://www.manhaj.com/manhaj/?cajxz<BR>

<li><a href="articles/laknb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-6.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 6: Shaykh Ubayd al-Jaabiree</a><BR>
https://www.manhaj.com/manhaj/?laknb<BR>

<li><a href="articles/pdziw-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-5.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?pdziw<BR>

<li><a href="articles/xkdrv-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-4.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 4: Shaykh Zayd al-Madkhali</a><BR>
https://www.manhaj.com/manhaj/?xkdrv<BR>

<li><a href="articles/rqltx-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-3.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 3: Shaykh Muhammad bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?rqltx<BR>

<li><a href="articles/xkjsh-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-2.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 2: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?xkjsh<BR>

<li><a href="articles/fpjyl-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-1.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 1: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?fpjyl<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?iknhb by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
</html>


