

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?vwlja by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Shaykh Saalih al-Fawzaan: Writing and Warning Against Deviant Groups and Sects, Obligatory If You Have Knowledge and Ability</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh Saalih al-Fawzaan: Writing and Warning Against Deviant Groups and Sects, Obligatory If You Have Knowledge and Ability</span><BR>
Tuesday, October 01 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>The people of desires love to spread confusion about the issue of refuting and warning against falsehood, and they selectively present statements of some of the scholars which have a context and an application, and they conceal many of their other statements that also have their context and application. An example of this is <a href=assets/images/fawzan-jarh-tadeel.jpg>this fatwa</a> of Shaykh Saalih <a href='tags/al-fawzaan.html' class='tagLink'><font class='tagLink'>al-Fawzaan</font></a> that is propagated on certain websites:    <P>
<img src=assets/images/fawzan-jarh-tadeel.jpg width="440" border="1" border=0>    <P>
The explanation of these types of fatwas are very clear when one collates all the statements of the scholar in relation to this topic and so it becomes clear <u>firstly</u> that the "<i>jarh and ta'deel</i>" that the Shaykh is speaking of relates to the narrators of hadeeth, and that science is completed, the Scholars of Islam who have passed have already completed that science and so there is no more jarh and ta'deel of the narrators. That is one point. <u>Then secondly</u>, using the science of jarh and ta'deel of narrators in order to backbite others and wrong them, this is not permissible, there is no doubt about that either. <u>Thirdly</u>, as for refuting deviants and <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>Innovators</font></a> for their confirmed and established errors and warning from their falsehood and informing the common people, then that is a separate matter altogether, the Shaykh also affirms and corroborates. So we can see that those people who spread these types of fatwas have an agenda of comprising the truth and hindering what is done  by Ahl al-Sunnah of refuting the deviants and <a href='tags/innovators.html' class='tagLink'><font class='tagLink'>Innovators</font></a> and the contemporary <a href='tags/jamaaaat.html' class='tagLink'><font class='tagLink'>jamaa'aat</font></a> of misguidance.    <P>
Further, they ignore what is found with other Scholars of tafseel (detail) in this matter. Take for example the speech of Shaykh Ibn al-Uthaymeen who clarifies this matter in a way that leaves no ambiguity, he said about the claim that jarh and ta'deel is no longer applicable today,  "<b>I fear that this is a statement of truth by which falsehood is intended. <a href='tags/al-jarh-wal-tadeel.html' class='tagLink'><font class='tagLink'>Al-Jarh wal-Ta'deel</font></a> has not died and nor has it been buried, and nor has it become ill, and all praise is due to Allaah... Except that when we see a specific person by which the people have been put to trial, and he is calling to his innovation or to misguidance, then there is no escape from specifying (his person) so that the people are not put to trial by him.</b> (see <a href=index0090.html?odviu>this article</a> for details). So one must beware of these people who spread these fatwas for certain agendas because they have methodologies and orientations which they are upon and which are opposed to what the very Shaykhs they are citing from are upon when one gathers together all their other statements so we have a more comprehensive and complete picture of their understanding.    <P>
All of this makes it clear that these people who selectively translate these types of statements, they desire to confuse and misguide the people, and they are dishonest and not to be trusted, and caution should be taken from them and no knowledge should be taken from them as they have proven to be dishonest and untrustworthy in the manner that they selectively convey what comes from a Shaykh in order to make it fit in with a wider agenda and objective they have which is contradicted by numerous other statements from the same scholar in the same field or subject area, that shed more light on how to reconcile between all of his various statements.     <P>
</blockquote></div>    <P>
Shaykh Saalih <a href='tags/al-fawzaan.html' class='tagLink'><font class='tagLink'>al-Fawzaan</font></a> was asked (<a href=assets/audio/fawzan-refuting-falsehood-ability.mp3>mp3</a>):    <P>
<div class='arabic' dir='rtl' align='right'>&#1571;&#1606;&#1608;&#1610; &#1571;&#1606; &#1571;&#1603;&#1578;&#1576; &#1593;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1575;&#1604;&#1590;&#1575;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1578;&#1581;&#1584;&#1610;&#1585; &#1605;&#1606;&#1607;&#1575;&#1548; &#1604;&#1603;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1604;&#1605; &#1578;&#1582;&#1585;&#1580; &#1605;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577;&#1548; &#1608;&#1602;&#1583; &#1605;&#1583;&#1581;&#1607;&#1575; &#1575;&#1604;&#1576;&#1593;&#1590; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1571;&#1582;&#1588;&#1609; &#1571;&#1606; &#1610;&#1583;&#1593;&#1608; &#1593;&#1604;&#1610;&#1548; &#1601;&#1605;&#1575; &#1578;&#1608;&#1580;&#1610;&#1607;&#1603;&#1605; &#1604;&#1610; &#1593;&#1604;&#1605;&#1575; &#1576;&#1571;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1605;&#1606;&#1581;&#1585;&#1601;&#1577;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I intend to write about some of the astray <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a> and warn from them however, this group has not exited from the religion and one of the scholars has praised it, and I fear that he may supplicate against me. So what is your advice with the knowledge that this group is deviated?</blockquote>    <P>
The Shaykh's answer:    <P>
<div class='arabic' dir='rtl' align='right'>&#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1593;&#1604;&#1610;&#1603; &#1576;&#1610;&#1575;&#1606; &#1575;&#1604;&#1581;&#1602;&#1548; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1593;&#1604;&#1610;&#1603; &#1576;&#1610;&#1575;&#1606; &#1575;&#1604;&#1581;&#1602;&#1548; &#1573;&#1584;&#1575; &#1603;&#1606;&#1578; &#1605;&#1578;&#1571;&#1603;&#1583;&#1611;&#1575; &#1605;&#1606; &#1575;&#1604;&#1571;&#1582;&#1591;&#1575;&#1569; &#1575;&#1604;&#1578;&#1610; &#1593;&#1606;&#1583;&#1607;&#1605;&#1548; &#1608;&#1575;&#1604;&#1590;&#1604;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1593;&#1606;&#1583;&#1607;&#1605;&#1548; &#1605;&#1578;&#1571;&#1603;&#1583; &#1605;&#1575;&#1574;&#1577; &#1576;&#1575;&#1604;&#1605;&#1575;&#1574;&#1577;&#1548; &#1608;&#1593;&#1606;&#1583;&#1603; &#1605;&#1602;&#1583;&#1585;&#1577; &#1608;&#1593;&#1606;&#1583;&#1603; &#1593;&#1604;&#1605; &#1578;&#1587;&#1578;&#1591;&#1610;&#1593; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1610;&#1580;&#1576; &#1593;&#1604;&#1610;&#1603; &#1607;&#1584;&#1575;.  (&#1608;&#1614;&#1573;&#1616;&#1584;&#1618; &#1571;&#1614;&#1582;&#1614;&#1584;&#1614; &#1575;&#1604;&#1604;&#1614;&#1617;&#1607;&#1615; &#1605;&#1616;&#1610;&#1579;&#1614;&#1575;&#1602;&#1614; &#1575;&#1604;&#1614;&#1617;&#1584;&#1616;&#1610;&#1606;&#1614; &#1571;&#1615;&#1608;&#1578;&#1615;&#1608;&#1575; &#1575;&#1604;&#1618;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1614; &#1604;&#1614;&#1578;&#1615;&#1576;&#1614;&#1610;&#1616;&#1617;&#1606;&#1615;&#1606;&#1614;&#1617;&#1607;&#1615; &#1604;&#1616;&#1604;&#1606;&#1614;&#1617;&#1575;&#1587;&#1616; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1603;&#1618;&#1578;&#1615;&#1605;&#1615;&#1608;&#1606;&#1614;&#1607;&#1615;)  (&#1573;&#1616;&#1606;&#1614;&#1617; &#1575;&#1604;&#1614;&#1617;&#1584;&#1616;&#1610;&#1606;&#1614; &#1610;&#1614;&#1603;&#1618;&#1578;&#1615;&#1605;&#1615;&#1608;&#1606;&#1614; &#1605;&#1614;&#1575; &#1571;&#1614;&#1606;&#1618;&#1586;&#1614;&#1604;&#1618;&#1606;&#1614;&#1575; &#1605;&#1616;&#1606;&#1614; &#1575;&#1604;&#1618;&#1576;&#1614;&#1610;&#1616;&#1617;&#1606;&#1614;&#1575;&#1578;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1607;&#1615;&#1583;&#1614;&#1609;)  &#1605;&#1575; &#1610;&#1580;&#1608;&#1586; &#1603;&#1578;&#1605;&#1575;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583;&#1603; &#1593;&#1604;&#1605; &#1608;&#1605;&#1578;&#1610;&#1602;&#1606; &#1605;&#1606; &#1590;&#1604;&#1575;&#1604;&#1575;&#1578; &#1576;&#1593;&#1590; &#1575;&#1604;&#1591;&#1608;&#1575;&#1574;&#1601; &#1601;&#1576;&#1610;&#1606;&#1607;&#1575; &#1604;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1571;&#1580;&#1604; &#1571;&#1606; &#1610;&#1581;&#1584;&#1585;&#1608;&#1607;&#1575; &#1608;&#1607;&#1584;&#1575; &#1605;&#1606; &#1575;&#1604;&#1606;&#1589;&#1610;&#1581;&#1577;.  &#1602;&#1575;&#1604; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;- "&#1575;&#1604;&#1583;&#1616;&#1617;&#1610;&#1606;&#1615; &#1575;&#1604;&#1606;&#1614;&#1617;&#1589;&#1616;&#1610;&#1581;&#1614;&#1577;&#1615;. &#1602;&#1615;&#1604;&#1618;&#1606;&#1614;&#1575;: &#1604;&#1616;&#1605;&#1614;&#1606;&#1618;&#1567; &#1602;&#1614;&#1575;&#1604;&#1614; &#1604;&#1616;&#1604;&#1614;&#1617;&#1607;&#1616;&#1548; &#1608;&#1614;&#1604;&#1616;&#1603;&#1616;&#1578;&#1614;&#1575;&#1576;&#1616;&#1607;&#1616;&#1548; &#1608;&#1614;&#1604;&#1616;&#1585;&#1614;&#1587;&#1615;&#1608;&#1604;&#1616;&#1607;&#1616;&#1548; &#1608;&#1614;&#1604;&#1616;&#1571;&#1614;&#1574;&#1616;&#1605;&#1614;&#1617;&#1577;&#1616; &#1575;&#1604;&#1618;&#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1616;&#1610;&#1606;&#1614; &#1608;&#1614;&#1593;&#1614;&#1575;&#1605;&#1614;&#1617;&#1578;&#1616;&#1607;&#1616;&#1605;&#1618;" . &#1585;&#1614;&#1608;&#1614;&#1575;&#1607;&#1615; &#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1612; [&#1585;&#1602;&#1605;: 55].  &#1608;&#1604;&#1575; &#1578;&#1582;&#1588; &#1575;&#1604;&#1606;&#1575;&#1587;&#1548; &#1593;&#1604;&#1610;&#1603; &#1571;&#1606; &#1578;&#1582;&#1588; &#1575;&#1604;&#1604;&#1607; -&#1587;&#1576;&#1581;&#1575;&#1606;&#1607; &#1608;&#1578;&#1593;&#1575;&#1604;&#1609;- &#1608;&#1576;&#1610;&#1617;&#1606; &#1575;&#1604;&#1581;&#1602; &#1608;&#1578;&#1585;&#1583; &#1575;&#1604;&#1576;&#1575;&#1591;&#1604;&#1548; &#1608;&#1604;&#1575; &#1578;&#1582;&#1588; &#1575;&#1604;&#1606;&#1575;&#1587; . &#1606;&#1593;&#1605;. &#1575;&#1607;&#1600; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is obligatory upon you to explain the truth, it is obligatory upon you to explain the truth. If you are sure about the errors that are with them and the misguidance(s) that are with them, sure one-hundred percent and you have the ability, you have knowledge by which you are able to clarify, then this is obligatory upon you, "<b>And when Allaah took the covenant from those who were given the Book that you will explain, clarify it to the people and not conceal it</b>" [and] "<b>Verily, those who conceal what we have revealed of clear evidences and guidance</b>", it is not permissible to conceal knowledge. If you have knowledge with you and you are certain about the misguidance(s) of certain factions, then explain them to the people so that they may beware of them, and this is from sincere advice. He (sallallaahu alayhi wasallam) said, "The religion comprises sincerity of purpose" and we (the Companions) said, "To whom?" and he said, "<i>To Allaah, His Book, His Messenger, the leaders of the Muslims and the common folk</i>" (reported by Muslim, no. 55). Do not fear the people, upon you is to fear Allaah, the Sublime and Exalted, and explain to the people, refute falsehoood, and do not fear the people. Yes.  </blockquote>    <P>
We can add here for further clarification the statement of Shaykh Rabee bin Hadee (Fataawa Ash-Shaykh Rabee' 1/246):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>...Al-Jarh Wa At-Tadeel will remain until the day of judgement. The people want to benefit from this particular scholar and you inform them that this person is a noble scholar and upon the Sunnah so you praise him, and this scholar is Raafidee, this one is a Soofee who believes in Wahdatul Wujood (This is referring to the false belief that all in existence is a single reality and that everything we see is only aspects of the essence of Allah), this one is a secularist, this one is a communist who conceals his reality with Islam. This one is this and this one is that. It is obligatory upon you to clarify this; this is an obligation. This is a form of Jihaad and it will not cease and it is not specific to narrators.    <P>
Also the Salaf wrote [books] refuting the people of innovation as we have stated and they did not declare Al-Jarh Wa At-Ta'deel to be specific to the narrators alone. He is an innovator and is not from the people of hadeeth, [he is] Mu'tazilee, [he is] Jahmee, [he is] Murjee and so and so forth. He has no connection to any narrations but he is an innovator therefore they criticized him (Al-Jarh). So how can these people claim that the door of Al-Jarh is closed?</blockquote>    <P>
In another place the Shaykh said (Fataawa Ash-Shaykh Rabee' 1/249):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>...The methodology of Al-Jarh Wa At-Ta'deel will not cease until the day of judgement as long as innovations are present.</blockquote>    <P>
Refer also to this article with another fatwa of Shaykh Saalih <a href='tags/al-fawzaan.html' class='tagLink'><font class='tagLink'>al-Fawzaan</font></a> on this subject: <b>Shaykh Saalih al-Fawzaan: The True and Real Fitnah is Leaving Alone the People of Falsehood and Evil and Remaining Silent About Them </b>(<a href=index13b0.html?utjea>see here</a>).   <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/vwlja-shaykh-saalih-al-fawzaan-writing-and-warning-against-deviant-sects.html">Shaykh Saalih al-Fawzaan: Writing and Warning Against Deviant Groups and Sects, Obligatory If You Have Knowledge and Ability</a><BR>
https://www.manhaj.com/manhaj/?vwlja<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?vwlja by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
</html>


