

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?aqpld by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Ibn Abil-Izz al-Hanafi: Allaah Empowers Tyrannical, Oppressive Rulers Over the Subjects Due to Their Own Oppression and Corruption</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Ibn Abil-Izz al-Hanafi: Allaah Empowers Tyrannical, Oppressive Rulers Over the Subjects Due to Their Own Oppression and Corruption</span><BR>
Monday, July 05 2010 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>The vast majority of the <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a> present today in the field of da'wah try to win the sentiments and support of the people by focusing and pointing their fingers towards the rulers. They make them the scapegoats for all the calamities, evils and ills to befall the Ummah, and subsequently make their methodologies of reform based around coups, revolutions and bringing about the downfall and replacement of governments. All of this is based upon ignorance of the Sharee'ah and ignorance of Allaah's Divine wisdom, and is a mental outlook that is based upon a corrupt underlying aqidah.</div> <P> 


<p>Ibn Abil-Izz al-Hanafi stated in explanation of the saying of Imaam at-Tahaawi, "<i>We do not consider (the permissibility) of revolting against our leaders and rulers of our affair, even if they are tyrannical</i>...", as occurs in <i>Sharh Aqidah at-Tahawiyyah</i> (1/430):    <P>
<div class='arabic' dir='rtl' align='right'>&#1571;&#1605;&#1575; &#1604;&#1586;&#1608;&#1605; &#1591;&#1575;&#1593;&#1578;&#1607;&#1605; &#1608;&#1573;&#1606; &#1580;&#1575;&#1585;&#1608;&#1575; &#1601;&#1604;&#1571;&#1606;&#1607; &#1610;&#1578;&#1585;&#1578;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1605;&#1606; &#1591;&#1575;&#1593;&#1578;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1605;&#1601;&#1575;&#1587;&#1583; &#1575;&#1590;&#1593;&#1575;&#1601; &#1605;&#1575; &#1610;&#1581;&#1589;&#1604; &#1605;&#1606; &#1580;&#1608;&#1585;&#1607;&#1605; &#1576;&#1604; &#1601;&#1610; &#1575;&#1604;&#1589;&#1576;&#1585; &#1593;&#1604;&#1609; &#1580;&#1608;&#1585;&#1607;&#1605; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1587;&#1610;&#1574;&#1575;&#1578; &#1608;&#1605;&#1590;&#1575;&#1593;&#1601;&#1577; &#1575;&#1604;&#1571;&#1580;&#1608;&#1585; &#1601;&#1573;&#1606; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; &#1605;&#1575; &#1587;&#1604;&#1591;&#1607;&#1605; &#1593;&#1604;&#1610;&#1606;&#1575; &#1573;&#1604;&#1575; &#1604;&#1601;&#1587;&#1575;&#1583; &#1571;&#1593;&#1605;&#1575;&#1604;&#1606;&#1575; &#1608;&#1575;&#1604;&#1580;&#1586;&#1575;&#1569; &#1605;&#1606; &#1580;&#1606;&#1587; &#1575;&#1604;&#1593;&#1605;&#1604; &#1601;&#1593;&#1604;&#1610;&#1606;&#1575; &#1575;&#1604;&#1573;&#1580;&#1578;&#1607;&#1575;&#1583; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1578;&#1594;&#1601;&#1575;&#1585; &#1608;&#1575;&#1604;&#1578;&#1608;&#1576;&#1577; &#1608;&#1573;&#1589;&#1604;&#1575;&#1581; &#1575;&#1604;&#1593;&#1605;&#1604; &#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;   <<&#1608;&#1605;&#1575; &#1571;&#1589;&#1575;&#1576;&#1603;&#1605; &#1605;&#1606; &#1605;&#1589;&#1610;&#1576;&#1577; &#1601;&#1576;&#1605;&#1575; &#1603;&#1587;&#1576;&#1578; &#1571;&#1610;&#1583;&#1610;&#1603;&#1605; &#1608;&#1610;&#1593;&#1601;&#1608; &#1593;&#1606; &#1603;&#1579;&#1610;&#1585;>>  &#1608;&#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;   <<&#1571;&#1608; &#1604;&#1605;&#1575; &#1571;&#1589;&#1575;&#1576;&#1578;&#1603;&#1605; &#1605;&#1589;&#1610;&#1576;&#1577; &#1602;&#1583; &#1571;&#1589;&#1576;&#1578;&#1605; &#1605;&#1579;&#1604;&#1610;&#1607;&#1575; &#1602;&#1604;&#1578;&#1605; &#1571;&#1606;&#1609; &#1607;&#1584;&#1575; &#1602;&#1604; &#1607;&#1608; &#1605;&#1606; &#1593;&#1606;&#1583; &#1571;&#1606;&#1601;&#1587;&#1603;&#1605;>>  &#1608;&#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;   <<&#1605;&#1575; &#1571;&#1589;&#1575;&#1576;&#1603; &#1605;&#1606; &#1581;&#1587;&#1606;&#1577; &#1601;&#1605;&#1606; &#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1575; &#1571;&#1589;&#1575;&#1576;&#1603; &#1605;&#1606; &#1587;&#1610;&#1574;&#1577; &#1601;&#1605;&#1606; &#1606;&#1601;&#1587;&#1603;>>  &#1608;&#1602;&#1575;&#1604; &#1578;&#1593;&#1575;&#1604;&#1609;   <<&#1608;&#1603;&#1584;&#1604;&#1603; &#1606;&#1608;&#1604;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605;&#1610;&#1606; &#1576;&#1593;&#1590;&#1575; &#1576;&#1605;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1603;&#1587;&#1576;&#1608;&#1606;>>  &#1601;&#1573;&#1584;&#1575; &#1571;&#1585;&#1575;&#1583; &#1575;&#1604;&#1585;&#1593;&#1610;&#1577; &#1571;&#1606; &#1610;&#1578;&#1582;&#1604;&#1589;&#1608;&#1575; &#1605;&#1606; &#1592;&#1604;&#1605; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605; &#1601;&#1604;&#1610;&#1578;&#1585;&#1603;&#1608;&#1575; &#1575;&#1604;&#1592;&#1604;&#1605; &#1608;&#1593;&#1606; &#1605;&#1575;&#1604;&#1603; &#1576;&#1606; &#1583;&#1610;&#1606;&#1575;&#1585; &#1571;&#1606;&#1607; &#1580;&#1575;&#1569; &#1601;&#1610; &#1576;&#1593;&#1590; &#1603;&#1578;&#1576; &#1575;&#1604;&#1604;&#1607; &#1571;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1605;&#1575;&#1604;&#1603; &#1575;&#1604;&#1605;&#1604;&#1603; &#1602;&#1604;&#1608;&#1576; &#1575;&#1604;&#1605;&#1604;&#1608;&#1603; &#1576;&#1610;&#1583;&#1610; &#1601;&#1605;&#1606; &#1571;&#1591;&#1575;&#1593;&#1606;&#1610; &#1580;&#1593;&#1604;&#1578;&#1607;&#1605; &#1593;&#1604;&#1610;&#1607; &#1585;&#1581;&#1605;&#1577; &#1608;&#1605;&#1606; &#1593;&#1589;&#1575;&#1606;&#1610; &#1580;&#1593;&#1604;&#1578;&#1607;&#1605; &#1593;&#1604;&#1610;&#1607; &#1606;&#1602;&#1605;&#1577; &#1601;&#1604;&#1575; &#1578;&#1588;&#1594;&#1604;&#1608;&#1575; &#1571;&#1606;&#1601;&#1587;&#1603;&#1605; &#1576;&#1587;&#1576; &#1575;&#1604;&#1605;&#1604;&#1608;&#1603; &#1604;&#1603;&#1606; &#1578;&#1608;&#1576;&#1608;&#1575; &#1571;&#1593;&#1591;&#1601;&#1607;&#1605; &#1593;&#1604;&#1610;&#1603;&#1605;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And as for adhering to obedience to them (the Rulers), even if they commit <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a>, then this is because the evils and harms that arise on account of rebelling against them is numerous times more than that which occurs as a result of the <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> of the Rulers themselves. Rather, in having patience over their <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> there is expiation of sins, and a multiplication of the reward.     <P>
<b>For Allaah did not empower them over us, except due to the corruption in our actions, and the recompense for an action is its like (<i>al-jazaa'u min jins il-'amal</i>).</b> Hence, it is upon us to strive (ijtihaad) in seeking forgiveness, making repentance and rectification of our actions.     <P>
Allaah the Most High said, "<b>And whatever affliction befalls you, then it is from what your hands have earned, yet He pardons many.</b>" (42:30), and He, the Most High said, "<b>If a calamity befell you (the believers),[your enemies] were inflicted with twice as much, but you said, "Where did this(calamity) come from?" Say: It has come from your own selves</b>." (3:165),  and He the Most High said, "<b>And whatever evil befalls you, then it is from your own soul.</b>" (4:79), and He the Most High said, "<b>And thus do we turn some of the oppressors against others on account of what they used to earn.</b>" (6:129).     <P>
<b>Hence, if the subjects (of a state) wish to save themselves from the <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> of the tyrannical ruler, then let them abandon <a href='tags/oppression.html' class='tagLink'><font class='tagLink'>oppression</font></a> themselves</b>. And from Malik bin Deenaar (who said) that it has come in some of the (previous revealed) Books of Allaah:    <P>
<blockquote>"I am the King of the dominion, the hearts of the kings are in my Hand. So whoever obeyed me, I made them (the kings) a mercy over him, and whoever disobeyed me, I made them a vengeance upon him. So do not occupy yourselves with reviling the kings, but rather repent and I will make them compassionate upon you."</blockquote>  </blockquote>    <P>
All of the <a href='tags/jamaaaat.html' class='tagLink'><font class='tagLink'>jamaa'aat</font></a> (<a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a>) that have appeared in the 20th century, claiming to rectify the Ummah, have fallen into deviation in their methodologies of reform and they have not judged by what Allaah has revealed in their understandings, their methodologies and their calls. They wrongly believe by removing one ruler, or one government they can establish Allaah's law, or that they can do so through political parties that engineer coups and revolutions while turning a blind eye to or belittling the fact that the Muslims are far removed from <u>that Islaam</u> which gave honour and victory to the Companions, but upon an Islaam tainted with innovations, devations, foreign philosophies and ideologies in the fields of aqidah and ibaadah and manhaj and siyaasah. And thus, that tainted Islam they are following does not have the same effect in bringing about the aid and support of Allaah and the granting of success as that pure Islaam, with its purity in aqidah, and <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a>, that the Companions were upon.    <P>
The activities of these <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a> claiming to rectify the Ummah are based upon methodologies that are in opposition to the Book, the Sunnah and the way of the Righteous Salaf whose belief and methodology Allaah has made a criterion of truth in all affairs of the religion. <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/ctcdt-revolutions-coups-and-revolts-were-not-the-way-of-the-righteous-salaf-in-repelling-oppression-and-tyranny.html">Revolutions, Coups and Revolts Were Not the Way of the Righteous Salaf in Repelling Oppression and Tyranny</a><BR>
https://www.manhaj.com/manhaj/?ctcdt<BR>

<li><a href="articles/ltnje-al-hasan-al-basree-d-110h-al-hajjaaj-bin-yusuf-is-the-punishment-of-allaah.html">Al-Hasan al-Basree (d. 110H): Al-Hajjaaj bin Yusuf is the Punishment of Allaah</a><BR>
https://www.manhaj.com/manhaj/?ltnje<BR>

<li><a href="articles/aqpld-ibn-abil-izz-al-hanafi-the-oppression-of-a-tyrannical-ruler-results-from-the-oppression-in-the-actions-of-the-subjects.html">Ibn Abil-Izz al-Hanafi: Allaah Empowers Tyrannical, Oppressive Rulers Over the Subjects Due to Their Own Oppression and Corruption</a><BR>
https://www.manhaj.com/manhaj/?aqpld<BR>

<li><a href="articles/tyjmk-it-is-from-the-divine-wisdom-that-kings-and-rulers-are-simply-a-manifestation-of-the-actions-of-the-servants.html">Ibn al-Qayyim: It is From the Divine Wisdom That Kings and Rulers Are Simply a Manifestation of the Actions of the Servants, Like for Like</a><BR>
https://www.manhaj.com/manhaj/?tyjmk<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?aqpld by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:44 GMT -->
</html>


