

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?bgwmv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:19 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Taking Caution About One in Whose Speech and Positions There Appears Need For Investigation and Clarity</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Taking Caution About One in Whose Speech and Positions There Appears Need For Investigation and Clarity</span><BR>
Monday, August 22 2011 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
Shaykh Zayd bin Muhammad al-Madkhalee was asked:    <P>
<div class='arabic' dir='rtl' align='right'>&#1607;&#1604; &#1575;&#1604;&#1575;&#1581;&#1578;&#1610;&#1575;&#1591; &#1601;&#1610; &#1593;&#1583;&#1605; &#1575;&#1604;&#1578;&#1585;&#1608;&#1610;&#1580; &#1604;&#1576;&#1593;&#1590; &#1605;&#1606; &#1592;&#1607;&#1585;&#1578; &#1605;&#1606;&#1607; &#1605;&#1608;&#1575;&#1602;&#1601; &#1608;&#1603;&#1604;&#1605;&#1575;&#1578; &#1601;&#1610;&#1607;&#1575; &#1606;&#1592;&#1585; &#1581;&#1578;&#1609; &#1610;&#1578;&#1590;&#1581; &#1571;&#1605;&#1585;&#1607; &#1548; &#1607;&#1604; &#1610;&#1593;&#1578;&#1576;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1601;&#1593;&#1604; &#1589;&#1608;&#1575;&#1576;&#1575; &#1571;&#1605; &#1604;&#1575; &#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Is taking caution in not promoting someone from whom certain positions and speech have emanated requiring inspection, until his affair becomes clear, is this practice considered correct or not?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'>&#1571;&#1608;&#1604;&#1575; : &#1571;&#1602;&#1608;&#1604; : &#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1587;&#1608;&#1569; &#1575;&#1604;&#1592;&#1606; &#1576;&#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1584;&#1610;&#1606; &#1607;&#1605; &#1605;&#1578;&#1605;&#1587;&#1603;&#1608;&#1606; &#1576;&#1607;&#1575; &#1608;&#1575;&#1604;&#1605;&#1608;&#1575;&#1604;&#1608;&#1606; &#1604;&#1571;&#1607;&#1604;&#1607;&#1575; &#1608;&#1575;&#1604;&#1605;&#1580;&#1575;&#1604;&#1587;&#1608;&#1606; &#1604;&#1607;&#1605; &#1608;&#1575;&#1604;&#1605;&#1576;&#1578;&#1593;&#1583;&#1608;&#1606; &#1593;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1607;&#1608;&#1575;&#1569; &#1608;&#1575;&#1604;&#1576;&#1583;&#1593; .  &#1608;&#1610;&#1580;&#1608;&#1586; &#1587;&#1608;&#1569; &#1575;&#1604;&#1592;&#1606; &#1576;&#1605;&#1606; &#1571;&#1578;&#1609; &#1576;&#1571;&#1587;&#1576;&#1575;&#1576;&#1607; &#1548; &#1603;&#1605;&#1606; &#1578;&#1585;&#1575;&#1607; &#1610;&#1594;&#1590;&#1576; &#1573;&#1584;&#1575; &#1584;&#1603;&#1585; &#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1578;&#1603;&#1604;&#1617;&#1605; &#1601;&#1610;&#1607;&#1605; &#1608;&#1581;&#1584;&#1585; &#1605;&#1606;&#1607;&#1605; &#1578;&#1581;&#1584;&#1610;&#1585;&#1575; &#1593;&#1575;&#1605;&#1575; &#1548; &#1571;&#1608; &#1578;&#1587;&#1605;&#1593;&#1607; &#1610;&#1583;&#1575;&#1601;&#1593; &#1593;&#1606;&#1607;&#1605; &#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1571;&#1608; &#1571;&#1601;&#1585;&#1575;&#1583;&#1575; &#1548; &#1571;&#1608; &#1583;&#1604;&#1617;&#1578; &#1602;&#1585;&#1575;&#1574;&#1606; &#1610;&#1578;&#1576;&#1610;&#1606; &#1605;&#1606;&#1607;&#1575; &#1571;&#1606; &#1575;&#1604;&#1588;&#1582;&#1589; &#1605;&#1605;&#1610;&#1617;&#1593; &#1604;&#1605;&#1606;&#1607;&#1580; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1548; &#1601;&#1604;&#1575; &#1578;&#1585;&#1608;&#1580; &#1604;&#1607; &#1608;&#1604;&#1575; &#1578;&#1585;&#1588;&#1583; &#1573;&#1604;&#1609; &#1575;&#1604;&#1571;&#1582;&#1584; &#1593;&#1606;&#1607; &#1581;&#1578;&#1609; &#1578;&#1578;&#1576;&#1610;&#1606; &#1604;&#1603; &#1587;&#1604;&#1575;&#1605;&#1578;&#1607; &#1601;&#1578;&#1585;&#1588;&#1583; &#1591;&#1604;&#1575;&#1576; &#1575;&#1604;&#1593;&#1604;&#1605; &#1573;&#1604;&#1609; &#1571;&#1582;&#1584; &#1575;&#1604;&#1593;&#1604;&#1605; &#1593;&#1606;&#1607; &#1548; &#1571;&#1608; &#1610;&#1578;&#1576;&#1610;&#1606; &#1604;&#1603; &#1605;&#1608;&#1575;&#1604;&#1575;&#1578;&#1607; &#1604;&#1571;&#1607;&#1604; &#1575;&#1604;&#1576;&#1583;&#1593; &#1608;&#1604;&#1608; &#1576;&#1575;&#1604;&#1578;&#1585;&#1608;&#1610;&#1580; &#1604;&#1607;&#1605; &#1608;&#1593;&#1583;&#1605; &#1575;&#1604;&#1573;&#1606;&#1603;&#1575;&#1585; &#1593;&#1604;&#1610;&#1607;&#1605; &#1601;&#1575;&#1581;&#1584;&#1585;&#1607; &#1608;&#1581;&#1584;&#1585; &#1605;&#1606;&#1607; &#1548; &#1608;&#1581;&#1602;&#1575; &#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1575;&#1604;&#1588;&#1575;&#1593;&#1585; :    <P>
&#1608;&#1605;&#1607;&#1605;&#1575; &#1578;&#1603;&#1606; &#1593;&#1606;&#1583; &#1575;&#1605;&#1585;&#1574; &#1605;&#1606; &#1582;&#1604;&#1610;&#1602;&#1577; &#1600; &#1608;&#1573;&#1606; &#1582;&#1575;&#1604;&#1607;&#1575; &#1578;&#1582;&#1601;&#1609; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1578;&#1593;&#1604;&#1605;    <P>
&#1601;&#1605;&#1579;&#1604; &#1607;&#1584;&#1575; &#1608;&#1605;&#1606; &#1605;&#1575;&#1579;&#1604;&#1607; &#1578;&#1576;&#1610;&#1606; &#1604;&#1607; &#1571;&#1610;&#1607;&#1575; &#1575;&#1604;&#1583;&#1575;&#1593;&#1610;&#1577; &#1582;&#1591;&#1571;&#1607; &#1576;&#1610;&#1575;&#1606;&#1575; &#1608;&#1575;&#1590;&#1581;&#1575; &#1580;&#1604;&#1610;&#1575; &#1548; &#1608;&#1578;&#1608;&#1585;&#1583; &#1604;&#1607; &#1575;&#1604;&#1571;&#1583;&#1604;&#1577; &#1575;&#1604;&#1578;&#1610; &#1610;&#1578;&#1605;&#1610;&#1586; &#1576;&#1607;&#1575; &#1575;&#1604;&#1582;&#1591;&#1571; &#1605;&#1606; &#1575;&#1604;&#1589;&#1608;&#1575;&#1576; &#1548; &#1579;&#1605; &#1575;&#1606;&#1592;&#1585; &#1573;&#1604;&#1609; &#1571;&#1610; &#1601;&#1585;&#1602;&#1577; &#1610;&#1586;&#1581;&#1601; &#1548; &#1608;&#1571;&#1610; &#1580;&#1605;&#1575;&#1593;&#1577; &#1610;&#1571;&#1604;&#1601; &#1548; &#1608;&#1605;&#1593; &#1605;&#1606; &#1610;&#1594;&#1583;&#1608; &#1608;&#1610;&#1585;&#1608;&#1581; &#1548; &#1608;&#1575;&#1593;&#1604;&#1605; &#1571;&#1606; &#1605;&#1606; &#1571;&#1582;&#1601;&#1609; &#1593;&#1604;&#1609; &#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1576;&#1583;&#1593;&#1578;&#1607; &#1548; &#1601;&#1604;&#1606; &#1578;&#1582;&#1601;&#1609; &#1593;&#1604;&#1610;&#1607;&#1605; &#1571;&#1604;&#1601;&#1578;&#1607;   </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>First: I say that it is not permissible to hold an evil presumption about Ahl al-Sunnah wal-Jamaa'ah who hold fast to it (the Sunnah) and who show loyalty to its adherents, and who sit with them and keep away from the people of innovation and desires. And it is permissible to have a evil presumption about one who brings (in speech and deed) that become reasons for it, such as the one you see becoming angry when the people of innovation are mentioned and are spoken about and they are warned against in general. Or you hear him defending certain <a href='tags/groups.html' class='tagLink'><font class='tagLink'>groups</font></a> or individuals. Or certain indicators make clear that this individual is one who softens the methodology of Ahl al-Sunnah. So you should not promote him and nor direct (others) to take from him until the safety (in his position) becomes clear to you, then you direct the students of knowledge to take knowledge from him. Or if it becomes apparent to you that he shows loyalty to the people of innovation, even if it is just by promoting tehm and not showing rejection agains them, then beware of him, and warn against hiim, and truthful is what was said by the poet:    <P>
<div align=center><i>Whatever trait a man might posses, even if he concealed it from the people will become known.</i></div>    <P>
So the likes of this one and whoever is like him, you should explain to him O caller, his error with a clear, manifest explanation, and you should present to him the evidences by which the error is distinguished from what is correct. Then watch and see with which party he advances to and with which group he shows affinity, and with whom he accompanies and rests with.     <P>
And know that whoever tried to hide his innovation from Ahl al-Sunnah, his companionship will not remain hidden from them.</blockquote>    <P>
Source: al-Ajwibah al-Athariyyah An il-Masaa'il al-Manhajiyyah (p. 93) through <a href=http://www.sahab.net/forums/index.php?showtopic=122704>Sahab.Net</a>. <P> 

</div>
<br>





</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?bgwmv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:48:19 GMT -->
</html>


