

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?wpvti by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</span><BR>
Sunday, October 06 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>Following the role of Ahl al-Sunnah in the West of conveying the speech of the Scholars regarding certain figureheads who went astray, the followers of many of these figureheads spread doubts about some of the callers in the West, with respect to teaching and giving da'wah, claiming that a person must have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> to teach, or he  must have graduated from an institution and so on. <b>However, the reality of the matter is that those whom they target in this way actually have  connections with the Scholars, they travel to them, and take knowledge from them in aqidah, manhaj and fiqh, even if they have not formally studied in an institution, or graduated or have a specific tazkiyah</b>. The real reason for these doubts is to undermine what the callers do in the West (in addition to calling to the Sunnah) of warning from doubts, innovations and desires and warning from the people who are upon them or promote them. The articles in these series will shed light on this matter and repel the doubts spread. No one article in this series should be read in isolation as it is possible for <u>a person with ulterior motives</u> to utilize some of these fatwas from the scholars to justify isolation and separation away from the main body of Salafis in that land and from their centres and mosques with the claim that everybody has the green light to teach, and so some of them teach in the mosques and centres of the hizbees and others teach in their homes (often secretly) whilst spreading poison that aims to isolate people from the students of knowledge. Rather, all the statements of all the Shaykhs <b>should be put together and understood collectively</b> to get a clearer picture of this whole affair. This is because there are generalizations in some fatwas, clarifications in others, important minor details in others, and contexts in some fatwas not found in others. All of this should be put together to get a full, comprehensive picture. <u>Alongside the clarifications in these articles</u>, it should be still be stressed that seeking knowledge from the Scholars, by travelling to them and sitting in their lessons is of utmost importance and should not be neglected as it is <u>the primary route</u> of seeking knowledge. And for those who are unable to do this, <b>then they should take from the students of knowledge in their lands, those who have connections with the Scholars, have studied with them and take from them.</b> So they should attend their lessons, in the Salafi mosques and centres, and any issues that arise such as requiring a fatwa, or removal of a <i>shubhah</i> or clarification in an issue of knowledge, then those students of knowledge can return these questions to the Scholars on behalf of the people of that land if the answer is not already known.     <P>
Here are links to all articles so far for easy reference:     <P>
<b>Shaykh Abd al-Muhsin al-Abbaad</b> (<a href=index67d0.html?fpjyl>see here</a>)  <b>Shaykh Zayd al-Madkhali</b> (<a href=index292c.html?xkdrv>see here</a>)  <b>Shaykh Muhammad bin Haadee</b> (<a href=index7c01.html?rqltx>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5b8a.html?pdziw>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index4f73.html?xkjsh>see here</a>)   <b>Shaykh Ubayd al-Jaabiree</b> (<a href=index3c84.html?laknb>see here</a>)   <b>Shaykh Abdullah al-Ghudayan</b> (<a href=indexbaf0.html?cajxz>see here</a>)  <b>Shaykh Rabee bin Haadee</b> (<a href=indexa1a5.html?iknhb>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5ea5.html?ccblo>see here</a>)  <b>Shaykh Ahmad Bazmul</b> (<a href=indexd377.html?ibtpx>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index3ed6.html?aninc>see here</a>).    <P>
.    <P>
<!---The bottom line is that knowledge can be sought from books and cassettes where it is not possible to take it directly from the scholars, though this is a longer and more burdensome route than taking it from the scholars directly. And it is not a condition that a person  must have a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar prior to teaching or giving da'wah. However, a person must know his limit and capability and not transgress it and not speak about matters he does not know and he must also seek to understand thoroughly that which he conveys so that where explanation is required he is able to explain that knowledge, and further, he must only resort to books of trusted, deeply-rooted scholars. <b>In all cases, the seeking of knowledge from the scholars directly is the quickest,  easiest route as it allows discussion and for clarifications to be made</b>. Whether a person is fit to convey and teach is known by two ways, either a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar or by it being it well known by the people of his land that he has knowledge, understanding and ability. //--->  </blockquote></div> <P> 


<p>Shaykh Abd al-Muhsin al-Abbaad was asked about teaching some of the books of usool in <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> and he gave the answers below (<a href=assets/audio/knowl-tazkiyah-abbaad-2.mp3>mp3</a>). The questioner starts with the following:    <P>
<div class='arabic' dir='rtl' align='right'> &#1604;&#1602;&#1583; &#1583;&#1585;&#1587;&#1578; &#1601;&#1610; &#1576;&#1604;&#1583;&#1610; &#1575;&#1604;&#1571;&#1589;&#1608;&#1604; &#1575;&#1604;&#1579;&#1604;&#1575;&#1579;&#1577; &#1608;&#1575;&#1604;&#1602;&#1608;&#1575;&#1593;&#1583; &#1575;&#1604;&#1571;&#1585;&#1576;&#1593; &#1608;&#1603;&#1588;&#1601; &#1575;&#1604;&#1588;&#1576;&#1607;&#1575;&#1578; &#1608;&#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1608;&#1606;&#1608;&#1575;&#1602;&#1590; &#1575;&#1604;&#1575;&#1587;&#1604;&#1575;&#1605; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575; &#1548; &#1601;&#1607;&#1604; &#1604;&#1610; &#1571;&#1606; &#1571;&#1583;&#1585;&#1587; &#1601;&#1610; &#1576;&#1604;&#1583;&#1610; &#1608;&#1604;&#1608; &#1604;&#1605; &#1571;&#1578;&#1581;&#1589;&#1604; &#1593;&#1604;&#1609; &#1578;&#1586;&#1603;&#1610;&#1577; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>I studied <i>al-Usul al-Thalaathah</i>, <i>al-Qawaa'i al-Arba'</i>, <i>Kashf al-Shubuhaat</i>, <i>Kitaab al-Tawheed</i> and <i>Nawaaqid al-Islaam</i> and others in my city. Is it (permissible) for me to teach in my city even though I have not acquired a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> (commendation) from the people of knowledge?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'> &#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1610;&#1593;&#1585;&#1601; &#1602;&#1583;&#1585; &#1606;&#1601;&#1587;&#1607; &#1548;&#1601;&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1588;&#1610;&#1574; &#1605;&#1606; &#1575;&#1604;&#1605;&#1593;&#1585;&#1601;&#1577; &#1610;&#1572;&#1583;&#1610; &#1593;&#1604;&#1609; &#1602;&#1583;&#1585; &#1605;&#1575;&#1610;&#1587;&#1578;&#1591;&#1610;&#1593; &#1548; &#1604;&#1603;&#1606; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1594;&#1610;&#1585; &#1605;&#1578;&#1581;&#1602;&#1602; &#1605;&#1606; &#1590;&#1576;&#1591; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1608;&#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1581;&#1602; &#1601;&#1573;&#1606;&#1607; &#1610;&#1615;&#1582;&#1588;&#1609; &#1593;&#1604;&#1610;&#1607; &#1548; &#1604;&#1603;&#1606; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1578;&#1576; &#1573;&#1584;&#1575; &#1602;&#1585;&#1571;&#1578; &#1588;&#1585;&#1608;&#1581;&#1607;&#1575; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1576;&#1607;&#1575; &#1608;&#1575;&#1604;&#1605;&#1578;&#1605;&#1603;&#1606;&#1610;&#1606; &#1605;&#1606;&#1607;&#1575; &#1608;&#1575;&#1604;&#1578;&#1610; &#1588;&#1585;&#1608;&#1581;&#1607;&#1575; &#1605;&#1601;&#1610;&#1583;&#1577; &#1601;&#1610;&#1607;&#1575; &#1601;&#1571;&#1606;&#1578; &#1578;&#1587;&#1578;&#1601;&#1610;&#1583; &#1608;&#1605;&#1605;&#1603;&#1606; &#1571;&#1606; &#1578;&#1602;&#1585;&#1571; &#1593;&#1604;&#1610;&#1607;&#1605; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1578;&#1576; &#1608;&#1588;&#1585;&#1608;&#1581;&#1607;&#1575; &#1548; &#1571;&#1605;&#1575; &#1603;&#1608;&#1606;&#1603; &#1578;&#1571;&#1578;&#1610; &#1605;&#1606; &#1606;&#1601;&#1587;&#1603; &#1576;&#1588;&#1610;&#1574; &#1608;&#1571;&#1606;&#1578; &#1602;&#1583; &#1604;&#1575; &#1578;&#1603;&#1608;&#1606; &#1605;&#1591;&#1605;&#1574;&#1606; &#1576;&#1607; &#1604;&#1606;&#1601;&#1587;&#1603; &#1601;&#1573;&#1606; &#1605;&#1606; &#1575;&#1604;&#1582;&#1610;&#1585; &#1604;&#1603; &#1575;&#1604;&#1575; &#1578;&#1602;&#1583;&#1605; &#1593;&#1604;&#1609; &#1588;&#1610;&#1574; &#1604;&#1575; &#1578;&#1590;&#1576;&#1591;&#1607; &#1608;&#1604;&#1575; &#1578;&#1578;&#1605;&#1603;&#1606; &#1605;&#1606;&#1607;&#1548; &#1608;&#1604;&#1603;&#1606; &#1573;&#1584;&#1575; &#1602;&#1585;&#1571;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1578;&#1576; &#1608;&#1607;&#1584;&#1607; &#1575;&#1604;&#1588;&#1585;&#1608;&#1581; &#1575;&#1604;&#1578;&#1610; &#1607;&#1610; &#1588;&#1585;&#1608;&#1581; &#1587;&#1604;&#1610;&#1605;&#1577; &#1601;&#1573;&#1606; &#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1610;&#1581;&#1589;&#1604; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>A person knows his own level, so when he has something of knowledge, he can offer it to the extent he is able, but if he is not able to  be precise in the affairs and (arrive) at knowledge of the truth then it is feared for him. However, the likes of these books, when you read them with their explanations coming from the people of knowledge, who have knowledge with respect to these (books), who are firmly-grounded in them, and whose explanations provide benefit with respect to them, then you can benefit and it is possible that you can read these books and the explanations to them. As for you coming and bringing something from yourself and you are not even sure about it yourself, then it is better for you that you do not enter into something that you are not precise in, you are not grounded in. However, if you read these books and explanations  to them, which are sound (correct) explanations, then the objective will be attained.</blockquote>    <P>
Another related question:    <P>
<div class='arabic' dir='rtl' align='right'> &#1571;&#1581;&#1587;&#1606; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1610;&#1603;&#1548; &#1601;&#1610; &#1605;&#1587;&#1571;&#1604;&#1577; &#1602;&#1585;&#1610;&#1576;&#1577; &#1605;&#1606; &#1607;&#1584;&#1607; &#1548; &#1607;&#1608; &#1571;&#1606; &#1576;&#1593;&#1590; &#1575;&#1604;&#1606;&#1575;&#1587; &#1575;&#1604;&#1575;&#1606; &#1602;&#1583; &#1610;&#1578;&#1589;&#1583;&#1585; &#1604;&#1604;&#1578;&#1583;&#1585;&#1610;&#1587; &#1548; &#1608;&#1610;&#1602;&#1575;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1585;&#1580;&#1604; &#1575;&#1604;&#1575;&#1606; &#1604;&#1575; &#1606;&#1593;&#1604;&#1605; &#1575;&#1581;&#1583;&#1575; &#1586;&#1603;&#1575;&#1607; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1607;&#1604; &#1606;&#1580;&#1604;&#1587; &#1573;&#1604;&#1610;&#1607; &#1571;&#1608; &#1604;&#1575; &#1606;&#1580;&#1604;&#1587;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>May Allaah be benevolent to you, regarding a matter that is related to this, which is that some people come forward to teach, and it is said that this man, at this time, we do not know anyone who has given him <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from the people of knowledge, shall we sit with him or shall we not sit with him?</blockquote>    <P>
To which the Shaykh replied:    <P>
<div class='arabic' dir='rtl' align='right'>&#1604;&#1610;&#1587; &#1576;&#1604;&#1575;&#1586;&#1605; &#1571;&#1606; &#1610;&#1603;&#1608;&#1606; &#1603;&#1604; &#1573;&#1606;&#1587;&#1575;&#1606; &#1605;&#1615;&#1586;&#1603;&#1609;&#1548; &#1604;&#1610;&#1587; &#1576;&#1604;&#1575;&#1586;&#1605; &#1548; &#1604;&#1603;&#1606; &#1575;&#1604;&#1603;&#1604;&#1575;&#1605; &#1607;&#1606;&#1575; &#1603;&#1608;&#1606; &#1575;&#1604;&#1575;&#1606;&#1587;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1602;&#1583;&#1585;&#1577; &#1608;&#1578;&#1605;&#1603;&#1606; &#1548; &#1603;&#1604;&#1612; &#1593;&#1604;&#1609; &#1581;&#1587;&#1576; &#1605;&#1575; &#1610;&#1587;&#1578;&#1591;&#1610;&#1593; &#1548; &#1604;&#1608; &#1584;&#1607;&#1576;&#1578; &#1573;&#1604;&#1609; &#1571;&#1610; &#1575;&#1606;&#1587;&#1575;&#1606; &#1605;&#1605;&#1603;&#1606; &#1605;&#1575; &#1578;&#1580;&#1583; &#1593;&#1606;&#1583;&#1607; &#1578;&#1586;&#1603;&#1610;&#1577;&#1548; &#1605;&#1575; &#1603;&#1604; &#1575;&#1606;&#1587;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1578;&#1586;&#1603;&#1610;&#1577; &#1548; &#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1575;&#1604;&#1585;&#1580;&#1604; &#1610;&#1576;&#1604;&#1594; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1575; &#1576;&#1604;&#1594; &#1608;&#1610;&#1583;&#1585;&#1587; &#1608;&#1604;&#1610;&#1587; &#1593;&#1606;&#1583;&#1607; &#1578;&#1586;&#1603;&#1610;&#1577; &#1548; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1578;&#1586;&#1603;&#1610;&#1607; &#1548; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1601;&#1604;&#1575;&#1606; &#1586;&#1603;&#1575;&#1607; &#1548; &#1604;&#1603;&#1606; &#1575;&#1604;&#1605;&#1607;&#1605; &#1603;&#1608;&#1606; &#1575;&#1604;&#1575;&#1606;&#1587;&#1575;&#1606; &#1610;&#1593;&#1585;&#1601; &#1602;&#1583;&#1585; &#1606;&#1601;&#1587;&#1607; &#1548; &#1601;&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1602;&#1583;&#1585;&#1577; &#1608;&#1610;&#1576;&#1606;&#1610; &#1593;&#1604;&#1609; &#1603;&#1604;&#1575;&#1605; &#1593;&#1604;&#1605;&#1575;&#1569; &#1605;&#1581;&#1602;&#1602;&#1610;&#1606; &#1608;&#1585;&#1587;&#1575;&#1574;&#1604; &#1608;&#1588;&#1585;&#1608;&#1581; &#1605;&#1578;&#1593;&#1604;&#1602; &#1576;&#1575;&#1604;&#1605;&#1608;&#1590;&#1608;&#1593; &#1610;&#1583;&#1585;&#1587;&#1607; &#1608;&#1610;&#1578;&#1603;&#1604;&#1605; &#1601;&#1610;&#1607; &#1608;&#1601;&#1602;&#1575; &#1604;&#1605;&#1575; &#1602;&#1575;&#1604;&#1607; &#1575;&#1604;&#1588;&#1575;&#1585;&#1581;&#1608;&#1606; &#1575;&#1604;&#1605;&#1593;&#1578;&#1576;&#1585;&#1608;&#1606; &#1601;&#1610; &#1584;&#1604;&#1603; &#1548; &#1601;&#1573;&#1606; &#1584;&#1604;&#1603; &#1575;&#1604;&#1605;&#1602;&#1589;&#1583; &#1548; &#1608;&#1604;&#1610;&#1587; &#1576;&#1604;&#1575;&#1586;&#1605; &#1573;&#1606; &#1588;&#1601;&#1578; &#1571;&#1581;&#1583;&#1575; &#1610;&#1583;&#1585;&#1587; &#1578;&#1585;&#1608;&#1581; &#1578;&#1587;&#1571;&#1604;&#1607; &#1593;&#1606;&#1583;&#1603; &#1578;&#1586;&#1603;&#1610;&#1577; &#1575;&#1608; &#1605;&#1575; &#1593;&#1606;&#1583;&#1603; &#1578;&#1586;&#1603;&#1610;&#1577;&#1548; </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is not binding for every person to have <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> (commendation), it is not binding. However, the speech here is about a person having ability and grounding, every person to the level he is able. If you went to any person, its possible you will not find him having a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a>, not every person has a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a>, but a man may sometimes reach whatever level of knowledge he has reached, and he teaches yet he does not have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a>, he does not have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a>. He does not anyone who has give him commendation. What is important however is that a person should know his own level, so when he has ability and he bases (his teaching) upon the speech of the investigative scholars, and treatises and explanations related to the topic, he teaches (in the matter) and speaks about it in agreement with what the accepted explainers have said regarding that, because that is the objective. And it is not binding that when you see someone teaching that you go and ask him, "Do you have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> or not have a tazkiyah?"</blockquote>    <P>
The next question:    <P>
<div class='arabic' dir='rtl' align='right'> &#1571;&#1581;&#1587;&#1606; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1610;&#1603;&#1548; &#1605;&#1602;&#1608;&#1604;&#1577; &#1575;&#1576;&#1606; &#1587;&#1610;&#1585;&#1610;&#1606;: ( &#1573;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1604;&#1605; &#1583;&#1610;&#1606; &#1601;&#1575;&#1606;&#1592;&#1585;&#1608;&#1575; &#1593;&#1605;&#1606; &#1578;&#1575;&#1582;&#1584;&#1608;&#1606; &#1583;&#1610;&#1606;&#1603;&#1605;) &#1610;&#1587;&#1578;&#1583;&#1604;&#1608;&#1606; &#1576;&#1607; &#1593;&#1604;&#1609; &#1575;&#1606;&#1607; &#1604;&#1610;&#1587; &#1604;&#1603;&#1604; &#1571;&#1581;&#1583; &#1580;&#1604;&#1587; &#1604;&#1604;&#1578;&#1583;&#1585;&#1610;&#1587;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>May Allaah be benevolent towards you, the statement of Ibn Seereen, "This knowledge is deen, so look to see from whom you are taking your deen", they use this as evidence that it is not for everyone to sit to teach.</blockquote>    <P>
To which the Shaykh replied:    <P>
<div class='arabic' dir='rtl' align='right'>&#1589;&#1581;&#1610;&#1581;&#1548; &#1604;&#1610;&#1587; &#1603;&#1604; &#1571;&#1581;&#1583; &#1548; &#1604;&#1603;&#1606; &#1571;&#1606;&#1575; &#1575;&#1602;&#1608;&#1604; &#1575;&#1604;&#1575;&#1606;&#1587;&#1575;&#1606; &#1575;&#1604;&#1584;&#1610; &#1610;&#1580;&#1604;&#1587; &#1593;&#1604;&#1610;&#1607; &#1571;&#1606; &#1610;&#1593;&#1585;&#1601; &#1602;&#1583;&#1585; &#1606;&#1601;&#1587;&#1607;&#1548; &#1601;&#1573;&#1606; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1602;&#1583;&#1585;&#1577; &#1601;&#1593;&#1604; &#1548; &#1608;&#1594;&#1610;&#1585;&#1607; &#1610;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1606;&#1607;&#1548; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606; &#1605;&#1575; &#1593;&#1606;&#1583;&#1607; &#1602;&#1583;&#1585;&#1577; &#1610;&#1578;&#1585;&#1603; &#1548; &#1571;&#1608; &#1610;&#1602;&#1585;&#1571; &#1575;&#1604;&#1588;&#1610;&#1574; &#1575;&#1604;&#1584;&#1610; &#1603;&#1615;&#1578;&#1576; &#1603;&#1578;&#1575;&#1576;&#1577; &#1587;&#1604;&#1610;&#1605;&#1577; &#1608;&#1603;&#1575;&#1578;&#1576;&#1607;&#1575; (...&#1603;&#1604;&#1605;&#1577; &#1594;&#1610;&#1585; &#1608;&#1575;&#1590;&#1581;&#1577;) &#1605;&#1579;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1575;&#1576;&#1606; &#1576;&#1575;&#1586; &#1608;&#1575;&#1576;&#1606; &#1593;&#1579;&#1610;&#1605;&#1610;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is correct, it is not for everyone, but I say that a person who has (others) sitting around him he should know his level, so if he has ability, then he does so and others can benefit from him. And if he does not have ability, then he abandons it, or he reads something that has been written and is sound and its author (word unclear) such as Ibn Baz, Ibn Uthaymeen.</blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/wpvti-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-12.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?wpvti<BR>

<li><a href="articles/aninc-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-10.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 10: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?aninc<BR>

<li><a href="articles/iknhb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-8.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?iknhb<BR>

<li><a href="articles/cajxz-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-7.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</a><BR>
https://www.manhaj.com/manhaj/?cajxz<BR>

<li><a href="articles/laknb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-6.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 6: Shaykh Ubayd al-Jaabiree</a><BR>
https://www.manhaj.com/manhaj/?laknb<BR>

<li><a href="articles/pdziw-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-5.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?pdziw<BR>

<li><a href="articles/xkdrv-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-4.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 4: Shaykh Zayd al-Madkhali</a><BR>
https://www.manhaj.com/manhaj/?xkdrv<BR>

<li><a href="articles/rqltx-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-3.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 3: Shaykh Muhammad bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?rqltx<BR>

<li><a href="articles/xkjsh-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-2.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 2: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?xkjsh<BR>

<li><a href="articles/fpjyl-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-1.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 1: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?fpjyl<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?wpvti by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:31 GMT -->
</html>


