

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?dkhtd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:31 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (2) - Takfir of the Raafidah</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (2) - Takfir of the Raafidah</span><BR>
Thursday, July 17 2014 - by Manhaj.Com 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>In this series of articles we present the statements of the Scholars of Ahl al-Sunnah which clarify and explain the issue of (<span class='arb' dir='rtl'>&#1575;&#1604;&#1593;&#1584;&#1585; &#1576;&#1575;&#1604;&#1580;&#1607;&#1604;</span>), the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a>, and also (<span class='arb' dir='rtl'>&#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605; &#1605;&#1606; &#1575;&#1604;&#1583;&#1610;&#1606; &#1576;&#1575;&#1604;&#1590;&#1585;&#1608;&#1585;&#1577;</span>), that which is known from the religion by necessity. There is much confusion and speculation about this issue, despite the fact that it is very clear in the speech of the Scholars. One should also be aware of factions of the <b>Takfiris, Qutbis</b> who allege that the Scholars of Ahl al-Sunnah such as Imaam Ibn Baz, Imaam <a href='tags/ibn-uthaymin.html' class='tagLink'><font class='tagLink'>Ibn Uthaymin</font></a>, Imaam al-Albaani, Shaykh Abd al-Muhsin al-Abbaad and many other contemporary Scholars are "revisionists," a charge levelled because these Scholars did not agree to their methodologies and positions (of mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of nations and societies or <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of certain rulers). Hence, they extended this claim of revisionism beyond the issue of the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the rulers into other issues (such as the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> and that which is known from the religion by necessity) in order to discredit these Scholars and make the people not take from them and instead to drive the people towards the Harakiyyeen and their figureheads. These Qutbis and Takfiris are ignorant people, they are pretenders to knowledge, and they employ much deception. Instead of being honest and saying that difference in this issue can be found right through the history of the da'wah of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> in Najd, and varying sayings can be found amongst the Scholars of the da'wah, they opted for their usual trait of deception and lies and tried to attack those Scholars who spoke against their Qutbi da'wah by accusing them of being "revisionists" merely because they held the view of granting the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> in matters of kufr and shirk within certain circumstances. Addressing their falsehood and their conniving in detail is for another place. Here we want to systematically document the sayings of the scholars for the purposes of building a record and at a later time, we will inshaa'Allaah, discuss some of these issues with the purpose of clarification.</blockquote></div> <P> 


<p><font class='titleHeadline'>Shaykh Salih <a href='tags/al-fawzan.html' class='tagLink'><font class='tagLink'>al-Fawzan</font></a> on <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>takfir</font></a> of the Raafidah</font>    <P>
The Shaykh was asked:    <P>
<div class='arabic' dir='rtl' align='right'>&#1571;&#1581;&#1587;&#1606; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1610;&#1603;&#1605; &#1589;&#1575;&#1581;&#1576; &#1575;&#1604;&#1601;&#1590;&#1610;&#1604;&#1577;: &#1610;&#1602;&#1608;&#1604;: &#1607;&#1604; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1603;&#1601;&#1575;&#1585;&#1548; &#1608;&#1607;&#1604; &#1610;&#1615;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1593;&#1604;&#1605;&#1575;&#1574;&#1607;&#1605; &#1608;&#1593;&#1575;&#1605;&#1578;&#1607;&#1605; &#1601;&#1610; &#1584;&#1604;&#1603;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>May Allah be benevolent to possessor of excellence, he says: Are the Rafidah disbelievers and is to be distinguished between their scholars and general-folk in that regard?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'> &#1575;&#1604;&#1602;&#1575;&#1593;&#1583;&#1577; &#1571;&#1606; &#1603;&#1604;&#1617;&#1614; &#1605;&#1606; &#1583;&#1593;&#1575; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1571;&#1608; &#1584;&#1576;&#1581; &#1604;&#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1571;&#1608; &#1593;&#1605;&#1604; &#1571;&#1610; &#1593;&#1576;&#1575;&#1583;&#1577; &#1604;&#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1601;&#1573;&#1606;&#1607; &#1603;&#1575;&#1601;&#1585; &#1587;&#1608;&#1575;&#1569; &#1603;&#1575;&#1606; &#1605;&#1606; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1608; &#1594;&#1610;&#1585;&#1607;&#1605; &#1548; &#1605;&#1606; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1608; &#1594;&#1610;&#1585;&#1607;&#1605; .   &#1605;&#1614;&#1606; &#1593;&#1614;&#1576;&#1614;&#1583;&#1614; &#1594;&#1610;&#1585; &#1575;&#1604;&#1604;&#1607; &#1576;&#1571;&#1610; &#1606;&#1608;&#1593; &#1605;&#1606; &#1571;&#1606;&#1608;&#1575;&#1593; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1577; &#1601;&#1573;&#1606;&#1607; &#1603;&#1575;&#1601;&#1585; &#1608; &#1603;&#1584;&#1604;&#1603; &#1605;&#1606; &#1586;&#1593;&#1605; &#1571;&#1606;&#1617; &#1571;&#1581;&#1583;&#1611;&#1575; &#1610;&#1580;&#1576; &#1573;&#1578;&#1576;&#1575;&#1593;&#1607; &#1605;&#1606; &#1594;&#1610;&#1585; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1601;&#1573;&#1606;&#1607; &#1603;&#1575;&#1601;&#1585; &#1605;&#1606; &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1608; &#1605;&#1606; &#1594;&#1610;&#1585;&#1607;&#1605;. &#1575;&#1604;&#1585;&#1575;&#1601;&#1590;&#1577; &#1610;&#1585;&#1608;&#1606; &#1571;&#1606;&#1617; &#1604;&#1571;&#1574;&#1605;&#1578;&#1607;&#1605; &#1605;&#1606;&#1586;&#1604;&#1577; &#1571;&#1593;&#1604;&#1609; &#1605;&#1585;&#1578;&#1576;&#1577; &#1605;&#1606; &#1575;&#1604;&#1585;&#1587;&#1604; &#1608; &#1571;&#1606; &#1571;&#1574;&#1605;&#1578;&#1607;&#1605; &#1604;&#1575; &#1610;&#1582;&#1591;&#1574;&#1608;&#1606; &#1608; &#1571;&#1606;&#1607;&#1605; &#1605;&#1593;&#1589;&#1608;&#1605;&#1608;&#1606; &#1548; &#1605;&#1593;&#1589;&#1608;&#1605;&#1608;&#1606; &#1604;&#1575; &#1610;&#1582;&#1591;&#1574;&#1608;&#1606; &#1548; &#1608; &#1571;&#1606; &#1604;&#1607;&#1605; &#1575;&#1604;&#1581;&#1602; &#1601;&#1610; &#1571;&#1606; &#1610;&#1581;&#1604;&#1604;&#1608;&#1575; &#1605;&#1575; &#1571;&#1585;&#1575;&#1583;&#1608;&#1575; &#1608; &#1610;&#1581;&#1585;&#1605;&#1608;&#1575; &#1605;&#1575; &#1571;&#1585;&#1575;&#1583;&#1608;&#1575;&#1548; &#1571;&#1604;&#1610;&#1587; &#1607;&#1584;&#1575; &#1571;&#1593;&#1592;&#1605; &#1575;&#1604;&#1603;&#1601;&#1585; &#1608; &#1575;&#1604;&#1593;&#1610;&#1575;&#1584; &#1576;&#1575;&#1604;&#1604;&#1607;. &#1607;&#1584;&#1575; &#1593;&#1606;&#1583;&#1607;&#1605; &#1601;&#1610; &#1603;&#1578;&#1576;&#1607;&#1605; &#1605;&#1575; &#1607;&#1608; &#1576;&#1582;&#1601;&#1610;&#1548; &#1608;&#1593;&#1606;&#1583;&#1607;&#1605; &#1571;&#1605;&#1608;&#1585; &#1603;&#1579;&#1610;&#1585;&#1577; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The principle is that whoever invoked those besides Allaah or sacrificed to other than Allaah or performed any action of worship for other than Allaah, then he is a disbeliever whether he is from the Raafidah or other than them, from the Raafidah or other than them. Whoever worships other than Allaah with any of the types of worship, then he is a disbeliever and likewise whoever claims that it is obligatory to follow one besides the Messenger (sallallaahu alayhi wasallam), then he is a disbeliever, from amongst the Raafidah or other than them. The Raafidah consider their imaams to have a higher status than the Messenger, and that their imaams do not err, that they are infallible, they do not errr. And that they have the right to declare lawful what they wish and declare unlawful what they wish. Is this not the greatest disbelief and refuge  is with Allaah. This is found with them in their books, this is not hidden, and they have many affairs besides that.</blockquote>    <P>
The Questioner said:    <P>
<div class='arabic' dir='rtl' align='right'>&#1610;&#1602;&#1608;&#1604;: &#1608;&#1607;&#1604; &#1610;&#1615;&#1601;&#1614;&#1585;&#1617;&#1614;&#1602; &#1576;&#1610;&#1606; &#1593;&#1604;&#1605;&#1575;&#1574;&#1607;&#1605; &#1608;&#1593;&#1575;&#1605;&#1578;&#1607;&#1605; &#1601;&#1610; &#1584;&#1604;&#1603;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He (the questioner) says: Is to be distinguished between their scholars and general-folk in that regard?</blockquote>    <P>
The Shaykh replied:    <P>
<div class='arabic' dir='rtl' align='right'> &#1593;&#1604;&#1605;&#1575;&#1572;&#1607;&#1605; &#1571;&#1588;&#1583;&#1548; &#1604;&#1571;&#1606;&#1607;&#1605; &#1610;&#1593;&#1585;&#1601;&#1608;&#1606; &#1571;&#1606; &#1607;&#1584;&#1575; &#1576;&#1575;&#1591;&#1604; &#1608;&#1571;&#1582;&#1584;&#1608;&#1607;&#1548; &#1604;&#1575; &#1588;&#1603; &#1601;&#1610; &#1603;&#1601;&#1585;&#1607;&#1605;&#1548; &#1571;&#1605;&#1575; &#1593;&#1608;&#1575;&#1605;&#1607;&#1605; &#1601;&#1573;&#1584;&#1575; &#1571;&#1602;&#1610;&#1605;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1581;&#1580;&#1577; &#1608; &#1571;&#1589;&#1585;&#1608;&#1575; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606;&#1548; &#1571;&#1605;&#1575; &#1605;&#1575; &#1604;&#1605; &#1578;&#1602;&#1605; &#1593;&#1604;&#1610;&#1607;&#1605; &#1575;&#1604;&#1581;&#1580;&#1577; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1571;&#1607;&#1604; &#1590;&#1604;&#1575;&#1604; &#1608; &#1604;&#1575; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606; .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Their scholars are more severe, because they know that this  is falsehood and they adopted it, there is no doubt about their disbelief. As for their common-folk, if  the proof is established against them and then they persist, they disbelieve. As for when the proof is not established, then they are people of misguidance and they do not disbelieve.</blockquote>    <P>
<b>Source:</b> <i>At-Ta'leeq al-Mukhtasar alaa al-Qaseedah al-Nooniyyah</i> (3/1342) through <a href=http://www.sahab.net/forums/index.php?showtopic=145409>Sahab.Net</a> and <a href=http://www.alfawzan.af.org.sa/node/5118>original audio</a> here on the Shaykhs website, download (<a href=assets/audio/fawzan-takfir-rafidah-01.mp3>MP3</a>).    <P>
Three clear points are taken from the above fatwa: <b>a)</b> Not everyone who falls into kufr or shirk automatically becomes a kafir or mushrik, <b>b)</b> there are situations in which the one falling into kufr and shirk may be excused - from those who ascribe to Islaam - such as ignorance, blind-following, faulty interpretation (ta'weel) and the likes, <b>c)</b> judging upon a specific individual requires presence of conditions and absence of barriers (to takfir) and this is what is meant by "establishing the proof".     <P>
The Shaykh does have other speech that suggests the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a> does not apply (in matters treated as "known by necessity" or "through conveyance of the Qur'an" etc.), however the intent here is to show that this view has been held by the Shaykh (and that there is differing about it between the Scholars) and this is a silencing of the <b><a href='tags/haddaadiyyah.html' class='tagLink'><font class='tagLink'>Haddaadiyyah</font></a></b> who are using this issue to ascribe Irjaa' to many of the Salafi Scholars who affirm the <a href='tags/excuse-of-ignorance.html' class='tagLink'><font class='tagLink'>excuse of ignorance</font></a>  and they include Scholars of <a href='tags/tawhid.html' class='tagLink'><font class='tagLink'>Tawhid</font></a> from Najd in what has passed and likewise the contemporary Scholars, <a href='tags/al-albani.html' class='tagLink'><font class='tagLink'>al-Albani</font></a>, Ibn al-Uthaymin, Abdul-Muhsin al-Abbaad and so on.    <P>
 <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/xyjjc-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5---on-those-who-worship-the-righteous.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5) - On Those Who Worship the Righteous Upon Ignorance</a><BR>
https://www.manhaj.com/manhaj/?xyjjc<BR>

<li><a href="articles/zmhyr-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen-2.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen (2)</a><BR>
https://www.manhaj.com/manhaj/?zmhyr<BR>

<li><a href="articles/uufmf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-5.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (5)</a><BR>
https://www.manhaj.com/manhaj/?uufmf<BR>

<li><a href="articles/wvnjp-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-aziz-bin-baz.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Aziz Bin Baz</a><BR>
https://www.manhaj.com/manhaj/?wvnjp<BR>

<li><a href="articles/illhh-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-4---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (4) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?illhh<BR>

<li><a href="articles/gzrsz-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-3---takfir-of-the-raafidah.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (3) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?gzrsz<BR>

<li><a href="articles/dkhtd-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan-2.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (2) - Takfir of the Raafidah</a><BR>
https://www.manhaj.com/manhaj/?dkhtd<BR>

<li><a href="articles/obkwf-takfir-and-the-excuse-of-ignorance-shaykh-saalih-al-fawzaan.html">Takfir and the Excuse of Ignorance: Shaykh Saalih al-Fawzaan (1)</a><BR>
https://www.manhaj.com/manhaj/?obkwf<BR>

<li><a href="articles/uncnb-takfir-and-the-excuse-of-ignorance-shaykh-abd-al-muhsin-al-abbaad.html">Takfir and the Excuse of Ignorance: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?uncnb<BR>

<li><a href="articles/ecksy-takfir-and-the-excuse-of-ignorance-shaykh-rabee-bin-haadee.html">Takfir and the Excuse of Ignorance: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?ecksy<BR>

<li><a href="articles/wwqny-takfir-and-the-excuse-of-ignorance-shaykh-muhammad-bin-abd-al-wahhaab.html">Takfir and the Excuse of Ignorance: Shaykh Muhammad bin Abd al-Wahhaab</a><BR>
https://www.manhaj.com/manhaj/?wwqny<BR>

<li><a href="articles/xwouo-takfir-and-the-excuse-of-ignorance-shaykh-ibn-uthaymeen.html">Takfir and the Excuse of Ignorance: Shaykh Ibn Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?xwouo<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?dkhtd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:31 GMT -->
</html>


