

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?cajxz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Manhaj.Com | Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</span><BR>
Tuesday, October 01 2013 - by Abu.Iyaad 
<hr size="1" noshade>
<b>Read more articles at Manhaj.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'><blockquote>Following the role of Ahl al-Sunnah in the West of conveying the speech of the Scholars regarding certain figureheads who went astray, the followers of many of these figureheads spread doubts about some of the callers in the West, with respect to teaching and giving da'wah, claiming that a person must have a <a href='tags/tazkiyah.html' class='tagLink'><font class='tagLink'>tazkiyah</font></a> to teach, or he  must have graduated from an institution and so on. <b>However, the reality of the matter is that those whom they target in this way actually have  connections with the Scholars, they travel to them, and take knowledge from them in aqidah, manhaj and fiqh, even if they have not formally studied in an institution, or graduated or have a specific tazkiyah</b>. The real reason for these doubts is to undermine what the callers do in the West (in addition to calling to the Sunnah) of warning from doubts, innovations and desires and warning from the people who are upon them or promote them. The articles in these series will shed light on this matter and repel the doubts spread. No one article in this series should be read in isolation as it is possible for <u>a person with ulterior motives</u> to utilize some of these fatwas from the scholars to justify isolation and separation away from the main body of Salafis in that land and from their centres and mosques with the claim that everybody has the green light to teach, and so some of them teach in the mosques and centres of the hizbees and others teach in their homes (often secretly) whilst spreading poison that aims to isolate people from the students of knowledge. Rather, all the statements of all the Shaykhs <b>should be put together and understood collectively</b> to get a clearer picture of this whole affair. This is because there are generalizations in some fatwas, clarifications in others, important minor details in others, and contexts in some fatwas not found in others. All of this should be put together to get a full, comprehensive picture. <u>Alongside the clarifications in these articles</u>, it should be still be stressed that seeking knowledge from the Scholars, by travelling to them and sitting in their lessons is of utmost importance and should not be neglected as it is <u>the primary route</u> of seeking knowledge. And for those who are unable to do this, <b>then they should take from the students of knowledge in their lands, those who have connections with the Scholars, have studied with them and take from them.</b> So they should attend their lessons, in the Salafi mosques and centres, and any issues that arise such as requiring a fatwa, or removal of a <i>shubhah</i> or clarification in an issue of knowledge, then those students of knowledge can return these questions to the Scholars on behalf of the people of that land if the answer is not already known.     <P>
Here are links to all articles so far for easy reference:     <P>
<b>Shaykh Abd al-Muhsin al-Abbaad</b> (<a href=index67d0.html?fpjyl>see here</a>)  <b>Shaykh Zayd al-Madkhali</b> (<a href=index292c.html?xkdrv>see here</a>)  <b>Shaykh Muhammad bin Haadee</b> (<a href=index7c01.html?rqltx>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5b8a.html?pdziw>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index4f73.html?xkjsh>see here</a>)   <b>Shaykh Ubayd al-Jaabiree</b> (<a href=index3c84.html?laknb>see here</a>)   <b>Shaykh Abdullah al-Ghudayan</b> (<a href=indexbaf0.html?cajxz>see here</a>)  <b>Shaykh Rabee bin Haadee</b> (<a href=indexa1a5.html?iknhb>see here</a>)  <b>Shaykh Ibn al-Uthaymeen</b> (<a href=index5ea5.html?ccblo>see here</a>)  <b>Shaykh Ahmad Bazmul</b> (<a href=indexd377.html?ibtpx>see here</a>)  <b>Shaykh Saalih al-Fawzaan</b> (<a href=index3ed6.html?aninc>see here</a>).    <P>
.    <P>
<!---The bottom line is that knowledge can be sought from books and cassettes where it is not possible to take it directly from the scholars, though this is a longer and more burdensome route than taking it from the scholars directly. And it is not a condition that a person  must have a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar prior to teaching or giving da'wah. However, a person must know his limit and capability and not transgress it and not speak about matters he does not know and he must also seek to understand thoroughly that which he conveys so that where explanation is required he is able to explain that knowledge, and further, he must only resort to books of trusted, deeply-rooted scholars. <b>In all cases, the seeking of knowledge from the scholars directly is the quickest,  easiest route as it allows discussion and for clarifications to be made</b>. Whether a person is fit to convey and teach is known by two ways, either a <a href='https://www.manhaj.com/manhaj/tags/tazkiyah.cfm' class='tagLink'><font class='tagLink'>tazkiyah</font></a> from a scholar or by it being it well known by the people of his land that he has knowledge, understanding and ability. //--->  </blockquote></div> <P> 


<p>Shaykh Abdullah al-Ghudayan was asked the following question (<a href=assets/audio/knowl-tazkiyah-ghudayan.mp3>mp3</a>) regarding a sister who seeks knowledge through books and tapes which are translations and whether she is allowed to teach in the mosque:    <P>
<div class='arabic' dir='rtl' align='right'>&#1571;&#1614;&#1581;&#1618;&#1587;&#1614;&#1606;&#1614; &#1575;&#1604;&#1604;&#1607;&#1615; &#1573;&#1616;&#1604;&#1614;&#1610;&#1603;&#1615;&#1605;&#1618; &#1608;&#1616;&#1576;&#1614;&#1575;&#1585;&#1616;&#1603;&#1614; &#1575;&#1604;&#1604;&#1607;&#1615; &#1601;&#1616;&#1610;&#1603;&#1615;&#1605;&#1618; &#1548; &#1608;&#1614;&#1607;&#1614;&#1584;&#1614;&#1575; &#1587;&#1615;&#1572;&#1614;&#1575;&#1604;&#1612; &#1578;&#1614;&#1587;&#1618;&#1571;&#1614;&#1604;&#1615; &#1575;&#1604;&#1587;&#1614;&#1617;&#1575;&#1574;&#1616;&#1604;&#1614;&#1577;&#1615; &#1578;&#1614;&#1602;&#1615;&#1608;&#1604;&#1615; : &#1575;&#1604;&#1618;&#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1614;&#1577;&#1615; &#1575;&#1604;&#1614;&#1617;&#1578;&#1616;&#1610; &#1591;&#1614;&#1604;&#1614;&#1576;&#1614;&#1578; &#1575;&#1604;&#1618;&#1593;&#1616;&#1604;&#1618;&#1605;&#1614; &#1593;&#1614;&#1606;&#1618; &#1591;&#1614;&#1585;&#1616;&#1610;&#1602;&#1616; &#1575;&#1604;&#1618;&#1603;&#1615;&#1578;&#1615;&#1576;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1571;&#1614;&#1588;&#1618;&#1585;&#1616;&#1591;&#1614;&#1577;&#1616; &#1575;&#1604;&#1618;&#1605;&#1615;&#1578;&#1614;&#1585;&#1618;&#1580;&#1614;&#1605;&#1614;&#1577;&#1616; &#1608;&#1614;&#1604;&#1614;&#1583;&#1614;&#1610;&#1607;&#1614;&#1575; &#1601;&#1615;&#1585;&#1618;&#1589;&#1614;&#1577;&#1612; &#1604;&#1616;&#1604;&#1618;&#1575;&#1616;&#1578;&#1616;&#1617;&#1589;&#1614;&#1575;&#1604;&#1616; &#1576;&#1616;&#1575;&#1604;&#1618;&#1593;&#1615;&#1604;&#1614;&#1605;&#1614;&#1575;&#1569;&#1616; &#1576;&#1616;&#1605;&#1614;&#1575; &#1610;&#1615;&#1588;&#1618;&#1603;&#1616;&#1604;&#1615; &#1593;&#1614;&#1604;&#1614;&#1610;&#1607;&#1614;&#1575; &#1548; &#1607;&#1614;&#1604;&#1618; &#1610;&#1614;&#1580;&#1615;&#1608;&#1586;&#1615; &#1604;&#1614;&#1607;&#1614;&#1575; &#1571;&#1614;&#1608;&#1618; &#1610;&#1615;&#1605;&#1618;&#1603;&#1616;&#1606;&#1615; &#1604;&#1614;&#1607;&#1614;&#1575; &#1571;&#1614;&#1606;&#1618; &#1578;&#1615;&#1583;&#1614;&#1585;&#1616;&#1617;&#1587;&#1614; &#1575;&#1604;&#1618;&#1605;&#1615;&#1587;&#1618;&#1604;&#1616;&#1605;&#1614;&#1575;&#1578;&#1616; &#1601;&#1616;&#1610; &#1575;&#1604;&#1618;&#1605;&#1614;&#1587;&#1618;&#1580;&#1616;&#1583;&#1616;  &#1576;&#1614;&#1606;&#1614;&#1617;&#1575;&#1569;&#1575;&#1611; &#1593;&#1614;&#1604;&#1614;&#1609; &#1593;&#1614;&#1583;&#1614;&#1605;&#1616; &#1608;&#1615;&#1580;&#1615;&#1608;&#1583;&#1616; &#1571;&#1581;&#1614;&#1583;&#1613; &#1594;&#1616;&#1610;&#1614;&#1585;&#1616;&#1607;&#1614;&#1575; &#1604;&#1616;&#1578;&#1614;&#1593;&#1618;&#1604;&#1616;&#1610;&#1605;&#1616;&#1607;&#1616;&#1606;&#1614;&#1617; &#1604;&#1616;&#1604;&#1618;&#1571;&#1615;&#1605;&#1615;&#1608;&#1585;&#1616; &#1575;&#1604;&#1571;&#1582;&#1604;&#1575;&#1602;&#1610;&#1577; &#1608;&#1614;&#1575;&#1604;&#1618;&#1593;&#1614;&#1602;&#1616;&#1610;&#1583;&#1614;&#1577;&#1616; &#1608;&#1614;&#1575;&#1604;&#1618;&#1605;&#1616;&#1606;&#1618;&#1607;&#1614;&#1580;&#1616; &#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>May Allaah be benevolent to you and bless you. And this question, the female questioner says: A muslim woman who seeks knowledge through the route of translated books and cassettes and she has the opportunity to contact the scholars for matters that become difficult for her (to understand). Is it permisible for her, or possible for her to teach other Muslim women in the mosque built upon the situation of there not being anyone besides her to teach them matters of etiquette, creed and methodology?</blockquote>    <P>
The Shaykh answered:    <P>
<div class='arabic' dir='rtl' align='right'> &#1605;&#1606; &#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605; &#1571;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1582;&#1589; &#1610;&#1571;&#1582;&#1584; &#1575;&#1604;&#1593;&#1604;&#1605; &#1605;&#1606; &#1571;&#1601;&#1608;&#1575;&#1607; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1608;&#1610;&#1571;&#1582;&#1584; &#1603;&#1604; &#1593;&#1604;&#1605; &#1605;&#1606; &#1575;&#1604;&#1588;&#1582;&#1589; &#1575;&#1604;&#1605;&#1578;&#1605;&#1603;&#1616;&#1617;&#1606; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1601;&#1593;&#1606;&#1583;&#1605;&#1575; &#1610;&#1585;&#1610;&#1583; &#1571;&#1606; &#1610;&#1571;&#1582;&#1584; &#1593;&#1604;&#1605; &#1578;&#1601;&#1587;&#1610;&#1585; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1610;&#1571;&#1582;&#1584;&#1607; &#1593;&#1606; &#1588;&#1582;&#1589; &#1605;&#1578;&#1605;&#1603;&#1616;&#1617;&#1606; &#1601;&#1610; &#1607;&#1584;&#1575;&#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1607;&#1603;&#1584;&#1575; &#1587;&#1575;&#1574;&#1585; &#1575;&#1604;&#1593;&#1604;&#1608;&#1605; &#1575;&#1604;&#1571;&#1582;&#1585;&#1609; &#1607;&#1584;&#1607; &#1608;&#1587;&#1610;&#1604;&#1577;.    <P>
&#1608;&#1575;&#1604;&#1608;&#1587;&#1610;&#1604;&#1577; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577;: &#1571;&#1606;&#1614;&#1617; &#1575;&#1604;&#1588;&#1582;&#1589; &#1610;&#1602;&#1585;&#1571; &#1575;&#1604;&#1603;&#1578;&#1576;&#1563; &#1608;&#1604;&#1603;&#1606; &#1604;&#1575; &#1610;&#1602;&#1585;&#1571; &#1575;&#1604;&#1603;&#1578;&#1576; &#1608;&#1610;&#1593;&#1578;&#1605;&#1583; &#1593;&#1604;&#1610;&#1607;&#1575; &#1573;&#1604;&#1575; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1605;&#1572;&#1607;&#1614;&#1617;&#1604;&#1575; &#1604;&#1601;&#1607;&#1605;&#1607;&#1575; &#1593;&#1604;&#1609; &#1608;&#1580;&#1607; &#1589;&#1581;&#1610;&#1581;&#1548; &#1604;&#1571;&#1606;&#1607; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1593;&#1606;&#1583;&#1607; &#1602;&#1589;&#1608;&#1585; &#1601;&#1610; &#1601;&#1607;&#1605;&#1607; &#1601;&#1602;&#1583; &#1610;&#1601;&#1607;&#1605; &#1575;&#1604;&#1588;&#1610;&#1569; &#1593;&#1604;&#1609; &#1594;&#1610;&#1585; &#1608;&#1580;&#1607;&#1607; &#1608;&#1576;&#1593;&#1583; &#1584;&#1604;&#1603; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1605;&#1575; &#1601;&#1607;&#1605; &#1608;&#1605;&#1575; &#1578;&#1603;&#1604;&#1605; &#1576;&#1607; &#1610;&#1603;&#1608;&#1606; &#1582;&#1591;&#1571; &#1601;&#1610;&#1593;&#1605;&#1604; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1605;&#1575; &#1601;&#1607;&#1614;&#1617;&#1605;&#1607;&#1605; &#1576;&#1607; &#1593;&#1604;&#1609; &#1587;&#1576;&#1610;&#1604; &#1575;&#1604;&#1582;&#1591;&#1571; &#1601;&#1610;&#1578;&#1581;&#1605;&#1614;&#1617;&#1604; &#1573;&#1579;&#1605;&#1607;&#1605;.    <P>
&#1608;&#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1571;&#1606;&#1575; &#1571;&#1606;&#1589;&#1581;&#1607;&#1575; &#1571;&#1606;&#1607;&#1575; &#1604;&#1575; &#1578;&#1583;&#1585;&#1616;&#1617;&#1587; &#1576;&#1606;&#1575;&#1569;&#1611; &#1593;&#1604;&#1609; &#1571;&#1606;&#1607;&#1575; &#1578;&#1602;&#1585;&#1571; &#1575;&#1604;&#1603;&#1578;&#1576; &#1576;&#1583;&#1608;&#1606; &#1571;&#1581;&#1583; &#1610;&#1601;&#1607;&#1616;&#1617;&#1605;&#1607;&#1575; &#1607;&#1584;&#1607; &#1575;&#1604;&#1603;&#1578;&#1576;. &#1607;&#1584;&#1575; &#1575;&#1604;&#1580;&#1608;&#1575;&#1576; &#1593;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is known that a person takes knowledge from the mouths of the scholars and takes every (type) of knowledge from the person who is grounded in this knowledge. So when you wish to take knowledge of tafseer of the Qur'ann you take it from a person grounded in this knowledge and likewise for all the other sciences. This is one means.    <P>
The second means is that a person reads books, but he does not read books and depend on them unless he is fit and capable of understanding them upon the right way. Because if he had deficiency in his understanding he may understand something upon other than the correct way and afterwards he may speak with what he has understood and what he speaks with is a mistake, then the people act upon what he has made them to understand erroneously and hence he will carry the burden of their sin.    <P>
And in relation to this woman, I advise her that she does not teach because she reads from (translated) books without anyone to make her understand these books. This is the answer to this question.</blockquote> <P> 

</div>
<br>



<span class="smallHeadline">Related Articles:</span><BR>
<ul>

<li><a href="articles/wpvti-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-12.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 11: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?wpvti<BR>

<li><a href="articles/aninc-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-10.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 10: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?aninc<BR>

<li><a href="articles/iknhb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-8.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 8: Shaykh Rabee bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?iknhb<BR>

<li><a href="articles/cajxz-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-7.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 7: Shaykh Abdullah al-Ghudayaan</a><BR>
https://www.manhaj.com/manhaj/?cajxz<BR>

<li><a href="articles/laknb-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-6.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 6: Shaykh Ubayd al-Jaabiree</a><BR>
https://www.manhaj.com/manhaj/?laknb<BR>

<li><a href="articles/pdziw-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-5.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 5: Shaykh Ibn al-Uthaymeen</a><BR>
https://www.manhaj.com/manhaj/?pdziw<BR>

<li><a href="articles/xkdrv-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-4.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 4: Shaykh Zayd al-Madkhali</a><BR>
https://www.manhaj.com/manhaj/?xkdrv<BR>

<li><a href="articles/rqltx-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-3.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 3: Shaykh Muhammad bin Haadee</a><BR>
https://www.manhaj.com/manhaj/?rqltx<BR>

<li><a href="articles/xkjsh-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-2.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 2: Shaykh Saalih al-Fawzaan</a><BR>
https://www.manhaj.com/manhaj/?xkjsh<BR>

<li><a href="articles/fpjyl-is-tazkiyah-or-graduation-required-before-one-teaches-and-gives-dawah-part-1.html">Is Tazkiyah (or Graduation) Required Before One Teaches and Gives Da'wah? Part 1: Shaykh Abd al-Muhsin al-Abbaad</a><BR>
https://www.manhaj.com/manhaj/?fpjyl<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.manhaj.com/manhaj/print.cfm?cajxz by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 10:47:41 GMT -->
</html>


