

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.islamagainstextremism.com/print.cfm?hnjsd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:18:12 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>IslamAgainstExtremism.Com | Imam Al-Albani: The Prophetic Description of 'Dogs of Hellfire' and Contemporary Takfiri Kharijites </title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>IslamAgainstExtremism.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Imam Al-Albani: The Prophetic Description of 'Dogs of Hellfire' and Contemporary Takfiri Kharijites </span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Admin.html">Admin</a> on  Tuesday, July, 26 2011 and
 filed under <a href="categories/aj-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/kharijites.html">
Kharijites 
</a> &#149; <a href="tags/sayyid-qutb.html">
Sayyid Qutb 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p>The late and great hadith Scholar, <b>Muhammad Nasir al-Din al-Albani</b> (rahimahullaah) stated about the contemporary <a href='tags/takfiri.html' class='tagLink'><font class='tagLink'>takfiri</font></a> and revolutionary movements that were spawned in the 1960s onwards, [the head of them being <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> (see   <a href=http://www.takfiris.com/takfir/?lyhev>here</a>, <a href=http://www.takfiris.com/takfir/?xbnsa>here</a>, <a href=http://www.takfiris.com/takfir/?hulwt>here</a>, <a href=http://www.takfiris.com/takfir/?ezjol>here</a> and <a href=http://www.takfiris.com/takfir/?wmagi>here</a>)], the following:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1608;&#1575;&#1604;&#1605;&#1602;&#1589;&#1608;&#1583; &#1571;&#1606;&#1607;&#1605; &#1587;&#1606;&#1617;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1587;&#1606;&#1577;&#1611; &#1587;&#1610;&#1574;&#1577; &#1548;&#1608;&#1580;&#1593;&#1604;&#1608;&#1575; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1583;&#1610;&#1606;&#1575;&#1611; &#1593;&#1604;&#1609; &#1605;&#1585; &#1575;&#1604;&#1586;&#1605;&#1575;&#1606; &#1608;&#1575;&#1604;&#1571;&#1610;&#1575;&#1605; &#1548; &#1585;&#1594;&#1605; &#1578;&#1581;&#1584;&#1610;&#1585; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1605;&#1606;&#1607;&#1605; &#1601;&#1610; &#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1603;&#1579;&#1610;&#1585;&#1577; &#1548; &#1605;&#1606;&#1607;&#1575; &#1602;&#1608;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1603;&#1604;&#1575;&#1576; &#1575;&#1604;&#1606;&#1575;&#1585;.&#1608;&#1585;&#1594;&#1605; &#1571;&#1606;&#1607;&#1605; &#1604;&#1605; &#1610;&#1585;&#1608;&#1575; &#1603;&#1601;&#1585;&#1575;&#1611; &#1576;&#1614;&#1608;&#1575;&#1581;&#1575;&#1611; &#1605;&#1606;&#1607;&#1605; &#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1605;&#1575; &#1583;&#1608;&#1606; &#1584;&#1604;&#1603; &#1605;&#1606; &#1592;&#1604;&#1605; &#1608;&#1601;&#1580;&#1608;&#1585; &#1608;&#1601;&#1587;&#1602; . &#1608;&#1575;&#1604;&#1610;&#1608;&#1605; &#1608;&#1575;&#1604;&#1578;&#1575;&#1585;&#1610;&#1582; &#1610;&#1593;&#1610;&#1583; &#1606;&#1601;&#1587;&#1607; &#1603;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604;&#1608;&#1606;- &#1563; &#1601;&#1602;&#1583; &#1606;&#1576;&#1578;&#1578; &#1606;&#1575;&#1576;&#1578;&#1577; &#1605;&#1606; &#1575;&#1604;&#1588;&#1576;&#1575;&#1576; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1604;&#1605; &#1610;&#1578;&#1601;&#1602;&#1607;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1583;&#1610;&#1606; &#1573;&#1604;&#1575; &#1602;&#1604;&#1610;&#1604;&#1575; &#1608;&#1585;&#1571;&#1608;&#1575; &#1571;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1604;&#1575; &#1610;&#1581;&#1603;&#1605;&#1608;&#1606; &#1576;&#1605;&#1575; &#1571;&#1606;&#1586;&#1604; &#1575;&#1604;&#1604;&#1607; &#1573;&#1604;&#1575; &#1602;&#1604;&#1610;&#1604;&#1575; &#1601;&#1585;&#1571;&#1608;&#1575; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1610;&#1607;&#1605; &#1583;&#1608;&#1606; &#1571;&#1606; &#1610;&#1587;&#1578;&#1588;&#1610;&#1585;&#1608;&#1575; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605; &#1608;&#1575;&#1604;&#1601;&#1602;&#1607; &#1608;&#1575;&#1604;&#1581;&#1603;&#1605;&#1577; &#1605;&#1606;&#1607;&#1605; &#1576;&#1604; &#1585;&#1603;&#1576;&#1608;&#1575; &#1585;&#1572;&#1608;&#1587;&#1607;&#1605; &#1571;&#1579;&#1575;&#1585;&#1608;&#1575; &#1601;&#1578;&#1606;&#1575;&#1611; &#1593;&#1605;&#1610;&#1575;&#1569; &#1608;&#1587;&#1601;&#1603;&#1608;&#1575; &#1575;&#1604;&#1583;&#1605;&#1575;&#1569; &#1601;&#1610; &#1605;&#1589;&#1585; &#1608;&#1587;&#1608;&#1585;&#1610;&#1575; , &#1608;&#1575;&#1604;&#1580;&#1586;&#1575;&#1574;&#1585; &#1608;&#1602;&#1576;&#1604; &#1584;&#1604;&#1603; &#1601;&#1578;&#1606;&#1577; &#1575;&#1604;&#1581;&#1585;&#1605; &#1575;&#1604;&#1605;&#1603;&#1610; &#1601;&#1582;&#1575;&#1604;&#1601;&#1608;&#1575; &#1576;&#1584;&#1604;&#1603; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1583;&#1610;&#1579; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1575;&#1604;&#1584;&#1610; &#1580;&#1585;&#1609; &#1593;&#1604;&#1610;&#1607; &#1593;&#1605;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1587;&#1604;&#1601;&#1575; &#1608;&#1582;&#1604;&#1601;&#1575; &#1573;&#1604;&#1575; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580;</div></blockquote>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And the intent here is that they instituted an evil way (sunnah)  into Islam and made revolting against the ruler to be an act of devotion (deen) over the passing of time and  (passing) of days despite the warning of the Prophet (sallallaahu alayhi wasallam) against them in many ahaadeeth, from them, his saying (sallallaahu alayhi wasallam), "<i>The <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> are the Dogs of Hellfire</i>." And despite the fact they did not see clear, plain manifest disbelief from them (the rulers), but only what is less than that of oppression, <a href='tags/tyranny.html' class='tagLink'><font class='tagLink'>tyranny</font></a> and sin. And today, history repeats itself as they say, for there has emerged a new band amongst the Muslim youth who did not understand except very little of the religion and they hold that the <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a> do not rule by what Allaah has revealed except little, and they held [the obligation] of revolting against them without consulting with the people of knowledge, understanding and wisdom. Rather, they followed their heads, kindled blind tribulations, and shed blood in Egypt, Syria and <a href='tags/algeria.html' class='tagLink'><font class='tagLink'>Algeria</font></a>, and prior to that (was) the tribulation of the sacred precincts in Makkah. Through (these activities) they opposed the authentic hadeeth upon which all the Muslims, the earlier ones and the later ones abided by, except for the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>.</blockquote>    <P>
Refer to <i>al-Silsilah al-Sahihah</i> (7/1240-1241).    <P>
 <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.islamagainstextremism.com/print.cfm?hnjsd by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:18:12 GMT -->
</html>


