

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.islamagainstextremism.com/print.cfm?fvoubqa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:18:50 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>IslamAgainstExtremism.Com | Combatting Extremist Kharijite (Renegade) Ideology During the 1990s: Warning From the Ideology of the Terrorists</title>
	<link rel="STYLESHEET" type="text/css" href="css/global.css">
	<link rel="STYLESHEET" type="text/css" href="layout/default/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>IslamAgainstExtremism.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Combatting Extremist Kharijite (Renegade) Ideology During the 1990s: Warning From the Ideology of the Terrorists</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Friday, October, 14 2016 and
 filed under <a href="categories/aj-articles.html">Articles</a></span><BR>

<span style="font-size:11px;">
Key topics: <a href="tags/kharijites.html">
Kharijites 
</a> <span style="font-size:11px;"><BR> 



<div class="articleContent">






<p><img src=assets/images/fitnah-takfir-hakimiyyah.jpg align="right" width="300"  style="margin:0px 0px 12px 15px;border-radius:5px;" border=0>During the early 1990s a series of dubious individuals, ignorant pseudo-scholars appeared in Britain. With a command of the Arabic language and able to deceive people into thinking they were scholars, they acquired followings. They include <b>Ab&#363; &#7716;amzah al-Mi&#7779;r&#299;</b>, <b>Ab&#363; Qat&#257;dah</b>, <b>Omar Bakr&#299;</b> and others. They were promoting the doctrines of misguided thinkers such as Sayyid Qu&#7789;b, Ab&#363; A&#703;l&#257; al-Mawd&#363;d&#299; and Taq&#299; al-D&#299;n al-Nabah&#257;n&#299; who were responsible for creating political movements based upon distorted understandings of basic Isl&#257;mic tenets. They presented the idea that all contemporary Muslim societies are non-Isl&#257;mic and illegitimate, that these societies are led by <a href='tags/rulers.html' class='tagLink'><font class='tagLink'>rulers</font></a>, (or classes, families or political parties) that have usurped divine authority. They gave the Muslim declaration of faith ("None has the right to be worshipped but God alone") a purely political explanation. On the basis of this political explanation, they excommunicated whole societies, governments and their institutions and then reframed lofty institutions such as jih&#257;d (just war to remove violent aggression from peaceful preaching), enjoining good and prohibiting evil as a constant struggle against governments, regimes, their institutions (army, police) and whoever allies and supports them. They actually revived the doctrine and methodology of the very first sect to break off from Isl&#257;m, the Kh&#257;rijites (extremist renegades) and their methodology centres around exaggeration in two basic concepts. &#7716;&#257;kimiyyah (lawgiving) and takf&#299;r (expelling a Muslim from Isl&#257;m).  This innovated, heretical doctrine does not actually originate with so-called  "Wahh&#257;b&#299;" <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a> or "Salafists". These individuals, Qu&#7789;b, al-Mawd&#363;d&#299;, al-Nabah&#257;n&#299;, were from &#7778;&#363;f&#299;, Ash&#703;ar&#299;, M&#257;tur&#299;d&#299; backgrounds and they are the pioneers of this distorted idea (<a href=http://www.kharijites.com/kj/?lembgaglq>see here</a>).    <P>
Perceiving this misguidance Salaf&#299; <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a> within UK and beyond played an instrumental role in countering this <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>extremism</font></a> and distortion of Isl&#257;m. From those efforts was the mass distribution and translation of books such as the one pictured around 1995. It is titled, "<b>The Tribulation of Takf&#299;r and &#7716;&#257;kimiyyah</b>" and discusses the <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>extremism</font></a> and exaggeration in these fields by the neo-Kh&#257;rijites. The book covers     <P>
<ul><li> The importance of sticking to genuine scholars, not pseudo-scholars and ignoramuses.  <li> Warnings about the danger of takf&#299;r (expelling <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a> from Isl&#257;m).   <li>The necessity and obligation of warning from heretics and deviants who distort Isl&#257;m and misguide others.  <li> A refutation those responsible for the appearance of extremist doctrines and methodologies and they include: &#7716;asan al-Bann&#257;, Sayyid Qu&#7789;b, &#7716;asan al-Tur&#257;b&#299;, Ab&#363; al-A&#703;l&#257; al-Mawd&#363;d&#299; and Mu&#7717;ammad Sur&#363;r.  <li> General advice to <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a> in keeping away from <a href='tags/extremism.html' class='tagLink'><font class='tagLink'>extremism</font></a>.   </ul>    <P>
On  the back cover of the book is a quote from a prominent Muslim scholar which states purifying Isl&#257;m from the views and doctrines of the heretics and deviants, (such as the extremists and terrorists) "is a form of jih&#257;d" which is "a collective obligation" upon <a href='tags/muslims.html' class='tagLink'><font class='tagLink'>Muslims</font></a> by agreement.  <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.islamagainstextremism.com/print.cfm?fvoubqa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:18:50 GMT -->
</html>


