

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>

<!-- Mirrored from www.themadkhalis.com/md/articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:22:07 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>

	<title>Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</title>
	
	
	<meta name="Keywords" content="Sayyid Qutb,Mahmood Shakir">
	<meta name="Description" content="Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction.  ...">
	<link rel="STYLESHEET" type="text/css" href="../style.css">
</head>

<body>

<div align="center">


<br>

<table width="1000" cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr>

<td align="right" class="textSmall">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Monday, 18 August 2025&nbsp;&nbsp;&nbsp;
<a href="../index.html">Home</a> &#149; 
<a href="../about.html">About Us</a> &#149; 

<a href="../contact.html">Contact Us</a> 

 &nbsp;&nbsp;&nbsp;&nbsp;
</td>
</tr>
</table>
<img src="../images/spacer.gif" width="10" height="9">
<table width="1000" cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr><td colspan="2"><img src="../images/banner.gif" width="1000" height="200" border="0" alt=""></td></tr>
<tr><td>





<ul class="solidblockmenu">
<li><a href="../index.html">HOME</a></li><li><a href="../categories/basics.html">BASICS</a></li><li><a href="../categories/sayyid-qutb.html">SAYYID QUTB</a></li><li><a href="../categories/hasan-al-banna.html">HASAN AL-BANNA</a></li><li><a href="../categories/methodology.html">METHODOLOGY</a></li><li><a href="../categories/shaykh-rabee.html">SHAYKH RABEE</a></li><li><a href="../categories/refutations.html">REFUTATIONS</a></li><li><a href="../categories/articles.html">ARTICLES</a></li>
<li><a href="../reports.html">REPORTS</a></li></ul><br style="clear: left" /></td>

<td align="right" nowrap>
<ul class="solidblockmenu2">

 <li><a href="../signin.html">LOGIN</a></li>
 
<li><a href="../search.html">SEARCH</a></li>
<li><a href="../tags.html">TAGS</a></li>
<li><a href="../rss.html">RSS</a></li>
</ul><br style="clear: right" />

</td>

</tr>
<tr bgcolor="Gray"><td colspan="2"><img src="../images/spacer.gif" width="1" height="1" border="0" alt=""></td></tr>
</table>
<img src="../images/spacer.gif" width="1" height="2" border="0" alt=""><BR>

<table width="1000" cellpadding="0" cellspacing="0" bgcolor="#ffffff">
<tr><td><img src="../images/spacer.gif" width="1" height="10" border="0" alt=""></td></tr>
</table>
 



<table width="1000" cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr>

<td><img src="../images/spacer.gif" width="15" height="1"></td>
<td valign="top">



<font style="font-size:12px;">
You are here: 
<a href="../index.html">Home</a> / 
<a href="../categories/sayyid-qutb.html">Sayyid Qutb</a> 

</font>
<hr size="1" noshade style="margin-top:12" color="#cdcdcd">


<table cellpadding="0" cellspacing="0" border="0" bgcolor="#ffffff">
<tr>


<td valign="top" width="100%">
<span class="articleTitle">Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</span><BR>
Filed under: <a href="../categories/sayyid-qutb.html">Sayyid Qutb</a><BR>
 Monday, January 04 2010 - by <a href="../authors/Admin.html">Admin</a>
<BR>
Key topics: <a href="../tags/sayyid-qutb.html">
Sayyid Qutb 
</a> &#149; <a href="../tags/mahmood-shakir.html">
Mahmood Shakir 
</a> 
<BR>
<img src="../images/spacer.gif" width="10" height="4"><BR>
<!-- AddThis Button BEGIN -->
<a class="addthis_button" href="http://addthis.com/bookmark.php?v=250&amp;pub=xa-4b1aa87179c845dd"><img src="../../../s7.addthis.com/static/btn/v2/lg-share-en.gif" width="125" height="16" alt="Bookmark and Share" style="border:0"/></a><script type="text/javascript" src="../../../s7.addthis.com/js/250/addthis_widget.js#pub=xa-4b1aa87179c845dd"></script>
<!-- AddThis Button END -->

</td>
<td><img src="../images/spacer.gif" width="15" height="1"></td>
</tr>
</table>

<hr size="1" noshade style="margin-top:12" color="#cdcdcd">




<a href="mailto:Enter_Email?subject=TheMadkhalis.Com | Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction&body=You may be interested in this article:%0D%0A%0D%0ASayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction%0D%0A//www.themadkhalis.com/md/?mslqe">Mail to a Friend</a> &#149;
<a href="../print2199.html?mslqe">Printer friendly</a> 







<br><br>




<div class="articleContent">

<font class='titleHeadline'>Introduction: The Judgement of the <a href='../tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a>, the Sunnah and the Salaf Against Those Who Revile or Criticize <a href="../tags/the-companions.html" class="tagLink"><font class="tagLink">the Companions</font></a></font>    <P>
Allaah the Most High said:    <P>
<div class='arabicquran'><img src='../images/qnstart.gif'> &#1608;&#1614;&#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1580;&#1614;&#1575;&#1572;&#1615;&#1608;&#1575; &#1605;&#1616;&#1606; &#1576;&#1614;&#1593;&#1618;&#1583;&#1616;&#1607;&#1616;&#1605;&#1618; &#1610;&#1614;&#1602;&#1615;&#1608;&#1604;&#1615;&#1608;&#1606;&#1614; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1575;&#1594;&#1618;&#1601;&#1616;&#1585;&#1618; &#1604;&#1614;&#1606;&#1614;&#1575; &#1608;&#1614;&#1604;&#1616;&#1573;&#1616;&#1582;&#1618;&#1608;&#1614;&#1575;&#1606;&#1616;&#1606;&#1614;&#1575; &#1575;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1587;&#1614;&#1576;&#1614;&#1602;&#1615;&#1608;&#1606;&#1614;&#1575; &#1576;&#1616;&#1575;&#1604;&#1618;&#1573;&#1616;&#1610;&#1605;&#1614;&#1575;&#1606;&#1616; &#1608;&#1614;&#1604;&#1614;&#1575; &#1578;&#1614;&#1580;&#1618;&#1593;&#1614;&#1604;&#1618; &#1601;&#1616;&#1610; &#1602;&#1615;&#1604;&#1615;&#1608;&#1576;&#1616;&#1606;&#1614;&#1575; &#1594;&#1616;&#1604;&#1617;&#1611;&#1575; &#1604;&#1617;&#1616;&#1604;&#1617;&#1614;&#1584;&#1616;&#1610;&#1606;&#1614; &#1570;&#1605;&#1614;&#1606;&#1615;&#1608;&#1575; &#1585;&#1614;&#1576;&#1617;&#1614;&#1606;&#1614;&#1575; &#1573;&#1616;&#1606;&#1617;&#1614;&#1603;&#1614; &#1585;&#1614;&#1572;&#1615;&#1608;&#1601;&#1612; &#1585;&#1617;&#1614;&#1581;&#1616;&#1610;&#1605;&#1612; <img src='../images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='../images/qnstart.gif'><b> And those who came after them say: "Our Lord! Forgive us and our brethren who have preceded us in <a href='../tags/faith.html' class='tagLink'><font class='tagLink'>Faith</font></a>, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.  (Al-Hashr 59:10) </b><img src='../images/qnend.gif'></blockquote>    <P>
And the Prophet (sallallaahu alayhi wasallam) said:     <P>
<div class='arabic' align='right'>&#1605;&#1606; &#1587;&#1576; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610; &#1548; &#1601;&#1593;&#1604;&#1610;&#1607; &#1604;&#1593;&#1606;&#1577; &#1575;&#1604;&#1604;&#1607; &#1608; &#1575;&#1604;&#1605;&#1604;&#1575;&#1574;&#1603;&#1577; &#1608; &#1575;&#1604;&#1606;&#1575;&#1587; &#1571;&#1580;&#1605;&#1593;&#1610;&#1606;</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Whoever abuses my Companions, upon them is the curse of Allaah, the angels and the people.</blockquote>    <P>
Reported from Ibn Abbaas and Ibn Umar by at-Tabaraanee. The hadeeth is <b>Hasan</b> as declared by al-Albaanee in as-Saheehah (no. 2340).    <P>
<u>Imaam Ahmad</u> said: "If you see anyone speaking ill of <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of the Messenger of Allaah (sallallaahu alayhi wasallam), doubt his Islaam." (Al-Laalikaa'ee (d. 418H) in as-Sunnah, no.2359)    <P>
<u>Imaam al-Barbahaaree</u> (d. 329H) said in his Sharh us-Sunnah: "If you see a man criticising <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of the Messenger of Allaah (sallallaahu alayhi wasallam) know that he is a person of wicked speech and desires, since the Messenger of Allaah (sallallaahu alayhi wasallam) said: '<i>When my Companions are mentioned then withhold</i>'." The hadeeth is reported by at-Tabaraanee from Ibn Mas'ood and it is Saheeh. See Silsilatul Ahaadeeth is-Saheehah (no.34) of Shaikh al-Albaanee). <u>Imaam al-Barbahaaree</u> also said in <i>Sharh us-Sunnah</i> (Explanation of the Creed, p.84): Do not discuss about their slips or wars, nor that of which you have no knowledge. Do not listen to such talk from anyone, for if you do, your heart will not remain safe and sound.    <P>
And Harb bin Ismaa'eel al-Kirmani (d. 280H), in the treatise "<i>Masaa'il Harb bin Ismaa'eel al-Kirmaanee Anil-Imaam Ahmad</i>" said:    <P>
<div class='arabic' align='right'>&#1607;&#1584;&#1575; &#1605;&#1584;&#1607;&#1576; &#1571;&#1607;&#1604; &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1571;&#1579;&#1585;&#1548; &#1608;&#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1575;&#1604;&#1605;&#1578;&#1605;&#1587;&#1617;&#1603;&#1610;&#1606; &#1576;&#1607;&#1575;&#1548; &#1575;&#1604;&#1605;&#1615;&#1602;&#1578;&#1583;&#1609; &#1576;&#1607;&#1605; &#1601;&#1610;&#1607;&#1575; &#1605;&#1606; &#1604;&#1614;&#1583;&#1615;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1575;&#1604;&#1606;&#1576;&#1610; -&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;- &#1573;&#1604;&#1609; &#1610;&#1608;&#1605;&#1606;&#1575; &#1607;&#1584;&#1575;&#1548; &#1608;&#1571;&#1583;&#1585;&#1603;&#1578; &#1605;&#1606; &#1571;&#1583;&#1585;&#1603;&#1578; &#1605;&#1606; &#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1607;&#1604; &#1575;&#1604;&#1581;&#1580;&#1575;&#1586; &#1608;&#1575;&#1604;&#1588;&#1575;&#1605; -&#1608;&#1594;&#1610;&#1585;&#1607;&#1605;-&#1563; &#1601;&#1614;&#1605;&#1614;&#1606; &#1582;&#1575;&#1604;&#1601; &#1588;&#1610;&#1574;&#1575;&#1611; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1584;&#1575;&#1607;&#1576; &#1571;&#1608; &#1591;&#1593;&#1606; &#1601;&#1610;&#1607;&#1575;&#1548; &#1571;&#1608; &#1593;&#1575;&#1576; &#1602;&#1575;&#1574;&#1604;&#1614;&#1607;&#1575;&#1548; &#1601;&#1607;&#1608; &#1605;&#1582;&#1575;&#1604;&#1601;&#1612; &#1605;&#1576;&#1578;&#1583;&#1593;&#1612; &#1582;&#1575;&#1585;&#1580;&#1612; &#1593;&#1606; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1586;&#1575;&#1574;&#1604;&#1612; &#1593;&#1606; &#1605;&#1606;&#1607;&#1580; &#1575;&#1604;&#1587;&#1617;&#1606;&#1617;&#1577; &#1608;&#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1581;&#1602;.    <P>
&#1602;&#1575;&#1604;: &#1608;&#1607;&#1608; &#1605;&#1584;&#1607;&#1576; &#1571;&#1581;&#1605;&#1583; &#1608;&#1573;&#1587;&#1581;&#1575;&#1602;&#1614; &#1576;&#1606; &#1573;&#1576;&#1585;&#1575;&#1607;&#1610;&#1605; &#1576;&#1606; &#1605;&#1614;&#1582;&#1618;&#1604;&#1614;&#1583;&#1548; &#1608;&#1593;&#1576;&#1583;&#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1575;&#1604;&#1586;&#1576;&#1610;&#1585; &#1575;&#1604;&#1581;&#1615;&#1605;&#1614;&#1610;&#1583;&#1610;&#1548; &#1608;&#1587;&#1593;&#1610;&#1583; &#1576;&#1606; &#1605;&#1606;&#1589;&#1608;&#1585; -&#1608;&#1594;&#1610;&#1585;&#1607;&#1605;- &#1605;&#1605;&#1606; &#1580;&#1575;&#1604;&#1587;&#1618;&#1606;&#1575; &#1608;&#1571;&#1582;&#1584;&#1606;&#1575; &#1593;&#1606;&#1607;&#1605; &#1575;&#1604;&#1593;&#1604;&#1605;&#1548; &#1601;&#1603;&#1575;&#1606; &#1605;&#1606; &#1602;&#1608;&#1604;&#1607;&#1605;</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>This is <u>the madhhab of the People of Knowledge, the Ashaabul-Athar (People of the Narrations), Ahl us-Sunnah wal-Jamaa'ah</u>, those who stick fast to it [Ahl us-Sunnah] and who seek to guide themselves by [them i.e. the Ahl us-Sunnah] from among those in the presence of the Messenger of Allaah (sallallaahu alaihi wasallam) up until this day of ours. And I met whomever I met from among the Scholars of the people of Hijaaz and Shaam and others besides them. <b>Whoever differs with and opposes a single matter from the madhaahib [of these People of Knowledge] or contests and defames them or criticizes the one who speaks [by what they speak with], then he is a  mukhaalif  (opposer), a mubtadi' (an innovator) and one who  has left the Jamaa'ah, who has ceased to be upon the manhaj of the Sunnah and the Path of Truth</b>.     <P>
And this [i.e. the path of the People of Knowledge] is the madhhab of [Imaam] Ahmad, Ishaaq bin Ibraaheem, Abdullaah bin Zubair al-Humaidee, Sa'eed bin Mansoor and others besides them amongst those with whom we have sat and taken knowledge from...</blockquote>    <P>
Then he says later in the treatise from that which is from the madhhab ijmaa' of the people of knowledge, Ahl us-Sunnah wal-Jamaa'ah:    <P>
<div class='arabic' align='right'>&#1608;&#1584;&#1603;&#1585; &#1605;&#1581;&#1575;&#1587;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1575;&#1604;&#1603;&#1601; &#1593;&#1606; &#1584;&#1603;&#1585; &#1605;&#1587;&#1575;&#1608;&#1610;&#1607;&#1605; &#1575;&#1604;&#1578;&#1610; &#1588;&#1580;&#1585;&#1578; &#1576;&#1610;&#1606;&#1607;&#1605;&#1563; &#1601;&#1605;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1571;&#1608; &#1608;&#1575;&#1581;&#1583;&#1575; &#1605;&#1606;&#1607;&#1605;&#1548; &#1571;&#1608; &#1578;&#1606;&#1602;&#1589;&#1607; &#1571;&#1608; &#1591;&#1593;&#1606; &#1593;&#1604;&#1610;&#1607;&#1605;&#1548; &#1571;&#1608; &#1593;&#1585;&#1590; &#1576;&#1593;&#1610;&#1576;&#1607;&#1605;&#1548; &#1571;&#1608; &#1593;&#1575;&#1576; &#1571;&#1581;&#1583;&#1575; &#1605;&#1606;&#1607;&#1605;&#1548; &#1601;&#1607;&#1608; &#1605;&#1576;&#1578;&#1583;&#1593; &#1585;&#1575;&#1601;&#1590;&#1610; &#1582;&#1576;&#1610;&#1579; &#1605;&#1582;&#1575;&#1604;&#1601;&#1548; &#1604;&#1575; &#1610;&#1602;&#1576;&#1604; &#1575;&#1604;&#1604;&#1607; &#1605;&#1606;&#1607;&#1605; &#1589;&#1585;&#1601;&#1575; &#1608;&#1604;&#1575; &#1593;&#1583;&#1604;&#1575;&#1548; &#1576;&#1604; &#1581;&#1576;&#1607;&#1605; &#1587;&#1606;&#1577;&#1548; &#1608;&#1575;&#1604;&#1583;&#1593;&#1575;&#1569; &#1604;&#1607;&#1605; &#1602;&#1585;&#1576;&#1577;&#1548; &#1608;&#1575;&#1604;&#1573;&#1602;&#1578;&#1583;&#1575;&#1569; &#1576;&#1607;&#1605; &#1608;&#1587;&#1610;&#1604;&#1577;&#1548; &#1608;&#1575;&#1604;&#1571;&#1582;&#1584; &#1576;&#1570;&#1579;&#1575;&#1585;&#1607;&#1605; &#1576;&#1607;&#1575; &#1601;&#1590;&#1610;&#1604;&#1577;</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>And the mentioning of the good qualities and deeds of <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of the Messenger of Allaah (sallallaahu alaihi wasallam) and refraining from mentioning their shortcomings and mistakes, those which occurred between them. <b>Whoever reviles <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of the Messenger of Allaah (sallallaahu alaihi wasallam), or a single one amongst them, or reduces [their worth and status] or insults them or exposes their faults or criticises a single one amongst them then he is <u>a mubtadi'</u> (an innovator), <u>a raafidee</u> (an extreme shi'ite), <u>a khabeeth</u> (vile and repugnant) and <u>a mukhaalif</u> (an opposer) and Allaah will not accept from him any of his efforts nor his fair dealings</b>. Rather loving them is a sunnah, supplicating for them is nearness (Allaah), taking them as a model for guidance is a means (of nearness to Allaah) and accepting and taking from their narrations is an excellence</blockquote>    <P>
And then he mentions shortly afterwards:    <P>
<div class='arabic' align='right'>&#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1604;&#1571;&#1581;&#1583; &#1571;&#1606; &#1610;&#1584;&#1603;&#1585; &#1588;&#1610;&#1574;&#1575; &#1605;&#1606; &#1605;&#1587;&#1575;&#1608;&#1610;&#1607;&#1605;&#1548; &#1608;&#1604;&#1575; &#1571;&#1606; &#1610;&#1591;&#1593;&#1606; &#1593;&#1604;&#1609; &#1571;&#1581;&#1583; &#1605;&#1606;&#1607;&#1605; &#1576;&#1593;&#1610;&#1576; &#1571;&#1608; &#1606;&#1602;&#1589;&#1563; &#1601;&#1605;&#1606; &#1601;&#1593;&#1604; &#1584;&#1604;&#1603; &#1601;&#1602;&#1583; &#1608;&#1580;&#1576; &#1593;&#1604;&#1609; &#1575;&#1604;&#1587;&#1604;&#1591;&#1575;&#1606; &#1578;&#1571;&#1583;&#1610;&#1576;&#1607; &#1608;&#1593;&#1602;&#1608;&#1576;&#1578;&#1607;&#1548; &#1604;&#1610;&#1587; &#1604;&#1607; &#1571;&#1606; &#1610;&#1593;&#1601;&#1608; &#1593;&#1606;&#1607;&#1548; &#1576;&#1604; &#1610;&#1593;&#1575;&#1602;&#1576;&#1607;&#1548; &#1608;&#1610;&#1587;&#1578;&#1578;&#1610;&#1576;&#1607;&#1548; &#1601;&#1573;&#1606; &#1578;&#1575;&#1576; &#1602;&#1576;&#1604; &#1605;&#1606;&#1607;&#1548; &#1608;&#1573;&#1606; &#1604;&#1605; &#1610;&#1578;&#1576; &#1571;&#1593;&#1575;&#1583; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1593;&#1602;&#1608;&#1576;&#1577;&#1548; &#1608;&#1582;&#1604;&#1583;&#1607; &#1601;&#1610; &#1575;&#1604;&#1581;&#1576;&#1587;&#1548; &#1581;&#1578;&#1609; &#1610;&#1605;&#1608;&#1578; &#1571;&#1608; &#1610;&#1585;&#1580;&#1593;</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>It is not permissible for anyone to mention anything of their shortcomings, and nor to revile anyone of them on account of a fault or deficiency. Whoever does that, then <b>it is obligatory upon the ruler to discipline him and punish him</b>. It is not for him (the ruler) to pardon him, rather he should punish him and seek his repentance. <b>So if he repents, it is accepted from him and if he does not repent, the punishment is repeated upon him, <u>and he is kept in prison until he dies or recants</u></b>.</blockquote>    <P>
<font class='titleHeadline'>Dhul-Khuwaisrah at-Tamimi, <a href='../tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="../tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, <a href='../tags/social-justice.html' class='tagLink'><font class='tagLink'>Social Justice</font></a> and <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger</font>    <P>
Dhul-Khuwaisarah at-Tamimi, the Munaafiq, when he saw the Messenger (sallallaahu alayhi wasallam) distributing booty, said, "Be just O Muhammad". Dhul-Khuwaisarah uttered this statement from the angle of "<a href="../tags/social-justice.html" class="tagLink"><font class="tagLink">Social Justice</font></a>", meaning that he did not see the distribution was fair. This man was the one from whose descendants the Khawaarij appeared, and they raised the banners of "<a href="../tags/social-justice.html" class="tagLink"><font class="tagLink">Social Justice</font></a>" and ruling with equity, fairness, with what Allaah revealed. They came out against <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger with hatred, making <a href='../tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of them, and <a href='../tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the rulers of the Muslims. The scholars have said that these people are characterized by <b>a)</b> pursuit of the worldly affairs (leadership, wealth) <b>b)</b> ignorance <b>c)</b> deviation in their religion (creed).    <P>
<div class='sidebar'>1300 years later, there appears <u>Sayyid <a href='../tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> al-Ash'ari</u> who revives this <a href='../tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of the <a href='../tags/khawarij.html' class='tagLink'><font class='tagLink'>Khawarij</font></a>, raising the flag of "<a href="../tags/social-justice.html" class="tagLink"><font class="tagLink">Social Justice</font></a>" making <a href='../tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all societies and all Muslims, declaring them apostates because there is not complete rule of the Sharee'ah and because (as he claims) the Muslims are pleased and satisfied with this through their actions, then he incorporates the manifestos of secular atheist Jews to snatch power away from these "apostates" and launch bloody violent jihads against the people of <a href='../tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>jaahiliyyah</font></a> (i.e. Muslims who are apostates and who have not adopted his ideology and joined his group - <a href=http://www.takfiris.com/takfir/?lyhev >see here</a>). And he had already plotted one successful Leninist revolution in 1952 which ushered in the NTO (Nasserite Taaghootee Order).</div>    <P>
With his notion of "<a href="../tags/social-justice.html" class="tagLink"><font class="tagLink">Social Justice</font></a>" he reviled the <a href='../tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a>, Uthmaan, Mu'aawiyyah, the Banu Umayyah and others - for if Dhul-Khuwaisarah reviled the Prophet (sallallaahu alayhi wasallam), then what is left for those besides him such as <a href='../tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="../tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> except to make manifest their hatred and resentment towards those promised Paradise, under the same flag and banner of "the absence of social justice".    <P>
Then when a scholar amongst the Scholars (Shaykh Rabee' bin Haadee al-Madkhali) stood to defend the honours of Uthmaan, <a href='../tags/muawiyah.html' class='tagLink'><font class='tagLink'>Mu'awiyah</font></a>, Banee Umayyah, Abu Sufyaan bin Harb (radiallaahu anhum), and pointed out these excesses and vile attacks - a people claiming love of the <a href='../tags/sahaabah.html' class='tagLink'><font class='tagLink'>Sahaabah</font></a> and attachment to the <a href='../tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of the Salaf arose to defame, revile, attack, abuse and to try to destroy, with every opportunity, stratagem, guile, trickery and deception, this particular Scholar. Not a method that represented baseness and vileness of character, except that they traversed it to aid and support the lot of the Rafidite heretics in disfavor of the honours of the illustrious Companions. And so they tried to incite others from the people of knowledge against this Scholar, trying to elicit verdicts against him - ringing this scholar and that scholar "<i>O Shaykh there is a man who makes tajreeh</i>...", "<i>O Shaykh there are a group of people who follow a particular Shaykh and they revile the dead</i>...", and so on, and at the same time trying to elicit defences of the Rafidite Heretic <b>for whose sake they were prepared to dig into the earth, dive into the oceans and conquer the mountains</b>.    <P>
<div class='sidebar'><b>They continued this war for ten years until the sum of their activities exposed the repugnance in their hearts, and their favouring allegiance to the Rafidite Heretics over the defence of the honours of the Noble Companions - and so they perverted their own hearts, and whilst they were in that <u>self-induced state</u> of <b>hawaan and dhull</b> (disgrace, contempt, ignominy) Allaah aided and absolved the honours of Uthmaan, Mu'aawiyah, the Banee Umayyah and others (radiallaahu anhum) through the collective statements of a large group of the Scholars of Ahl us-Sunnah in support and vindication of that one Scholar who gave sincerity of purpose in defending the honours of noble Companions.</b></div>    <P>
And then a stake was driven into their support and defence of the promulgators of the deen of rafd through what emerged of the refutations of Allaamah <a href='../tags/mahmood-shakir.html' class='tagLink'><font class='tagLink'>Mahmood Shakir</font></a> (rahimahullaah) against the Rafidite Heretic, and these were five refutations in number, published around 1952, which afforded the knowledge of the hujjah being established upon him. And it was not shortly after that Allaah decreed for him a ten-year stretch in the prison of the very Taaghootee Order that he helped to cement through the revolutionary manifestos of secular atheist Jews which he had been crafting, along with Jamal Abdul-Nasser, in his own house - <u>and all the while</u> his books containing revilement upon <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> continued to be published and distributed with his knowledge and intent, throughout his stretch in prison - <b>and thus the understanding of history is purely in the eye of the beholder!</b> <P> 
<div class="articleContent">
<font class='titleHeadline'>Mahmood Shakir Refuting and Establishing the Hujjah Upon The Propounders of the <a href='../tags/aqidah.html' class='tagLink'><font class='tagLink'>aqidah</font></a> of the <a href='../tags/rafidah.html' class='tagLink'><font class='tagLink'>Rafidah</font></a> of Hatred and Revilement of <a href="../tags/the-companions.html" class="tagLink"><font class="tagLink">the Companions</font></a></font>    <P>
Mahmood Shakir wrote five articles in defence of <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger (sallallaahu alayhi wasallam). Four of them appeared in the magazine "<i>al-Muslimoon</i>" which was edited by Sa'eed Ramadan al-Misree, who was one of the prominent figureheads of al-Ikhwaan al-Muslimeen, and the fifth was published in "<i>ar-Risaalah</i>", a magazine by Ahmad Hasan az-Zayyaat. These are the five articles:    <P>
<ul><li>(<span class='arb'>&#1581;&#1603;&#1605; &#1576;&#1604;&#1575; &#1576;&#1610;&#1606;&#1577;</span>) "<i>Hukmum bilaa Bayyinah</i>" (Judgement without proof), published in the first edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1578;&#1575;&#1585;&#1610;&#1582; &#1576;&#1604;&#1575; &#1573;&#1610;&#1605;&#1575;&#1606;</span>) "<i>Taareekh bilaa Eemaan</i>" (History Without Faith), published in the second edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610;</span>) "<i>Laa Tasubboo Ashaabee</i>" (Do not Revile My Companions), published in the third edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1571;&#1604;&#1587;&#1606;&#1577; &#1575;&#1604;&#1605;&#1601;&#1578;&#1585;&#1610;&#1606;</span>) "<i>Alsinat al-Muftareen</i>" (Tongues of the Liars), published in the fourth edition of "al-Muslimoon", 1952    <P>
<li>(<span class='arb'>&#1584;&#1608; &#1575;&#1604;&#1593;&#1602;&#1604; &#1610;&#1588;&#1602;&#1609;</span>) "<i>Dhul-Aql Yashqaa</i>" (Possessor of Intellect Becomes Miserable), published in "ar-Risaalah" in 1952</ul>    <P>
<font class='titleHeadline'>Do Not Revile My Companions! First Installment</font>    <P>
<div class='arabic' align='right'>&#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610;   &#1604;&#1604;&#1571;&#1587;&#1578;&#1575;&#1584; &#1605;&#1581;&#1605;&#1608;&#1583; &#1605;&#1581;&#1605;&#1583; &#1588;&#1575;&#1603;&#1585;</div>    <P>
<b>"Do Not Revile my Companions" by Mahmood Muhammad Shakir <BR>[A Refutation of Sayyid Qutb]</b>    <P>
<div class='sidebar'><b>Go to:</b> <a href=../index2199.html?mslqe>Part 1</a> <a href=../index0657.html?qodiy>Part 2</a> <a href=../index959c.html?veuwi>Part 3</a> <a href=../index4be1.html?lhrbj>Part 4</a> <a href=../indexeda2.html?ngbjl>Part 5</a></div>    <P>
<div class='arabic' align='right'>&#1581;&#1587;&#1576; &#1575;&#1605;&#1585;&#1574; &#1605;&#1587;&#1604;&#1605; &#1604;&#1604;&#1607; &#1571;&#1606; &#1610;&#1576;&#1604;&#1594;&#1607; &#1602;&#1608;&#1604; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) : "&#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610; &#1548; &#1604;&#1575; &#1578;&#1587;&#1576;&#1608;&#1575; &#1571;&#1589;&#1581;&#1575;&#1576;&#1610;&#1563; &#1601;&#1608;&#1575;&#1604;&#1584;&#1610; &#1606;&#1601;&#1587;&#1610; &#1576;&#1610;&#1583;&#1607; &#1548; &#1604;&#1608; &#1571;&#1606; &#1571;&#1581;&#1583;&#1603;&#1605; &#1571;&#1606;&#1601;&#1602; &#1605;&#1579;&#1604; &#1571;&#1581;&#1583;&#1613; &#1584;&#1607;&#1576;&#1575;&#1611; &#1563; &#1605;&#1575; &#1571;&#1583;&#1585;&#1603; &#1605;&#1583; &#1571;&#1581;&#1583;&#1607;&#1605; &#1608;&#1604;&#1575; &#1606;&#1589;&#1610;&#1601;&#1607;"&#1563; &#1581;&#1578;&#1609; &#1610;&#1582;&#1588;&#1593; &#1604;&#1585;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606; &#1548; &#1608;&#1610;&#1587;&#1605;&#1593; &#1604;&#1606;&#1576;&#1610; &#1575;&#1604;&#1604;&#1607; &#1608;&#1610;&#1591;&#1610;&#1593; &#1548; &#1601;&#1614;&#1610;&#1614;&#1603;&#1615;&#1601;&#1617;&#1614; &#1593;&#1614;&#1585;&#1618;&#1576;&#1614; &#1604;&#1587;&#1575;&#1606;&#1607; &#1608;&#1590;&#1585;&#1575;&#1608;&#1577; &#1601;&#1603;&#1585;&#1607; &#1593;&#1606; &#1571;&#1589;&#1581;&#1575;&#1576; &#1605;&#1581;&#1605;&#1583; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) &#1579;&#1605; &#1610;&#1593;&#1604;&#1605; &#1593;&#1604;&#1605;&#1575;&#1611; &#1604;&#1575; &#1610;&#1588;&#1608;&#1576;&#1607; &#1588;&#1603;&#1617; &#1608;&#1604;&#1575; &#1585;&#1610;&#1576;&#1577;: &#1571;&#1606; &#1604;&#1575; &#1587;&#1576;&#1610;&#1604; &#1604;&#1571;&#1581;&#1583; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1585;&#1590;  &#1605;&#1575;&#1590;&#1610;&#1607;&#1605; &#1608;&#1581;&#1575;&#1590;&#1585;&#1607;&#1605; &#1571;&#1606; &#1610;&#1604;&#1581;&#1602; &#1571;&#1602;&#1604; &#1571;&#1589;&#1581;&#1575;&#1576;&#1607; &#1583;&#1585;&#1580;&#1577; &#1548; &#1605;&#1607;&#1605;&#1575; &#1580;&#1607;&#1583; &#1601;&#1610; &#1593;&#1576;&#1575;&#1583;&#1578;&#1607; &#1548; &#1608;&#1605;&#1607;&#1605;&#1575; &#1578;&#1608;&#1585;&#1593; &#1601;&#1610; &#1583;&#1610;&#1606;&#1607; &#1548; &#1608;&#1605;&#1607;&#1605;&#1575; &#1571;&#1582;&#1604;&#1589; &#1602;&#1604;&#1576;&#1607; &#1605;&#1606; &#1582;&#1608;&#1575;&#1591;&#1585; &#1575;&#1604;&#1587;&#1608;&#1569; &#1601;&#1610; &#1587;&#1585;&#1607; &#1608;&#1593;&#1604;&#1575;&#1606;&#1610;&#1578;&#1607;.  </div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>It is sufficient for a man submitting to Allaah that the saying of the Messenger of Allaah (sallallaau alayhi wasallam) reaches him,     <P>
<blockquote><i>Do not revile my Companions. Do not revile my Companions. For if one of you spent the likes of [Mount] Uhud in gold, it would not reach the mudd (a quarter litre of volume) of one of them, nor half of it</i>.</blockquote>    <P>
Such that he humbles himself to the Lord of the Worlds, hears the Prophet of Allaah, obeys, and withholds his tongue, and the voracity of his thought from (reviling) <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Muhammad (sallallaahu alayhi wasallam), and then that he know [with sure] knowledge - with which no doubt or wavering mixes - that there is no way for anyone from the people of the Earth, past or present, to reach the level of the lowest amongst <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> (in rank), no matter how much he strives in worship, and no matter how much godfearingness (tawarru') he shows in his religion, and no matter how much he purifies his heart from evil whisperings in secret and in open.</blockquote>    <P>
<div class='arabic' align='right'>  &#1608;&#1605;&#1575; &#1571;&#1610;&#1606; &#1610;&#1588;&#1603; &#1608;&#1603;&#1610;&#1601; &#1610;&#1591;&#1605;&#1593; &#1608;&#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1604;&#1575; &#1610;&#1606;&#1591;&#1602; &#1593;&#1606; &#1575;&#1604;&#1607;&#1608;&#1609; &#1548; &#1608;&#1604;&#1575; &#1610;&#1583;&#1575;&#1607;&#1606; &#1601;&#1610; &#1583;&#1610;&#1606; &#1548; &#1608;&#1604;&#1575; &#1610;&#1571;&#1605;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1576;&#1605;&#1575; &#1610;&#1593;&#1604;&#1605; &#1571;&#1606; &#1575;&#1604;&#1581;&#1602; &#1601;&#1610; &#1582;&#1604;&#1575;&#1601;&#1607; &#1548; &#1608;&#1604;&#1575; &#1610;&#1581;&#1583;&#1579; &#1576;&#1582;&#1576;&#1585; &#1608;&#1604;&#1575; &#1610;&#1606;&#1593;&#1578; &#1571;&#1581;&#1583;&#1575;&#1611; &#1576;&#1589;&#1601;&#1577; &#1563; &#1573;&#1604;&#1575; &#1576;&#1605;&#1575; &#1593;&#1604;&#1605;&#1607; &#1585;&#1576;&#1607; &#1608;&#1576;&#1605;&#1575; &#1606;&#1576;&#1571;&#1607;&#1567;! &#1608;&#1585;&#1576;&#1607; &#1575;&#1604;&#1584;&#1610; &#1610;&#1602;&#1608;&#1604; &#1604;&#1607; &#1608;&#1604;&#1571;&#1589;&#1581;&#1575;&#1576;&#1607; :     <P>
<div class='arabicquran'><img src='../images/qnstart.gif'> &#1608;&#1575;&#1604;&#1617;&#1584;&#1610; &#1580;&#1575;&#1569;&#1614; &#1576;&#1575;&#1604;&#1589;&#1617;&#1616;&#1583;&#1602;&#1616; &#1608;&#1614;&#1589;&#1583;&#1617;&#1614;&#1602;&#1614; &#1576;&#1607; &#1571;&#1608;&#1604;&#1616;&#1574;&#1603;&#1614; &#1607;&#1615;&#1605;&#1615; &#1575;&#1604;&#1605;&#1615;&#1578;&#1617;&#1614;&#1602;&#1608;&#1606; . &#1604;&#1614;&#1607;&#1615;&#1605;&#1618; &#1605;&#1575; &#1610;&#1614;&#1588;&#1575;&#1572;&#1608;&#1606;&#1614; &#1593;&#1616;&#1606;&#1618;&#1583;&#1614; &#1585;&#1614;&#1576;&#1617;&#1616;&#1607;&#1605;&#1618; &#1584;&#1614;&#1604;&#1616;&#1603;&#1614; &#1580;&#1614;&#1586;&#1575;&#1569;&#1615; &#1575;&#1604;&#1605;&#1615;&#1581;&#1618;&#1587;&#1616;&#1606;&#1616;&#1610;&#1606;&#1614; . &#1604;&#1616;&#1610;&#1615;&#1603;&#1614;&#1601;&#1617;&#1616;&#1585;&#1614; &#1575;&#1604;&#1604;&#1607;&#1615; &#1593;&#1614;&#1606;&#1618;&#1607;&#1615;&#1605; &#1571;&#1614;&#1587;&#1618;&#1608;&#1614;&#1571;&#1614; &#1575;&#1604;&#1584;&#1610; &#1593;&#1614;&#1605;&#1616;&#1604;&#1608;&#1575; &#1608;&#1610;&#1614;&#1580;&#1618;&#1586;&#1616;&#1610;&#1614;&#1607;&#1615;&#1605;&#1618; &#1576;&#1571;&#1614;&#1581;&#1587;&#1614;&#1606;&#1616; &#1575;&#1604;&#1584;&#1616;&#1610; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1614;&#1593;&#1618;&#1605;&#1614;&#1604;&#1608;&#1606;&#1614; <img src='../images/qnend.gif'></div>     <P>
&#1579;&#1605; &#1610;&#1576;&#1610;&#1606; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) &#1603;&#1578;&#1575;&#1576; &#1585;&#1576;&#1607;  &#1548; &#1601;&#1610;&#1602;&#1608;&#1604; : "&#1582;&#1610;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1602;&#1585;&#1606;&#1610; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1548; &#1579;&#1605; &#1575;&#1604;&#1584;&#1610; &#1610;&#1604;&#1608;&#1606;&#1607;&#1605; &#1548; &#1579;&#1605; &#1610;&#1580;&#1610;&#1569; &#1602;&#1608;&#1605;&#1615; &#1578;&#1587;&#1576;&#1602; &#1588;&#1607;&#1575;&#1583;&#1577; &#1571;&#1581;&#1583;&#1607;&#1605; &#1610;&#1605;&#1610;&#1606;&#1607; &#1548; &#1608;&#1610;&#1605;&#1610;&#1606;&#1607; &#1588;&#1607;&#1575;&#1583;&#1578;&#1607;".  </div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>And how can he doubt and how can he covet (what is besides this) whilst the Messenger of Allaah (sallallaahu alayhi wasallam) does not speak from his desire, and nor does he compromise in the religion, and does he order the people with something that he knows to be in opposition to the truth, and nor does he narrate a report, and nor describe anyone with a characteristic, except with what his Lord taught him and informed him with?! And his Lord is the one who says to him (the Prophet) and his companions:    <P>
<blockquote class='quotequran'><img src='../images/qnstart.gif'><b> And he (Muhammad) who has brought the truth (this <a href='../tags/quran.html' class='tagLink'><font class='tagLink'>Qur'an</font></a> and Islamic Monotheism) and (those who) believed therein (i.e. the companions). They shall have all that they will desire with their Lord. That is the reward of the doers of good. So that Allah may remit from them the evil of what they did and give them the reward, according to the best of what they used to do.  (Az-Zumar 39:33-35) </b><img src='../images/qnend.gif'></blockquote>    <P>
Then he (sallallaahu alayhi wasallam) explained the Book of his Lord, saying: "<i>The best of people are my generation, then those that follow them, then those that follow them. Then there will come a people whose testimony will precede his oath, and his oath (preceding) his testimony</i>."    <P>
  </blockquote>    <P>
<div class='arabic' align='right'>  &#1579;&#1605; &#1610;&#1586;&#1610;&#1583; &#1575;&#1604;&#1571;&#1605;&#1585; &#1576;&#1610;&#1575;&#1606;&#1575; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) &#1548; &#1601;&#1610;&#1583;&#1604; &#1575;&#1604;&#1605;&#1572;&#1605;&#1606;&#1610;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1606;&#1586;&#1604;&#1577; &#1575;&#1604;&#1578;&#1610; &#1571;&#1606;&#1586;&#1604;&#1607;&#1575; &#1575;&#1604;&#1604;&#1607; &#1571;&#1589;&#1581;&#1575;&#1576;&#1614; &#1605;&#1581;&#1605;&#1583; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1548; &#1601;&#1610;&#1602;&#1608;&#1604;: "&#1610;&#1571;&#1578;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1586;&#1605;&#1575;&#1606; &#1548; &#1601;&#1610;&#1594;&#1586;&#1608; &#1601;&#1574;&#1575;&#1605; &#1601;&#1610;&#1601;&#1578;&#1581; &#1604;&#1607;&#1605; &#1548; &#1579;&#1605; &#1610;&#1571;&#1578;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1586;&#1605;&#1575;&#1606; &#1548; &#1601;&#1610;&#1594;&#1586;&#1608; &#1601;&#1574;&#1575;&#1605; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1548; &#1601;&#1610;&#1602;&#1575;&#1604;: &#1607;&#1604; &#1601;&#1610;&#1603;&#1605; &#1605;&#1606; &#1589;&#1575;&#1581;&#1576; &#1605;&#1606; &#1589;&#1575;&#1581;&#1576; &#1571;&#1589;&#1581;&#1575;&#1576; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) &#1567; &#1601;&#1610;&#1602;&#1608;&#1604;&#1608;&#1606;: &#1606;&#1593;&#1605; &#1548; &#1601;&#1610;&#1601;&#1578;&#1581; &#1604;&#1607;&#1605;".    <P>
&#1601;&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1607;&#1584;&#1575; &#1605;&#1576;&#1604;&#1594; &#1589;&#1581;&#1576;&#1577; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; (&#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;) &#1563; &#1601;&#1571;&#1610; &#1605;&#1587;&#1604;&#1605; &#1610;&#1591;&#1610;&#1602; &#1576;&#1593;&#1583; &#1607;&#1584;&#1575; &#1571;&#1606; &#1610;&#1576;&#1587;&#1591; &#1604;&#1587;&#1575;&#1606;&#1607; &#1601;&#1610; &#1571;&#1581;&#1583; &#1605;&#1606; &#1589;&#1581;&#1575;&#1576;&#1577; &#1605;&#1581;&#1605;&#1583; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1567;! &#1608;&#1576;&#1571;&#1610; &#1604;&#1587;&#1575;&#1606; &#1610;&#1593;&#1578;&#1584;&#1585; &#1610;&#1608;&#1605; &#1610;&#1582;&#1575;&#1589;&#1605;&#1607; &#1576;&#1610;&#1606; &#1610;&#1583;&#1610; &#1585;&#1576;&#1607;&#1605; &#1567;! &#1608;&#1605;&#1575; &#1610;&#1602;&#1608;&#1604; &#1608;&#1602;&#1583; &#1602;&#1575;&#1605;&#1578; &#1593;&#1604;&#1610;&#1607; &#1575;&#1604;&#1581;&#1580;&#1577; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576; &#1575;&#1604;&#1604;&#1607; &#1608;&#1605;&#1606; &#1582;&#1576;&#1585; &#1606;&#1576;&#1610;&#1607; &#1567;! &#1608;&#1571;&#1610;&#1606; &#1610;&#1601;&#1585; &#1575;&#1605;&#1585;&#1572; &#1610;&#1608;&#1605;&#1574;&#1584; &#1605;&#1606; &#1593;&#1584;&#1575;&#1576; &#1585;&#1576;&#1607;&#1567;</div>    <P>
<blockquote class='quote'><img src='../images/quote-start.gif'>Then he (sallallaahu alayhi wasallam) increased the matter with further clarification, so he indicated the position that Allaah had bestowed upon <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of the Messenger of Allaah, so he says: "<i>There will come upon the people a time when a faction will go out on an expedition and they will be victorious. Then there will come upon the people a time when a faction a mongst the people will go out on an expedition and it will be said, 'Is there amongst you a companion, of a companion of <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Allaah's Messenger (sallallaahu alayhi wasallam)?' And they will say, 'Yes' and they will be granted victory</i>.    <P>
So when this is the level of the companionship of the Messenger of Allaah (sallallaahu alayhi wasallam), then which Muslim is able after this to roll his tongue against anyone amongst <a href='../tags/the-companions.html' class='tagLink'><font class='tagLink'>the Companions</font></a> of Muhammad, the Messenger of Allaah?! And with which tongue will he try to make excuse on the day when he (the companion) will dispute with him in front of their Lord?! And what will he say when the hujjah has already been established upon him from the Book of Allaah, and from the report of His Prophet?! And to where will a man flee on that day from the punishment of his Lord?  </blockquote>    <P>
    <P>
    <P>
 <P>

</div>
<br>


<hr size="1" noshade color="#cdcdcd">




<span class="smallHeadline">Link to this article:</span>&nbsp;&nbsp;&nbsp;<b>Show:</b>
<a href="javascript:void();" onclick="document.frm.thelink.value='<a href=\'//www.themadkhalis.com/md/articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.cfm\'>Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir\'s Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</a>'">HTML Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//www.themadkhalis.com/md/articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.cfm'">Full Link</a> &#149;
<a href="javascript:void();" onclick="document.frm.thelink.value='//www.themadkhalis.com/md/?mslqe'">Short Link</a>
<BR>
<form name="frm"><input name="thelink" type="text" style="width:450px;" value="<a href='mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.html'>Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</a>" onFocus="this.select()" onClick="this.select()"></form>



<span class="smallHeadline">Related Articles:</span><BR>


<ul>

<li><a href="pfwuf-muftee-abdul-azeez-aal-al-shaykh-on-the-saying-of-sayyid-qutb-about-muawiyyah-and-amr-bin-al-aas.html">Muftee Abdul-Azeez Aal al-Shaykh on the Saying of Sayyid Qutb About Mu'awiyyah and Amr bin al-Aas: It is the Saying of a Baatinee Khabeeth or a Yahoodee La'een and is the Epitomy of Nifaaq</a>

<li><a href="udyrx-audio-of-mahmood-shakir-from-march-1976-in-defence-of-the-companions.html">Audio of Shaykh Mahmood Shakir from March 1976 In Defence of the Companions of the Messenger</a>

<li><a href="qpqvs-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-7.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 7 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Seventh Installment</a>

<li><a href="wumtj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-6.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 6 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Sixth Installment - Attacks upon Mu'awiyah, Hind and Bani Umayyah</a>

<li><a href="sqrfw-sayyid-qutb-and-the-french-connection-the-french-catholic-social-darwinist-doctor-that-influenced-qutbs-jaahiliyyah.html">Sayyid Qutb And The French Connection: The French Catholic, Social Darwinist Doctor That Influenced Qutb's 'Jaahiliyyah'</a>

<li><a href="iczdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-13.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 13 - Ta'weel of the Arsh, Negation of al-Uluww and Negation of 'Hawaadith' Upon the Way of the Jahmiyyah</a>

<li><a href="dsppw-readings-in-elementary-communism-the-manifesto-of-karl-marx-and-frederick-engels-and-sayyid-qutb.html">Readings in Elementary Communism: Karl Marx, Freidrich Engels, Sayyid Qutb, Capitalism, the State, Social Justice, Revolution and the Communist Manifesto</a>

<li><a href="oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html">A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</a>

<li><a href="ngbjl-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-5.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 5 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fifth Installment - The Most Distasteful Type of Revilement Against Mu'awiyah, Amr bin al-Aas, Abu Sufyaan and Hind</a>

<li><a href="krmbd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-12.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 12 - Between al-Ghazali, ar-Razi and Sayyid Qutb - The Texts of the Attributes Are Imaginary Depictions With No Reality Behind Them</a>

<li><a href="lhrbj-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-4.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 4 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Fourth Installment - Takfir of Abu Sufyan</a>

<li><a href="exkgz-qutbi-competition-corner-1st-quiz---test-your-knowledge-of-wahdatul-wujood.html">Qutbi Competition Corner: 1st Quiz - Test Your Knowledge of Wahdat ul-Wujood And The Positions of the Scholars Towards Those Who Express It</a>

<li><a href="veuwi-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-3.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 3 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Third Installment - Takfir of Bani Umayyah</a>

<li><a href="dsopw-imaam-muqbil-bin-haadee-al-waadiee-qutb-jamaaat-ut-takfir-zilal-milestones.html">Imaam Muqbil bin Haadee al-Waadi'ee: A Beginner Who Reads the Books of Qutb Will Not Perceive After Only a Few Days that He Has Become Amongst the Jamaa'at ut-Takfir</a>

<li><a href="romka-imaam-muqbil-bin-haadee-al-waadiee-the-works-of-sayyid-qutb-are-placed-in-the-closet-of-the-books-of-misguidance.html">Imaam Muqbil bin Haadee al-Waadi'ee: The Works of Sayyid Qutb Are Placed In the Closet of the Books of Misguidance</a>

<li><a href="qodiy-sayyid-qutb-and-the-aqidah-of-the-raafidah-part-2---mahmood-shakirs-defence-of-the-companions.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 2 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - Second Installment - Malices and Resentments of the Idolatrous Western Civilization</a>

<li><a href="mgrwe-imaam-muqbil-bin-haadee-al-waadiee-sayyid-qutb-and-hasan-al-banna-were-two-imaams.html">Imaam Muqbil bin Haadee al-Waadi'ee: Sayyid Qutb and Hasan al-Banna Were Two Imaams (of Ahl ul-Bid'ah)</a>

<li><a href="umiea-shaykh-saalih-aal-ash-shaykh-the-fikr-of-sayyid-qutb.html">Shaykh Saalih Aal ash-Shaykh: The Role of the  'Fikr' (Ideology) of Sayyid Qutb in Splitting, Disunity and The Emergence of the Jama'aat and the Freedom and Innocence of True Islamic Knowledge (Ilm) From All Of That</a>

<li><a href="epluy-shaykh-ibn-uthaymin-the-people-began-to-tarnish-shaykh-rabee-with-faults-after-he-spoke-about-some-of-their-symbolic-figureheads.html">Shaykh Ibn Uthaymin: The People Began to Tarnish Shaykh Rabee' with Faults After He Spoke About Some of Their Symbolic Figureheads</a>

<li><a href="iosjk-imaam-al-albani-to-shaykh-rabee-everything-with-which-you-refuted-qutb-for-is-correct-and-true.html">Imaam al-Albani to Shaykh Rabee: Everything With Which You Refuted Qutb For Is Correct and True and May Allaah Reward You For Fulfilling The Obligation of Exposing His Ignorance and Deviance</a>

<li><a href="ezcyb-shaykh-muhammad-bin-jameel-zainoo-i-asked-mohammad-qutb-to-clarify-the-errors-of-his-brother-in-az-zilal.html">Shaykh Muhammad bin Jameel Zainoo: I Asked Mohammad Qutb To Clarify the Errors of His Brother in az-Zilal Regarding Ta'weel and the Doctrine of Wahdat ul-Wujood</a>

<li><a href="mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.html">Sayyid Qutb and the Aqidah of the Raafidah: Part 1 - Mahmood Shakir's Defence of the Companions Against the Attacks of Sayyid Qutb - First Installment - Introduction</a>

<li><a href="waqwg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-11.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 11 - Allaah Speaking to Moses and Allaah's Eternal Kalaam </a>

<li><a href="bguiq-shaykh-ibn-jibreen-making-takfir-upon-the-saying-of-sayyid-qutb-that-islam-is-a-mixture-of-communism-and-christianity.html">Impaling Leninist Qutbi Doubts: Shaykh Ibn Jibreen Makes Takfir Upon (Declares as Kufr) the Saying of Sayyid Qutb That Islam Is a Mixture of Communism and Christianity</a>

<li><a href="vlffh-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-10---the-quran-is-like-the-rest-of-what-allaah-creates-and-like-the-soul.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 10 - The Qur'an is (Created) Like The Soul and Like The Rest of What Allaah Creates</a>

<li><a href="mslbg-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-9.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 9 - Moses and the Speech of Allaah</a>

<li><a href="pgpti-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-8.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 8 - Negating Tahayyuz (Spatial Occupation) From Allaah</a>

<li><a href="taifd-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-7----allaah-does-not-have-a-makaan-hayyiz-hadd-jihah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 7 -  Allaah Does Not Have a Makaan, Hayyiz, Hadd, Jihah</a>

<li><a href="tkptu-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-5---allaah-does-not-occupy-a-place-makaan.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 5 - Allaah Does Not Occupy a Place (Makaan)</a>

<li><a href="kxsoa-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-4.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 4 - Allaah's Uluww, al-Istiwaa and Sifaat Fi'liyyah</a>

<li><a href="lalhx-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-3.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 3 - The Use of Aahaad Hadeeth in Aqidah</a>

<li><a href="ebzdi-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-2.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 2 - Ta'weel of al-Istiwaa and Negation of the Sifaat Fi'liyyah</a>

<li><a href="ppxmw-sayyid-qutb-and-the-aqidah-of-the-ashariyyah-jahmiyyah-part-1---al-uluww-al-istiwaa-and-sifaat-filiyyah.html">Sayyid Qutb and the Aqidah of the Ash'ariyyah Jahmiyyah: Part 1 - The Qur'an, al-Istiwaa and Sifaat Fi'liyyah</a>

<li><a href="sxptl-shaykh-saalih-al-fawzaan-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Saalih al-Fawzaan Distinguishes Between The Salafi Manhaj and The Qutbi Manhaj</a>

<li><a href="xwcmm-shaykh-muhammad-bin-saalih-al-uthaymeen-distinguishes-between-the-salafi-manhaj-and-the-qutbi-manhaj.html">Shaykh Muhammad bin Saalih al-Uthaymeen Distinguished Between The Salafi Manhaj and The Qutbi Manhaj and Wholeheartedly Reccommended Warning From the Qutbi Manhaj After Detailed Study and Consideration</a>

<li><a href="pidmx-shaykh-bin-baaz-on-sayyid-qutbs-attacks-upon-muawiyah-and-amr-ibn-al-aas-and-accusing-them-of-hypocrisy-and-treachery.html">Shaykh Bin Baaz on Sayyid Qutb's Attacks Upon Mu'awiyah and Amr Ibn al-Aas and Accusing them of Hypocrisy and Treachery</a>

<li><a href="chbqv-shaykh-muhammad-amaan-al-jaamee-there-is-no-doubt-about-sayyid-qutb-being-an-ashari.html">Shaykh Muhammad Amaan al-Jaamee: There Is No Dispute About Sayyid Qutb Being an Ash'ari</a>

<li><a href="rhmeq-sayyid-qutb-establishing-the-haakimiyyah-of-allaah-through-communism-socialism-and-leninism.html">Sayyid Qutb: Establishing the Haakimiyyah of Allaah (By Borrowing The Manifestos of Secular Atheist Jews)</a>

<li><a href="fiohb-shaykh-salih-al-fawzaan-on-the-tafsir-of-sayyid-qutb-fee-zilaal-il-quran.html">Shaykh Salih al-Fawzaan on the Tafsir of Sayyid Qutb, 'Fee Zilaal il-Quran'</a>

<li><a href="tgdma-imaam-ibn-baaz-on-sayyid-qutbs-mockery-of-the-prophet-moses-and-his-taweel-of-istiwaa-upon-the-way-of-the-jahmiyyah-mutazilah.html">Imaam Ibn Baaz on Sayyid Qutb's Mockery of the Prophet Moses And His Ta'weel of Istiwaa Upon the Way of the Jahmiyyah Mu'tazilah</a>

<li><a href="bhman-shaykh-abdul-muhsin-al-abbaad-on-the-tafseer-of-sayyid-qutb.html">Shaykh Abdul-Muhsin al-Abbaad on the Tafseer of Sayyid Qutb</a>

<li><a href="fufhr-shaykh-muhammad-bin-saalih-al-uthaymeen-on-sayyid-qutbs-tafseer.html">Shaykh Muhammad bin Saalih al-Uthaymeen on Sayyid Qutb's Tafseer</a>

<li><a href="oplui-a-brief-glimpse-into-the-mistakes-innovations-and-calamities-of-sayyid-qutb.html">A Brief Glimpse Into the Mistakes, Innovations and Calamities of Sayyid Qutb</a>

</ul>

<font class="smallHeadline">Add a Comment</font> (comments are currently moderated)
<br>






You must be registered and logged in to comment.




<br>
<br>
<br>

</td>

<td><img src="../images/spacer.gif" width="10" height="1"></td>



<td style="border-right:1px solid #dedede;"><img src="../images/spacer.gif" width="5" height="1"></td>
<td valign="top" width="420">


<a href="dsppw-readings-in-elementary-communism-the-manifesto-of-karl-marx-and-frederick-engels-and-sayyid-qutb.html"><img src="../assets/images/qutb-marxism.gif" width="420" height="208" border="0" alt=""></a>
<img src="../images/spacer.gif" width="100" height="8">

<a href="oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html"><img src="../assets/images/picture-paints-thousand-qutbis.gif" width="420" height="208" border="0" alt=""></a>
<img src="../images/spacer.gif" width="100" height="8">





<table width="420">
<tr><td>





<table cellpadding="3">



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/the-sayings-verdicts-and-rulings-of-the-scholars-of-ahl-us-sunnah-regarding-the-doctrines-and-books-of-sayyid-qutb.html"><font style="font-size:14px;"><b>The Sayings, Verdicts and Rulings of the Scholars of Ahl us-Sunnah Regarding the Doctrines and Books of Sayyid Qutb</b></font></a> (<b>21</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/concerning-shaykh-ibn-jibreens-defence-of-hasan-al-banna-and-sayyid-qutb.html"><font style="font-size:14px;"><b>Concerning Shaykh Ibn Jibreen's Defence of Hasan al-Banna and Sayyid Qutb</b></font></a> (<b>6</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/misguiding-the-ummah-through-propaganda-for-qutbs-books-an-encyclopedia-of-the-innovations-and-deviations-they-contain.html"><font style="font-size:14px;"><b>Misguiding the Ummah Through Propaganda For Qutb's Books: An Encyclopedia of the Innovations and Deviations They Contain</b></font></a> (<b>13</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/the-false-comparison-between-hadith-giants-ibn-hajar-an-nawawi-and-20th-century-ignoramuses.html"><font style="font-size:14px;"><b>The False Comparison Between Hadith Giants Ibn Hajar, an-Nawawi and 20th Century Ignoramuses</b></font></a> (<b>2</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/sayyid-qutb-and-the-aqidah-of-the-rafidah-in-reviling-and-abusing-the-companions.html"><font style="font-size:14px;"><b>Sayyid Qutb and the Aqidah of the Rafidah in Reviling and Abusing the Companions</b></font></a> (<b>7</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/sayyid-qutb-and-the-issue-of-the-doctrine-of-wahdat-ul-wujood.html"><font style="font-size:14px;"><b>Sayyid Qutb and the Issue of the Doctrine of 'Wahdat ul-Wujood'</b></font></a> (<b>4</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/bayan-talbis-al-qutbiyyah---explanation-of-the-deception-of-the-qutbiyyah.html"><font style="font-size:14px;"><b>Bayan Talbis al-Qutbiyyah - Explanation of the Deception of the Qutbiyyah</b></font></a> (<b>4</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/qutbi-competition-corner---test-your-aptitude-for-defending-baatil.html"><font style="font-size:14px;"><b>Qutbi Competition Corner - Test Your Aptitude for Defending Baatil</b></font></a> (<b>1</b>)</td>
</tr>



<tr>
<td style="border-top:1px solid #787878; border-bottom:1px solid #787878;background:#ffffcc;"><a href="../series/hasan-al-banna-al-ikhwan-and-the-rafidite-shiah.html"><font style="font-size:14px;"><b>Hasan al-Banna, al-Ikhwan and the Rafidite Shiah</b></font></a> (<b>3</b>)</td>
</tr>

</table>

</td>
</tr></table>




<table width="420"><tr>

<td width="200" valign="top">






<table width="100%" bgcolor="#ffffff">
<tr><td colspan="2"><span class="smallHeadline">Latest Articles</span></td></tr>
<tr>
<td><a href="crfil-shaykh-al-raajihee-declares-the-haddaadiyyah-as-liars.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh al-Raajihee Declares the Extremist Haddaadiyyah as Liars</font></a>
</td>
</tr><tr>
<td><a href="tpiqg-shaykh-al-luhaydan-they-harbour-malice-towards-shaykh-rabee.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh al-Luhaydan: They Harbour Malice Towards Shaykh Rabee Because He Refutes the Opposers</font></a>
</td>
</tr><tr>
<td><a href="nkckz-shaykh-muqbil-bin-haadee-shaykh-rabee-is-an-ayah-sign-in-knowledge-of-the-hizbiyyeen.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Muqbil bin Haadee: Shaykh Rabee is an Ayah (Sign) in Knowledge of the Hizbiyyeen</font></a>
</td>
</tr><tr>
<td><a href="rlbec-shaykh-muqbil-bin-haadee-shaykh-rabee-brings-out-hizbiyyah-with-chisels.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Muqbil bin Haadee: Shaykh Rabee is Insightful Regarding the Hizbiyyeen and 'Chisels Out' Their Hizbiyyah</font></a>
</td>
</tr><tr>
<td><a href="nblim-shaykh-muqbil-bin-haadee-shaykh-rabee-is-from-the-taaifah-mansoorah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Muqbil bin Haadee: Shaykh Rabee is From the Taa'ifah Mansoorah and Filters out the Hizbiyyeen</font></a>
</td>
</tr><tr>
<td><a href="lznpg-shaykh-muqbil-bin-haadee-on-shaykh-rabee.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Muqbil bin Haadee on Shaykh Rabee: If Shaykh Rabee Says So and So is a Hizbee, Over the Passing of Days, It Will Become Clear That He is a Hizbee</font></a>
</td>
</tr><tr>
<td><a href="bjjoe-refutation-of-the-slander-of-the-confused-abdullaah-al-farsee-against-shaykh-rabee.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Refutation of the Slander of the Confused Abdullaah al-Farsee Against Shaykh Rabee Regarding the Issue of Iqaamat ul-Hujjah</font></a>
</td>
</tr><tr>
<td><a href="dhzcn-shaykh-saalih-al-fawzaan-on-shaykh-rabee.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Shaykh Saalih al-Fawzaan Asked About Whoever Twisted His Speech to Attack Shaykh Rabee: It is From His Own Desire and He Will Bear the Burden of Sin</font></a>
</td>
</tr><tr>
<td><a href="ugyiy-a-gift-to-salman-al-awdah-and-safar-al-hawali-shaykh-al-fawzan-on-the-jaamiyyah.html" class="articleTitleListLatest"><font class="articleTitleListLatest">A Gift to Salman al-Awdah and Safar al-Hawali: Shaykh Salih al-Fawzan: Being Labelled with 'Jaamiyyah' is a Praise and a Tazkiyah</font></a>
</td>
</tr><tr>
<td><a href="lvmri-sayyid-qutbs-letter-to-ayatollah-kashani-al-rafidee.html" class="articleTitleListLatest"><font class="articleTitleListLatest">Sayyid Qutb and Ayatollah Kashani (Both Rafidees) and Abu Zubair Saleem Begg and Abu Fatimah Salman Awan (Both Practical Ghulaat al-Murji'ah)</font></a>
</td>
</tr>

<tr><td>
<span class="articleTitleListLatest">
<a href="http://www.learnarabic.com/profile/?bintmuhammed" target="_top">Demonstrative Pronouns in Arabic Grammar</a> 
</span>
</td></tr>

<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>






</div>
 
</td>

<td style="border-right:1px solid #dedede;"><img src="../images/spacer.gif" width="5" height="1"></td>

<td><img src="../images/spacer.gif" width="3" height="1"></td>

<td width="200" valign="top">



<table align="center" width="100%">
<tr><td><span class="smallHeadline">Search This Site</span></td></tr>
<form action="http://www.themadkhalis.com/md/search.cfm" method="post"><tr>
<td><input type="text" name="q" size="25" style="background:#ffffff" value="Enter phrase and hit enter" onfocus="this.value='';"></td>
</tr>
</form>
</table>



<BR>
<table width="100%">

<tr><td colspan="2" style="border-bottom:1px solid #ababab;" bgcolor="#e7edf9">&nbsp;<font style="font-size:12px;color:#676767;"><b>Other Websites</b></font></td></tr>

<tr><td style="border-bottom:1px solid #ababab;">&nbsp;<a href="http://www.takfiris.com/" target="_blank"><font style="font-size:12px;">Takfiris.Com</font></a></td></tr>

</table>




<br>





<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Most Popular</span></td></tr>

<tr>

<td>
<a href="oyama-hasan-al-banna-sayyid-qutb-abu-ala-mawdudi-the-rafidah-and-the-iranian-revolution.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>A Picture Paints (Characterizes)  a Thousand Qutbis: Hasan al-Banna, Sayyid Qutb, Abu A'la Mawdudi, the Rafidah and the Iranian Revolution</b></font></a>
</td>
</tr><tr>

<td>
<a href="cotrs-the-hypocritical-filthy-coward-who-runs-the-forums-of-amwaatmorg.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Sajid Kayum: The Hypocritical Coward Who Runs The Forums of Amwaat.Morg In Which Slanders and Alleged Sins Are Spread About Other Muslims</b></font></a>
</td>
</tr><tr>

<td>
<a href="dsppw-readings-in-elementary-communism-the-manifesto-of-karl-marx-and-frederick-engels-and-sayyid-qutb.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Readings in Elementary Communism: Karl Marx, Freidrich Engels, Sayyid Qutb, Capitalism, the State, Social Justice, Revolution and the Communist Manifesto</b></font></a>
</td>
</tr><tr>

<td>
<a href="nvskb-why-shaykh-rabee-was-correct-and-shaykh-abdul-muhsin-al-abbaad-was-wrong-yet-both-are-rewarded.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Regarding Abu al-Hasan al-Ma'ribee al-Ikhwani: Why Shaykh Rabee' Was Correct and Shaykh Abdul-Muhsin al-Abbaad Was Wrong (Yet Both Are Rewarded) -  Part 1</b></font></a>
</td>
</tr><tr>

<td>
<a href="amyxn-the-satanic-path-of-the-slanderhouse-forums.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Satanic Path of Sajid Kayum's Slanderhouse Forums Evaluated in Light of the Prophetic Sunnah</b></font></a>
</td>
</tr><tr>

<td>
<a href="pfwuf-muftee-abdul-azeez-aal-al-shaykh-on-the-saying-of-sayyid-qutb-about-muawiyyah-and-amr-bin-al-aas.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Muftee Abdul-Azeez Aal al-Shaykh on the Saying of Sayyid Qutb About Mu'awiyyah and Amr bin al-Aas: It is the Saying of a Baatinee Khabeeth or a Yahoodee La'een and is the Epitomy of Nifaaq</b></font></a>
</td>
</tr><tr>

<td>
<a href="ztcvm-the-relationship-between-shaykh-rabee-al-madkhali-and-the-major-scholars-part-3.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Relationship Between Shaykh Rabee al-Madkhali and the Major Scholars: Part 3 - Imaam Ibn Baz Requesting Shaykh Rabee in Writing To Refute a Denier of Allaah's Attributes</b></font></a>
</td>
</tr><tr>

<td>
<a href="elmbe-sayyid-qutb-and-the-jewish-led-revolution-against-the-third-khalifah-uthman-bin-affaan.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Sayyid Qutb and the Revolution Organized in Egypt  Against the Third Khalifah Uthman bin Affaan</b></font></a>
</td>
</tr><tr>

<td>
<a href="iosjk-imaam-al-albani-to-shaykh-rabee-everything-with-which-you-refuted-qutb-for-is-correct-and-true.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>Imaam al-Albani to Shaykh Rabee: Everything With Which You Refuted Qutb For Is Correct and True and May Allaah Reward You For Fulfilling The Obligation of Exposing His Ignorance and Deviance</b></font></a>
</td>
</tr><tr>

<td>
<a href="qvrrm-imaam-ibn-baz-on-the-qutbiyyah-who-lied-upon-him-safar-al-hawali-salman-al-awdah-muhammad-saeed-al-qahtani.html" class="articleTitleMostPopular"><font class="articleTitleMostPopular"><b>The Words of Imaam Ibn Baz Falling on Those (Qutbiyyah) Who Lied Upon Him (Safar al-Hawali, Salman al-Awdah, Muhammad Sa'eed al-Qahtani, Aa'id al-Qarnee, Abdur-Razzaq ash-Shayijee): Callers of Falsehood and Stirrers of the Murky Waters</b></font></a>
</td>
</tr>

<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>




<br>





<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Tags</span></td></tr>

<tr>
<td>

<span class="tagspan_yellow"><a href="../tags/aaid-al-qarnee.html">aa'id al-qarnee</a></span>

<span class="tagspan_yellow"><a href="../tags/aaid-al-qarni.html">aa'id al-qarni</a></span>

<span class="tagspan_yellow"><a href="../tags/abbaas-al-.html">abbaas al-</a></span>

<span class="tagspan_yellow"><a href="../tags/abbas-el-akkad.html">abbas el-akkad</a></span>

<span class="tagspan_yellow"><a href="../tags/abd-al-aziz-aal-ash-shaikh.html">abd al-aziz aal ash-shaikh</a></span>

<span class="tagspan_yellow"><a href="../tags/abdul-aziz-aal-ash-shaikh.html">abdul-aziz aal ash-shaikh</a></span>

<span class="tagspan_yellow"><a href="../tags/abdul-aziz-ar-raajihee.html">abdul-aziz ar-raajihee</a></span>

<span class="tagspan_yellow"><a href="../tags/abdullaah-al-farsee.html">abdullaah al-farsee</a></span>

<span class="tagspan_yellow"><a href="../tags/abdullah-al-farsee.html">abdullah al-farsee</a></span>

<span class="tagspan_yellow"><a href="../tags/abdullah-azzam.html">abdullah azzam</a></span>

<span class="tagspan_yellow"><a href="../tags/abdullah-bin-saba.html">abdullah bin saba'</a></span>

<span class="tagspan_yellow"><a href="../tags/abdur-rahmaan-abdul-khaaliq.html">abdur-rahmaan abdul-khaaliq</a></span>

<span class="tagspan_yellow"><a href="../tags/abdur-razzaq-ash-shayijee.html">abdur-razzaq ash-shayijee</a></span>

<span class="tagspan_yellow"><a href="../tags/abu-ala-mawdudi.html">abu a'la mawdudi</a></span>

<span class="tagspan_yellow"><a href="../tags/abu-al-hasan-al-maribee.html">abu al-hasan al-ma'ribee</a></span>

<span class="tagspan_yellow"><a href="../tags/abu-sufyan.html">abu sufyan</a></span>

<span class="tagspan_yellow"><a href="../tags/ahmad-shakir.html">ahmad shakir</a></span>

<span class="tagspan_yellow"><a href="../tags/ahya.html">ahya</a></span>

<span class="tagspan_yellow"><a href="../tags/al-adaalah-al-ijtimaaiyyah.html">al-adaalah al-ijtimaa'iyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/al-arsh.html">al-arsh</a></span>

<span class="tagspan_yellow"><a href="../tags/al-fawzaan.html">al-fawzaan</a></span>

<span class="tagspan_yellow"><a href="../tags/al-fawzan.html">al-fawzan</a></span>

<span class="tagspan_yellow"><a href="../tags/al-ghazali.html">al-ghazali</a></span>

<span class="tagspan_yellow"><a href="../tags/al-ghudayan.html">al-ghudayan</a></span>

<span class="tagspan_yellow"><a href="../tags/al-ikwan-al-muslimoon.html">al-ikwan al-muslimoon</a></span>

<span class="tagspan_yellow"><a href="../tags/al-istiwaa.html">al-istiwaa</a></span>

<span class="tagspan_yellow"><a href="../tags/al-luhaidan.html">al-luhaidan</a></span>

<span class="tagspan_yellow"><a href="../tags/al-mubarakfuri.html">al-mubarakfuri</a></span>

<span class="tagspan_yellow"><a href="../tags/al-uluww.html">al-uluww</a></span>

<span class="tagspan_yellow"><a href="../tags/albaanee.html">albaanee</a></span>

<span class="tagspan_yellow"><a href="../tags/albani.html">albani</a></span>

<span class="tagspan_yellow"><a href="../tags/alexis-carrel.html">alexis carrel</a></span>

<span class="tagspan_yellow"><a href="../tags/algeria.html">algeria</a></span>

<span class="tagspan_yellow"><a href="../tags/amr-khalid.html">amr khalid</a></span>

<span class="tagspan_yellow"><a href="../tags/an-nawawi.html">an-nawawi</a></span>

<span class="tagspan_yellow"><a href="../tags/aqidah.html">aqidah</a></span>

<span class="tagspan_yellow"><a href="../tags/aqqaad.html">aqqaad</a></span>

<span class="tagspan_yellow"><a href="../tags/ar-razi.html">ar-razi</a></span>

<span class="tagspan_yellow"><a href="../tags/ashari.html">ash'ari</a></span>

<span class="tagspan_yellow"><a href="../tags/asharis.html">ash'aris</a></span>

<span class="tagspan_yellow"><a href="../tags/asharite.html">ash'arite</a></span>

<span class="tagspan_yellow"><a href="../tags/ashariyyah.html">ash'ariyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/ashariyyah.html">asha'riyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/asharis.html">asharis</a></span>

<span class="tagspan_yellow"><a href="../tags/az-zilal.html">az-zilal</a></span>

<span class="tagspan_yellow"><a href="../tags/banna.html">banna</a></span>

<span class="tagspan_yellow"><a href="../tags/barbarism.html">barbarism</a></span>

<span class="tagspan_yellow"><a href="../tags/bayaan-talbis-al-qutbiyyah.html">bayaan talbis al-qutbiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/bayan-talbis-al-qutbiyyah.html">bayan talbis al-qutbiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/christianity.html">christianity</a></span>

<span class="tagspan_yellow"><a href="../tags/communism.html">communism</a></span>

<span class="tagspan_yellow"><a href="../tags/communist-manifesto.html">communist manifesto</a></span>

<span class="tagspan_yellow"><a href="../tags/egypt.html">egypt</a></span>

<span class="tagspan_yellow"><a href="../tags/excommunication.html">excommunication</a></span>

<span class="tagspan_yellow"><a href="../tags/extremism.html">extremism</a></span>

<span class="tagspan_yellow"><a href="../tags/faith.html">faith</a></span>

<span class="tagspan_yellow"><a href="../tags/fawzan.html">fawzan</a></span>

<span class="tagspan_yellow"><a href="../tags/fi-zilal-il-quran.html">fi zilal il-qur'an</a></span>

<span class="tagspan_yellow"><a href="../tags/fi-zilal-il-quran.html">fi zilal il-quran</a></span>

<span class="tagspan_yellow"><a href="../tags/fikr.html">fikr</a></span>

<span class="tagspan_yellow"><a href="../tags/frederick-engels.html">frederick engels</a></span>

<span class="tagspan_yellow"><a href="../tags/george-bush.html">george bush</a></span>

<span class="tagspan_yellow"><a href="../tags/ghaddafi.html">ghaddafi</a></span>

<span class="tagspan_yellow"><a href="../tags/ghulaat-al-murjiah.html">ghulaat al-murji'ah</a></span>

<span class="tagspan_yellow"><a href="../tags/ghuluww.html">ghuluww</a></span>

<span class="tagspan_yellow"><a href="../tags/grave-worship.html">grave worship</a></span>

<span class="tagspan_yellow"><a href="../tags/haakimiyyah.html">haakimiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/habib-ali-al-jifree.html">habib ali al-jifree</a></span>

<span class="tagspan_yellow"><a href="../tags/hadd.html">hadd</a></span>

<span class="tagspan_yellow"><a href="../tags/hammad-al-ansari.html">hammad al-ansari</a></span>

<span class="tagspan_yellow"><a href="../tags/hasan-al-banna.html">hasan al-banna</a></span>

<span class="tagspan_yellow"><a href="../tags/hasan-al-maalikee.html">hasan al-maalikee</a></span>

<span class="tagspan_yellow"><a href="../tags/hayyiz.html">hayyiz</a></span>

<span class="tagspan_yellow"><a href="../tags/hind.html">hind</a></span>

<span class="tagspan_yellow"><a href="../tags/hudood.html">hudood</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-arabi.html">ibn arabi</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-baaz.html">ibn baaz</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-baz.html">ibn baz</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-hajar-al-asqalani.html">ibn hajar al-asqalani</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-hajr.html">ibn hajr</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-jibreen.html">ibn jibreen</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-jibrin.html">ibn jibrin</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-saba-al-yahudi.html">ibn saba al-yahudi</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-taymiyyah.html">ibn taymiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-uthaymeen.html">ibn uthaymeen</a></span>

<span class="tagspan_yellow"><a href="../tags/ibn-uthaymin.html">ibn uthaymin</a></span>

<span class="tagspan_yellow"><a href="../tags/ihyaa-al-turaath.html">ihyaa al-turaath</a></span>

<span class="tagspan_yellow"><a href="../tags/imaan.html">imaan</a></span>

<span class="tagspan_yellow"><a href="../tags/in-the-shade-of-the-quran.html">in the shade of the qur'an</a></span>

<span class="tagspan_yellow"><a href="../tags/iranian-revolution.html">iranian revolution</a></span>

<span class="tagspan_yellow"><a href="../tags/irja.html">irja</a></span>

<span class="tagspan_yellow"><a href="../tags/irjaa.html">irjaa</a></span>

<span class="tagspan_yellow"><a href="../tags/irjaa.html">irjaa'</a></span>

<span class="tagspan_yellow"><a href="../tags/istibdaal.html">istibdaal</a></span>

<span class="tagspan_yellow"><a href="../tags/istihzaa.html">istihzaa</a></span>

<span class="tagspan_yellow"><a href="../tags/jaahiliyyah.html">jaahiliyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/jahmiyyah.html">jahmiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/jamaaat-ut-takfir.html">jamaa'at ut-takfir</a></span>

<span class="tagspan_yellow"><a href="../tags/jameel-zainoo.html">jameel zainoo</a></span>

<span class="tagspan_yellow"><a href="../tags/jihah.html">jihah</a></span>

<span class="tagspan_yellow"><a href="../tags/karl-marx.html">karl marx</a></span>

<span class="tagspan_yellow"><a href="../tags/kashani.html">kashani</a></span>

<span class="tagspan_yellow"><a href="../tags/khabar-ul-aahaad.html">khabar ul-aahaad</a></span>

<span class="tagspan_yellow"><a href="../tags/khabar-ul-wahid.html">khabar ul-wahid</a></span>

<span class="tagspan_yellow"><a href="../tags/khameni.html">khameni</a></span>

<span class="tagspan_yellow"><a href="../tags/kharijites.html">kharijites</a></span>

<span class="tagspan_yellow"><a href="../tags/khawarij.html">khawarij</a></span>

<span class="tagspan_yellow"><a href="../tags/khomeini.html">khomeini</a></span>

<span class="tagspan_yellow"><a href="../tags/khurooj.html">khurooj</a></span>

<span class="tagspan_yellow"><a href="../tags/kufr-bawah.html">kufr bawah</a></span>

<span class="tagspan_yellow"><a href="../tags/leninism.html">leninism</a></span>

<span class="tagspan_yellow"><a href="../tags/leninists.html">leninists</a></span>

<span class="tagspan_yellow"><a href="../tags/libya.html">libya</a></span>

<span class="tagspan_yellow"><a href="../tags/madaakhilah.html">madaakhilah</a></span>

<span class="tagspan_yellow"><a href="../tags/madkhali.html">madkhali</a></span>

<span class="tagspan_yellow"><a href="../tags/madkhalis.html">madkhalis</a></span>

<span class="tagspan_yellow"><a href="../tags/mahmood-shakir.html">mahmood shakir</a></span>

<span class="tagspan_yellow"><a href="../tags/mahmud-shakir.html">mahmud shakir</a></span>

<span class="tagspan_yellow"><a href="../tags/makaan.html">makaan</a></span>

<span class="tagspan_yellow"><a href="../tags/makhlooq.html">makhlooq</a></span>

<span class="tagspan_yellow"><a href="../tags/marxism.html">marxism</a></span>

<span class="tagspan_yellow"><a href="../tags/marxist-socialism.html">marxist socialism</a></span>

<span class="tagspan_yellow"><a href="../tags/mawdudi.html">mawdudi</a></span>

<span class="tagspan_yellow"><a href="../tags/milestones.html">milestones</a></span>

<span class="tagspan_yellow"><a href="../tags/mockery.html">mockery</a></span>

<span class="tagspan_yellow"><a href="../tags/mohammad-qutb.html">mohammad qutb</a></span>

<span class="tagspan_yellow"><a href="../tags/mongols.html">mongols</a></span>

<span class="tagspan_yellow"><a href="../tags/moosaa.html">moosaa</a></span>

<span class="tagspan_yellow"><a href="../tags/moses.html">moses</a></span>

<span class="tagspan_yellow"><a href="../tags/muawiyah.html">mu'awiyah</a></span>

<span class="tagspan_yellow"><a href="../tags/mufawwidah.html">mufawwidah</a></span>

<span class="tagspan_yellow"><a href="../tags/mufawwidh.html">mufawwidh</a></span>

<span class="tagspan_yellow"><a href="../tags/muhammad-al-areefee.html">muhammad al-areefee</a></span>

<span class="tagspan_yellow"><a href="../tags/muhammad-bin-ibraaheem.html">muhammad bin ibraaheem</a></span>

<span class="tagspan_yellow"><a href="../tags/muhammad-bin-ibrahim.html">muhammad bin ibrahim</a></span>

<span class="tagspan_yellow"><a href="../tags/muhammad-saeed-al-qahtani.html">muhammad sa'eed al-qahtani</a></span>

<span class="tagspan_yellow"><a href="../tags/muqbil-bin-haadee.html">muqbil bin haadee</a></span>

<span class="tagspan_yellow"><a href="../tags/muqbil-bin-hadi.html">muqbil bin hadi</a></span>

<span class="tagspan_yellow"><a href="../tags/murjiah.html">murji'ah</a></span>

<span class="tagspan_yellow"><a href="../tags/nawab-safawi.html">nawab safawi</a></span>

<span class="tagspan_yellow"><a href="../tags/nawawi.html">nawawi</a></span>

<span class="tagspan_yellow"><a href="../tags/qawaaneen.html">qawaaneen</a></span>

<span class="tagspan_yellow"><a href="../tags/qawanin.html">qawanin</a></span>

<span class="tagspan_yellow"><a href="../tags/qsep.html">qsep</a></span>

<span class="tagspan_yellow"><a href="../tags/quran.html">qur'an</a></span>

<span class="tagspan_yellow"><a href="../tags/qutb.html">qutb</a></span>

<span class="tagspan_yellow"><a href="../tags/qutbi.html">qutbi</a></span>

<span class="tagspan_yellow"><a href="../tags/qutbi-manhaj.html">qutbi manhaj</a></span>

<span class="tagspan_yellow"><a href="../tags/qutbis.html">qutbis</a></span>

<span class="tagspan_yellow"><a href="../tags/qutbiyyah.html">qutbiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/qutubiyyah.html">qutubiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/raafidah.html">raafidah</a></span>

<span class="tagspan_yellow"><a href="../tags/rabi-al-madkhali.html">rabi al-madkhali</a></span>

<span class="tagspan_yellow"><a href="../tags/rabi-bin-hadi-al-madkhali.html">rabi bin hadi al-madkhali</a></span>

<span class="tagspan_yellow"><a href="../tags/rafidah.html">rafidah</a></span>

<span class="tagspan_yellow"><a href="../tags/rafidah-shiah.html">rafidah shi'ah</a></span>

<span class="tagspan_yellow"><a href="../tags/revolutionary-ideology.html">revolutionary ideology</a></span>

<span class="tagspan_yellow"><a href="../tags/safar-al-hawali.html">safar al-hawali</a></span>

<span class="tagspan_yellow"><a href="../tags/sahaabah.html">sahaabah</a></span>

<span class="tagspan_yellow"><a href="../tags/sajid-kaym.html">sajid kaym</a></span>

<span class="tagspan_yellow"><a href="../tags/sajid-kayum.html">sajid kayum</a></span>

<span class="tagspan_yellow"><a href="../tags/salafi-manhaj.html">salafi manhaj</a></span>

<span class="tagspan_yellow"><a href="../tags/saleem-begg.html">saleem begg</a></span>

<span class="tagspan_yellow"><a href="../tags/salih-aal-ash-shaykh.html">salih aal ash-shaykh</a></span>

<span class="tagspan_yellow"><a href="../tags/salih-al-luhaydan.html">salih al-luhaydan</a></span>

<span class="tagspan_yellow"><a href="../tags/salman-al-aqdah.html">salman al-aqdah</a></span>

<span class="tagspan_yellow"><a href="../tags/salman-al-awdah.html">salman al-awdah</a></span>

<span class="tagspan_yellow"><a href="../tags/salman-awan.html">salman awan</a></span>

<span class="tagspan_yellow"><a href="../tags/saudi.html">saudi</a></span>

<span class="tagspan_yellow"><a href="../tags/saudi-arabia.html">saudi arabia</a></span>

<span class="tagspan_yellow"><a href="../tags/sayyid-qutb.html">sayyid qutb</a></span>

<span class="tagspan_yellow"><a href="../tags/secular-law.html">secular law</a></span>

<span class="tagspan_yellow"><a href="../tags/secular-laws.html">secular laws</a></span>

<span class="tagspan_yellow"><a href="../tags/secularism.html">secularism</a></span>

<span class="tagspan_yellow"><a href="../tags/shaikh-rabi.html">shaikh rabi</a></span>

<span class="tagspan_yellow"><a href="../tags/shanqeetee.html">shanqeetee</a></span>

<span class="tagspan_yellow"><a href="../tags/shanqiti.html">shanqiti</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-abd-al-aziz-aal-ash-shaykh.html">shaykh abd al-aziz aal ash-shaykh</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-abd-al-aziz-bin-baz.html">shaykh abd al-aziz bin baz</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-abdul-aziz-bin-baz.html">shaykh abdul-aziz bin baz</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-al-albani.html">shaykh al-albani</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-al-luhaydaan.html">shaykh al-luhaydaan</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-al-uthaymin.html">shaykh al-uthaymin</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-ibn-jibrin.html">shaykh ibn jibrin</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-ibn-uthaymin.html">shaykh ibn uthaymin</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-muhammad-amaan-al-jaamee.html">shaykh muhammad amaan al-jaamee</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-muqbil-bin-haadee.html">shaykh muqbil bin haadee</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-muqbil-bin-hadi.html">shaykh muqbil bin hadi</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabee.html">shaykh rabee</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabee-bin-haadee.html">shaykh rabee bin haadee</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabee.html">shaykh rabee'</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabi.html">shaykh rabi</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabi-al-madkali.html">shaykh rabi al-madkali</a></span>

<span class="tagspan_yellow"><a href="../tags/shaykh-rabi-bin-hadi-al-madkhali.html">shaykh rabi bin hadi al-madkhali</a></span>

<span class="tagspan_yellow"><a href="../tags/shiites.html">shi'ites</a></span>

<span class="tagspan_yellow"><a href="../tags/shiah.html">shiah</a></span>

<span class="tagspan_yellow"><a href="../tags/shirk.html">shirk</a></span>

<span class="tagspan_yellow"><a href="../tags/sifaat-filiyyah.html">sifaat fi'liyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/social-justice.html">social justice</a></span>

<span class="tagspan_yellow"><a href="../tags/socialism.html">socialism</a></span>

<span class="tagspan_yellow"><a href="../tags/soofee.html">soofee</a></span>

<span class="tagspan_yellow"><a href="../tags/speech-of-allaah.html">speech of allaah</a></span>

<span class="tagspan_yellow"><a href="../tags/sufi.html">sufi</a></span>

<span class="tagspan_yellow"><a href="../tags/sufism.html">sufism</a></span>

<span class="tagspan_yellow"><a href="../tags/syria.html">syria</a></span>

<span class="tagspan_yellow"><a href="../tags/taweel.html">ta'weel</a></span>

<span class="tagspan_yellow"><a href="../tags/tabdeel.html">tabdeel</a></span>

<span class="tagspan_yellow"><a href="../tags/tafweed.html">tafweed</a></span>

<span class="tagspan_yellow"><a href="../tags/tahkeem.html">tahkeem</a></span>

<span class="tagspan_yellow"><a href="../tags/tahkeem-al-qawaaneen.html">tahkeem al-qawaaneen</a></span>

<span class="tagspan_yellow"><a href="../tags/tahkim-al-qawanin.html">tahkim al-qawanin</a></span>

<span class="tagspan_yellow"><a href="../tags/takfeer.html">takfeer</a></span>

<span class="tagspan_yellow"><a href="../tags/takfir.html">takfir</a></span>

<span class="tagspan_yellow"><a href="../tags/takfiris.html">takfiris</a></span>

<span class="tagspan_yellow"><a href="../tags/takhyeel.html">takhyeel</a></span>

<span class="tagspan_yellow"><a href="../tags/tamyee.html">tamyee'</a></span>

<span class="tagspan_yellow"><a href="../tags/tashree.html">tashree'</a></span>

<span class="tagspan_yellow"><a href="../tags/taswir-al-fanni-fil-quran.html">taswir al-fanni fil-qur'an</a></span>

<span class="tagspan_yellow"><a href="../tags/tatars.html">tatars</a></span>

<span class="tagspan_yellow"><a href="../tags/tawhid.html">tawhid</a></span>

<span class="tagspan_yellow"><a href="../tags/tawhid-al-haakimiyyah.html">tawhid al-haakimiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/tawhid-al-hakimiyyah.html">tawhid al-hakimiyyah</a></span>

<span class="tagspan_yellow"><a href="../tags/tawhid-al-hukm.html">tawhid al-hukm</a></span>

<span class="tagspan_yellow"><a href="../tags/the-companions.html">the companions</a></span>

<span class="tagspan_yellow"><a href="../tags/ubaydullah-al-mubarakfuri.html">ubaydullah al-mubarakfuri</a></span>

<span class="tagspan_yellow"><a href="../tags/wahdat-ul-wujood.html">wahdat ul-wujood</a></span>

<span class="tagspan_yellow"><a href="../tags/zilal.html">zilal</a></span>

</td>
</tr>
<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>



<br>










<table width="100%" bgcolor="#ffffff" style="border-bottom:1px dashed #99ccff;">
<tr><td colspan="2"><span class="smallHeadline">Archives</span></td></tr>
<tr>

<td>

<a href="../archives/2025/08.html">August 2025</a><BR>


<a href="../archives/2025/07.html">July 2025</a><BR>


<a href="../archives/2025/06.html">June 2025</a><BR>


<a href="../archives/2025/05.html">May 2025</a><BR>


<a href="../archives/2025/04.html">April 2025</a><BR>


<a href="../archives/2025/03.html">March 2025</a><BR>


<a href="../archives/2025/02.html">February 2025</a><BR>


<a href="../archives/2025/01.html">January 2025</a><BR>


<a href="../archives/2024/12.html">December 2024</a><BR>


<a href="../archives/2024/11.html">November 2024</a><BR>


<a href="../archives/2024/10.html">October 2024</a><BR>


<a href="../archives/2024/09.html">September 2024</a><BR>


<a href="../archives/2024/08.html">August 2024</a><BR>


<a href="../archives/2024/07.html">July 2024</a><BR>


<a href="../archives/2024/06.html">June 2024</a><BR>


<a href="../archives/2024/05.html">May 2024</a><BR>


<a href="../archives/2024/04.html">April 2024</a><BR>


<a href="../archives/2024/03.html">March 2024</a><BR>


<a href="../archives/2024/02.html">February 2024</a><BR>


<a href="../archives/2024/01.html">January 2024</a><BR>


<a href="../archives/2023/12.html">December 2023</a><BR>


<a href="../archives/2023/11.html">November 2023</a><BR>


<a href="../archives/2023/10.html">October 2023</a><BR>


<a href="../archives/2023/09.html">September 2023</a><BR>


<a href="../archives/2023/08.html">August 2023</a><BR>


<a href="../archives/2023/07.html">July 2023</a><BR>


<a href="../archives/2023/06.html">June 2023</a><BR>


<a href="../archives/2023/05.html">May 2023</a><BR>


<a href="../archives/2023/04.html">April 2023</a><BR>


<a href="../archives/2023/03.html">March 2023</a><BR>


<a href="../archives/2023/02.html">February 2023</a><BR>


<a href="../archives/2023/01.html">January 2023</a><BR>


<a href="../archives/2022/12.html">December 2022</a><BR>


<a href="../archives/2022/11.html">November 2022</a><BR>


<a href="../archives/2022/10.html">October 2022</a><BR>


<a href="../archives/2022/09.html">September 2022</a><BR>


<a href="../archives/2022/08.html">August 2022</a><BR>


<a href="../archives/2022/07.html">July 2022</a><BR>


<a href="../archives/2022/06.html">June 2022</a><BR>


<a href="../archives/2022/05.html">May 2022</a><BR>


<a href="../archives/2022/04.html">April 2022</a><BR>


<a href="../archives/2022/03.html">March 2022</a><BR>


<a href="../archives/2022/02.html">February 2022</a><BR>


<a href="../archives/2022/01.html">January 2022</a><BR>


<a href="../archives/2021/12.html">December 2021</a><BR>


<a href="../archives/2021/11.html">November 2021</a><BR>


<a href="../archives/2021/10.html">October 2021</a><BR>


<a href="../archives/2021/09.html">September 2021</a><BR>


<a href="../archives/2021/08.html">August 2021</a><BR>


<a href="../archives/2021/07.html">July 2021</a><BR>


<a href="../archives/2021/06.html">June 2021</a><BR>


<a href="../archives/2021/05.html">May 2021</a><BR>


<a href="../archives/2021/04.html">April 2021</a><BR>


<a href="../archives/2021/03.html">March 2021</a><BR>


<a href="../archives/2021/02.html">February 2021</a><BR>


<a href="../archives/2021/01.html">January 2021</a><BR>


<a href="../archives/2020/12.html">December 2020</a><BR>


<a href="../archives/2020/11.html">November 2020</a><BR>


<a href="../archives/2020/10.html">October 2020</a><BR>


<a href="../archives/2020/09.html">September 2020</a><BR>


<a href="../archives/2020/08.html">August 2020</a><BR>


<a href="../archives/2020/07.html">July 2020</a><BR>


<a href="../archives/2020/06.html">June 2020</a><BR>


<a href="../archives/2020/05.html">May 2020</a><BR>


<a href="../archives/2020/04.html">April 2020</a><BR>


<a href="../archives/2020/03.html">March 2020</a><BR>


<a href="../archives/2020/02.html">February 2020</a><BR>


<a href="../archives/2020/01.html">January 2020</a><BR>


<a href="../archives/2019/12.html">December 2019</a><BR>


<a href="../archives/2019/11.html">November 2019</a><BR>


<a href="../archives/2019/10.html">October 2019</a><BR>


<a href="../archives/2019/09.html">September 2019</a><BR>


<a href="../archives/2019/08.html">August 2019</a><BR>


<a href="../archives/2019/07.html">July 2019</a><BR>


<a href="../archives/2019/06.html">June 2019</a><BR>


<a href="../archives/2019/05.html">May 2019</a><BR>


<a href="../archives/2019/04.html">April 2019</a><BR>


<a href="../archives/2019/03.html">March 2019</a><BR>


<a href="../archives/2019/02.html">February 2019</a><BR>


<a href="../archives/2019/01.html">January 2019</a><BR>


<a href="../archives/2018/12.html">December 2018</a><BR>


<a href="../archives/2018/11.html">November 2018</a><BR>


<a href="../archives/2018/10.html">October 2018</a><BR>


<a href="../archives/2018/09.html">September 2018</a><BR>


<a href="../archives/2018/08.html">August 2018</a><BR>


<a href="../archives/2018/07.html">July 2018</a><BR>


<a href="../archives/2018/06.html">June 2018</a><BR>


<a href="../archives/2018/05.html">May 2018</a><BR>


<a href="../archives/2018/04.html">April 2018</a><BR>


<a href="../archives/2018/03.html">March 2018</a><BR>


<a href="../archives/2018/02.html">February 2018</a><BR>


<a href="../archives/2018/01.html">January 2018</a><BR>


<a href="../archives/2017/12.html">December 2017</a><BR>


<a href="../archives/2017/11.html">November 2017</a><BR>


<a href="../archives/2017/10.html">October 2017</a><BR>


<a href="../archives/2017/09.html">September 2017</a><BR>


<a href="../archives/2017/08.html">August 2017</a><BR>


<a href="../archives/2017/07.html">July 2017</a><BR>


<a href="../archives/2017/06.html">June 2017</a><BR>


<a href="../archives/2017/05.html">May 2017</a><BR>


</td>
</tr>
<tr><td><img src="../images/spacer.gif" width="12" height="8" border="0" alt=""></td></tr>
</table>



<br>







</td>
</tr></table>



</td>






<td><img src="../images/spacer.gif" width="15" height="1"></td>
</tr>
</table>




<table width="1000" cellpadding="0" cellspacing="0" bgcolor="#ffffff">
<tr>
<td><img src="../images/spacer.gif" width="15" height="15" border="0" alt=""></td>
<td width="100%"></td>
<td><img src="../images/spacer.gif" width="15" height="15" border="0" alt=""></td>
</tr>
</table>
<table width="1000" cellpadding="0" cellspacing="0" bgcolor="#33366"><tr><td>
<br>


</div>

<div class="textsmall" style="color:#ffffff;" align="center">&copy; TheMadkhalis.Com. All rights reserved.<BR>
<a href="../../index.html">Madkhalis</a> <a href="../../index.html">Madaakhilah</a>  <a href="../../index.html">The Madkhalis</a>
</div>


<br>


</td></tr></table>
<table width="1000" cellpadding="0" cellspacing="0" bgcolor="#232323"><tr><td><img src="../images/spacer.gif" width="15" height="6" border="0" alt=""></td></tr></table>
</div>
<br>
<br>
<br>



</body>

<!-- Mirrored from www.themadkhalis.com/md/articles/mslqe-mahmood-shakirs-defence-of-the-companions-against-the-attacks-of-the-raafidee-sayyid-qutb.cfm by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:22:08 GMT -->
</html>
