{"id":718,"date":"2010-12-18T09:11:27","date_gmt":"2010-12-18T05:11:27","guid":{"rendered":"http:\/\/www.faithinallah.org"},"modified":"2023-03-24T12:31:15","modified_gmt":"2023-03-24T08:31:15","slug":"forty-sacred-hadith-qudsi-english-arabic","status":"publish","type":"page","link":"https:\/\/www.abuaminaelias.com\/forty-sacred-hadith-qudsi-english-arabic\/","title":{"rendered":"Forty Sacred Hadith Qudsi"},"content":{"rendered":"<p>Translated by Abu Amina Elias (Justin Parrott)<\/p>\n<p><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>—<\/p>\n<p><strong>Hadith 1<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ يَوْمَ الْقِيَامَةِ يَا ابْنَ آدَمَ مَرِضْتُ فَلَمْ تَعُدْنِي قَالَ يَا رَبِّ كَيْفَ أَعُودُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ قَالَ أَمَا عَلِمْتَ أَنَّ عَبْدِي فُلَانًا مَرِضَ فَلَمْ تَعُدْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ عُدْتَهُ لَوَجَدْتَنِي عِنْدَهُ يَا ابْنَ آدَمَ اسْتَطْعَمْتُكَ فَلَمْ تُطْعِمْنِي قَالَ يَا رَبِّ وَكَيْفَ أُطْعِمُكَ وَأَنْتَ رَبُّ الْعَالَمِينَ قَالَ أَمَا عَلِمْتَ أَنَّهُ اسْتَطْعَمَكَ عَبْدِي فُلَانٌ فَلَمْ تُطْعِمْهُ أَمَا عَلِمْتَ أَنَّكَ لَوْ أَطْعَمْتَهُ لَوَجَدْتَ ذَلِكَ عِنْدِي يَا ابْنَ آدَمَ اسْتَسْقَيْتُكَ فَلَمْ تَسْقِنِي قَالَ يَا رَبِّ كَيْفَ أَسْقِيكَ وَأَنْتَ رَبُّ الْعَالَمِينَ قَالَ اسْتَسْقَاكَ عَبْدِي فُلَانٌ فَلَمْ تَسْقِهِ أَمَا إِنَّكَ لَوْ سَقَيْتَهُ وَجَدْتَ ذَلِكَ عِنْدِي<\/p>\n<p><strong>Allah Almighty will say on the Day of Resurrection: O son of Adam, I was sick but you did not visit Me. He will say: My Lord, how can I visit You when You are the Lord of the worlds? Allah will say: Did you not know that My servant was sick and you did not visit him, and had you visited him you would have found Me with him? O son of Adam, I asked you for food but you did not feed Me. He will say: My Lord, how can I feed You when You are the Lord of the worlds? Allah will say: Did you not know that My servant asked you for food but you did not feed him, and had you fed him you would have found Me with him? O son of Adam, I asked you for drink but you did not provide for Me. He will say: My Lord, how can I give You drink when You are the Lord of the worlds? Allah will say: My servant asked you for a drink but you did not provide for him, and had you given it to him you would have found Me with him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2569, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/sadaqah-did-not-visit-me\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 2<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said: Allah Almighty said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ أَنْفِقْ يَا ابْنَ آدَمَ أُنْفِقْ عَلَيْك<\/p>\n<p><strong>Spend in charity, O son of Adam, and I shall spend on you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5352, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/07\/22\/spend-o-son-of-adam\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَمِينُ اللَّهِ مَلْأَى لَا يَغِيضُهَا سَحَّاءُ اللَّيْلَ وَالنَّهَارَ أَرَأَيْتُمْ مَا أَنْفَقَ مُذْ خَلَقَ السَّمَاءَ وَالْأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَمِينِهِ<\/p>\n<p><strong>The hand of Allah is full and it is not diminished by continuous spending night and day. Do you not see that He has been spending since the creation of the heavens and the earth, and it has not decreased anything in His hand?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7411, Grade: <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/01\/14\/tawhid-dominion-spending\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 3<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> لَمَّا قَضَى اللَّهُ الْخَلْقَ كَتَبَ فِي كِتَابِهِ فَهُوَ عِنْدَهُ فَوْقَ الْعَرْشِ إِنَّ رَحْمَتِي غَلَبَتْ غَضَبِي<\/p>\n<p><strong>When Allah completed the creation, He wrote in His book with Him upon the Throne: Verily, My mercy prevails over My wrath.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3194, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/08\/allah-rahmah-prevails-wrath\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 4<\/strong><\/p>\n<p>Abu Sa&#8217;id al-Khudri reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ يَقُولُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ فِي يَدَيْكَ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ وَمَا لَنَا لَا نَرْضَى يَا رَبِّ وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ فَيَقُولُ أَلَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ فَيَقُولُونَ يَا رَبِّ وَأَيُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ فَيَقُولُ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلَا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا<\/p>\n<p><b>Verily, Allah will say to the people of Paradise: O people of Paradise! They will say: We are at Your service, our Lord, all goodness is in Your hand! Allah will say: Are you satisfied? They will say: Why would we not be satisfied when You have given us what You have not given to any other creation? Allah will say: Shall I not give you something better than all of that? They will say: O Lord, what could be better than that? Allah will say: I will grant you My pleasure, such that I will never be displeased with you ever again<\/b>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7518, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/jannah-ultimate-reward\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 5<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ أَعْدَدْتُ لِعِبَادِي الصَّالِحِينَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ<\/p>\n<p><strong>Allah said: I have prepared for My righteous servants what no eye has seen, what no ear has heard, and what no heart has perceived.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3244, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/07\/20\/greatness-of-paradise-cannot-be-understood\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 6<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ تَعَالَى أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا ذَكَرَنِي فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلَإٍ ذَكَرْتُهُ فِي مَلَإٍ خَيْرٍ مِنْهُمْ وَإِنْ تَقَرَّبَ إِلَيَّ بِشِبْرٍ تَقَرَّبْتُ إِلَيْهِ ذِرَاعًا وَإِنْ تَقَرَّبَ إِلَيَّ ذِرَاعًا تَقَرَّبْتُ إِلَيْهِ بَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً<\/p>\n<p><strong>Allah Almighty says: I am as My servant expects of Me and I am with him as he remembers Me. If he remembers Me in himself, I will remember him in Myself. If he mentions Me in a gathering, I will mention him in a greater gathering. When he draws near Me by the span of his hand, I draw near him by the length of a cubit. When he draws near Me by the length of a cubit, I draw near him by the length of a fathom. When he comes to Me walking, I come to him running<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7405, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/07\/good-thoughts-about-allah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ إِنْ ظَنَّ بِي خَيْرًا فَلَهُ وَإِنْ ظَنَّ شَرًّا فَلَهُ<\/p>\n<p><strong>Allah Almighty says: I am as My servants expects of Me. If he thinks good of Me, he will have it. If he thinks evil of Me, he will have it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 639, Grade: <strong><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/28\/good-thoughts-allah\/\">Sahih<\/a><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 7<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كَانَ رَجُلَانِ فِي بَنِي إِسْرَائِيلَ مُتَوَاخِيَيْنِ فَكَانَ أَحَدُهُمَا يُذْنِبُ وَالْآخَرُ مُجْتَهِدٌ فِي الْعِبَادَةِ فَكَانَ لَا يَزَالُ الْمُجْتَهِدُ يَرَى الْآخَرَ عَلَى الذَّنْبِ فَيَقُولُ أَقْصِرْ فَوَجَدَهُ يَوْمًا عَلَى ذَنْبٍ فَقَالَ لَهُ أَقْصِرْ فَقَالَ خَلِّنِي وَرَبِّي أَبُعِثْتَ عَلَيَّ رَقِيبًا فَقَالَ وَاللَّهِ لَا يَغْفِرُ اللَّهُ لَكَ أَوْ لَا يُدْخِلُكَ اللَّهُ الْجَنَّةَ فَقَبَضَ أَرْوَاحَهُمَا فَاجْتَمَعَا عِنْدَ رَبِّ الْعَالَمِينَ فَقَالَ لِهَذَا الْمُجْتَهِدِ أَكُنْتَ بِي عَالِمًا أَوْ كُنْتَ عَلَى مَا فِي يَدِي قَادِرًا وَقَالَ لِلْمُذْنِبِ اذْهَبْ فَادْخُلْ الْجَنَّةَ بِرَحْمَتِي وَقَالَ لِلْآخَرِ اذْهَبُوا بِهِ إِلَى النَّارِ<\/p>\n<p><strong>Two men among the children of Israel were the opposite of each other. One of them was a sinner and the other would strive in worship. The worshiper would see the sinner and tell him to stop. One day he found him sinning so he said: Stop! The sinner said: Leave me alone, by my Lord, have you been sent to watch over me? The worshiper said: By Allah, Allah will not forgive you or admit you into Paradise! Later their souls were taken and they met in the presence of the Lord of the worlds. Allah said to the worshiper: Did you have knowledge of Me or power over what is in My hand? Allah said to the sinner: Enter Paradise by My mercy. And Allah said to the worshiper: Take him to the Hellfire<\/strong>.<\/p><\/blockquote>\n<p>Abu Huraira said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ لَتَكَلَّمَ بِكَلِمَةٍ أَوْبَقَتْ دُنْيَاهُ وَآخِرَتَهُ<\/p>\n<p>By the One in whose hand is my soul, he spoke a word which ruined him in this world and the Hereafter.<\/p>\n<p>Source: Sunan Abī Dāwūd 4901, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/06\/humble-sinner-arrogant-worshiper\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 8<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> تُفْتَحُ أَبْوَابُ الْجَنَّةِ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ فَيُغْفَرُ لِكُلِّ عَبْدٍ لَا يُشْرِكُ بِاللَّهِ شَيْئًا إِلَّا رَجُلًا كَانَتْ بَيْنَهُ وَبَيْنَ أَخِيهِ شَحْنَاءُ فَيُقَالُ أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا أَنْظِرُوا هَذَيْنِ حَتَّى يَصْطَلِحَا<\/p>\n<p><strong>The gates of Paradise are opened on Monday and Thursday. Allah forgives every servant who does not associate anything with Him, except a man with enmity between himself and his brother. It will be said: Delay these two until they reconcile, delay these two until they reconcile.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2565, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/no-jannah-until-islah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 9<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَيْنَ الْمُتَحَابُّونَ بِجَلَالِي الْيَوْمَ أُظِلُّهُمْ فِي ظِلِّي يَوْمَ لَا ظِلَّ إِلَّا ظِلِّي<\/p>\n<p><strong>Verily, Allah will say on the Day of Resurrection: Where are those who love each other for the sake of My glory? Today, I will shelter them in My shade on a day when there is no shade but Mine.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2566, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/love-each-other-shade-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 10<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَإِلَى مَا أَعَدَّ اللَّهُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهِ قَالَ فَوَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ ارْجِعْ إِلَيْهَا فَانْظُرْ إِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ اذْهَبْ إِلَى النَّارِ فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ إِلَيْهَا فَرَجَعَ إِلَيْهَا فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَنْجُوَ مِنْهَا أَحَدٌ إِلَّا دَخَلَهَا<\/p>\n<p><strong>When Allah created Paradise and Hellfire, He sent Gabriel to Paradise saying: Behold it and what I have prepared therein for its people. Gabriel came and looked at it and what Allah had prepared therein for its people, then he returned to Allah and he said: By Your might, no one will hear of it but that he will enter it. Allah ordered that it be surrounded by adversity and He said: Return to it and behold what I have prepared therein for its people. Gabriel returned and found that it was surrounded by hardship, then he returned to Allah and he said: By Your might, I fear that no one will enter it. Allah said: Go to the Hellfire and behold it and what I have prepared therein for its people. Gabriel found that it was in layers, one above another, then he returned to Allah and he said: By Your might, no one who hears of it will enter it. Allah ordered that it be surrounded by desires and He said: Return to it. Gabriel returned and he said: By Your might, I fear that no one will escape it.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2560, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/23\/jibreel-fears-hellfire-hereafter\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 11<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَذْنَبَ عَبْدٌ ذَنْبًا فَقَالَ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ رَبِّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى عَبْدِي أَذْنَبَ ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ ثُمَّ عَادَ فَأَذْنَبَ فَقَالَ أَيْ رَبِّ اغْفِرْ لِي ذَنْبِي فَقَالَ تَبَارَكَ وَتَعَالَى أَذْنَبَ عَبْدِي ذَنْبًا فَعَلِمَ أَنَّ لَهُ رَبًّا يَغْفِرُ الذَّنْبَ وَيَأْخُذُ بِالذَّنْبِ اعْمَلْ مَا شِئْتَ فَقَدْ غَفَرْتُ لَكَ<\/p>\n<p><strong>A servant committed a sin and he said: O Allah, forgive my sin! Allah Almighty said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable. Then the servant returned to his sin and he said: O Allah, forgive my sin! Allah said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable. Then the servant returned to his sin and he said: O Allah, forgive my sin! Allah said: My servant has committed a sin and he knows he has a Lord who forgives sins and holds him accountable, so do what you will for I have forgiven you.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7507, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/14\/tawbah-allah-continues-forgive\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 12<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَسْرَفَ رَجُلٌ عَلَى نَفْسِهِ فَلَمَّا حَضَرَهُ الْمَوْتُ أَوْصَى بَنِيهِ فَقَالَ إِذَا أَنَا مُتُّ فَأَحْرِقُونِي ثُمَّ اسْحَقُونِي ثُمَّ اذْرُونِي فِي الرِّيحِ فِي الْبَحْرِ فَوَاللَّهِ لَئِنْ قَدَرَ عَلَىَّ رَبِّي لَيُعَذِّبُنِي عَذَابًا مَا عَذَّبَهُ بِهِ أَحَدًا قَالَ فَفَعَلُوا ذَلِكَ بِهِ فَقَالَ لِلأَرْضِ أَدِّي مَا أَخَذْتِ فَإِذَا هُوَ قَائِمٌ فَقَالَ لَهُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ فَقَالَ خَشْيَتُكَ يَا رَبِّ أَوْ قَالَ مَخَافَتُكَ فَغَفَرَ لَهُ بِذَلِكَ<\/p>\n<p><strong>A man had indulged himself in sin. When death approached, he enjoined his sons, saying: When I die you should burn me, pulverize me, and scatter me to the winds over the sea. By Allah, if Allah is capable, He will punish me in such a way as He has not punished anyone else.<\/strong> <strong>They did that to him and when he stood before his Lord, Allah said to him: What made you do what you did? The man said: Fear and awe of You, O Lord. Thus, Allah forgave him due to that.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3481, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/01\/man-cremated-himself-fear-allah\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>Ibn al-Qayyim commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَمَعَ هَذَا فَقَدْ غَفَرَ اللَّهُ لَهُ وَرَحِمَهُ لِجَهْلِهِ إِذْ كَانَ ذَلِكَ الَّذِي فَعَلَهُ مَبْلَغَ عِلْمِهِ وَلَمْ يَجْحَدْ قُدْرَةَ اللَّهِ عَلَى إِعَادَتِهِ عِنَادًا أَوْ تَكْذِيبًا<\/p>\n<p>Despite this error in belief, Allah forgave the man and had mercy upon him because of his ignorance. The knowledge about the providence of Allah that had reached him was not denied out of stubbornness or an intention to lie.<\/p>\n<p>Source: Madārij al-Sālikīn 1\/348<\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 13<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَنْزِلُ رَبُّنَا كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ وَمَنْ يَسْأَلُنِي فَأُعْطِيَهُ وَمَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ<\/p>\n<p><strong>Our Lord Almighty descends to the lowest heaven in the last third of every night, saying: Who is calling upon Me that I may answer him? Who is asking from Me that I may give him? Who is seeking My forgiveness that I may forgive him?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1145, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/24\/allah-descends-last-third-night\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 14<\/strong><\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ عَزَّ وَجَلَّ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَأَزِيدُ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَجَزَاؤُهُ سَيِّئَةٌ مِثْلُهَا أَوْ أَغْفِرُ وَمَنْ تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا وَمَنْ تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَمَنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً وَمَنْ لَقِيَنِي بِقُرَابِ الْأَرْضِ خَطِيئَةً لَا يُشْرِكُ بِي شَيْئًا لَقِيتُهُ بِمِثْلِهَا مَغْفِرَةً<\/p>\n<p><strong>Allah Almighty says: Whoever comes with a good deed will have the reward of ten like it and even more. Whoever comes with an evil deed will be recompensed for one evil deed like it or he will be forgiven. Whoever draws close to Me by the length of a hand, I will draw close to him by the length of an arm. Whoever draws close to Me the by length of an arm, I will draw close to him by the length of a fathom. Whoever comes to Me walking, I will come to him running. Whoever meets Me with enough sins to fill the earth, not associating any partners with Me, I will meet him with as much forgiveness.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2687, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/06\/01\/if-he-comes-walking-i-come-running\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 15<\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَالَ إِذَا ابْتَلَيْتُ عَبْدِي بِحَبِيبَتَيْهِ فَصَبَرَ عَوَّضْتُهُ مِنْهُمَا الْجَنَّةَ<\/p>\n<p><strong>Allah said: If I afflict My servant in his two dear eyes and he remains patient, he will be compensated for them with Paradise.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5653, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/13\/lose-eyes-sabr-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 16<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ تَعَالَى مَا لِعَبْدِي الْمُؤْمِنِ عِنْدِي جَزَاءٌ إِذَا قَبَضْتُ صَفِيَّهُ مِنْ أَهْلِ الدُّنْيَا ثُمَّ احْتَسَبَهُ إِلَّا الْجَنَّةُ<\/p>\n<p><strong>Allah Almighty says: I have nothing to give to My faithful servant except Paradise if I cause his dear friend to die and he remains patient.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6424, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/16\/sabr-mawt-leads-to-jannah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 17<\/strong><\/p>\n<p>Abu Umamah reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَقُولُ اللَّهُ سُبْحَانَهُ ابْنَ آدَمَ إِنْ صَبَرْتَ وَاحْتَسَبْتَ عِنْدَ الصَّدْمَةِ الْأُولَى لَمْ أَرْضَ لَكَ ثَوَابًا دُونَ الْجَنَّةِ<\/p>\n<p><strong>Allah Almighty says: O son of Adam, if you are patient and restrained at the first shock of calamity, I would not be pleased with any reward for you less than Paradise.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 1597, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/01\/22\/patience-first-strike-paradise\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 18<\/strong><\/p>\n<p>Abu Musa al-Ashari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا مَاتَ وَلَدُ الْعَبْدِ قَالَ اللَّهُ لِمَلَائِكَتِهِ قَبَضْتُمْ وَلَدَ عَبْدِي فَيَقُولُونَ نَعَمْ فَيَقُولُ قَبَضْتُمْ ثَمَرَةَ فُؤَادِهِ فَيَقُولُونَ نَعَمْ فَيَقُولُ مَاذَا قَالَ عَبْدِي فَيَقُولُونَ حَمِدَكَ وَاسْتَرْجَعَ فَيَقُولُ اللَّهُ ابْنُوا لِعَبْدِي بَيْتًا فِي الْجَنَّةِ وَسَمُّوهُ بَيْتَ الْحَمْدِ<\/p>\n<p><strong>When the child of a servant dies, Allah says to the angels: Have you taken the life of My servant’s child? They say yes. Allah says: Have you taken the fruit of his heart? They say yes. Allah says: What has My servant said? They say: He has praised You and said to Allah we belong and to Allah we return. Allah says: Build a house for My servant in Paradise and name it the House of Praise.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1021, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/07\/24\/build-for-him-bayt-al-hamd\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 19<\/strong><\/p>\n<p>Jundab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنَّ رَجُلاً قَالَ وَاللَّهِ لاَ يَغْفِرُ اللَّهُ لِفُلاَنٍ وَإِنَّ اللَّهَ تَعَالَى قَالَ مَنْ ذَا الَّذِي يَتَأَلَّى عَلَىَّ أَنْ لاَ أَغْفِرَ لِفُلاَنٍ فَإِنِّي قَدْ غَفَرْتُ لِفُلاَنٍ وَأَحْبَطْتُ عَمَلَكَ<\/p>\n<p><strong>A man said: By Allah, Allah will not forgive this person! Allah Almighty said: Who is he who swore by Me that I will not forgive someone? I have forgiven him and erased your good deeds.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2621, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/05\/07\/never-say-allah-not-forgive\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 20<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ إِنَّ الْمُؤْمِنَ عِنْدِي بِمَنْزِلَةِ كُلِّ خَيْرٍ يَحْمَدُنِي وَأَنَا أَنْزِعُ نَفْسَهُ مِنْ بَيْنِ جَنْبَيْهِ<\/p>\n<p><strong>Allah Almighty said: Verily, the believer is always in a good position with Me. He praises Me even as I remove his soul within himself.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 8492, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/27\/believers-praise-allah-everything\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 21<\/strong><\/p>\n<p>Abu Mas’ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فَلَمْ يُوجَدْ لَهُ مِنْ الْخَيْرِ شَيْءٌ إِلَّا أَنَّهُ كَانَ يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنْ الْمُعْسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ نَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ تَجَاوَزُوا عَنْهُ<\/p>\n<p><strong>A man among those before you was called to account in the Hereafter. Nothing good was found with him but that he was lenient in his dealings with people, and he would order his servant to relieve the debts of those in hardship. Allah Almighty said: We are more worthy of such actions, so overlook his sins.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1561, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/14\/easy-going-business\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 22<\/strong><\/p>\n<p>Hudhayfah reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَلَقَّتْ الْمَلَائِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ فَقَالُوا أَعَمِلْتَ مِنْ الْخَيْرِ شَيْئًا قَالَ لَا قَالُوا تَذَكَّرْ قَالَ كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ وَيَتَجَوَّزُوا عَنْ الْمُوسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ تَجَوَّزُوا عَنْهُ<\/p>\n<p><strong>The angels received the soul of a man who lived before you. They said: Have you done anything good? The man said no. They said: Try to remember. The man said: I used to give loans and I would order my servants to give respite to those in difficulty, and to overlook the faults of those in ease. Allah Almighty said: Overlook his faults.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2077, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2015\/01\/13\/debt-forgiveness\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 23<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, visited a man who was sick and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبْشِرْ فَإِنَّ اللَّهَ يَقُولُ هِيَ نَارِي أُسَلِّطُهَا عَلَى عَبْدِي الْمُذْنِبِ لِتَكُونَ حَظَّهُ مِنْ النَّارِ<\/p>\n<p><strong>Be glad, for Allah has said: It is My fire that I afflict upon my sinful servant as his share in place of Hellfire.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2088, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/05\/11\/sickness-fire-expiate-sins\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 24<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ تَعَالَى يَقُولُ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلَأْ صَدْرَكَ غِنًى وَأَسُدَّ فَقْرَكَ وَإِلَّا تَفْعَلْ مَلَأْتُ يَدَيْكَ شُغْلًا وَلَمْ أَسُدَّ فَقْرَكَ<\/p>\n<p><strong>Allah Almighty said: O son of Adam, use your free time to worship Me and I will fill your heart with riches and alleviate your poverty, otherwise I will fill your life with troubles and never relieve your poverty.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2466, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/28\/busy-yourself-ibadah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 25<\/strong><\/p>\n<p>Mu’adh ibn Jabal reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ الْمُتَحَابُّونَ فِي جَلَالِي لَهُمْ مَنَابِرُ مِنْ نُورٍ يَغْبِطُهُمْ النَّبِيُّونَ وَالشُّهَدَاءُ<\/p>\n<p><strong>Allah Almighty said: Those who love each other for the sake of My glory will be upon pulpits of light, admired by the prophets and the martyrs.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2390, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/admired-prophets-martyrs\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ وَجَبَتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَالْمُتَجَالِسِينَ فِيَّ وَالْمُتَزَاوِرِينَ فِيَّ وَالْمُتَبَاذِلِينَ فِيَّ<\/p>\n<p><strong>Allah Almighty said: My love is assured for those who love each other for My sake, who sit together for My sake, who visit each other for My sake, and who spend on each other for My sake.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 22030, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/02\/23\/love-allah-assured-each-other\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 26<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوَّلَ مَا يُسْأَلُ عَنْهُ يَوْمَ الْقِيَامَةِ يَعْنِي الْعَبْدَ مِنْ النَّعِيمِ أَنْ يُقَالَ لَهُ أَلَمْ نُصِحَّ لَكَ جِسْمَكَ وَنُرْوِيَكَ مِنْ الْمَاءِ الْبَارِدِ<\/p>\n<p><strong>Verily, the first thing a servant will be asked about on the Day of Resurrection will be his blessings. It will be said to him: Have We not given you health in your body and nourished you with cool water to drink?<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3358, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/06\/16\/first-asked-blessings\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 27<\/strong><\/p>\n<p>Suhayb reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ قَالَ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى تُرِيدُونَ شَيْئًا أَزِيدُكُمْ فَيَقُولُونَ أَلَمْ تُبَيِّضْ وُجُوهَنَا أَلَمْ تُدْخِلْنَا الْجَنَّةَ وَتُنَجِّنَا مِنْ النَّارِ قَالَ فَيَكْشِفُ الْحِجَابَ فَمَا أُعْطُوا شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْ النَّظَرِ إِلَى رَبِّهِمْ عَزَّ وَجَلَّ<\/p>\n<p><strong>When the people of Paradise enter it, Allah Almighty will say: Would you like anything more? They will say: Have You not brightened our faces? Have You not admitted us into Paradise and saved us from Hellfire? Then, Allah will lift the veil and nothing they are given will be more beloved to them than looking at their Lord Almighty.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ<\/p>\n<p><strong>For those who do good is more.<\/strong> (10:26)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 181, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/jannah-reward-countenance-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 28<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ عَزَّ وَجَلَّ وَمَنْ أَظْلَمُ مِمَّنْ ذَهَبَ يَخْلُقُ كَخَلْقِي فَلْيَخْلُقُوا ذَرَّةً أَوْ لِيَخْلُقُوا حَبَّةً أَوْ شَعِيرَةً<\/p>\n<p><strong>Allah Almighty said: Who is more unjust than one who considers his creation as My creation? Let him create the smallest ant, or let him create a grain of wheat or barely.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7559, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/01\/06\/haram-create-images-idols\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 29<\/strong><\/p>\n<p>Aisha reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مِنْ يَوْمٍ أَكْثَرَ مِنْ أَنْ يُعْتِقَ اللَّهُ فِيهِ عَبْدًا مِنْ النَّارِ مِنْ يَوْمِ عَرَفَةَ وَإِنَّهُ لَيَدْنُو ثُمَّ يُبَاهِي بِهِمْ الْمَلَائِكَةَ فَيَقُولُ مَا أَرَادَ هَؤُلَاءِ<\/p>\n<p><strong>There is no day upon which Allah frees more of His servants from the Hellfire than the day of Arafat. He draws near and then He boasts of them to the angels, saying: What do these servants want?<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1348, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/24\/allah-frees-servants-arafah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 30<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, came to his companions while they were laughing and talking. The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالَّذِي نَفْسِي بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلاً وَلَبَكَيْتُمْ كَثِيرًا<\/p>\n<p><strong>By the One in whose hand is my soul, if you knew what I knew, you would laugh little and weep often<\/strong>.<\/p><\/blockquote>\n<p>The Prophet departed and people started weeping, so Allah Almighty revealed to him:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا مُحَمَّدُ لِمَ تُقَنِّطُ عِبَادِي<\/p>\n<p><strong>O Muhammad, why have you made My servants despair?<\/strong><\/p><\/blockquote>\n<p>The Prophet returned and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَبْشِرُوا وَسَدِّدُوا وَقَارِبُوا<\/p>\n<p><strong>Give glad tidings, follow the right course, and seek nearness to Allah<\/strong>.<\/p>\n<p>Source: al-Adab al-Mufrad lil-Bukhārī 254, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/15\/why-servants-despair\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 31<\/strong><\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يُدْنَى الْمُؤْمِنُ يَوْمَ الْقِيَامَةِ مِنْ رَبِّهِ عَزَّ وَجَلَّ حَتَّى يَضَعَ عَلَيْهِ كَنَفَهُ فَيُقَرِّرُهُ بِذُنُوبِهِ فَيَقُولُ هَلْ تَعْرِفُ فَيَقُولُ أَيْ رَبِّ أَعْرِفُ قَالَ فَإِنِّي قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَإِنِّي أَغْفِرُهَا لَكَ الْيَوْمَ فَيُعْطَى صَحِيفَةَ حَسَنَاتِهِ وَأَمَّا الْكُفَّارُ وَالْمُنَافِقُونَ فَيُنَادَى بِهِمْ عَلَى رُءُوسِ الْخَلَائِقِ هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى اللَّهِ<\/p>\n<p><strong>A believer will be brought to his Almighty Lord on the Day of Resurrection until He places His veil over him and makes him confess to his sins, saying: Do you acknowledge your sins? The believer will say: My Lord, I do acknowledge them. Allah will say: I concealed them for you in the world and today I forgive you for them. Then, he will be given the record of his good deeds. As for the unbelievers and hypocrites, there will be an announcement before all creation declaring that these people had lied about Allah.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2768, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/05\/believers-intimate-conversations-allah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 32<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوَّلَ النَّاسِ يُقْضَى يَوْمَ الْقِيَامَةِ عَلَيْهِ رَجُلٌ اسْتُشْهِدَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ قَالَ كَذَبْتَ وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ جَرِيءٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ تَعَلَّمْتُ الْعِلْمَ وَعَلَّمْتُهُ وَقَرَأْتُ فِيكَ الْقُرْآنَ قَالَ كَذَبْتَ وَلَكِنَّكَ تَعَلَّمْتَ الْعِلْمَ لِيُقَالَ عَالِمٌ وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ هُوَ قَارِئٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ وَرَجُلٌ وَسَّعَ اللَّهُ عَلَيْهِ وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ قَالَ كَذَبْتَ وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ هُوَ جَوَادٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ ثُمَّ أُلْقِيَ فِي النَّارِ<\/p>\n<p><strong>Verily, the first people to be judged on the Day of Resurrection will be a man who was martyred. He will be brought, the blessings of Allah will be made known, and he will acknowledge them. Allah will say: What did you do with them? The man will say: I fought in Your cause until I was martyred. Allah will say: You have lied, for you fought only that it would be said you were brave, thus it was said. Then, Allah will order him to be dragged upon his face until he is cast into Hellfire. Another man studied religious knowledge, taught others, and recited the Quran. He will be brought, the blessings of Allah will be made known, and he will acknowledge them. Allah will say: What did you do with them? The man will say: I learned religious knowledge, taught others, and I recited the Quran for Your sake. Allah will say: You have lied, for you studied only that it would be said you are a scholar and you recited the Quran only that it would be said you are a reciter, thus it was said. Then, Allah will order him to be dragged upon his face until he is cast into Hellfire. Another man was given an abundance of blessings from Allah and every kind of wealth. He will be brought, the blessings of Allah will be made known, and he will acknowledge them. Allah will say: What did you do with them? The man will say: I did not leave any good cause beloved to You but that I spent on it for Your sake. Allah will say: You have lied, for you spent only that it would be said you are generous, thus it was said. Then, Allah will order him to be dragged upon his face until he is cast into Hellfire.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1905, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/14\/allah-exposes-nifaq-yawm-al-qiyamah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 33<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَوَّلَ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ مِنْ عَمَلِهِ صَلَاتُهُ فَإِنْ صَلُحَتْ فَقَدْ أَفْلَحَ وَأَنْجَحَ وَإِنْ فَسَدَتْ فَقَدْ خَابَ وَخَسِرَ فَإِنْ انْتَقَصَ مِنْ فَرِيضَتِهِ شَيْءٌ قَالَ الرَّبُّ عَزَّ وَجَلَّ انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَيُكَمَّلَ بِهَا مَا انْتَقَصَ مِنْ الْفَرِيضَةِ ثُمَّ يَكُونُ سَائِرُ عَمَلِهِ عَلَى ذَلِكَ<\/p>\n<p><strong>The first action for which a servant of Allah will be held accountable on the Day of Resurrection will be his prayers. If they are in order, he will have prospered and succeeded. If they are lacking, he will have failed and lost. If there is something defective in his obligatory prayers, then the Almighty Lord will say: See if My servant has any voluntary prayers that can complete what is insufficient in his obligatory prayers. The rest of his deeds will be judged the same way.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 413, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/11\/first-deed-judged-salat\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 34<\/strong><\/p>\n<p>Abu Huraira reported: The Prophet, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَعَالَى قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ الْعَبْدُ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ  قَالَ اللَّهُ تَعَالَى حَمِدَنِي عَبْدِي وَإِذَا قَالَ الرَّحْمَنِ الرَّحِيمِ قَالَ اللَّهُ تَعَالَى أَثْنَى عَلَيَّ عَبْدِي وَإِذَا قَالَ مَالِكِ يَوْمِ الدِّينِ قَالَ مَجَّدَنِي عَبْدِي وَقَالَ مَرَّةً فَوَّضَ إِلَيَّ عَبْدِي فَإِذَا قَالَ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ قَالَ هَذَا بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ فَإِذَا قَالَ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ  قَالَ هَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ<\/p>\n<p><strong>Allah Almighty said: I have divided prayer between Myself and My servant into two halves, and My servant shall have what he has asked for. When the servant says, ‘All praise is due to Allah the Lord of the worlds,’ Allah says: My servant has praised Me. When he says, ‘The Gracious, the Merciful,’ Allah says: My servant has exalted Me. When he says, ‘The Master of the Day of Judgment,’ Allah says: My servant has glorified Me and my servant has submitted to Me. When he says, ‘You alone we worship, You alone we ask for help,’ Allah says: This is between Me and My servant, and My servant will have what he has asked for. When he says, ‘Guide us to the straight path, the path of those whom you have favored, not those who went astray,’ Allah says: This is for My servant, and My servant will have what he has asked for.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 395, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/10\/surat-al-fatihah-allah-responds\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 35<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ مَنْ عَمِلَ عَمَلًا أَشْرَكَ فِيهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ<\/p>\n<p><strong>Allah Almighty said: Verily, I am free of the idolatry of any partners. Whoever performs a deed in which he associates another with Me, I will abandon him to his partner.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2985, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/18\/shirk-abandon-mushrikin-idols\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 36<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ خَلَقَ الْخَلْقَ حَتَّى إِذَا فَرَغَ مِنْهُمْ قَامَتْ الرَّحِمُ فَقَالَتْ هَذَا مَقَامُ الْعَائِذِ مِنْ الْقَطِيعَةِ قَالَ نَعَمْ أَمَا تَرْضَيْنَ أَنْ أَصِلَ مَنْ وَصَلَكِ وَأَقْطَعَ مَنْ قَطَعَكِ قَالَتْ بَلَى قَالَ فَذَاكِ لَكِ<\/p>\n<p><strong>Verily, Allah made the creation and when He finished, the womb said: In this place, I seek refuge in you from those who sever me. Allah said: Are you not pleased that I keep good relations with those who are good to you and I will cut off whoever severs relations with you? The womb said: Yes, my Lord. Allah said: Thus, you will have it<\/strong>.<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اقْرَءُوا إِنْ شِئْتُمْ فَهَلْ عَسَيْتُمْ إِنْ تَوَلَّيْتُمْ أَنْ تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَ<\/p>\n<p><strong>Recite the verse if you wish: Will you then, if you were given authority, spread corruption in the land and sever your family ties<\/strong>? (47:22)<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 5987, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/17\/spread-fasad-cut-rahim\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p style=\"text-align: left;\"><strong>Hadith 37<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلاَّ الصِّيَامَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ‏ وَالصِّيَامُ جُنَّةٌ وَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلاَ يَرْفُثْ وَلاَ يَصْخَبْ فَإِنْ سَابَّهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا إِذَا أَفْطَرَ فَرِحَ وَإِذَا لَقِيَ رَبَّهُ فَرِحَ بِصَوْمِهِ<\/p>\n<p><strong>Allah Almighty said, ‘Every deed of the son of Adam is for him, except for fasting. It is for Me and I will reward it.’ Fasting is a shield, so when one of you fasts, he may not be obscene or boisterous. If someone insults him or fights him, let him say: Indeed, I am fasting. By the One in whose hand is the soul of Muhammad, the breath coming from the mouth of a fasting person is more pleasant to Allah than the scent of musk. The fasting person has two moments of relief he enjoys: when he breaks his fast he is joyful, and when he meets his Lord he is joyful for his fasting.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1904, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/07\/many-virtues-fasting-shield-musk\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p><span style=\"font-size: 15px;\">—<\/span><\/p>\n<p><strong>Hadith 38<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَحَاجَّتْ الْجَنَّةُ وَالنَّارُ فَقَالَتْ النَّارُ أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ وَقَالَتْ الْجَنَّةُ مَا لِي لَا يَدْخُلُنِي إِلَّا ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَقَالَ لِلنَّارِ إِنَّمَا أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْهُمَا مِلْؤُهَا فَأَمَّا النَّارُ فَلَا تَمْتَلِئُ حَتَّى يَضَعَ رِجْلَهُ فَتَقُولُ قَطْ قَطْ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ وَلَا يَظْلِمُ اللَّهُ عَزَّ وَجَلَّ مِنْ خَلْقِهِ أَحَدًا وَأَمَّا الْجَنَّةُ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُنْشِئُ لَهَا خَلْقًا<\/p>\n<p><strong>The Hellfire and Paradise disputed each other. Hellfire said: The arrogant and the tyrants will dwell in me. Paradise said: What is the matter with me that only the meek and humble of the people will enter me? Allah said to Paradise: You are My mercy with which I show mercy to those of My servants whom I will. Allah said to Hellfire: You are My punishment with which I punish those of My servants whom I will, and both of you will be full. As for Hellfire, it will not be filled until Allah puts His foot over it and Hellfire will say: Enough! Enough! All of its parts will be filled together and Allah will not wrong any of His creatures. As for Paradise, Allah will create a new creation with which to fill it<\/strong>.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 4850, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/jannah-rahmah-nar-adhab\/\">Muttafaqun Alayhi<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 39<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">سَأَلَ مُوسَى رَبَّهُ عَنْ سِتِّ خِصَالٍ كَانَ يَظُنُّ أَنَّهَا لَهُ خَالِصَةً وَالسَّابِعَةُ لَمْ يَكُنْ مُوسَى يُحِبُّهَا قَالَ يَا رَبِّ أَيُّ عِبَادِكَ أَتْقَى قَالَ الَّذِي يَذْكُرُ وَلا يَنْسَى قَالَ فَأَيُّ عِبَادِكَ أَهْدَى قَالَ الَّذِي يَتْبَعُ الْهُدَى قَالَ فَأَيُّ عِبَادِكَ أَحْكُمُ قَالَ الَّذِي يَحْكُمُ لِلنَّاسِ كَمَا يَحْكُمُ لِنَفْسِهِ قَالَ فَأَيُّ عِبَادِكَ أَعْلَمُ قَالَ عَالِمٌ لا يَشْبَعُ مِنَ الْعِلْمِ يَجْمَعُ عِلْمَ النَّاسِ إِِلَى عِلْمِهِ قَالَ فَأَيُّ عِبَادِكَ أَعَزُّ قَالَ الَّذِي إِِذَا قَدَرَ غَفَرَ قَالَ فَأَيُّ عِبَادِكَ أَغْنَى قَالَ الَّذِي يَرْضَى بِمَا يُؤْتَى قَالَ فَأَيُّ عِبَادِكَ أَفْقَرُ قَالَ صَاحِبٌ مَنْقُوصٌ<\/p>\n<p><strong>Moses asked his Lord about six traits he thought he had, but the seventh he did not like. Moses said: O Lord, who is the most Godfearing of Your servants? Allah said: Those who remember and do not forget. Moses said: Who is the most guided of Your servants? Allah said: Those who follow the guidance. Moses said: Who is the best in judgment of Your servants? Allah said: Those who judge people as they would love to be judged themselves. Moses said: Who are the most knowledgeable of Your servants? Allah said: A scholar who is unsatisfied with his knowledge and adds the knowledge of people to his own. Moses said: Who are the most honored of Your servants? Allah said: Those who forgive when they have power over others. Moses said: Who are the richest of Your servants? Allah said: Those who are pleased with what they have. Moses said: Who are the poorest of Your servants? Allah said: Those who desire more than they need.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 6217, Grade: <em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2016\/04\/07\/moses-six-qualities\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 40<\/strong><\/p>\n<p>Abu Sa&#8217;id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الشَّيْطَانَ قَالَ وَعِزَّتِكَ يَا رَبِّ لَا أَبْرَحُ أُغْوِي عِبَادَكَ مَا دَامَتْ أَرْوَاحُهُمْ فِي أَجْسَادِهِمْ قَالَ الرَّبُّ وَعِزَّتِي وَجَلَالِي لَا أَزَالُ أَغْفِرُ لَهُمْ مَا اسْتَغْفَرُونِي<\/p>\n<p><strong>Satan said: By Your might, O Lord, I will continue to mislead the children of Adam, as long as their souls are in their bodies. The Lord said: By My might and majesty, I will continue to forgive them, as long as they seek My forgiveness.<\/strong><\/p>\n<p>Source: Musnad Aḥmad 11367, Grade: <em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/19\/allah-continues\/\">Hasan<\/a><\/em><\/p><\/blockquote>\n<p><em>Success comes from Allah, and Allah knows best<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Spend in charity, O son of Adam, and I shall spend on you.&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":12,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"footnotes":""},"class_list":["post-718","page","type-page","status-publish","hentry"],"aioseo_notices":[],"jetpack_shortlink":"https:\/\/wp.me\/P5YGRL-bA","jetpack-related-posts":[{"id":735,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-nawawi\/","url_meta":{"origin":718,"position":0},"title":"Forty Hadith al-Nawawi","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"Verily, deeds are only with intentions,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":741,"url":"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/","url_meta":{"origin":718,"position":1},"title":"Al-Aqidah al-Tahawiyyah in English and Arabic","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"This is a clear presentation of the creed of Ahl al-Sunnah wal Jamā’ah,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18687,"url":"https:\/\/www.abuaminaelias.com\/al-aqeedah-al-wasitiyyah-by-ibn-taymiyyah\/","url_meta":{"origin":718,"position":2},"title":"Al-Aqidah al-Wasitiyyah by Ibn Taymiyyah","author":"Abu Amina Elias","date":"January 25, 2018","format":false,"excerpt":"\"This is the creed of the saved and victorious group until the establishment of the Hour, Ahl al-Sunnah wal Jamā’ah,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20423,"url":"https:\/\/www.abuaminaelias.com\/al-targhib-wal-tarhib\/","url_meta":{"origin":718,"position":3},"title":"Inspiring Hope and Inciting Fear by Imam al-Mundhiri","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"Al-Targhīb wal-Tarhīb (Inspiring Hope and Inciting Fear) is a book of Hadith collected by Imam al-Mundhirī. It is distinguished because of its inclusion of Hadith besides those found in the Six Books, such as in collections by Imam Ahmad, Al-Tabarani, and Al-Bayhaqi. The following are some select chapters with English…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12884,"url":"https:\/\/www.abuaminaelias.com\/about-me\/","url_meta":{"origin":718,"position":4},"title":"About Me","author":"Abu Amina Elias","date":"February 13, 2013","format":false,"excerpt":"My name is Abu Amina Elias (Justin Parrott). This website is dedicated to spreading the message of Islam according to the Quran, the Sunnah, the way of the righteous predecessors, and the scholars who followed them. Citations are always provided so that others can independently verify the authenticity of the…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":19880,"url":"https:\/\/www.abuaminaelias.com\/the-golden-rule-in-islam-ethics-of-reciprocity-in-islamic-traditions\/","url_meta":{"origin":718,"position":5},"title":"The Golden Rule in Islam: Ethics of Reciprocity in Islamic Traditions","author":"Abu Amina Elias","date":"September 23, 2018","format":false,"excerpt":"In the name of Allah, the Gracious, the Merciful My academic thesis for the University of Wales TSD degree of Master of Research in Islamic Studies was on the topic of the 'golden rule' or ethics of reciprocity in Islam. The work can be summarized as follows: The ethics of…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/718","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=718"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/718\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=718"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}