{"id":735,"date":"2010-12-18T00:19:56","date_gmt":"2010-12-18T05:19:56","guid":{"rendered":"http:\/\/www.faithinallah.org"},"modified":"2023-03-23T18:02:38","modified_gmt":"2023-03-23T14:02:38","slug":"forty-hadith-nawawi","status":"publish","type":"page","link":"https:\/\/www.abuaminaelias.com\/forty-hadith-nawawi\/","title":{"rendered":"Forty Hadith al-Nawawi"},"content":{"rendered":"<p style=\"text-align: left;\"><em>In the name of Allah, the Gracious, the Merciful<\/em><\/p>\n<p>Translated by Abu Amina Elias (Justin Parrott)<\/p>\n<p>The following are the most important prophetic traditions in Islam according to Imam Yaḥyā ibn Sharaf al-Nawawī, including some additional traditions added by Ibn Rajab al-Ḥanbalī, with Arabic and English translation.<\/p>\n<p><a href=\"https:\/\/www.youtube.com\/watch?v=q7888V_QypU&amp;list=PLqqprFrOot2zRmYDqu9fx739VK38mGo9B\">Click here to listen to the Forty Hadith on YouTube<\/a><\/p>\n<p>—<\/p>\n<p style=\"text-align: left;\"><strong>Hadith 1: <\/strong><strong>Deeds are by intentions إنما الأعمال بالنيات<\/strong><\/p>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ<\/p>\n<p style=\"text-align: left;\"><strong>Verily, deeds are only with intentions. Verily, every person will have only what they intended. Whoever emigrated to Allah and his messenger, his emigration is for Allah and his messenger. Whoever emigrated to get something in the world or to marry a woman, his emigration is for that to which he emigrated.<\/strong><\/p>\n<p style=\"text-align: left;\">Source: Ṣaḥīḥ al-Bukhārī 54, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/08\/29\/deeds-intention-niyyah-ikhlaas\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p>\n<\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 2: <\/strong><strong>Islam, faith, and excellence الإسلام والإيمان والإحسان<\/strong><\/p>\n<p>Umar ibn al-Khattab reported: We were sitting with the Messenger of Allah, peace and blessings be upon him, one day when a man appeared with very white clothes and very black hair. There were no signs of travel on him and we did not recognize him. He sat down in front of the Prophet and rested his knees by his knees and placed his hands on his thighs. The man said, “O Muhammad, tell me about Islam.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنْ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا<\/p>\n<p><strong>Islam is to testify there is no God but Allah and Muhammad is the Messenger of Allah, to establish prayer, to give charity, to fast the month of Ramadan, and to perform pilgrimage to the House if a way is possible.<\/strong><\/p><\/blockquote>\n<p>The man said, “You have spoken truthfully.” We were surprised that he asked him and then said he was truthful. He said, “Tell me about faith.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ<\/p>\n<p style=\"text-align: left;\"><strong>Faith is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in providence, its good and its evil.<\/strong><\/p>\n<\/blockquote>\n<p>The man said, “You have spoken truthfully. Tell me about excellence.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ<\/p>\n<p><strong>Excellence is to worship Allah as if you see Him, for if you do not see Him, He surely sees you.<\/strong><\/p><\/blockquote>\n<p>The man said, “Tell me about the final hour.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ<\/p>\n<p><strong>The one asked does not know more than the one asking.<\/strong><\/p><\/blockquote>\n<p>The man said, “Tell me about its signs.” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ<\/p>\n<p><b>The slave girl will give birth to her master and you will see barefoot, naked, and dependent shepherds compete in the construction tall buildings.<\/b><\/p><\/blockquote>\n<p>Then, the man left and I remained. The Prophet said to me:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ<\/p>\n<p><strong>O Umar, do you know who he was?<\/strong><\/p><\/blockquote>\n<p>I said, &#8220;Allah and his messenger know best.&#8221; The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ<\/p>\n<p><strong>Verily, he was Gabriel who came to teach you your religion.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 8, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/25\/jibreel-islam-iman-ihsan\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 3: <\/strong><strong>Pillars of Islam أركان الإسلام<\/strong><\/p>\n<p>Ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ عَلَى أَنْ يُعْبَدَ اللَّهُ وَيُكْفَرَ بِمَا دُونَهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَحَجِّ الْبَيْتِ وَصَوْمِ رَمَضَانَ<\/p>\n<p><strong>Islam is built upon five: to worship Allah and to disbelieve in what is worshiped besides him, to establish prayer, to give charity, to perform Hajj pilgrimage to the house, and to fast the month of Ramadan.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 8, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/17\/five-pillars-of-islam\/\"><em><strong>Muttafaqu<\/strong><\/em><em><strong>n<\/strong><\/em><em><strong> Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 4: <\/strong><strong>Providence القضاء والقدر<\/strong><\/p>\n<p>Abdullah ibn Masud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ فِي ذَلِكَ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ فِي ذَلِكَ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُرْسَلُ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيدٌ فَوَالَّذِي لَا إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا<\/p>\n<p><strong>Verily, the creation of each one of you is brought together in his mother’s womb for forty days as a drop, then he is a clot for a similar period, then a morsel for a similar period, then there is sent to him the angel who blows the spirit into him and he is commanded regarding four matters: to write down his provision, his life span, his deeds, and whether he is blessed or damned. By Allah, other than whom there is no God, one of you acts like the people of Paradise until he is but an arm’s length from it, and what is written overtakes him so he acts like the people of Hellfire and he enters it. Verily, one of you acts like the people of Hellfire until he is but an arm’s length from it, and what is written overtakes him so he acts like the people of Paradise and he enters it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7454, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/divine-decree-womb\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 5: Religious innovation البدعة<\/strong><\/p>\n<p>Aisha reported: The Messenger of Allah, peace be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ فَهُوَ رَدٌّ<\/p>\n<p><strong>Whoever innovates into this matter of ours that which does not belong to it, it will be rejected.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2697, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/15\/innovation-bidah-in-religion\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ<\/p>\n<p><strong><strong>Whoever performs a deed that is not in accordance with our matter will have it rejected<\/strong>.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1718, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 6: <\/strong><strong>Lawful and unlawful are clear الحلال بين والحرام بين<\/strong><\/p>\n<p>Al-Nu&#8217;man ibn Bashir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْحَلَالُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشَبَّهَاتٌ لَا يَعْلَمُهَا كَثِيرٌ مِنْ النَّاسِ فَمَنْ اتَّقَى الْمُشَبَّهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ كَرَاعٍ يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يُوَاقِعَهُ أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلَا إِنَّ حِمَى اللَّهِ فِي أَرْضِهِ مَحَارِمُهُ أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلَا وَهِيَ الْقَلْبُ<\/p>\n<p><strong>Verily, the lawful is clear and the unlawful is clear, and between the two of them are doubtful matters about which many people do not know. Thus, he who avoids doubtful matters clears himself in regard to his religion and his honor, and he who falls into doubtful matters will fall into the unlawful as the shepherd who pastures near a sanctuary, all but grazing therein. Verily, every king has a sanctum and the sanctum of Allah is His prohibitions. Verily, in the body is a piece of flesh which, if sound, the entire body is sound, and if corrupt, the entire body is corrupt. Truly, it is the heart.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 52, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/14\/halal-haram-clear\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اجْعَلُوا بَيْنَكُمْ وَبَيْنَ الْحَرَامِ سُتْرَةً مِنَ الْحَلالِ مَنْ فَعَلَ ذَلِكَ اسْتَبْرَأَ لِعِرْضِهِ وَدِينِهِ وَمَنْ أَرْتَعَ فِيهِ كَانَ كَالْمُرْتِعِ إِلَى جَنْبِ الْحِمَى يُوشِكُ أَنْ يَقَعَ فِيهِ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى وَإِنَّ حِمَى اللَّهِ فِي الأَرْضِ مَحَارِمُهُ<\/p>\n<p><b>Make between yourself and the unlawful a barrier of what is lawful. Whoever does so will clear himself in regard to his honor and his religion. A shepherd who grazes near the side of a sanctum will nearly fall into it. Verily, every king has a sanctum and the sanctum of Allah is His prohibitions<\/b>.<\/p>\n<p>Source: Ṣaḥīḥ Ibn Ḥibbān 5569, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2017\/03\/19\/make-barrier-haram-halal\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 7: Religion is Good Will الدين النصيحة<\/strong><\/p>\n<p>Tamim al-Dari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ الدِّينَ النَّصِيحَةُ<\/p>\n<p><strong>Verily, the religion is sincerity.<\/strong><\/p><\/blockquote>\n<p>We said, &#8220;To whom?&#8221; The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لِلَّهِ وَكِتَابِهِ وَرَسُولِهِ وَأَئِمَّةِ الْمُؤْمِنِينَ وَعَامَّتِهِمْ وَأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ<\/p>\n<p><strong>To Allah, His book, His Messenger, the leaders of the Muslims, and their common people.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 55, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/23\/deen-al-nasihah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 8: <\/strong><strong>Jihad in the way of Allah الجهاد في سبيل الله<\/strong><em><br \/>\n<\/em><\/p>\n<p>Jabir reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوا لَا إِلَهَ إِلَّا اللَّهُ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ<\/p>\n<p><b>I have been commanded to fight the people until they say there is no God but Allah. If they say there is no God but Allah, then they will be granted protection from me for their lives and property, except by right of justice, and their reckoning is with Allah.<\/b><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّمَا أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ<\/p>\n<p><b>Verily, you are only a reminder. You are not over them as a dictator.<\/b> (88:22)<\/p>\n<p>Source: Ṣaḥīḥ Muslim 21, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/12\/28\/jihad-protect-islam\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Taymiyah commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مُرَادُهُ قِتَالُ الْمُحَارِبِينَ الَّذِينَ أَذِنَ اللَّهُ فِي قِتَالِهِمْ لَمْ يُرِدْ قِتَالَ الْمُعَاهَدِينَ الَّذِينَ أَمَرَ اللَّهُ بِوَفَاءِ عَهْدِهِمْ<\/p>\n<p style=\"text-align: left;\">The meaning of this tradition is to fight those who are waging war, whom Allah has called us to fight. It does not mean to fight those who have made peace, with whom Allah has commanded us to fulfill their peace.<\/p>\n<p style=\"text-align: left;\">Source: Majmū’ al-Fatāwá 19\/20<\/p>\n<\/blockquote>\n<p>And Ibn Rajab writes:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَالْمَعْنَى إِنَّمَا عَلَيْكَ تَذْكِيرُهُمْ بِاللَّهِ وَدَعْوَتُهُمْ إِلَيْهِ وَلَسْتَ مُسَلَّطًا عَلَى إِدْخَالِ الْإِيمَانِ فِي قُلُوبِهِمْ قَهْرًا وَلَا مُكَلَّفًا بِذَلِكَ<\/p>\n<p>The meaning is that your duty is only to remind them about Allah and to preach to them. You do not have authority to insert faith into their hearts by force; you are not responsible for that.<\/p>\n<p>Source: Jāmi&#8217; al-&#8216;Ulūm wal-Ḥikam 1\/236<\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 9: <\/strong><strong>Responsibility within one&#8217;s capacity التكليف بما يستطاع<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ وَمَا أَمَرْتُكُمْ بِهِ فَافْعَلُوا مِنْهُ مَا اسْتَطَعْتُمْ فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ<\/p>\n<p style=\"text-align: left;\"><strong>What I have prohibited for you, avoid it. What I have commanded you, do it as much as you can. Verily, those before you were ruined only due to their excessive questioning and contradicting their prophets.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 7288, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/sunnah-as-much-as-you-can\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتْرُكُونِي مَا تَرَكْتُكُمْ فَإِذَا حَدَّثْتُكُمْ فَخُذُوا عَنِّي فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ<\/p>\n<p><strong>Leave me with what I have left you. When I narrate a saying to you, take it from me. Verily, those before you were ruined only due to their excessive questioning and contradicting their prophets.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2679, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 10: <\/strong><strong>Restriction to what is lawful and wholesome الاقتصار على الحلال الطيب<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\"> أَيُّهَا النَّاسُ إِنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إِلَّا طَيِّبًا وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ وَقَالَ يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ<\/p>\n<p style=\"text-align: left;\" align=\"right\"><strong>O people, Allah is pure and He accepts only what is pure. Verily, Allah has commanded the believers as He has commanded His Messengers. Allah said: O Messengers, eat from good things and act righteously, for I know what you do.<\/strong> (23:51) <strong>A<\/strong><strong style=\"text-align: left;\">nd Allah said: O you who believe, eat from good things We have provided for you<\/strong>. (2:172)<\/p>\n<\/blockquote>\n<p style=\"text-align: left;\">Abu Huraira added:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ يَا رَبِّ يَا رَبِّ وَمَطْعَمُهُ حَرَامٌ وَمَشْرَبُهُ حَرَامٌ وَمَلْبَسُهُ حَرَامٌ وَغُذِيَ بِالْحَرَامِ فَأَنَّى يُسْتَجَابُ لِذَلِكَ<\/p>\n<p style=\"text-align: left;\">Then, the Prophet mentioned a man who traveled far, becoming disheveled and dusty and he raised his hands to the sky, saying, “O Lord! O Lord!” while his food is unlawful, his drink is unlawful, his clothing is unlawful, and he is nourished by the unlawful, so how can he be answered?<\/p>\n<p>Source: Ṣaḥīḥ Muslim 1015, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/allah-pure-only-accepts-purity\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 11: <\/strong><strong>Refrain from doubts التورع عن الشبهات<\/strong><\/p>\n<p>Al-Hasan ibn Ali reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ وَإِنَّ الْكَذِبَ رِيبَةٌ<\/p>\n<p><strong>Leave what makes you doubt for what does not make you doubt. Verily, truth brings peace of mind and falsehood sows doubt.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2518, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/leave-doubts-yaqeen\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 12: <\/strong><strong>Leaving what does not concern the Muslim ترك ما لا يعني المسلم<\/strong><\/p>\n<p>&#8216;Ali ibn Husayn reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِنْ حُسْنِ إِسْلَامِ الْمَرْءِ تَرْكَهُ مَا لَا يَعْنِيهِ<\/p>\n<p><strong>Verily, from the perfection of Islam is that a person leaves what does not concern him.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2318, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/21\/islam-perfection-not-concern-him\/\"><em><strong>Sahih li ghayri<\/strong><\/em><\/a><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/05\/21\/hadith-on-islam-perfection-in-islam-is-to-leave-what-is-unbeneficial\/\"><em><strong><br \/>\n<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 13: <\/strong><strong>Perfection of faith كمال الإيمان<\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you will have faith until he loves for his brother what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 13, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/18\/love-brother-neighbor-self\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ أَوْ قَالَ لِجَارِهِ مَا يُحِبُّ لِنَفْسِهِ<\/p>\n<p><strong>None of you has faith until he loves for his brother, or his neighbor, what he loves for himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 45, Grade: <em><strong>Sahih<\/strong><\/em><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/05\/24\/love-for-people-what-you-love-for-yourself\/\"><em><br \/>\n<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 14: <\/strong><b>Sanctity of Muslim life and causes of its nullification حرمة دم المسلم وأسباب إهداره<\/b><\/p>\n<p>Abdullah ibn Mas&#8217;ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ الثَّيِّبُ الزَّانِي وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ<\/p>\n<p><strong>It is unlawful to shed the blood of a Muslim who testifies that there is no God but Allah and I am the Messenger of Allah, except in one of three cases: the married person who commits adultery, legal retaliation for murder, and a person who abandons their religion and secedes from the community.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6878, Grade: <em><strong><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/execution-three-crimes-zina-riddah\/\">Muttafaqun Alayhi<\/a><\/strong><\/em><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 15: Islamic Manners آداب إسلامية<\/strong><strong><br \/>\n<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلَا يُؤْذِ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ<\/p>\n<p><strong>Whoever believes in Allah and the Last Day, let him not harm his neighbor. Whoever believes in Allah and the Last Day, let him honor his guest. Whoever believes in Allah and the Last Day, let him speak goodness or remain silent.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6136, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/06\/03\/faith-in-allah-last-day\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلَا يُؤْذِي جَارَهُ<\/p>\n<p><strong>Let him not harm his neighbor.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 47, Grade: <em><strong>Sahih<\/strong><\/em><\/p><\/blockquote>\n<p>And in another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">فَلْيَصِلْ رَحِمَهُ<\/p>\n<p><strong>Let him uphold family ties.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6138, Grade: <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/01\/12\/iman-silat-al-rahim\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 16: <\/strong><strong>Prohibition of anger النهي عن الغضب<\/strong><\/p>\n<p>Abu Huraira reported: A man said to the Prophet, &#8220;Advise me.&#8221; The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَغْضَبْ<\/p>\n<p><strong>Do not be angry.<\/strong><\/p><\/blockquote>\n<p>The man repeated his request, and the Prophet:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَغْضَبْ<\/p>\n<p><strong>Do not be angry.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6116, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/06\/do-not-get-angry\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 17: <\/strong><strong>Command to slaughter in the best manner الأمر بإحسان الذبح<\/strong><\/p>\n<p>Shaddad ibn Aws reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ فَلْيُرِحْ ذَبِيحَتَهُ<\/p>\n<p><strong>Verily, Allah has prescribed excellence in everything. If you have to kill, kill in the best manner. If you have to slaughter, slaughter in the best manner. Let one of you sharpen his knife, so his animal is spared of suffering.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1955, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/07\/allah-ihsan-all-things\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 18: <\/strong><strong>Good character حسن الخلق<\/strong><\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اتَّقِ اللَّهِ حَيْثُمَا كُنْتَ وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ<\/p>\n<p><strong>Fear Allah wherever you are, follow a bad deed with a good deed and it will erase it, and behave with good character towards people.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 1987, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/17\/akhlaq-fear-allah-wherever\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 19: <\/strong><strong>Be mindful of Allah and he will protect you احفظ الله يحفظك<\/strong><\/p>\n<p>Ibn Abbas reported: I was riding with the Messenger of Allah, peace and blessings be upon him, and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">يَا غُلَامُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ احْفَظْ اللَّهَ يَحْفَظْكَ احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَكَ إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ وَلَوْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ رُفِعَتْ الْأَقْلَامُ وَجَفَّتْ الصُّحُفُ<\/p>\n<p><strong>Young man, I will teach you some words. Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. If you ask, ask from Allah. If you seek help, seek help from Allah. Know that if the nations gathered together to benefit you, they could not benefit you unless Allah has decreed it for you. And if the nations gathered together to harm you, they could not harm you unless Allah has decreed it for you. The pens have been lifted and the pages have dried.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2516, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/29\/mindful-allah-he-will-protect-you\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَاعْلَمْ أَنَّ فِي الصَّبْرِ عَلَى مَا تَكْرَهُ خَيْرًا كَثِيرًا وَأَنَّ النَّصْرَ مَعَ الصَّبْرِ وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ وَأَنَّ مَعَ الْعُسْرِ يُسْرًا<\/p>\n<p><strong>Know that there is much good in being patient with what you detest, victory will come with patience, affliction will come with relief, and ‘with hardship will come with ease.’<\/strong> (94:4-5)<\/p>\n<p>Source: Musnad Aḥmad 2803, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2013\/12\/27\/providence-sabr-maa-usri-yusra\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 20: <\/strong><strong>Modesty is part of faith الحياء من الإيمان<\/strong><\/p>\n<p>Abu Mas&#8217;ud reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ إِذَا لَمْ تَسْتَحْيِ فَافْعَلْ مَا شِئْتَ<\/p>\n<p><strong>Verily, among the words people obtained from the Prophets are this: If you feel no shame, do as you wish.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 3483, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/without-haya-does-whatever-wants\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Ibn Rajab commented on this tradition, writing:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">وَأَهْلُ هَذِهِ الْمَقَالَةِ لَهُمْ طَرِيقَانِ أَحَدُهُمَا أَنَّهُ أَمْرٌ بِمَعْنَى التَّهْدِيدِ وَالْوَعِيدِ وَالْمَعْنَى إِذَا لَمْ يَكُنْ حَيَاءٌ فَاعْمَلْ مَا شِئْتَ فَاللَّهُ يُجَازِيكَ عَلَيْه … وَالطَّرِيقُ الثَّانِي أَنَّهُ أَمْرٌ وَمَعْنَاهُ الْخَبَرُ وَالْمَعْنَى أَنَّ مَنْ لَمْ يَسْتَحْيِ صَنَعَ مَا شَاءَ فَإِنَّ الْمَانِعَ مِنْ فِعْلِ الْقَبَائِحِ هُوَ الْحَيَاءُ<\/p>\n<p>The scholars interpret this saying in two ways. First, that it is a command of caution and warning, meaning if there is no shame, do as you wish, for Allah will repay you accordingly&#8230; Second, that it is a command of description, meaning that whoever does not have shame will do as he wishes, for it is shame that prevents evil deeds.<\/p>\n<p>Source: Jāmi’ al-Ulūm wal-Ḥikam 1\/470<\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 21: <\/strong><strong>Say, &#8216;I have faith in Allah,&#8217; and remain steadfast قل آمنت بالله ثم استقم<\/strong><\/p>\n<p>Sufyan ibn Abdullah reported: I said, “O Messenger of Allah, tell me of a saying in Islam after which I will not need to ask anyone after you.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قُلْ آمَنْتُ بِاللَّهِ فَاسْتَقِمْ ‏‏<\/p>\n<p><strong>Say, &#8216;I have faith in Allah,&#8217; and then remain steadfast.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 38, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2010\/12\/13\/i-believe-in-allah-steadfast\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 22: <\/strong><strong>Adhering only to obligations الاقتصار على الفرائض<\/strong><\/p>\n<p>Jabir ibn Abdullah reported: A man asked the Messenger of Allah, saying, “O Messenger of Allah, do you think if I pray the five prescribed prayers, I fast the month of Ramadan, and I uphold what is lawful and unlawful without adding anything to it, will I enter Paradise?” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">نَعَمْ<\/p>\n<p><strong>Yes.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 15, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2014\/01\/26\/only-practice-pillars-islam\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا<\/p>\n<p><strong>Whoever is pleased to see a man from the people of Paradise, let him look at this one.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 1397, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/01\/27\/essentials-pillars-islam\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 23: <\/strong><strong>Hasten to good deeds الإسراع في الخير<\/strong><\/p>\n<p>Abu Malik al-Ash&#8217;ari reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الطُّهُورُ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآَنِ أَوْ تَمْلَأُ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ وَالصَّلَاةُ نُورٌ وَالصَّدَقَةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ كُلُّ النَّاسِ يَغْدُو فَبَايِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا<\/p>\n<p><strong>Purity is half of the faith. The praise of Allah fills the Scale, as the glorification and praise of Allah fill everything between the heavens and the earth. Prayer is a light, charity is a proof, and patience is luminous. The Quran is a decisive proof for you or against you. All people begin the day by trading for their soul, either setting it free or ensuring its ruin.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 223, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/06\/tahur-iman-salat-nur-sadaqah-burhan\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 24: <\/strong><strong>Prohibition of injustice تحريم الظلم<\/strong><\/p>\n<p>Abu Dharr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قال الله تبارك وتعالى يَا عِبَادِي إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمًا فَلَا تَظَالَمُوا<\/p>\n<p><strong>Allah Almighty said: O My servants, I have forbidden injustice for Myself and I have forbidden it among you, so do not oppress one another.<\/strong><\/p>\n<p style=\"text-align: right;\">يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ<\/p>\n<p><strong>O My servants, all of you are astray except for those I have guided, so seek guidance from Me and I will guide you.<\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي كُلُّكُمْ جَائِعٌ إِلَّا مَنْ أَطْعَمْتُهُ فَاسْتَطْعِمُونِي أُطْعِمْكُمْ<\/p>\n<p><strong>O My servants, all of you are hungry except for those I have fed, so seek food from Me and I will feed you.<\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي كُلُّكُمْ عَارٍ إِلَّا مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ<\/p>\n<p><strong>O My servants, all of you are naked except for those I have clothed, so seek clothing from Me and I will clothe you.<\/strong><\/p>\n<p style=\"text-align: right;\">يَا عِبَادِي إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ<\/p>\n<p><strong> O My servants, you sin by night and day and I forgive all sins, so seek forgiveness from Me and I will forgive you. <\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي إِنَّكُمْ لَنْ تَبْلُغُوا ضَرِّي فَتَضُرُّونِي وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي<\/p>\n<p><strong>O My servants, you will not be able to bring harm to Me and you will not be able to bring benefit to Me.<\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا<\/p>\n<p><strong>O My servants, were the first of you and the last of you, the human of you and the jinn of you, to be as pious as the most pious heart of anyone of you, that would not increase My dominion at all.<\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا<\/p>\n<p><strong>O My servants, were the first of you and the last of you, the human of you and the jinn of you, to be as wicked as the most wicked heart of anyone of you, that would not decrease My dominion at all.<\/strong><\/p>\n<p style=\"text-align: right;\"> يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ<\/p>\n<p><strong>O My servants, were the first of you and the last of you, the human of you and the jinn of you, to rise up in one place and make a request of Me, and were I to give everyone what he requested, that would not diminish what I have any more than a needle would diminish the sea if put into it. <\/strong><\/p>\n<p style=\"text-align: right;\">يَا عِبَادِي إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ ثُمَّ أُوَفِّيكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ<\/p>\n<p><strong>O My servants, it is only your deeds that I record for you and then recompense for you. Let he who finds good praise Allah, and let he who finds something else blame no one but himself.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2577, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/02\/05\/allah-has-forbidden-oppression\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 25: <\/strong><strong>Types of good deeds أنواع الأعمال الخيرية<\/strong><\/p>\n<p>Abu Dharr reported: The companions said, “O Messenger of Allah, the rich have taken the rewards. They perform prayer as we pray, they fast as we fast, and they give charity from their extra wealth.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> أَوَ لَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلِّ تَكْبِيرَةٍ صَدَقَةً وَكُلِّ تَحْمِيدَةٍ صَدَقَةً وَكُلِّ تَهْلِيلَةٍ صَدَقَةً وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ<\/p>\n<p><strong>Has not Allah made for you ways to give charity? In every glorification of Allah there is charity, and in every declaration of His greatness there is charity, and in praise of Him is charity, and in every declaration of His oneness there is charity, and enjoining good is charity and forbidding evil is charity, and in a man’s intimate relations with his wife is charity.<\/strong><\/p><\/blockquote>\n<p>They said, “O Messenger of Allah, is there a reward for one who satisfies his passions?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهَا وِزْرٌ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلَالِ كَانَ لَهُ أَجْرًا<\/p>\n<p><strong>You see that if he were to satisfy his passions with the unlawful, it would be a burden of sin upon him? Likewise, if he were to satisfy himself with the lawful, he will have a reward.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 1006, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/19\/many-ways-give-charity\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 26: Reconciliation between people<\/strong><strong> الإصلاح بين الناس<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ قَالَ تَعْدِلُ بَيْنَ الِاثْنَيْنِ صَدَقَةٌ وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ قَالَ وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ وَكُلُّ خُطْوَةٍ تَمْشِيهَا إِلَى الصَّلَاةِ صَدَقَةٌ وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ<\/p>\n<p><strong>Charity is due upon every joint of the people for every day upon which the sun rises. Justly reconciling two people is charity. Helping a man with his animal and lifting his luggage upon it is charity. A kind word is charity. Every step that you take towards the mosque is charity, and removing harmful things from the road is charity.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 2989, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/11\/14\/every-joint-charity-due\/\"><b><i>Muttafaqun Alayhi<\/i><\/b><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 27: <\/strong><strong>Righteousness is good character البر حسن الخلق<\/strong><\/p>\n<p>Al-Nawwas ibn Sam’an reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">الْبِرُّ حُسْنُ الْخُلُقِ وَالإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ<\/p>\n<p><strong>Righteousness is good character, and sin is what waivers in your heart and you hate for people to find out about it.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2553, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/09\/13\/al-birr-al-husn-al-khuluq\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">اسْتَفْتِ نَفْسَكَ اسْتَفْتِ قَلْبَكَ الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ<\/p>\n<p><strong>Consult your soul, consult your heart. Righteousness is what reassures your soul and your heart, and sin is what wavers in your soul and puts tension in your chest, even if the people approve it in their judgments again and again.<\/strong><\/p>\n<p>Source: Sunan al-Dārimī 2533, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/06\/25\/consult-conscience-fatwa\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 28: <\/strong><strong>Duty to uphold the Sunnah وجوب لزوم السنة<\/strong><\/p>\n<p>Al-‘Irbad ibn Sariyah reported: The Messenger of Allah, peace and blessings be upon him, prayed with us one day. Then, he faced us and delivered an eloquent sermon that brought tears to our eyes and by it shook our hearts. It was said, “O Messenger of Allah, it is as if this is a farewell address. What do you instruct for us?” The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ عَبْدًا حَبَشِيًّا فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ بَعْدِي فَسَيَرَى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الْمَهْدِيِّينَ الرَّاشِدِينَ تَمَسَّكُوا بِهَا وَعَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ وَكُلَّ بِدْعَةٍ ضَلَالَةٌ<\/p>\n<p><strong>I advise you to fear Allah, listen, and obey, even if an Abyssinian slave is put in charge of you. Whoever lives after me will see many conflicts. You must adhere to my Sunnah and the Sunnah of the righteous, guided successors. Hold firmly to it as if biting with your molar teeth. Beware of newly invented matters, for every new matter is an innovation and every innovation is misguidance.<\/strong><\/p>\n<p>Source: Sunan Abī Dāwūd 4607, Grade: <strong><em><a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/03\/05\/follow-sunnah-beware-bidah\/\">Sahih<\/a><\/em><\/strong><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 29: <\/strong><strong>What admits one into Paradise ما يدخل الجنة<\/strong><\/p>\n<p>Mu’adh ibn Jabal reported: I said, “O Messenger of Allah, tell me of a deed that will admit me into Paradise and keep me away from the Hellfire.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَقَدْ سَأَلْتَنِي عَنْ عَظِيمٍ وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ تَعْبُدُ اللَّهَ وَلَا تُشْرِكْ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ وَتَصُومُ رَمَضَانَ وَتَحُجُّ الْبَيْتَ<\/p>\n<p><strong>You have asked about an enormous matter, yet it is easy upon those for whom Allah makes it easy. Worship Allah and do not associate anything with Him, establish the prayer, give the charity, fast the month of Ramadan, and perform pilgrimage to the House. <\/strong><\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ الصَّوْمُ جُنَّةٌ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ وَصَلَاةُ الرَّجُلِ مِنْ جَوْفِ اللَّيْلِ<\/p>\n<p><strong>Shall I not tell you about the gates of goodness? Fasting is a shield, charity extinguishes sins as water extinguishes fire, and the prayer of a man in the late night.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet recited the verse:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">تَتَجَافَىٰ جُنُوبُهُمْ عَنِ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ فَلَا تَعْلَمُ نَفْسٌ مَّا أُخْفِيَ لَهُم مِّن قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ<\/p>\n<p><strong>They arise from their beds and supplicate to their Lord in fear and hope. They spend from what We have provided them, for no soul knows what has been hidden for them of comfort as reward for what they used to do.<\/strong> (32:16)<\/p><\/blockquote>\n<p>Then, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكَ بِرَأْسِ الْأَمْرِ كُلِّهِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ<\/p>\n<p><strong>Shall I not tell you about the head of the matter and its peak?<\/strong><\/p><\/blockquote>\n<p>I said, &#8220;Of course, O Messenger of Allah.&#8221; The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">رَأْسُ الْأَمْرِ الْإِسْلَامُ وَعَمُودُهُ الصَّلَاةُ وَذِرْوَةُ سَنَامِهِ الْجِهَادُ<\/p>\n<p><strong>The head of the matter is Islam, its pillar is prayer, and jihad is its peak.<\/strong><\/p><\/blockquote>\n<p>Then the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَلَا أُخْبِرُكَ بِمَلَاكِ ذَلِكَ كُلِّهِ<\/p>\n<p><strong>Shall I not tell you how to achieve all of this?<\/strong><\/p><\/blockquote>\n<p>I said, &#8220;Yes, O Messenger of Allah.&#8221; The Prophet pointed to his tongue and he said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُفَّ عَلَيْكَ هَذَا<\/p>\n<p><strong>Restrain this.<\/strong><\/p><\/blockquote>\n<p>I said, &#8220;O Prophet of Allah, will what we say be held against us?&#8221; The Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ أَوْ عَلَى مَنَاخِرِهِمْ إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ<\/p>\n<p><strong>May your mother be bereaved of you, O Mu’adh! Is there anything that topples people onto their faces in the Hellfire but the harvest of their tongues?<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2616, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/20\/islam-pillar-prayer-summit-jihad\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 30: <\/strong><strong>Rights of Allah Almighty حقوق الله تعالى<\/strong><\/p>\n<p>Abu Tha’laba al-Khushani reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">    إِنَّ اللَّهَ فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا<\/p>\n<p><strong>Verily, Allah has made duties obligatory, do not neglect them. He has set limits, do not transgress them. He has made some things sacred, do no violate them. He has remained silent upon matters as mercy for you, not out of forgetfulness, so do not search them out.<\/strong><\/p>\n<p>Source: Sunan al-Dāraquṭnī 4396, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/07\/03\/hudud-fard-limits\/\"><em><strong>Sahih<\/strong><\/em><\/a><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/07\/03\/hadith-on-law-do-not-neglect-duties-transgress-limits-or-disrespect-allahs-silence\/\"><em><br \/>\n<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 31: <\/strong><strong>True meaning of asceticism الزهد الحقيقي<\/strong><\/p>\n<p>Sahl ibn Sa’d al-Sa’idi reported: A man said, “O Messenger of Allah, tell me of a deed which will make Allah and people love me.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللَّهُ وَازْهَدْ فِيمَا فِي أَيْدِي النَّاسِ يُحِبُّوكَ<\/p>\n<p><strong>Renounce the world and Allah will love you. Renounce what people possess and people will love you<\/strong>.<\/p>\n<p>Source: <span class=\"il\">Sunan<\/span> Ibn Mājah 4102, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/renounce-al-hiyat-al-dunya\/\"><em><strong>Sahih<\/strong><\/em><\/a><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2012\/08\/18\/hadith-on-asceticism-renounce-the-worldly-life-then-allah-and-the-people-will-love-you\/\"><em><br \/>\n<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 32: <\/strong><strong>No harming yourself or others لا ضرر ولا ضرار<\/strong><\/p>\n<p>&#8216;Ubadah ibn al-Samit reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لاَ ضَرَرَ وَلاَ ضِرَارَ<\/p>\n<p><strong>Do not cause harm or return harm.<\/strong><\/p>\n<p>Source: <span class=\"il\">Sunan<\/span> Ibn Mājah 2340, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/03\/no-harm-la-darara-wa-la-dirar\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 33: <\/strong><strong>Burden of proof is on the claimant البينة على المدعي<\/strong><\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ وَلَكِنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي وَالْيَمِينَ عَلَى مَنْ أَنْكَرَ<\/p>\n<p><strong>If people were given in accordance with their claims, men would claim the wealth and lives of other people. Rather, the burden of proof is on the accuser and an oath is a duty upon the defendant.<\/strong><\/p>\n<p>Source: al-Sunan al-Kubrá lil-Bayhaqī 21201, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/burden-proof-on-claimant\/\"><em>Hasan<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 34: <\/strong><b>Enjoining good and forbidding evil الأمر بالمعروف والنهي عن المنكر<br \/>\n<\/b><\/p>\n<p>Abu Sa&#8217;id al-Khudri reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p align=\"right\">مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ<\/p>\n<p><strong>Whoever among you sees evil, let him change it with his hand. If he is unable to do so, then with his tongue. If he is unable to do so, then with his heart, and that is the weakest level of faith.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 49, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/02\/26\/whoever-sees-evil-change-it\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>Sufyan al-Thawri, may Allah have mercy on him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يَأْمُرُ بِالْمَعْرُوفِ وَلا يَنْهَى عَنِ الْمُنْكَرِ إِلا مَنْ كَانَ فِيهِ خِصَالٌ ثَلاثٌ رَفِيقٌ بِمَا يَأْمُرُ رَفِيقٌ بِمَا يَنْهَى عَدْلٌ بِمَا يَأْمُرُ عَدْلٌ بِمَا يَنْهَى عَالِمٌ بِمَا يَأْمُرُ عَالِمٌ بِمَا يَنْهَى<\/p>\n<p>There is no enjoining good or forbidding evil except for one who has three qualities: gentleness in what he enjoins and forbids, justice in what he enjoins and forbids, and knowledge of what he enjoins and forbids.<\/p>\n<p>Source: al-Amr bil-Maʻrūf lil-Khallāl 32<\/p><\/blockquote>\n<p>And Al-Qadi Abu Ya’la said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَأْمُرُ بِالْمَعْرُوفِ وَيَنْهَى عَنْ الْمُنْكَرِ إلَّا مَنْ كَانَ فَقِيهًا فِيمَا يَأْمُرُ بِهِ فَقِيهًا فِيمَا يَنْهَى عَنْهُ رَفِيقًا فِيمَا يَأْمُرُ بِهِ رَفِيقًا فِيمَا يَنْهَى عَنْهُ حَلِيمًا فِيمَا يَأْمُرُ بِهِ حَلِيمًا فِيمَا يَنْهَى عَنْهُ<\/p>\n<p>No one may enjoin good and forbid evil unless he understands what he enjoins and forbids, he is gentle in what he enjoins and forbids, and he shows forbearance in what he enjoins and forbids.<\/p>\n<p>Source: al-Amr bil Ma’rūf li-Ibn Taymīyyah 1\/20-21<\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 35: <\/strong><strong>Brotherhood of Islam أخوة الإسلام<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا تَحَاسَدُوا وَلَا تَنَاجَشُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ وَلَا يَحْقِرُهُ التَّقْوَى هَاهُنَا<\/p>\n<p><strong>Do not envy each other, do not outbid each other, do not hate each other, do not turn away from each other, and do not outsell each other. Rather, be servants of Allah as brothers. The Muslim is the brother of another Muslim. He does not wrong him or humiliate him or look down upon him. Righteousness is here.<\/strong><\/p><\/blockquote>\n<p>Then, the Prophet pointed to his chest three times and he continued:<\/p>\n<blockquote>\n<p style=\"text-align: right;\"> بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ<\/p>\n<p><strong>It is enough evil for a man to look down upon his Muslim brother. The entirety of the Muslim is sacred to another Muslim: his life, his wealth, and his honor.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2564, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/07\/taqwa-in-the-heart\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِيَّاكُمْ وَالظَّنَّ فَإِنَّ الظَّنَّ أَكْذَبُ الْحَدِيثِ وَلَا تَحَسَّسُوا وَلَا تَجَسَّسُوا وَلَا تَنَافَسُوا وَلَا تَحَاسَدُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا<\/p>\n<p><strong>Beware of suspicion, for suspicion is the most false of tales. Do not seek out faults, do not spy on each other, do not contend with each other, do not envy each other, do not hate each other, and do not turn away from each other. Rather, be servants of Allah as brothers.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6066, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/10\/04\/dhann-biggest-lie\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 36: <\/strong><strong>Gathering to remember Allah الاجتماع على الذكر<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالآخِرَةِ وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلاَئِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ<\/p>\n<p><strong>Whoever relieves the hardship of a believer in this world, Allah will relieve his hardship on the Day of Resurrection. Whoever helps ease one in difficulty, Allah will make it easy for him in this world and in the Hereafter. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and in the Hereafter. Allah helps the servant as long as he helps his brother. Whoever travels a path in search of knowledge, Allah will make easy for him a path to Paradise, for a people do not gather together in the houses of Allah, reciting the book of Allah and studying it together, but that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those near Him. Whoever is slow to good deeds will not be hastened by his lineage.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ Muslim 2699, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/01\/15\/allah-helps-brother\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 37: <\/strong><strong>Favor of Allah Almighty فضل الله تعالى<\/strong><\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ ثُمَّ بَيَّنَ ذَلِكَ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عَزَّ وَجَلَّ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِ مِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً<\/p>\n<p><strong>Verily, Allah has recorded good and evil deeds and He made them clear. Whoever intends to perform a good deed but does not do it, Allah will record it as a complete good deed. If he intends to do it and does so, Allah Almighty will record it as ten good deeds, up to seven hundred times as much or even more. If he intends to do an evil deed and does not do it, Allah will record for him one complete good deed. If he does it, Allah will record for him a single evil deed.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6491, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/05\/22\/deeds-multiplied-favor\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 38: <\/strong><strong>Means of nearness to Allah وسيلة القرب<\/strong><\/p>\n<p>Abu Huraira reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ قَالَ مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُ عَلَيْهِ وَمَا يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ وَيَدَهُ الَّتِي يَبْطِشُ بِهَا وَرِجْلَهُ الَّتِي يَمْشِي بِهَا وَإِنْ سَأَلَنِي لَأُعْطِيَنَّهُ وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ وَمَا تَرَدَّدْتُ عَنْ شَيْءٍ أَنَا فَاعِلُهُ تَرَدُّدِي عَنْ نَفْسِ الْمُؤْمِنِ يَكْرَهُ الْمَوْتَ وَأَنَا أَكْرَهُ مَسَاءَتَهُ<\/p>\n<p><strong>Allah said: Whoever shows hostility to a friend of Mine, I have declared war upon him. My servant does not grow closer to Me with anything more beloved to me than the duties I have imposed upon him. My servant continues to grow closer to Me with extra good works until I love him. When I love him, I am his hearing with which he hears, his seeing with which he sees, his hand with which he strikes, and his foot with which he walks. Were he to ask something from Me, I would surely give it to him. Were he to ask Me for refuge, I would surely grant it to him. I do not hesitate to do anything as I hesitate to take the soul of the believer, for he hates death and I hate to displease him.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6502, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/22\/saints-loyal-friends-allah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 39: <\/strong><strong>Overlooking mistakes التجاوز عن المخطئ <\/strong><\/p>\n<p>Ibn Abbas reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ وَضَعَ عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ<\/p>\n<p><strong>Verily, Allah has overlooked for my nation their honest mistakes, forgetfulness, and what they are forced into doing.<\/strong><\/p>\n<p>Source: Sunan Ibn Mājah 2045, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2019\/07\/26\/mistakes-forgetfulness-coercion\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>In another narration, the Prophet said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِنَّ اللَّهَ تَجَاوَزَ عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ<\/p>\n<p><strong>Verily, Allah has pardoned my nation for their mistakes, their forgetfulness, and what they are coerced into doing.<\/strong><\/p>\n<p>Source: <span class=\"il\">Sunan<\/span> Ibn Mājah 2043, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/10\/allah-forgives-mistakes-coercion\/\"><strong><em>Sahih<\/em><\/strong><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 40: <\/strong><strong>Cultivating the Hereafter مزرعة للآخرة<\/strong><\/p>\n<p>Abdullah ibn Umar reported: The Messenger of Allah, peace and blessings be upon him, took hold of my shoulder and said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ، أَوْ عَابِرُ سَبِيلٍ<\/p>\n<p><strong>Be in this world as if you were a stranger or a traveler along a path.<\/strong><\/p><\/blockquote>\n<p>Ibn Umar, may Allah be pleased with him, would say:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">إِذَا أَمْسَيْتَ فَلاَ تَنْتَظِرِ الصَّبَاحَ وَإِذَا أَصْبَحْتَ فَلاَ تَنْتَظِرِ الْمَسَاءَ وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ وَمِنْ حَيَاتِكَ لِمَوْتِكَ<\/p>\n<p>If you make it to the evening, do not wait for the morning. If you make it to the morning, do not wait for the evening. Take from your health for your sickness, and from your life for your death.<\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 6416, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/03\/05\/be-in-dunya-stranger-traveler\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 41: <\/strong><strong>Opposing one&#8217;s lowly desires مخالفة الهوى<\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ<\/p>\n<p><strong>None of you have faith until his desires comply with what I have brought.<\/strong><\/p>\n<p>Source: al-Sunnah li-Ibn Abī ‘Āṣim 15, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/08\/18\/desires-submit-islam\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 42: <\/strong><strong>Repentance التوبة<\/strong><\/p>\n<p>Anas ibn Malik reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى يَا ابْنَ آدَمَ إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي غَفَرْتُ لَكَ عَلَى مَا كَانَ فِيكَ وَلَا أُبَالِي يَا ابْنَ آدَمَ لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتَنِي غَفَرْتُ لَكَ وَلَا أُبَالِي يَا ابْنَ آدَمَ إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتَنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً<\/p>\n<p><strong>Allah Almighty said: O son of Adam, if you call upon Me and place your hope in Me, I will forgive you despite what is within you and I will not hesitate. O son of Adam, if you have sins piling up to the clouds and then ask for My forgiveness, I will forgive you without hesitation. O son of Adam, if you come to Me with enough sins to fill the earth and then you meet Me without associating anything with Me, I will come to you with enough forgiveness to fill the earth.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3540, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2011\/12\/31\/son-of-adam-forgiven\/\"><em>Hasan<\/em><\/a><a href=\"http:\/\/dailyhadith.abuaminaelias.com\/2011\/12\/31\/hadith-on-forgiveness-o-son-of-adam-i-will-forgive-you-without-reservation\/\"><em><br \/>\n<\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 43: Discouragement of overeating كراهية كثرة الأكل<\/strong><\/p>\n<p>Miqdam ibn Ma’d reported: The Messenger of Allah, peace and blessings be upon him, said, “<\/p>\n<blockquote>\n<p style=\"text-align: right;\">مَا مَلَأَ آدَمِيٌّ وِعَاءً شَرًّا مِنْ بَطْنٍ بِحَسْبِ ابْنِ آدَمَ أُكُلَاتٌ يُقِمْنَ صُلْبَهُ فَإِنْ كَانَ لَا مَحَالَةَ فَثُلُثٌ لِطَعَامِهِ وَثُلُثٌ لِشَرَابِهِ وَثُلُثٌ لِنَفَسِهِ<\/p>\n<p><strong>The son of Adam cannot fill a vessel worse than his stomach, as it is enough for him to take a few bites to straighten his back. If he cannot do it, then he may fill it with a third of his food, a third of his drink, and a third of his breath.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2380, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/09\/21\/eating-third-food-drink-air\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 44: Characteristics of hypocrisy خصال المنافق<\/strong><\/p>\n<p>Abdullah ibn Amr reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا إِذَا اؤْتُمِنَ خَانَ وَإِذَا حَدَّثَ كَذَبَ وَإِذَا عَاهَدَ غَدَرَ وَإِذَا خَاصَمَ فَجَرَ<\/p>\n<p><strong>There are four signs that make someone a pure hypocrite and whoever has them has a characteristic of hypocrisy until he abandons it: when he speaks he lies, when he makes a covenant he is treacherous, when he makes a promise he breaks it, and when he argues he is wicked.<\/strong><\/p>\n<p>Source: Ṣaḥīḥ al-Bukhārī 34, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/04\/22\/four-signs-nifaq\/\"><em><strong>Muttafaqun Alayhi<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 45: Reliance upon Allah التوكل على الله<\/strong><\/p>\n<p>Umar ibn al-Khattab reported: The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَوْ أَنَّكُمْ كُنْتُمْ تَوَكَّلُونَ عَلَى اللَّهِ حَقَّ تَوَكُّلِهِ لَرُزِقْتُمْ كَمَا يُرْزَقُ الطَّيْرُ تَغْدُو خِمَاصًا وَتَرُوحُ بِطَانًا<\/p>\n<p><strong>If you were to rely upon Allah with reliance due to Him, He would provide for you just as He provides for the birds. They go out in the morning with empty stomachs and return full.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 2344, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/06\/16\/work-rizq-like-birds\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><strong>Hadith 46: Virtue of remembrance فضل الذكر<\/strong><\/p>\n<p>Abdullah ibn Busr reported: A man said, “O Messenger of Allah, the laws of Islam are too many for me, so tell me something I can hold onto.” The Messenger of Allah, peace and blessings be upon him, said:<\/p>\n<blockquote>\n<p style=\"text-align: right;\">لَا يَزَالُ لِسَانُكَ رَطْبًا مِنْ ذِكْرِ اللَّهِ<\/p>\n<p><strong>Keep your tongue moist with the remembrance of Allah.<\/strong><\/p>\n<p>Source: Sunan al-Tirmidhī 3375, Grade: <a href=\"https:\/\/abuaminaelias.com\/dailyhadithonline\/2012\/10\/18\/tongue-moist-dhikr-allah\/\"><em><strong>Sahih<\/strong><\/em><\/a><\/p><\/blockquote>\n<p>—<\/p>\n<p><em>Success comes from Allah, and Allah knows best<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Verily, deeds are only with intentions,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":11,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"default","site-content-layout":"default","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"footnotes":""},"class_list":["post-735","page","type-page","status-publish","hentry"],"aioseo_notices":[],"jetpack_shortlink":"https:\/\/wp.me\/P5YGRL-bR","jetpack-related-posts":[{"id":14257,"url":"https:\/\/www.abuaminaelias.com\/riyad-us-saliheen-by-an-nawawi\/","url_meta":{"origin":735,"position":0},"title":"Meadows of the Righteous by Imam al-Nawawi","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"Riyad al-Salihin (Meadows of the Righteous) by Imam Yahya ibn Sharaf al-Nawawi is a book of Islamic ethics, manners, and acts of worship. The following are select chapters of this work in English translation with the Arabic text. Virtues and Good Deeds Sincerity, Good Intentions Good Character and Manners Seeking…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":718,"url":"https:\/\/www.abuaminaelias.com\/forty-sacred-hadith-qudsi-english-arabic\/","url_meta":{"origin":735,"position":1},"title":"Forty Sacred Hadith Qudsi","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"Spend in charity, O son of Adam, and I shall spend on you.\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":12884,"url":"https:\/\/www.abuaminaelias.com\/about-me\/","url_meta":{"origin":735,"position":2},"title":"About Me","author":"Abu Amina Elias","date":"February 13, 2013","format":false,"excerpt":"My name is Abu Amina Elias (Justin Parrott). This website is dedicated to spreading the message of Islam according to the Quran, the Sunnah, the way of the righteous predecessors, and the scholars who followed them. Citations are always provided so that others can independently verify the authenticity of the…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18687,"url":"https:\/\/www.abuaminaelias.com\/al-aqeedah-al-wasitiyyah-by-ibn-taymiyyah\/","url_meta":{"origin":735,"position":3},"title":"Al-Aqidah al-Wasitiyyah by Ibn Taymiyyah","author":"Abu Amina Elias","date":"January 25, 2018","format":false,"excerpt":"\"This is the creed of the saved and victorious group until the establishment of the Hour, Ahl al-Sunnah wal Jamā’ah,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20423,"url":"https:\/\/www.abuaminaelias.com\/al-targhib-wal-tarhib\/","url_meta":{"origin":735,"position":4},"title":"Inspiring Hope and Inciting Fear by Imam al-Mundhiri","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"Al-Targhīb wal-Tarhīb (Inspiring Hope and Inciting Fear) is a book of Hadith collected by Imam al-Mundhirī. It is distinguished because of its inclusion of Hadith besides those found in the Six Books, such as in collections by Imam Ahmad, Al-Tabarani, and Al-Bayhaqi. The following are some select chapters with English…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":741,"url":"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/","url_meta":{"origin":735,"position":5},"title":"Al-Aqidah al-Tahawiyyah in English and Arabic","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"This is a clear presentation of the creed of Ahl al-Sunnah wal Jamā’ah,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/735","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=735"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/735\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=735"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}