{"id":741,"date":"2010-12-18T01:10:54","date_gmt":"2010-12-18T06:10:54","guid":{"rendered":"http:\/\/www.faithinallah.org"},"modified":"2025-05-23T10:55:33","modified_gmt":"2025-05-23T06:55:33","slug":"aqeedah-tahawiyyah","status":"publish","type":"page","link":"https:\/\/www.abuaminaelias.com\/aqeedah-tahawiyyah\/","title":{"rendered":"Al-Aqidah al-Tahawiyyah in English and Arabic"},"content":{"rendered":"<p style=\"text-align: center;\"><strong>The Creed of Imam al-Tahawi:<br \/>\nal-ʻAqīdah al-Ṭaḥāwīyah<\/strong><\/p>\n<p style=\"text-align: center;\">Translated with references to proofs from the Quran and Sunnah<br \/>\nby Justin Parrott (Abu Amina Elias)<\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.abuaminaelias.com\/wp-content\/uploads\/2022\/01\/Aqidah-Tahawiyyah_abuaminaelias.pdf\">Click here for the printable and downloadable PDF<\/a><\/p>\n<p style=\"text-align: center;\"><strong>The text of al-‘Aqidah al-Tahawiyyah<\/strong><\/p>\n<p style=\"text-align: right;\">بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ وَبِهِ نَسْتَعِينُ الْحَمْدُ للَّهِ رَبِّ الْعَالَمِينَ<\/p>\n<p>In the name of Allah, the Gracious, the Merciful, from whom we seek help. All praise is due to Allah, the Lord of the worlds.<\/p>\n<p style=\"text-align: right;\">هَذَا ذِكْرُ بَيَانِ عَقِيدَةِ أَهْلِ السُّنَّةِ وَالْجَمَاعَةِ عَلَى مَذْهَبِ فُقَهَاءِ الْمِلَّةِ أَبِي حَنِيفَةَ النُّعْمَانِ بْنِ ثَابِتٍ الْكُوفِيِّ وَأَبِي يُوسُفَ يَعْقُوبَ بْنِ إِبْرَاهِيمَ الْأَنْصَارِيِّ وَأَبِي عَبْدِ اللَّهِ مُحَمَّدِ بْنِ الْحَسَنِ الشَّيْبَانِيِّ رِضْوَانُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ وَمَا يَعْتَقِدُونَ مِنْ أُصُولِ الدِّينِ وَيَدِينُونَ بِهِ رَبَّ الْعَالَمِينَ<\/p>\n<p>This is a clear presentation of the creed of <em>Ahl al-Sunnah wal Jama’ah<\/em>, according to the doctrine of the jurists of the religion, Abu Hanifah al-Nu’man ibn Thabit al-Kufi, Abu Yusuf Ya’qub ibn Ibrahim al-Ansari and Abu Abdullah Muhammad ibn al-Hasan al-Shaybani, may Allah be pleased with them all, and what they believe regarding the fundamentals of the religion and their faith in the Lord of the worlds.<\/p>\n<p style=\"text-align: center;\"><strong>التَّوْحِيدُ<br \/>\n<\/strong><strong>Monotheism<\/strong><\/p>\n<p style=\"text-align: right;\"> نَقُولُ فِي تَوْحِيدِ اللَّهِ مُعْتَقِدِينَ بِتَوْفِيقِ اللَّهِ إِنَّ اللَّهَ وَاحِدٌ لَا شَرِيكَ لَهُ<\/p>\n<p>We say about the oneness of Allah, believing in the guidance of Allah, that Allah is one without any partner.<\/p>\n<p style=\"text-align: right;\">وَلَا شَيْءَ مِثْلُهُ<\/p>\n<p>There is nothing like Him.<a href=\"#_ftn1\" name=\"_ftnref1\">[1]<\/a><\/p>\n<p style=\"text-align: right;\"> وَلَا شَيْءَ يُعْجِزُهُ<\/p>\n<p>There is nothing that can weaken Him.<a href=\"#_ftn2\" name=\"_ftnref2\">[2]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا إِلَهَ غَيْرُهُ<\/p>\n<p>There is nothing worthy of worship but Him.<a href=\"#_ftn3\" name=\"_ftnref3\">[3]<\/a><\/p>\n<p style=\"text-align: right;\">قَدِيمٌ بِلَا ابْتِدَاءٍ دَائِمٌ بِلَا انْتِهَاءٍ<\/p>\n<p>He is the eternal without a beginning and enduring without end.<a href=\"#_ftn4\" name=\"_ftnref4\">[4]<\/a><\/p>\n<p style=\"text-align: right;\">لا يَفْنَى وَلا يَبِيدُ<\/p>\n<p>He will never perish, nor come to an end.<a href=\"#_ftn5\" name=\"_ftnref5\">[5]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا يَكُونُ إِلَّا مَا يُرِيدُ<\/p>\n<p>Nothing happens except what He wills.<a href=\"#_ftn6\" name=\"_ftnref6\">[6]<\/a><\/p>\n<p style=\"text-align: right;\"> لَا تَبْلُغُهُ الْأَوْهَامُ وَلَا تُدْرِكُهُ الْأَفْهَامُ<\/p>\n<p>No imagination can fully conceive of Him. No understanding can fully comprehend Him.<a href=\"#_ftn7\" name=\"_ftnref7\">[7]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا يُشْبِهُهُ الْأَنَامُ<\/p>\n<p>He does not resemble any created being.<a href=\"#_ftn8\" name=\"_ftnref8\">[8]<\/a><\/p>\n<p style=\"text-align: right;\">حَيٌّ لَا يَمُوتُ قَيُّومٌ لَا يَنَامُ<\/p>\n<p>He is living and He never dies, always sustaining and never sleeping.<a href=\"#_ftn9\" name=\"_ftnref9\">[9]<\/a><\/p>\n<p style=\"text-align: right;\">خَالِقٌ بِلَا حَاجَةٍ رَازِقٌ بِلَا مُؤُونَةٍ<\/p>\n<p>He creates without a need to create,<a href=\"#_ftn10\" name=\"_ftnref10\">[10]<\/a> and He provides for His creation without any effort.<a href=\"#_ftn11\" name=\"_ftnref11\">[11]<\/a><\/p>\n<p style=\"text-align: right;\">مُمِيتٌ بِلَا مَخَافَةٍ بَاعِثٌ بِلَا مَشَقَّةٍ<\/p>\n<p>He causes death with no fear of consequences, and He resurrects without any difficulty.<a href=\"#_ftn12\" name=\"_ftnref12\">[12]<\/a><\/p>\n<p style=\"text-align: right;\">مَا زَالَ بِصِفَاتِهِ قَدِيمًا قَبْلَ خَلْقِهِ لَمْ يَزْدَدْ بِكَوْنِهِمْ شَيْئًا لَمْ يَكُنْ قَبْلَهُمْ مِنْ صِفَتِهِ وَكَمَا كَانَ بِصِفَاتِهِ أَزَلِيًّا كَذَلِكَ لَا يَزَالُ عَلَيْهَا أَبَدِيًّا<\/p>\n<p>He has existed with His timeless Attributes before His creation, which added nothing to His essence that was not already among His Attributes. As His Attributes were before creation, so will they continue forever.<\/p>\n<p style=\"text-align: right;\">لَيْسَ مُنْذُ خَلَقَ الْخَلْقَ اسْتَفَادَ اسْمَ الْخَالِقِ وَلَا بِإِحْدَاثِهِ الْبَرِيَّةَ اسْتَفَادَ اسْمَ الْبَارِي<\/p>\n<p>It is not because He created the creation that He earned the name, ‘The Creator,’ nor by His making it did he earn the name, ‘The Maker.’<\/p>\n<p style=\"text-align: right;\">لَهُ مَعْنَى الرُّبُوبِيَّةِ وَلَا مَرْبُوبَ وَمَعْنَى الْخَالِقِ وَلَا مَخْلُوقَ<\/p>\n<p>He has the quality of Lordship without requiring anything to Lord over, and the quality of being the Creator without requiring anything to create.<\/p>\n<p style=\"text-align: right;\">وَكَمَا أَنَّهُ مُحْيِي الْمَوْتَى بَعْدَمَا أَحْيَا اسْتَحَقَّ هَذَا الِاسْمَ قَبْلَ إِحْيَائِهِمْ كَذَلِكَ اسْتَحَقَّ  اسْمَ الْخَالِقِ قَبْلَ إِنْشَائِهِمْ<\/p>\n<p>Just as He resurrects the dead after they first had life, He deserved this name before He brought them to life. Likewise, He deserved the name of ‘The Creator’ before He produced them.<\/p>\n<p style=\"text-align: right;\">ذَلِكَ بِأَنَّهُ عَلَى  كُلِّ شَيْءٍ قَدِيرٌ وَكُلُّ شَىْءٍ إِلَيْهِ فَقِيرٌ وَكُلُّ أَمْرٍ إليه يَسِيرٌ لَا يَحْتَاجُ إِلَى شَيْءٍ لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ<\/p>\n<p>This is because He has power over all things and all things are in need of Him.<a href=\"#_ftn13\" name=\"_ftnref13\">[13]<\/a> Every matter is easy for Him. He has no need of anything, for ‘there is nothing like unto Him, and He is the Hearing, the Seeing.’<a href=\"#_ftn14\" name=\"_ftnref14\">[14]<\/a><\/p>\n<p style=\"text-align: right;\">خَلَقَ الْخَلْقَ بِعِلْمِهِ‏‏<\/p>\n<p>He created the creation with His knowledge.<a href=\"#_ftn15\" name=\"_ftnref15\">[15]<\/a><\/p>\n<p style=\"text-align: right;\">وَقَدَّرَ لَهُمْ أَقْدَارًا<\/p>\n<p>He decreed destinies for them.<a href=\"#_ftn16\" name=\"_ftnref16\">[16]<\/a><\/p>\n<p style=\"text-align: right;\">وَضَرَبَ لَهُمْ آجَالًا<\/p>\n<p>He set for them life spans.<a href=\"#_ftn17\" name=\"_ftnref17\">[17]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَمْ يَخْفَ عَلَيْهِ شَيْءٌ قَبْلَ أَنْ يَخْلُقَهُمْ وَعَلِمَ مَا هُمْ عَامِلُونَ قَبْلَ أَنْ يَخْلُقَهُمْ<\/p>\n<p>Nothing was hidden from Him before He created them. He knew what they would do before He created them.<a href=\"#_ftn18\" name=\"_ftnref18\">[18]<\/a><\/p>\n<p style=\"text-align: right;\">وَأَمَرَهُمْ بِطَاعَتِهِ وَنَهَاهُمْ عَنْ مَعْصِيَتِهِ<\/p>\n<p>He commanded them to obey Him and He forbade them to disobey Him.<a href=\"#_ftn19\" name=\"_ftnref19\">[19]<\/a><\/p>\n<p style=\"text-align: right;\">وَكُلُّ شَيْءٍ يَجْرِي بِتَقْدِيرِهِ وَمَشِيئَتِهِ وَمَشِيئَتُهُ تَنْفُذُ لَا مَشِيئَةَ لِلْعِبَادِ إِلَّا مَا شَاءَ لَهُمْ فَمَا شَاءَ لَهُمْ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ<\/p>\n<p>Everything that occurs is according to His decree and will. His will is always accomplished. The will of the servants is only what He wills for them. Whatever He wills for them comes to be, and whatever He does not will for them does not come to be.<a href=\"#_ftn20\" name=\"_ftnref20\">[20]<\/a><\/p>\n<p style=\"text-align: right;\"> يَهْدِي مَنْ يَشَاءُ وَيَعْصِمُ وَيُعَافِي فَضْلًا وَيُضِلُّ مَنْ يَشَاءُ وَيَخْذُلُ وَيَبْتَلِي عَدْلًا<\/p>\n<p>He guides whomever He wills. He protects them and secures them as grace. He leads astray whomever He wills.<a href=\"#_ftn21\" name=\"_ftnref21\">[21]<\/a> He humiliates them and He puts them to trial in justice.<a href=\"#_ftn22\" name=\"_ftnref22\">[22]<\/a><\/p>\n<p style=\"text-align: right;\"> وَكُلُّهُمْ يَتَقَلَّبُونَ فِي مَشِيئَتِهِ بَيْنَ فَضْلِهِ وَعَدْلِهِ<\/p>\n<p>All of them go back and forth by His will, between His grace and His justice.<a href=\"#_ftn23\" name=\"_ftnref23\">[23]<\/a><\/p>\n<p style=\"text-align: right;\">وَهُوَ مُتَعَالٍ عَنِ الْأَضْدَادِ وَالْأَنْدَادِ<\/p>\n<p>He is Exalted beyond having opposites or partners.<a href=\"#_ftn24\" name=\"_ftnref24\">[24]<\/a><\/p>\n<p style=\"text-align: right;\">لَا رَادَّ لِقَضَائِهِ وَلَا مُعَقِّبَ لِحُكْمِهِ وَلَا غَالِبَ لِأَمْرِهِ<\/p>\n<p>None can repel His decree, amend His judgment, or overpower His command.<a href=\"#_ftn25\" name=\"_ftnref25\">[25]<\/a><\/p>\n<p style=\"text-align: right;\">آمَنَّا بِذَلِكَ كُلِّهِ وَأَيْقَنَّا أَنَّ كُلًّا مِنْ عِنْدِهِ<\/p>\n<p>We believe in all of this. We are certain that it is all from Him.<a href=\"#_ftn26\" name=\"_ftnref26\">[26]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>خَتْمُ النُّبُوَّةِ<br \/>\n<\/strong><strong>The Seal of Prophecy<\/strong><\/p>\n<p style=\"text-align: right;\">وَإِنَّ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدُهُ الْمُصْطَفَى وَنَبِيُّهُ الْمُجْتَبَى وَرَسُولُهُ الْمُرْتَضَى<\/p>\n<p>Muhammad, peace and blessings be upon him, is His chosen servant, His selected prophet, and His Messenger with whom He is well pleased.<a href=\"#_ftn27\" name=\"_ftnref27\">[27]<\/a><\/p>\n<p style=\"text-align: right;\">وَأَنَّهُ خَاتَمُ الْأَنْبِيَاءِ وَإِمَامُ الْأَتْقِيَاءِ وَسَيِّدُ الْمُرْسَلِينَ وَحَبِيبُ رَبِّ الْعَالَمِينَ<\/p>\n<p>He is the seal of the prophets, the leader of the righteous, the master of the Messengers, and the beloved of the Lord of worlds.<a href=\"#_ftn28\" name=\"_ftnref28\">[28]<\/a><\/p>\n<p style=\"text-align: right;\">وَكُلُّ دَعْوَى النُّبُوَّةِ بَعْدَهُ فَغَيٌّ وَهَوًى<\/p>\n<p>Every claim to prophecy after him is falsehood and deceit.<a href=\"#_ftn29\" name=\"_ftnref29\">[29]<\/a><\/p>\n<p style=\"text-align: right;\">وَهُوَ الْمَبْعُوثُ إِلَى عَامَّةِ الْجِنِّ وَكَافَّةِ الْوَرَى بِالْحَقِّ وَالْهُدَى وَبِالنُّورِ وَالضِّيَاءِ<\/p>\n<p>He has been sent to all of the jinn and the entirety of humanity with truth, guidance, light, and illumination.<a href=\"#_ftn30\" name=\"_ftnref30\">[30]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْقُرْآنُ كَلَامُ اللَّهِ تَعَالَى لَيْسَ بِمَخْلُوقٍ<br \/>\n<\/strong><strong>The Quran is the uncreated speech of Allah Almighty<\/strong><\/p>\n<p style=\"text-align: right;\">وَإِنَّ الْقُرْآنَ كَلَامُ اللَّهِ مِنْهُ بَدَا بِلَا كَيْفِيَّةٍ قَوْلًا وَأَنْزَلَهُ عَلَى رَسُولِهِ وَحْيًا وَصَدَّقَهُ الْمُؤْمِنُونَ عَلَى ذَلِكَ حَقًّا وَأَيْقَنُوا أَنَّهُ كَلَامُ اللَّهِ تَعَالَى بِالْحَقِيقَةِ<\/p>\n<p>The Quran is the word of Allah.<a href=\"#_ftn31\" name=\"_ftnref31\">[31]<\/a> It originally came from Him, without ascribing modality to His speech.<a href=\"#_ftn32\" name=\"_ftnref32\">[32]<\/a> He sent it down upon His messenger as revelation. The believers accept all of that as the truth. They are certain that it is the word of Allah Almighty in reality.<\/p>\n<p style=\"text-align: right;\">لَيْسَ بِمَخْلُوقٍ كَكَلَامِ الْبَرِيَّةِ فَمَنْ سَمِعَهُ فَزَعَمَ أَنَّهُ كَلَامُ الْبَشَرِ فَقَدْ كَفَرَ وَقَدْ ذَمَّهُ اللَّهُ وَعَابَهُ وَأَوْعَدَهُ بِسَقَرَ حَيْثُ قَالَ تَعَالَى سَأُصْلِيهِ سَقَرَ  فَلَمَّا أَوْعَدَ اللَّهُ بِسَقَرَ لِمَنْ قَالَ إِنْ هَذَا إِلَّا قَوْلُ الْبَشَرِ عَلِمْنَا وَأَيْقَنَّا أَنَّهُ قَوْلُ خَالِقِ الْبَشَرِ وَلَا يُشْبِهُ قَوْلَ الْبَشَرِ<\/p>\n<p>It is uncreated, unlike the speech of creatures.<a href=\"#_ftn33\" name=\"_ftnref33\">[33]<\/a> Whoever hears it and imagines that it is human speech has committed unbelief. Allah has blamed him, censured him, and threatens him with Fire, wherein the Almighty said, ‘I will burn him in the Fire,’<a href=\"#_ftn34\" name=\"_ftnref34\">[34]<\/a> When Allah threatens with the Fire those who said, ‘This is only human speech,’<a href=\"#_ftn35\" name=\"_ftnref35\">[35]<\/a> we know with certainty that it is the speech of the Creator of humanity and it does not resemble the speech of humanity.<\/p>\n<p style=\"text-align: center;\"><strong>صِفَاتُ اللَّهِ لَيْسَتْ كَصِفَاتِ الْبَشَرِ<br \/>\n<\/strong><strong>The Attributes of Allah are unlike those of human beings<\/strong><\/p>\n<p style=\"text-align: right;\">وَمَنْ وَصَفَ اللَّهَ بِمَعْنًى مِنْ مَعَانِي الْبَشَرِ فَقَدْ كَفَرَ مَنْ أَبْصَرَ هَذَا اعْتَبَرَ وَعَنْ مِثْلِ قَوْلِ الْكُفَّارِ انْزَجَرَ وَعَلِمَ أَنَّ اللَّهَ بِصِفَاتِهِ لَيْسَ كَالْبَشَرِ<\/p>\n<p>Whoever describes Allah with the same qualities as human beings has committed unbelief.<a href=\"#_ftn36\" name=\"_ftnref36\">[36]<\/a> Whoever grasps this will be careful and restrained from the likes of what is said by the unbelievers. He knows that the Attributes of Allah are unlike those of human beings.<\/p>\n<p style=\"text-align: center;\"><strong>رُؤْيَةُ أَهْلِ الْجَنَّةِ رَبَّهُمْ بِغَيْرِ إِحَاطَةٍ<br \/>\n<\/strong><strong>The looking of the people of Paradise at their Lord without encompassing Him<\/strong><\/p>\n<p style=\"text-align: right;\">وَالرُّؤْيَةُ حَقٌّ لِأَهْلِ الْجَنَّةِ بِغَيْرِ إِحَاطَةٍ وَلَا كَيْفِيَّةٍ كَمَا نَطَقَ بِهِ كِتَابُ رَبِّنَا وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَى رَبِّهَا نَاظِرَةٌ وَتَفْسِيرُهُ عَلَى مَا أَرَادَ اللَّهُ تَعَالَى وَعَلِمَهُ<\/p>\n<p>The vision of the people of Paradise is true, without being all-encompassing and without modality. As expressed in the Book of our Lord, ‘Faces on that Day will be radiant, looking at their Lord,’<a href=\"#_ftn37\" name=\"_ftnref37\">[37]<\/a> The explanation of this is as Allah Almighty intended and knows.<\/p>\n<p style=\"text-align: right;\">وَكُلُّ مَا جَاءَ فِي ذَلِكَ مِنَ الْحَدِيثِ الصَّحِيحِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ كَمَا قَالَ وَمَعْنَاهُ عَلَى مَا أَرَادَ لَا نَدْخُلُ فِي ذَلِكَ مُتَأَوِّلِينَ بِآرَائِنَا وَلَا مُتَوَهِّمِينَ بِأَهْوَائِنَا<\/p>\n<p>Everything that has come in authentic narrations from the Messenger, peace and blessings be upon him, is as he said and it means what he intended.<a href=\"#_ftn38\" name=\"_ftnref38\">[38]<\/a> We do not insert our own opinions in it, nor do we imagine it according to our whims.<\/p>\n<p style=\"text-align: right;\">فَإِنَّهُ مَا سَلِمَ فِي دِينِهِ إِلَّا مَنْ سَلَّمَ لِلَّهِ عَزَّ وَجَلَّ وَلِرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَدَّ عِلْمَ مَا اشْتَبَهَ عَلَيْهِ إِلَى عَالِمِهِ<\/p>\n<p>For none is safe in his religion except those who surrender themselves to Allah Almighty and to His Messenger,<a href=\"#_ftn39\" name=\"_ftnref39\">[39]<\/a> and relinquishes the knowledge of what is ambiguous to the One who knows it.<a href=\"#_ftn40\" name=\"_ftnref40\">[40]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>التَّكَلُّمُ فِي أُمُورِ الدِّينِ بِغَيْرِ عِلْمٍ<br \/>\n<\/strong><strong>Speaking about religious matters without knowledge<\/strong><\/p>\n<p style=\"text-align: right;\">وَلَا تَثْبُتُ قَدَمُ الْإِسْلَامِ إِلَّا عَلَى ظَهْرِ التَّسْلِيمِ وَالْاسْتِسْلَامِ<\/p>\n<p>The foundation of one’s Islam is not firm unless it is upon outward submission and surrender to Allah.<a href=\"#_ftn41\" name=\"_ftnref41\">[41]<\/a><\/p>\n<p style=\"text-align: right;\">فَمَنْ رَامَ عِلْمَ مَا حُظِرَ عَنْهُ عِلْمُهُ وَلَمْ يَقْنَعْ بِالتَّسْلِيمِ فَهْمُهُ حَجَبَهُ مَرَامُهُ عَنْ خَالِصِ التَّوْحِيدِ وَصَافِي الْمَعْرِفَةِ وَصَحِيحِ الْإِيمَانِ<\/p>\n<p>For whoever wishes to know what is forbidden and is not satisfied with surrender, his understanding will be veiled from pure monotheism, gnosis, and sound faith.<a href=\"#_ftn42\" name=\"_ftnref42\">[42]<\/a><\/p>\n<p style=\"text-align: right;\">فَيَتَذَبْذَبُ بَيْنَ الْكُفْرِ وَالْإِيمَانِ وَالتَّصْدِيقِ وَالتَّكْذِيبِ وَالْإِقْرَارِ وَالْإِنْكَارِ مُوَسْوِسًا تَائِهًا شَاكًّا زَائِغًا لَا مُؤْمِنًا مُصَدِّقًا وَلَا جَاحِدًا مُكَذِّبًا<\/p>\n<p>He will veer between unbelief and faith, confirmation and denial, acceptance and rejection. Compulsive, disagreeable, doubtful, and deviant, he is not a true believer, nor a stubborn denier.<a href=\"#_ftn43\" name=\"_ftnref43\">[43]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا يَصِحُّ الْإِيمَانُ بِالرُّؤْيَةِ لِأَهْلِ دَارِ السَّلَامِ لِمَنِ اعْتَبَرَهَا مِنْهُمْ بِوَهْمٍ أَوْ تَأَوَّلَهَا بِفَهْمٍ إِذْ كَانَ تَأْوِيلُ الرُّؤْيَةِ وَتَأْوِيلُ كُلِّ مَعْنًى يُضَافُ إِلَى الرُّبُوبِيَّةِ تَرْكَ التَّأْوِيلِ وَلُزُومَ التَّسْلِيمِ وَعَلَيْهِ دِينُ الْمُسْلِمِينَ<\/p>\n<p>Faith in the vision of the people of the Abode of Peace is not correct for those among them who express it as an illusion or who interpret it with their own limited understanding, as the correct interpretation of the vision, and the interpretation of every meaning related to the Lordship of Allah, is by abandoning interpretation and adhering to surrender.<a href=\"#_ftn44\" name=\"_ftnref44\">[44]<\/a> This is the religion of the Muslims.<\/p>\n<p style=\"text-align: right;\">وَمَنْ لَمْ يَتَوَقَّ النَّفْيَ وَالتَّشْبِيهَ زَلَّ وَلَمْ يُصِبِ التَّنْزِيهَ فَإِنَّ رَبَّنَا جَلَّ وَعَلَا مَوْصُوفٌ بِصِفَاتِ الْوَحْدَانِيَّةِ مَنْعُوتٌ بِنُعُوتِ الْفَرْدَانِيَّةِ لَيْسَ فِي مَعْنَاهُ أَحَدٌ مِنَ الْبَرِيَّةِ<\/p>\n<p>Whoever does not guard himself from negating the Attributes of Allah or likening Allah to something else has strayed and has not correctly understood the transcendence of Allah, for our Lord Almighty is described with the Attributes of Oneness, qualified with the qualities of uniqueness. He does not have the characteristics of any creature.<a href=\"#_ftn45\" name=\"_ftnref45\">[45]<\/a><\/p>\n<p style=\"text-align: right;\">وَتَعَالَى عَنِ الْحُدُودِ وَالْغَايَاتِ وَالْأَرْكَانِ وَالْأَعْضَاءِ وَالْأَدَوَاتِ لَا تَحْوِيهِ الْجِهَاتُ السِّتُّ كَسَائِرِ الْمُبْتَدَعَاتِ<\/p>\n<p>He is Exalted above any limits, ends, supports, limbs, or tools. He is not contained by six directions like the rest of created things.<a href=\"#_ftn46\" name=\"_ftnref46\">[46]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْإِسْرَاءُ وَالْمِعْرَاجُ لَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْيَقَظَةِ<br \/>\n<\/strong><strong>The Night Journey and Ascension while the Prophet, peace and blessings be upon him, was awake<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْمِعْرَاجُ حَقٌّ وَقَدْ أُسْرِيَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعُرِجَ بِشَخْصِهِ فِي الْيَقَظَةِ إِلَى السَّمَاءِ ثُمَّ إِلَى حَيْثُ شَاءَ اللَّهُ مِنَ الْعُلَا وَأَكْرَمَهُ اللَّهُ بِمَا شَاءَ وَأَوْحَى إِلَيْهِ مَا أَوْحَى مَا كَذَبَ الْفُؤَادُ مَا رَأَى فَصَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْآخِرَةِ وَالْأُولَى<\/p>\n<p>The ascension to heaven is true. The Prophet, peace and blessings be upon him, was taken by night and ascended in person during wakefulness, to the heavens and then to whichever heights Allah willed for him.<a href=\"#_ftn47\" name=\"_ftnref47\">[47]<\/a> Allah honored him as He willed and He revealed to him what He revealed, ‘His heart was not mistaken about what he saw,’<a href=\"#_ftn48\" name=\"_ftnref48\">[48]<\/a> Allah blessed him and granted him peace in the Hereafter and in this world.<\/p>\n<p style=\"text-align: center;\"><strong>الْحَوْضِ<br \/>\n<\/strong><strong>The Prophetic Fountain<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْحَوْضُ الَّذِي أَكْرَمَهُ اللَّهُ تَعَالَى بِهِ غِيَاثًا لِأُمَّتِهِ حَقٌّ<\/p>\n<p>The Fountain (<em>al-hawḍ<\/em>), with which Allah Almighty honored him as nourishment for his nation, is true.<a href=\"#_ftn49\" name=\"_ftnref49\">[49]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الشَّفَاعَةُ<br \/>\n<\/strong><strong>The Intercession<\/strong><\/p>\n<p style=\"text-align: right;\">وَالشَّفَاعَةُ الَّتِي ادَّخَرَهَا لَهُمْ حَقٌّ كَمَا رُوِيَ فِي الْأَخْبَارِ<\/p>\n<p>The Intercession (<em>al-shafa’ah<\/em>), which he deferred for them until the Day of Resurrection, is true as related in the narrations.<a href=\"#_ftn50\" name=\"_ftnref50\">[50]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْمِيثَاقُ الَّذِي أَخَذَهُ اللَّهُ مِنْ آدَمَ وَذُرِّيَّتِهِ<br \/>\n<\/strong><strong>The covenant that Allah took from Adam and his progeny<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْمِيثَاقُ الَّذِي أَخَذَهُ اللَّهُ تَعَالَى مِنْ آدَمَ وَذُرِّيَّتِهِ حَقٌّ<\/p>\n<p>The covenant that Allah Almighty took from Adam and his progeny is true.<a href=\"#_ftn51\" name=\"_ftnref51\">[51]<\/a><\/p>\n<p style=\"text-align: right;\">وَقَدْ عَلِمَ اللَّهُ تَعَالَى فِيمَا لَمْ يَزَلْ عَدَدَ مَنْ يَدْخُلُ الْجَنَّةَ وَعَدَدَ مَنْ يَدْخُلُ النَّارَ جُمْلَةً وَاحِدَةً فَلَا يُزَادُ فِي ذَلِكَ الْعَدَدِ وَلَا يُنْقَصُ مِنْهُ<\/p>\n<p>Allah Almighty has always known the number of those who would enter Paradise and the number of those who would enter Hellfire, a single allocation. This number will neither increase nor decrease.<a href=\"#_ftn52\" name=\"_ftnref52\">[52]<\/a><\/p>\n<p style=\"text-align: right;\">وَكَذَلِكَ أَفْعَالُهُمْ فِيمَا عَلِمَ مِنْهُمْ أَنْ يَفْعَلُوهُ<\/p>\n<p>Likewise for the actions of people, as He knows among them what they would do.<a href=\"#_ftn53\" name=\"_ftnref53\">[53]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>القضاء والقدر<br \/>\n<\/strong><strong>Divine Providence<\/strong><\/p>\n<p style=\"text-align: right;\">وَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ وَالْأَعْمَالُ بِالْخَوَاتِيمِ وَالسَّعِيدُ مَنْ سَعِدَ بِقَضَاءِ اللَّهِ وَالشَّقِيُّ مَنْ شَقِيَ بِقَضَاءِ اللَّهِ<\/p>\n<p>Everyone is facilitated for what was created for him.<a href=\"#_ftn54\" name=\"_ftnref54\">[54]<\/a> Deeds are judged as they are at the end of life.<a href=\"#_ftn55\" name=\"_ftnref55\">[55]<\/a> Those who are blessed are blessed by the decree of Allah, and those who are damned are damned by the decree of Allah.<\/p>\n<p style=\"text-align: right;\">وَأَصْلُ الْقَدَرِ سِرُّ اللَّهِ تَعَالَى فِي خَلْقِهِ لَمْ يَطَّلِعْ عَلَى ذَلِكَ مَلَكٌ مُقَرَّبٌ وَلَا نَبِيٌّ مُرْسَلٌ وَالتَّعَمُّقُ وَالنَّظَرُ فِي ذَلِكَ ذَرِيعَةُ الْخِذْلَانِ وَسُلَّمُ الْحِرْمَانِ وَدَرَجَةُ الطُّغْيَانِ<\/p>\n<p>The basis of providence is that it is a secret of Allah Almighty in His creation.<a href=\"#_ftn56\" name=\"_ftnref56\">[56]<\/a> It has not been shown to an angel near to Him, nor to a prophet He sent. Delving and investigating deeply into that is a cause of loss, a ladder to deprivation, and a degree of transgression.<a href=\"#_ftn57\" name=\"_ftnref57\">[57]<\/a><\/p>\n<p style=\"text-align: right;\">فَالْحَذَرَ كُلَّ الْحَذَرِ مِنْ ذَلِكَ نَظَرًا وَفِكْرًا وَوَسْوَسَةً فَإِنَّ اللَّهَ تَعَالَى طَوَى عِلْمَ الْقَدَرِ عَنْ أَنَامِهِ وَنَهَاهُمْ عَنْ مَرَامِهِ كَمَا قَالَ تَعَالَى فِي كِتَابِهِ لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ فَمَنْ سَأَلَ لِمَ فَعَلَ فَقَدْ رَدَّ حُكْمَ الْكِتَابِ وَمَنْ رَدَّ حُكْمَ الْكِتَابِ كَانَ مِنَ الْكَافِرِينَ<\/p>\n<p>Thus, take extreme caution from that type of investigation, thinking, and insinuation. For Allah Almighty has hidden the knowledge of providence from His creatures and has prohibited them from seeking it, as said by Allah Almighty in His Book, ‘He will not be questioned about what He does, but they will be questioned.’<a href=\"#_ftn58\" name=\"_ftnref58\">[58]<\/a> Whoever asks why He did something has rejected the judgment of the Book, and whoever rejects the judgment of the Book is among the unbelievers.<a href=\"#_ftn59\" name=\"_ftnref59\">[59]<\/a><\/p>\n<p style=\"text-align: right;\">فَهَذَا جُمْلَةُ مَا يَحْتَاجُ إِلَيْهِ مَنْ هُوَ مُنَوَّرٌ قَلْبُهُ مِنْ أَوْلِيَاءِ اللَّهِ تَعَالَى وَهِيَ دَرَجَةُ الرَّاسِخِينَ فِي الْعِلْمِ لِأَنَّ الْعِلْمَ عِلْمَانِ عِلْمٌ فِي الْخَلْقِ مَوْجُودٌ وَعِلْمٌ فِي الْخَلْقِ مَفْقُودٌ فَإِنْكَارُ الْعِلْمِ الْمَوْجُودِ كُفْرٌ وَادِّعَاءُ الْعِلْمِ الْمَفْقُودِ كُفْرٌ وَلَا يَثْبُتُ الْإِيمَانُ إِلَّا بِقَبُولِ الْعِلْمِ الْمَوْجُودِ وَتَرْكِ طَلَبِ الْعِلْمِ الْمَفْقُودِ<\/p>\n<p>This is the summary of what is needed by those who have enlightened hearts among the allies of Allah Almighty. It is the degree of those rooted in knowledge, for knowledge in the creation is of two types: accessible knowledge and inaccessible knowledge. To deny accessible knowledge is unbelief, and to claim to know what is inaccessible is unbelief.<a href=\"#_ftn60\" name=\"_ftnref60\">[60]<\/a> Faith is only affirmed by accepting accessible knowledge and abandoning pursuit of inaccessible knowledge.<a href=\"#_ftn61\" name=\"_ftnref61\">[61]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>اللَّوْحُ الْمَحْفُوظُ وَالْقَلَمُ<br \/>\n<\/strong><strong>The Preserved Tablet and the Pen<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِاللَّوْحِ وَالْقَلَمِ وَبِجَمِيعِ مَا فِيهِ قَدْ رُقِمَ<\/p>\n<p>We believe in the Preserved Tablet (<em>al-lawh al-maḥfuz<\/em>), the Pen, and in everything inscribed on it.<a href=\"#_ftn62\" name=\"_ftnref62\">[62]<\/a><\/p>\n<p style=\"text-align: right;\">فَلَوِ اجْتَمَعَ الْخَلْقُ كُلُّهُمْ عَلَى شَيْءٍ كَتَبَهُ اللَّهُ تَعَالَى فِيهِ أَنَّهُ كَائِنٌ لِيَجْعَلُوهُ غَيْرَ كَائِنٍ لَمْ يَقْدِرُوا عَلَيْهِ وَلَوِ اجْتَمَعُوا كُلُّهُمْ عَلَى شَيْءٍ لَمْ يَكْتُبْهُ اللَّهُ تَعَالَى فِيهِ لِيَجْعَلُوهُ كَائِنًا لَمْ يَقْدِرُوا عَلَيْهِ جَفَّ الْقَلَمُ بِمَا هُوَ كَائِنٌ إِلَى يَوْمِ الْقِيَامَةِ<\/p>\n<p>If all creation gathered against something Allah Almighty had decreed to be, that they try to make it not exist, they would have no power to do so. If all of them gathered against something Allah had not decreed to be, that they try to bring it into existence, they would have no power to do so. The Pen has dried of what will be until the Day of Resurrection.<a href=\"#_ftn63\" name=\"_ftnref63\">[63]<\/a><\/p>\n<p style=\"text-align: right;\">وَمَا أَخْطَأَ الْعَبْدَ لَمْ يَكُنْ لِيُصِيبَهُ وَمَا أَصَابَهُ لَمْ يَكُنْ لِيُخْطِئَهُ<\/p>\n<p>Whatever a person has missed, he would have never received. Whatever he received, he would have never missed.<a href=\"#_ftn64\" name=\"_ftnref64\">[64]<\/a><\/p>\n<p style=\"text-align: right;\">وَعَلَى الْعَبْدِ أَنْ يَعْلَمَ أَنَّ اللَّهَ قَدْ سَبَقَ عِلْمُهُ فِي كُلِّ كَائِنٍ مِنْ خَلْقِهِ فَقَدَّرَ ذَلِكَ تَقْدِيرًا مُحْكَمًا مُبْرَمًا لَيْسَ فِيهِ نَاقِضٌ وَلَا مُعَقِّبٌ وَلَا مُزِيلٌ وَلَا مُغَيِّرٌ وَلَا مُحَوِّلٌ وَلَا نَاقِصٌ وَلَا زَائِدٌ مِنْ خَلْقِهِ فِي سَمَاوَاتِهِ وَأَرْضِهِ<\/p>\n<p>The servant must know that the knowledge of Allah of all that exists in His creation has already preceded. He measured all of that with precise measurement, judgment, and finality. There is nothing to reduce it, nor amend it, nor remove it, nor change it, nor divert it, nor decrease it, nor add to it.<a href=\"#_ftn65\" name=\"_ftnref65\">[65]<\/a><\/p>\n<p style=\"text-align: right;\">وذَلِكَ مِنْ عَقْدِ الْإِيمَانِ وَأُصُولِ الْمَعْرِفَةِ وَالِاعْتِرَافِ بِتَوْحِيدِ اللَّهِ تَعَالَى وَرُبُوبِيَّتِهِ كَمَا قَالَ تَعَالَى فِي كِتَابِهِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا وَقَالَ تَعَالَى وَكَانَ أَمْرُ اللَّهِ قَدَرًا مَقْدُورًا فَوَيْلٌ لِمَنْ صَارَ قَلْبُهُ فِي الْقَدَرِ قَلْبًا سَقِيمًا لَقَدِ الْتَمَسَ بِوَهْمِهِ فِي فَحْصِ الْغَيْبِ سِرًّا كَتِيمًا وَعَادَ بِمَا قَالَ فِيهِ أَفَّاكًا أَثِيمًا<\/p>\n<p>All of that is among the beliefs of faith, the fundamentals of gnosis, and the recognition of the oneness of Allah Almighty and His Lordship, as the Almighty said in His book, ‘He created all things and measured them with precise measurement,’<a href=\"#_ftn66\" name=\"_ftnref66\">[66]<\/a> And the Almighty said, ‘The command of Allah is a decisive decree,’<a href=\"#_ftn67\" name=\"_ftnref67\">[67]<\/a> Then woe to him whose heart becomes ill regarding providence. He has traversed the path of his delusions in investigating the Unseen, its secrets and hidden aspects.<a href=\"#_ftn68\" name=\"_ftnref68\">[68]<\/a> He ends up as a sinful liar due to what he said.<\/p>\n<p style=\"text-align: center;\"><strong>الْعَرْشُ وَالْكُرْسِيُّ<br \/>\n<\/strong><strong>The Throne and the Footstool<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْعَرْشُ وَالْكُرْسِيُّ حَقٌّ<\/p>\n<p>The Throne (<em>al-‘arsh<\/em>) and the Footstool (<em>al-kursī<\/em>) are true.<a href=\"#_ftn69\" name=\"_ftnref69\">[69]<\/a><\/p>\n<p style=\"text-align: right;\">وَهُوَ مُسْتَغْنٍ عَنِ الْعَرْشِ وَمَا دُونَهُ<\/p>\n<p>He is independent of the Throne and whatever is beneath it.<a href=\"#_ftn70\" name=\"_ftnref70\">[70]<\/a><\/p>\n<p style=\"text-align: right;\">مُحِيطٌ بِكُلِّ شَيْءٍ وَفَوْقَهُ وَقَدْ أَعْجَزَ عَنِ الْإِحَاطَةِ خَلْقَهُ<\/p>\n<p>He encompasses all things and He is above it, and what He has created is incapable of encompassing Him.<a href=\"#_ftn71\" name=\"_ftnref71\">[71]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>اتَّخَذَ اللَّهُ إِبْرَاهِيمَ خَلِيلًا<br \/>\n<\/strong><strong>Allah took Abraham as an intimate friend<\/strong><\/p>\n<p style=\"text-align: right;\">وَنَقُولُ إِنَّ اللَّهَ اتَّخَذَ إِبْرَاهِيمَ عليه السلام خَلِيلًا وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا إِيمَانًا وَتَصْدِيقًا وَتَسْلِيمًا<\/p>\n<p>We say that Allah has taken Abraham, upon him be peace, as an intimate friend<a href=\"#_ftn72\" name=\"_ftnref72\">[72]<\/a> and that He spoke directly to Moses, faithfully, truthfully, and in surrender to Allah.<a href=\"#_ftn73\" name=\"_ftnref73\">[73]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْإِيمَانُ بِالْمَلَائِكَةِ وَالْكُتُبِ الْمُنَزَّلَةِ وَالْمُرْسَلِي<br \/>\n<\/strong><strong>Faith in the angels, the revealed Books, and the Messengers<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِالْمَلَائِكَةِ وَالنَّبِيِّينَ وَالْكُتُبِ الْمُنَزَّلَةِ عَلَى الْمُرْسَلِينَ وَنَشْهَدُ أَنَّهُمْ كَانُوا عَلَى الْحَقِّ الْمُبِينِ<\/p>\n<p>We have faith in the angels, the Prophets, and the Books revealed to the Messengers.<a href=\"#_ftn74\" name=\"_ftnref74\">[74]<\/a> We testify that they were all upon the clear truth.<\/p>\n<p style=\"text-align: center;\"><strong>أَهْلُ الْقِبْلَةِ مُسْلِمُونَ مُؤْمِنُونَ<br \/>\n<\/strong><strong>Those who pray towards Mecca are Muslim believers<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُسَمِّي أَهْلَ قِبْلَتِنَا مُسْلِمِينَ مُؤْمِنِينَ مَا دَامُوا بِمَا جَاءَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُعْتَرِفِينَ وَلَهُ بِكُلِّ مَا قَالَهُ وَأَخْبَرَ مُصَدِّقِينَ<\/p>\n<p>We name the people who pray towards Mecca (<em>ahl<\/em> <em>al-qiblah<\/em>) as ‘Muslims’ and ‘believers’ as long as they remain upon what was brought by the Prophet, peace and blessings be upon him, recognizing and confirming as true everything he said and reported.<a href=\"#_ftn75\" name=\"_ftnref75\">[75]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نَخُوضُ فِي اللَّهِ وَلَا نُمَارِي فِي دِينِ اللَّهِ<\/p>\n<p>We do not speak vainly about Allah, nor do we argue about the religion of Allah.<a href=\"#_ftn76\" name=\"_ftnref76\">[76]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نُجَادِلُ فِي الْقُرْآنِ وَنَشْهَدُ أَنَّهُ كَلَامُ رَبِّ الْعَالَمِينَ نَزَلَ بِهِ الرُّوحُ الْأَمِينُ فَعَلَّمَهُ سَيِّدَ الْمُرْسَلِينَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ كَلَامُ اللَّهِ تَعَالَى لَا يُسَاوِيهِ شَيْءٌ مِنْ كَلَامِ الْمَخْلُوقِينَ وَلَا نَقُولُ بِخَلْقِهِ وَلَا نُخَالِفُ جَمَاعَةَ الْمُسْلِمِينَ<\/p>\n<p>We do not dispute over the Quran.<a href=\"#_ftn77\" name=\"_ftnref77\">[77]<\/a> We testify that it is the speech of the Lord of the worlds, sent down by the Trustworthy Spirit (Angel Gabriel), who taught it to the master of the Messengers, Muhammad, peace and blessings be upon him. It is the speech of Allah Almighty, in no way equal to the speech of creatures. We do not claim it is His creation, nor do we oppose the united community of Muslims.<a href=\"#_ftn78\" name=\"_ftnref78\">[78]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نُكَفِّرُ أَحَدًا مِنْ أَهْلِ الْقِبْلَةِ بِذَنْبٍ مَا لَمْ يَسْتَحِلَّهُ وَلَا نَقُولُ لَا يَضُرُّ مَعَ الْإِيمَانِ ذَنْبٌ لِمَنْ عَمِلَهُ<\/p>\n<p>We do not excommunicate anyone who prays toward Mecca due to a sin, as long as he does not claim it to be lawful, nor do we say sins do not harm the faith of those who commit them.<a href=\"#_ftn79\" name=\"_ftnref79\">[79]<\/a><\/p>\n<p style=\"text-align: right;\">وَنَرْجُو لِلْمُحْسِنِينَ مِنَ الْمُؤْمِنِينَ أَنْ يَعْفُوَ عَنْهُمْ وَيُدْخِلَهُمُ الْجَنَّةَ بِرَحْمَتِهِ وَلَا نَأْمَنُ عَلَيْهِمْ وَلَا نَشْهَدُ لَهُمْ بِالْجَنَّةِ وَنَسْتَغْفِرُ لِمُسِيئِيهِمْ وَنَخَافُ عَلَيْهِمْ وَلَا نُقَنِّطُهُمْ<\/p>\n<p>We hope that Allah will pardon the good-doers among the believers and admit them into Paradise by His mercy.<a href=\"#_ftn80\" name=\"_ftnref80\">[80]<\/a> We cannot guarantee it for them and we cannot testify that they will be in Paradise. We seek forgiveness for the sinful, we fear for them, yet we do not despair over them.<a href=\"#_ftn81\" name=\"_ftnref81\">[81]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْأَمْنُ وَالْإِيَاسُ يَنْقُلَانِ عَنْ مِلَّةِ الْإِسْلَامِ وَسَبِيلُ الْحَقِّ بَيْنَهُمَا لِأَهْلِ الْقِبْلَةِ<\/p>\n<p>Guarantee or despair (of entering Paradise) both remove one from the religion of Islam.<a href=\"#_ftn82\" name=\"_ftnref82\">[82]<\/a> The way of truth is between them both regarding the people who pray towards Mecca.<\/p>\n<p style=\"text-align: right;\">وَلَا يَخْرُجُ الْعَبْدُ مِنَ الْإِيمَانِ إِلَّا بِجُحُودِ مَا أَدْخَلَهُ فِيهِ<\/p>\n<p>No servant is expelled from the faith except by disavowing what made him enter into it.<a href=\"#_ftn83\" name=\"_ftnref83\">[83]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الإيمان قول وعمل<br \/>\n<\/strong><strong>Faith is words and deeds<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْإِيمَانُ هُوَ الْإِقْرَارُ بِاللِّسَانِ وَالتَّصْدِيقُ بِالْجَنَانِ<\/p>\n<p>Faith consists of affirmation by the tongue and acceptance by the soul.<a href=\"#_ftn84\" name=\"_ftnref84\">[84]<\/a><\/p>\n<p style=\"text-align: right;\">وَجَمِيعُ مَا صَحَّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَ الشَّرْعِ وَالْبَيَانِ كُلُّهُ حَقٌّ<\/p>\n<p>All of what is authentic from the Messenger of Allah, peace and blessings be upon him, of the Law and clear teachings are true.<a href=\"#_ftn85\" name=\"_ftnref85\">[85]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْإِيمَانُ وَاحِدٌ وَأَهْلُهُ فِي أَصْلِهِ سَوَاءٌ وَالتَّفَاضُلُ بَيْنَهُمْ بِالْخَشْيَةِ وَالتُّقَى وَمُخَالِفَةِ الْهَوَى وَمُلَازِمَةِ الْأَوْلَى<\/p>\n<p>Faith is one and its people are equal by default. The virtue of some over others is due to the fear of Allah, righteousness, opposing lowly desires, and adherence to the most important matters.<a href=\"#_ftn86\" name=\"_ftnref86\">[86]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْمُؤْمِنُونَ كُلُّهُمْ أَوْلِيَاءُ الرَّحْمَنِ وَأَكْرَمُهُمْ عِنْدَ اللَّهِ أَطْوَعُهُمْ وَأَتْبَعُهُمْ لِلْقُرْآنِ<\/p>\n<p>All believers are allies of the Most Merciful and the noblest of them to Allah are those who are most obedient and who best adhere to the Quran.<a href=\"#_ftn87\" name=\"_ftnref87\">[87]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْإِيمَانُ هُوَ الْإِيمَانُ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَالْقَدَرِ خَيْرِهِ وَشَرِّهِ وَحُلْوِهِ وَمُرِّهِ مِنَ اللَّهِ تَعَالَى<\/p>\n<p>Faith consists of belief in Allah, His angels, His Books, His Messengers, the Last Day, and providence, its good and its evil. The pleasant and unpleasant are both from Allah Almighty.<a href=\"#_ftn88\" name=\"_ftnref88\">[88]<\/a><\/p>\n<p style=\"text-align: right;\">وَنَحْنُ مُؤْمِنُونَ بِذَلِكَ كُلِّهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَنُصَدِّقُهُمْ كُلَّهُمْ عَلَى مَا جَاءُوا بِهِ<\/p>\n<p>We have faith in all of that. We make no distinction between any of His Messengers. We accept all of them as true in what they brought.<a href=\"#_ftn89\" name=\"_ftnref89\">[89]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>أَهْلُ الْكَبَائِرِ<br \/>\n<\/strong><strong>Those who commit major sins<\/strong><\/p>\n<p style=\"text-align: right;\">وَأَهْلُ الْكَبَائِرِ مِنْ أُمَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّارِ لَا يُخَلَّدُونَ إِذَا مَاتُوا وَهُمْ مُوَحِّدُونَ وَإِنْ لَمْ يَكُونُوا تَائِبِينَ بَعْدَ أَنْ لَقُوا اللَّهَ عَارِفِينَ وَهُمْ فِي مَشِيئَتِهِ وَحُكْمِهِ إِنْ شَاءَ غَفَرَ لَهُمْ وَعَفَا عَنْهُمْ بِفَضْلِهِ كَمَا ذَكَرَ عَزَّ وَجَلَّ فِي كِتَابِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ<\/p>\n<p>Those who commit major sins among the nation of Muhammad, peace and blessings be upon him, may be in Hellfire but will not reside there forever, if they die while they are monotheists, even if they have not repented.<a href=\"#_ftn90\" name=\"_ftnref90\">[90]<\/a> After they meet Allah knowing faith, they are subject to His will and His judgment. If He wills, He will forgive them and pardon them by His grace, as mentioned by the Almighty in His book, ‘He forgives whatever is less than idolatry for whomever He wills.’<a href=\"#_ftn91\" name=\"_ftnref91\">[91]<\/a><\/p>\n<p style=\"text-align: right;\">وَإِنْ شَاءَ عَذَّبَهُمْ فِي النَّارِ بِعَدْلِهِ ثُمَّ يُخْرِجُهُمْ مِنْهَا بِرَحْمَتِهِ وَشَفَاعَةِ الشَّافِعِينَ مِنْ أَهْلِ طَاعَتِهِ ثُمَّ يَبْعَثُهُمْ إِلَى جَنَّتِهِ وَذَلِكَ بِأَنَّ اللَّهَ تَعَالَى تَوَلَّى أَهْلَ مَعْرِفَتِهِ وَلَمْ يَجْعَلْهُمْ فِي الدَّارَيْنِ كَأَهْلِ نَكَرَتِهِ الَّذِينَ خَابُوا مِنْ هِدَايَتِهِ وَلَمْ يَنَالُوا مِنْ وِلَايَتِهِ اللَّهُمَّ يَا وَلِيَّ الْإِسْلَامِ وَأَهْلِهِ ثَبِّتْنَا عَلَى الْإِسْلَامِ حَتَّى نَلْقَاكَ بِهِ<\/p>\n<p>If He wills, He will punish them in Hellfire by His justice.<a href=\"#_ftn92\" name=\"_ftnref92\">[92]<\/a> Thereafter, He will bring them out of Hellfire by His mercy and the intercession of intercessors among those obedient to Him, then raise them to Paradise.<a href=\"#_ftn93\" name=\"_ftnref93\">[93]<\/a> This is because Allah Almighty is the ally of those who recognize Him and He will not deal with them in the two abodes as if they were the people who rejected Him, who failed to follow His guidance and did not earn His guardianship.<a href=\"#_ftn94\" name=\"_ftnref94\">[94]<\/a> O Allah, Guardian of Islam and its people, keep us firmly upon Islam until we meet You.<a href=\"#_ftn95\" name=\"_ftnref95\">[95]<\/a><\/p>\n<p style=\"text-align: right;\">وَنَرَى الصَّلَاةَ خَلْفَ كُلِّ بَرٍّ وَفَاجِرٍ مِنْ أَهْلِ الْقِبْلَةِ وَعَلَى مَنْ مَاتَ مِنْهُمْ<\/p>\n<p>We perform prayer behind every Imam who prays towards Mecca, whether righteous or wicked, as well as the funeral prayer over those who have died.<a href=\"#_ftn96\" name=\"_ftnref96\">[96]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نُنْزِلُ أَحَدًا مِنْهُمْ جَنَّةً وَلَا نَارً اوَلَا نَشْهَدُ عَلَيْهِمْ بِكُفْرٍ وَلَا بِشِرْكٍ أَهْلُ الْقِبْلَةِ لَا يُكَفَّرُونَ وَلَا بِنِفَاقٍ مَا لَمْ يَظْهَرْ مِنْهُمْ شَيْءٌ مِنْ ذَلِكَ وَنَذَرُ سَرَائِرَهُمْ إِلَى اللَّهِ تَعَالَى<\/p>\n<p>We do not declare any of them to be in Paradise or Hellfire.<a href=\"#_ftn97\" name=\"_ftnref97\">[97]<\/a> We do not accuse them of unbelief, nor idolatry.<a href=\"#_ftn98\" name=\"_ftnref98\">[98]<\/a> The people who pray towards Mecca are not excommunicated, nor accused of hypocrisy, as long as they have not openly demonstrated anything of that. We leave their inner secrets to Allah Almighty.<a href=\"#_ftn99\" name=\"_ftnref99\">[99]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نَرَى السَّيْفَ عَلَى أَحَدٍ مِنْ أُمَّةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مَنْ وَجَبَ عَلَيْهِ السَّيْفُ<\/p>\n<p>We do not raise the sword against anyone from the nation of Muhammad, peace and blessings be upon him, except against those whom it is necessary to fight [such as violent rebels and criminals].<a href=\"#_ftn100\" name=\"_ftnref100\">[100]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَا نَرَى الْخُرُوجَ عَلَى أَئِمَّتِنَا وَوُلَاةِ أُمُورِنَا وَإِنْ جَارُوا وَلَا نَدْعُو عَلَيْهِمْ وَلَا نَنْزِعُ يَدًا مِنْ طَاعَتِهِمْ وَنَرَى طَاعَتَهُمْ مِنْ طَاعَةِ اللَّهِ عَزَّ وَجَلَّ فَرِيضَةً مَا لَمْ يَأْمُرُوا بِمَعْصِيَةٍ وَنَدْعُو لَهُمْ بِالصَّلَاحِ وَالْمُعَافَاةِ<\/p>\n<p>We do not rebel against our leaders or those in charge of our affairs, even if they are tyrannical.<a href=\"#_ftn101\" name=\"_ftnref101\">[101]<\/a> We do not supplicate against them, nor withdraw from obedience to them.<a href=\"#_ftn102\" name=\"_ftnref102\">[102]<\/a> We view obedience to them as obedience to Allah Almighty, an obligation, as long as they do not order disobedience to Allah.<a href=\"#_ftn103\" name=\"_ftnref103\">[103]<\/a> We supplicate on their behalf for righteousness and wellness.<a href=\"#_ftn104\" name=\"_ftnref104\">[104]<\/a><\/p>\n<p style=\"text-align: right;\">وَنَتَّبِعُ السُّنَّةَ وَالْجَمَاعَةَ الِالْتِزَامُ بِالسُّنَّةِ وَالْجَمَاعَةِ وَنَجْتَنِبُ الشُّذُوذَ وَالْخِلَافَ وَالْفُرْقَةَ<\/p>\n<p>We follow the Sunnah and the majority community, committed to the Sunnah and the majority community. We avoid anomalous opinions, differences, and sectarianism.<a href=\"#_ftn105\" name=\"_ftnref105\">[105]<\/a><\/p>\n<p style=\"text-align: right;\">وَنُحِبُّ أَهْلَ الْعَدْلِ وَالْأَمَانَةِ حُبُّ أَهْلِ الْعَدْلِ مِنْ كَمَالِ الْإِيمَانِ وَنُبْغِضُ أَهْلَ الْجَوْرِ وَالْخِيَانَةِ<\/p>\n<p>We love the people of justice and trustworthiness, for love of the people of justice is among the perfection of faith. We hate the people of injustice and treachery.<a href=\"#_ftn106\" name=\"_ftnref106\">[106]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>المسح على الخفين في السفر والحضر<br \/>\n<\/strong><strong>Wiping over leather socks during travel or residency<\/strong><\/p>\n<p style=\"text-align: right;\">وَنَقُولُ اللَّهُ أَعْلَمُ فِيمَا اشْتَبَهَ عَلَيْنَا عِلْمُهُ<\/p>\n<p>We say, ‘Allah knows best,’ regarding matters the knowledge of which is unclear to us.<a href=\"#_ftn107\" name=\"_ftnref107\">[107]<\/a><\/p>\n<p style=\"text-align: right;\">وَنَرَى الْمَسْحَ عَلَى الْخُفَّيْنِ فِي السَّفَرِ وَالْحَضَرِ كَمَا جَاءَ فِي الْأَثَرِ<\/p>\n<p>We accept wiping over leather socks in ablution, for the traveler and the resident, as has come in the narrations.<a href=\"#_ftn108\" name=\"_ftnref108\">[108]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الحج والجهاد ماضيان إلى قيام الساعة<br \/>\n<\/strong><strong>Hajj pilgrimage and jihad will continue until the establishment of the Hour<\/strong><\/p>\n<p style=\"text-align: right;\">وَالْحَجُّ وَالْجِهَادُ مَاضِيَانِ مَعَ أُولِي الْأَمْرِ مِنَ الْمُسْلِمِينَ بَرِّهِمْ وَفَاجِرِهِمْ إِلَى قِيَامِ السَّاعَةِ لَا يُبْطِلُهُمَا شَيْءٌ وَلَا يَنْقُضُهُمَا<\/p>\n<p>Hajj pilgrimage and jihad in the way of Allah are continuous, under those with authority among the Muslims, the righteous and wicked among them, until the establishment of the Hour. Nothing invalidates or rescinds them.<a href=\"#_ftn109\" name=\"_ftnref109\">[109]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الإيمان بالملائكة<br \/>\n<\/strong><strong>Faith in the angels<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِالْكِرَامِ الْكَاتِبِينَ فَإِنَّ اللَّهَ قَدْ جَعَلَهُمْ عَلَيْنَا حَافِظِينَ<\/p>\n<p>We have faith in the noble recording angels, for Allah has appointed them over us as guardians.<a href=\"#_ftn110\" name=\"_ftnref110\">[110]<\/a><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِمَلَكِ الْمَوْتِ الْمُوَكَّلِ بِقَبْضِ أَرْوَاحِ الْعَالَمِينَ<\/p>\n<p>We have faith in the angel of death charged with seizing the souls of those in the worlds.<a href=\"#_ftn111\" name=\"_ftnref111\">[111]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>عَذَابُ الْقَبْرِ وَنَعِيمُهُ<br \/>\n<\/strong><strong>Punishment in the grave and its blessings<\/strong><\/p>\n<p style=\"text-align: right;\">وَبِعَذَابِ الْقَبْرِ لِمَنْ كَانَ لَهُ أَهْلًا وَسُؤَالِ مُنْكَرٍ وَنَكِيرٍ فِي قَبْرِهِ عَنْ رَبِّهِ وَدِينِهِ وَنَبِيِّهِ عَلَى مَا جَاءَتْ بِهِ الْأَخْبَارُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَنِ الصَّحَابَةِ رِضْوَانُ اللَّهِ عَلَيْهِمْ<\/p>\n<p>We have faith in the punishment of the grave for those who deserve it and the questioning in the grave by the two angels, Munkar and Nakir, about one’s Lord, religion, and prophet, as has come in reports from the Messenger of Allah, peace and blessings be upon him, and from the companions, may Allah be pleased with them.<a href=\"#_ftn112\" name=\"_ftnref112\">[112]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْقَبْرُ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النِّيرَانِ<\/p>\n<p>The grave is either one of the meadows of Paradise or one of the pits of Hellfire.<a href=\"#_ftn113\" name=\"_ftnref113\">[113]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الإيمان باليوم الآخر<br \/>\n<\/strong><strong>Faith in the Last Day<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِالْبَعْثِ وَجَزَاءِ الْأَعْمَالِ يَوْمَ الْقِيَامَةِ وَالْعَرْضِ وَالْحِسَابِ وَقِرَاءَةِ الْكِتَابِ وَالثَّوَابِ وَالْعِقَابِ وَالصِّرَاطِ وَالْمِيزَانِ<\/p>\n<p>We have faith in the Resurrection and the recompense for actions on the Day of Resurrection, the presentation of deeds, the reckoning, and the reading of the book of deeds, the reward and punishment, the Bridge over Hell (<em>al-sirat<\/em>),<a href=\"#_ftn114\" name=\"_ftnref114\">[114]<\/a> and the Scale (<em>al-mizan<\/em>).<a href=\"#_ftn115\" name=\"_ftnref115\">[115]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْجَنَّةُ وَالنَّارُ مَخْلُوقَتَانِ لَا تَفْنَيَانِ أَبَدًا وَلَا تَبِيدَانِ فَإِنَّ اللَّهَ تَعَالَى خَلَقَ الْجَنَّةَ وَالنَّارَ قَبْلَ الْخَلْقِ وَخَلَقَ لَهُمَا أَهْلًا فَمَنْ شَاءَ مِنْهُمْ إِلَى الْجَنَّةِ فَضْلًا مِنْهُ وَمَنْ شَاءَ مِنْهُمْ إِلَى النَّارِ عَدْلًا مِنْهُ وَكُلٌّ يَعْمَلُ لِمَا قَدْ فُرِغَ لَهُ وَصَائِرٌ إِلَى مَا خُلِقَ لَهُ<\/p>\n<p>Paradise and Hellfire are two creations that never end, nor perish.<a href=\"#_ftn116\" name=\"_ftnref116\">[116]<\/a> For Allah Almighty created Paradise and Hellfire before the rest of creation, then He created people for them.<a href=\"#_ftn117\" name=\"_ftnref117\">[117]<\/a> Whoever He wills enters Paradise due to His grace, and whoever He wills enters Hellfire due to His justice.<a href=\"#_ftn118\" name=\"_ftnref118\">[118]<\/a> Everyone acts in accordance with what is decreed for him, becoming that for which he was created.<a href=\"#_ftn119\" name=\"_ftnref119\">[119]<\/a><\/p>\n<p style=\"text-align: right;\">وَالْخَيْرُ وَالشَّرُّ مُقَدَّرَانِ عَلَى الْعِبَادِ<\/p>\n<p>Good and evil have both been decreed for the servants.<a href=\"#_ftn120\" name=\"_ftnref120\">[120]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الِاسْتِطَاعَةُ تَكُونُ مَعَ الْفِعْلِ<br \/>\n<\/strong><strong>Ability is accompanied by deeds<\/strong><\/p>\n<p style=\"text-align: right;\">وَالِاسْتِطَاعَةُ الَّتِي يَجِبُ بِهَا الْفِعْلُ مِنْ نَحْوِ التَّوْفِيقِ الَّذِي لَا يُوصَفُ الْمَخْلُوقُ بِهِ تَكُونُ مَعَ الْفِعْلِ وَأَمَّا الِاسْتِطَاعَةُ مِنْ جِهَةِ الصِّحَّةِ وَالْوُسْعِ وَالتَّمْكِينِ وَسَلَامَةِ الْآلَاتِ فَهِيَ قَبْلَ الْفِعْلِ وَبِهَا يَتَعَلَّقُ الْخِطَابُ وَهُوَ كَمَا قَالَ تَعَالَى<strong> لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا<\/strong><\/p>\n<p>The ability required for an action is from divine facilitation, which cannot be ascribed to a created being, along with the action itself.<a href=\"#_ftn121\" name=\"_ftnref121\">[121]<\/a> As for ability from the view of health, capacity, capability, and sound means, it is before the action itself, and what is related to these are addressed, as it was said by the Exalted, ‘Allah holds no soul responsible except within its capacity.’<a href=\"#_ftn122\" name=\"_ftnref122\">[122]<\/a><\/p>\n<p style=\"text-align: right;\">وَأَفْعَالُ الْعِبَادِ خَلْقُ اللَّهِ وَكَسْبٌ مِنَ الْعِبَادِ<\/p>\n<p>The actions of the servants are creations of Allah and are earned by the servants.<a href=\"#_ftn123\" name=\"_ftnref123\">[123]<\/a><\/p>\n<p style=\"text-align: right;\">وَلَمْ يُكَلِّفْهُمُ اللَّهُ تَعَالَى إِلَّا مَا يُطِيقُونَ وَلَا يُطِيقُونَ إِلَّا مَا كَلَّفَهُمْ وَهُوَ تَفْسِيرُ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ<\/p>\n<p>Allah Almighty does not hold them responsible unless they are capable, and they are not capable except for what they are responsible.<a href=\"#_ftn124\" name=\"_ftnref124\">[124]<\/a> It is the explanation of the phrase, ‘There is no movement or might but by Allah.’<a href=\"#_ftn125\" name=\"_ftnref125\">[125]<\/a><\/p>\n<p style=\"text-align: right;\">نَقُولُ لَا حِيلَةَ لِأَحَدٍ وَلَا تَحَوُّلَ لِأَحَدٍ وَلَا حَرَكَةَ لِأَحَدٍ عَنْ مَعْصِيَةِ اللَّهِ إِلَّا بِمَعُونَةِ اللَّهِ وَلَا قُوَّةَ لِأَحَدٍ عَلَى إِقَامَةِ طَاعَةِ اللَّهِ وَالثَّبَاتِ عَلَيْهَا إِلَّا بِتَوْفِيقِ اللَّهِ<\/p>\n<p>We say there is no stratagem of anyone, nor transformation of anyone, nor movement of anyone in disobedience to Allah except by enablement from Allah. None has the power to perform obedience to Allah and be firm upon it except by the facilitation of Allah.<a href=\"#_ftn126\" name=\"_ftnref126\">[126]<\/a><\/p>\n<p style=\"text-align: right;\">وَكُلُّ شَيْءٍ يَجْرِي بِمَشِيئَةِ اللَّهِ تَعَالَى وَعِلْمِهِ وَقَضَائِهِ وَقَدَرِهِ غَلَبَتْ مَشِيئَتُهُ الْمَشِيئَاتِ كُلَّهَا وَغَلَبَ قَضَاؤُهُ الْحِيَلَ كُلَّهَا يَفْعَلُ مَا يَشَاءُ وَهُوَ غَيْرُ ظَالِمٍ أَبَدًا لَا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ<\/p>\n<p>All things occur by the will of Allah the Exalted, His knowledge, His decree, and His providence.<a href=\"#_ftn127\" name=\"_ftnref127\">[127]<\/a> His will overpowers all other wills, and His decree overpowers all other stratagems.<a href=\"#_ftn128\" name=\"_ftnref128\">[128]<\/a> He does whatever He wills, and He is never unjust,<a href=\"#_ftn129\" name=\"_ftnref129\">[129]<\/a> ‘He will not be questioned about what He does, but they will be questioned.’<a href=\"#_ftn130\" name=\"_ftnref130\">[130]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>اسْتِجَابَةُ اللَّهِ الدُّعَاءَ<br \/>\n<\/strong><strong>Allah answers supplication<\/strong><\/p>\n<p style=\"text-align: right;\">وَفِي دُعَاءِ الْأَحْيَاءِ وَصَدَقَاتِهِمْ مَنْفَعَةٌ لِلْأَمْوَاتِ<\/p>\n<p>In the supplication of the living and their acts of charity are benefits for the dead.<a href=\"#_ftn131\" name=\"_ftnref131\">[131]<\/a><\/p>\n<p style=\"text-align: right;\">وَاللَّهُ تَعَالَى يَسْتَجِيبُ الدَّعَوَاتِ وَيَقْضِي الْحَاجَاتِ<\/p>\n<p>Allah Almighty responds to supplications and fulfills needs.<a href=\"#_ftn132\" name=\"_ftnref132\">[132]<\/a><\/p>\n<p style=\"text-align: right;\">وَيَمْلِكُ كُلَّ شَيْءٍ وَلَا يَمْلِكُهُ شَيْءٌ وَلَا غِنَى عَنِ اللَّهِ تَعَالَى طَرْفَةَ عَيْنٍ وَمَنِ اسْتَغْنَى عَنِ اللَّهِ طَرْفَةَ عَيْنٍ فَقَدْ كَفَرَ وَصَارَ مِنْ أَهْلِ الْحَيْنِ<\/p>\n<p>He controls all things and nothing has any control over Him.<a href=\"#_ftn133\" name=\"_ftnref133\">[133]<\/a> None can be independent of Allah for as much as the blink of an eye. Whoever considers himself independent of Allah for as much as the blink of an eye has committed unbelief and has become among of the people of perdition.<a href=\"#_ftn134\" name=\"_ftnref134\">[134]<\/a><\/p>\n<p style=\"text-align: right;\">وَاللَّهُ يَغْضَبُ وَيَرْضَى لَا كَأَحَدٍ مِنَ الْوَرَى<\/p>\n<p>Allah is angered and pleased, yet not like anyone else besides Him.<a href=\"#_ftn135\" name=\"_ftnref135\">[135]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الثَّنَاءُ عَلَى الصَّحَابَةِ<br \/>\n<\/strong><strong>Praise for the Companions<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُحِبُّ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نُفَرِّطُ فِي حُبِّ أَحَدٍ مِنْهُمْ وَلَا نَتَبَرَّأُ مِنْ أَحَدٍ مِنْهُمْ وَنُبْغِضُ مَنْ يُبْغِضُهُمْ وَبِغَيْرِ الْخَيْرِ يَذْكُرُهُمْ وَلَا نَذْكُرُهُمْ إِلَّا بِخَيْرٍ وَحُبُّهُمْ دِينٌ وَإِيمَانٌ وَإِحْسَانٌ وَبُغْضُهُمْ كُفْرٌ وَنِفَاقٌ وَطُغْيَانٌ<\/p>\n<p>We love the companions of the Messenger of Allah, peace and blessings be upon him. We do not exaggerate in our love for any of them, nor do we disown any of them.<a href=\"#_ftn136\" name=\"_ftnref136\">[136]<\/a> We hate those who hate them or who mention them without good, for we do not mention them except with good.<a href=\"#_ftn137\" name=\"_ftnref137\">[137]<\/a> Love for them is a part of religion, faith, and spiritual excellence, and hatred for them is unbelief, hypocrisy, and transgression.<a href=\"#_ftn138\" name=\"_ftnref138\">[138]<\/a><\/p>\n<p style=\"text-align: right;\">وَنُثْبِتُ الْخِلَافَةَ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلًا لِأَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ تَفْضِيلًا لَهُ وَتَقْدِيمًا عَلَى جَمِيعِ الْأُمَّةِ ثُمَّ لِعُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ ثُمَّ لِعُثْمَانَ رَضِيَ اللَّهُ عَنْهُ ثُمَّ لِعَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ وَهُمُ الْخُلَفَاءُ الرَّاشِدُونَ وَالْأَئِمَّةُ الْمَهْدِيُّونَ<\/p>\n<p>We affirm the Caliphate after the Messenger of Allah, peace and blessings be upon him, first went to Abu Bakr al-Ṣiddiq, may Allah be pleased with him, having virtue and priority over all others in the Muslim nation.<a href=\"#_ftn139\" name=\"_ftnref139\">[139]<\/a> Then, it was for ‘Umar ibn al-Khattab, may Allah be pleased with him.<a href=\"#_ftn140\" name=\"_ftnref140\">[140]<\/a> Then, it was for ‘Uthman, may Allah be pleased with him. Then, it was for ‘Ali ibn Abi Ṭalib, may Allah be pleased with him.<a href=\"#_ftn141\" name=\"_ftnref141\">[141]<\/a> They are the righteous Caliphs and guided leaders.<\/p>\n<p style=\"text-align: right;\">وَأَنَّ الْعَشَرَةَ الَّذِينَ سَمَّاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَشَّرَهُمْ بِالْجَنَّةِ نَشْهَدُ لَهُمْ بِالْجَنَّةِ عَلَى مَا شَهِدَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَوْلُهُ الْحَقُّ وَهُمْ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَطَلْحَةُ وَالزُّبَيْرُ وَسَعْدٌ وَسَعِيدٌ وَعَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ وَأَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ وَهُوَ أَمِينُ هَذِهِ الْأُمَّةِ رَضِيَ اللَّهُ عَنْهُمْ أَجْمَعِينَ<\/p>\n<p>The ten who were named by the Messenger of Allah, peace and blessings be upon him, as being promised with Paradise, we testify that they are in Paradise due to what was testified for them by the Messenger of Allah, peace and blessings be upon him, and his statements are true. They are Abu Bakr, ‘Umar, ‘Uthman, ‘Ali, Talhah, Al-Zubayr, Sa’d, Sa’id, ‘Abd al-Raḥmān ibn ‘Awf, and Abu ‘Ubaydah ibn Al-Jarraḥ who was the trustee of this nation, may Allah be pleased with them all.<a href=\"#_ftn142\" name=\"_ftnref142\">[142]<\/a><\/p>\n<p style=\"text-align: right;\">وَمَنْ أَحْسَنَ الْقَوْلَ فِي أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَزْوَاجِهِ الطَّاهِرَاتِ مِنْ كُلِّ دَنَسٍ وَذُرِّيَّاتِهِ الْمُقَدَّسِينَ مِنْ كُلِّ رِجْسٍ فَقَدَ بَرِئَ مِنَ النِّفَاقِ<\/p>\n<p>Whoever speaks well of the companions of the Messenger of Allah, peace and blessings be upon him, and his wives, pure of any defilement, and his sanctified progeny, he is innocent of any hypocrisy.<a href=\"#_ftn143\" name=\"_ftnref143\">[143]<\/a><\/p>\n<p style=\"text-align: right;\">وَعُلَمَاءُ السَّلَفِ مِنَ السَّابِقِينَ وَمَنْ بَعْدَهُمْ مِنَ التَّابِعِينَ أَهْلِ الْخَيْرِ وَالْأَثَرِ وَأَهْلِ الْفِقْهِ وَالنَّظَرِ لَا يُذْكَرُونَ إِلَّا بِالْجَمِيلِ وَمَنْ ذَكَرَهُمْ بِسُوءٍ فَهُوَ عَلَى غَيْرِ السَّبِيلِ<\/p>\n<p>The scholars of the first generation who preceded us and those after them among the successors, the people of virtue, tradition, understanding, and insight, they are not mentioned but in a gracious way.<a href=\"#_ftn144\" name=\"_ftnref144\">[144]<\/a> Whoever mentions them in an evil way, he is on a path different from their path.<a href=\"#_ftn145\" name=\"_ftnref145\">[145]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>لَا يُفَضَّلُ الْأَوْلِيَاءُ عَلَى الْأَنْبِيَاءِ<br \/>\n<\/strong><strong>No virtue of the saints over the prophets<\/strong><\/p>\n<p style=\"text-align: right;\">وَلَا نُفَضِّلُ أَحَدًا مِنَ الْأَوْلِيَاءِ عَلَى أَحَدٍ مِنَ الْأَنْبِيَاءِ عَلَيْهِمُ السَّلَامُ وَنَقُولُ نَبِيٌّ وَاحِدٌ أَفْضَلُ مِنْ جَمِيعِ الْأَوْلِيَاءِ<\/p>\n<p>We do not prefer any of the saints of this nation over any of the prophets, upon them be peace. We say that a single prophet is better than all the saints put together.<a href=\"#_ftn146\" name=\"_ftnref146\">[146]<\/a><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِمَا جَاءَ مِنْ كَرَامَاتِهِمْ وَصَحَّ عَنِ الثِّقَاتِ مِنْ رِوَايَاتِهِمْ<\/p>\n<p>We have faith in what has come of their miracles and what has been authenticated in their narrations from trustworthy narrators.<a href=\"#_ftn147\" name=\"_ftnref147\">[147]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْإِيمَانُ بِأَشْرَاطِ السَّاعَةِ<br \/>\n<\/strong><strong>Faith in the signs of the Hour<\/strong><\/p>\n<p style=\"text-align: right;\">وَنُؤْمِنُ بِأَشْرَاطِ السَّاعَةِ مِنْ خُرُوجِ الدَّجَّالِ وَنُزُولِ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ السَّلَامُ مِنَ السَّمَاءِ وَنُؤْمِنُ بِطُلُوعِ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجِ دَابَّةِ الْأَرْضِ مِنْ مَوْضِعِهَا<\/p>\n<p>We have faith in the signs of the Hour, such as the appearance of the False Messiah (<em>al-Dajjal<\/em>),<a href=\"#_ftn148\" name=\"_ftnref148\">[148]<\/a> and the descent from the heavens of Jesus the son of Mary, upon him be peace.<a href=\"#_ftn149\" name=\"_ftnref149\">[149]<\/a> We have faith in the rising of the sun from the West<a href=\"#_ftn150\" name=\"_ftnref150\">[150]<\/a> and in the emergence of the Beast from its place in the earth.<a href=\"#_ftn151\" name=\"_ftnref151\">[151]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>كَذَبَ الْكَاهِنُ وَالْعَرَّافُ<br \/>\n<\/strong><strong>Falsehood of soothsayers and fortunetellers<\/strong><\/p>\n<p style=\"text-align: right;\">وَلَا نُصَدِّقُ كَاهِنًا وَلَا عَرَّافًا وَلَا مَنْ يَدَّعِي شَيْئًا يُخَالِفُ الْكِتَابَ وَالسُّنَّةَ وَإِجْمَاعَ الْأُمَّةِ<\/p>\n<p>We do not believe in soothsayers and fortunetellers, nor whoever claims anything against the Book, the Sunnah, and the consensus of the Muslim nation.<a href=\"#_ftn152\" name=\"_ftnref152\">[152]<\/a><\/p>\n<p style=\"text-align: center;\"><strong>الْجَمَاعَةُ حُقٌّ وَالْفُرْقَةُ زَيْغٌ<br \/>\n<\/strong><strong>Unity upon the truth and the deviation of sectarianism<\/strong><\/p>\n<p style=\"text-align: right;\">وَنَرَى الْجَمَاعَةَ حَقًّا وَصَوَابًا وَالْفُرْقَةَ زَيْغًا وَعَذَابًا<\/p>\n<p>We regard unity as truth and what is right, and sectarianism as deviation and punishment.<a href=\"#_ftn153\" name=\"_ftnref153\">[153]<\/a><\/p>\n<p style=\"text-align: right;\">وَدِينُ اللَّهِ فِي الْأَرْضِ وَالسَّمَاءِ وَاحِدٌ وَهُوَ دِينُ الْإِسْلَامِ قَالَ اللَّهُ تَعَالَى إِنَّ الدِّينَ عِنْدَ اللَّهِ الْإِسْلَامُ وَقَالَ تَعَالَى وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا وَهُوَ بَيْنَ الْغُلُوِّ وَ التَّقْصِيرِ وَبَيْنَ التَّشْبِيهِ وَالتَّعْطِيلِ وَبَيْنَ الْجَبْرِ وَالْقَدَرِ وَبَيْنَ الْأَمْنِ وَالْإِيَاسِ<\/p>\n<p>The religion of Allah on earth and in the heavens is one, and it is the religion of Islam. Allah Almighty said, ‘Verily, the religion with Allah is Islam,’<a href=\"#_ftn154\" name=\"_ftnref154\">[154]<\/a> And the Almighty said, ‘I am pleased with Islam as your religion.’<a href=\"#_ftn155\" name=\"_ftnref155\">[155]<\/a> It is between exaggeration and belittlement, between comparing the Attributes of Allah to creation and negating them, between fatalism and unrestricted free will, and between guarantee and despair.<a href=\"#_ftn156\" name=\"_ftnref156\">[156]<\/a><\/p>\n<p style=\"text-align: right;\">فَهَذَا دِينُنَا وَاعْتِقَادُنَا ظَاهِرًا وَبَاطِنًا وَنَحْنُ بَرَاءٌ إِلَى اللَّهِ تَعَالَى مِنْ كُلِّ مَنْ خَالَفَ الَّذِي ذَكَرْنَاهُ وَبَيَّنَّاهُ وَنَسْأَلُ اللَّهَ تَعَالَى أَنْ يُثَبِّتَنَا عَلَى الْإِيمَانِ وَيَخْتِمَ لَنَا بِهِ وَيَعْصِمَنَا مِنَ الْأَهْوَاءِ الْمُخْتَلِفَةِ وَالْآرَاءِ الْمُتَفَرِّقَةِ وَالْمَذَاهِبِ الرَّدِيَّةِ مِثْلِ الْمُشَبِّهَةِ وَالْمُعْتَزِلَةِ وَالْجَهْمِيَّةِ وَالْجَبْرِيَّةِ وَالْقَدَرِيَّةِ وَغَيْرِهِمْ مِنَ الَّذِينَ خَالَفُوا الْجَمَاعَةَ وَحَالَفُوا الضَّلَالَةَ وَنَحْنُ مِنْهُمْ بَرَاءٌ وَهُمْ عِنْدَنَا ضُلَّالٌ وَأَرْدِيَاءُ وَبِاللَّهِ الْعِصْمَةُ وَالتَّوْفِيقُ<\/p>\n<p>This is our religion and what we take as our creed, inwardly and outwardly. We disown before Allah Almighty all those who oppose what we have mentioned and clarified. We ask Allah the Exalted to keep us firm upon faith, seal our lives with it, and to protect us from various desires, sectarian opinions, and the doctrines of rejection, such as anthropomorphists (<em>al-Mushabbihah<\/em>),<a href=\"#_ftn157\" name=\"_ftnref157\">[157]<\/a> the rationalists (<em>al-Mu’tazilah<\/em>),<a href=\"#_ftn158\" name=\"_ftnref158\">[158]<\/a> those who deny the Attributes of Allah (<em>al-Jahmiyyah<\/em>),<a href=\"#_ftn159\" name=\"_ftnref159\">[159]<\/a> the fatalists (<em>al-Jabriyah<\/em>),<a href=\"#_ftn160\" name=\"_ftnref160\">[160]<\/a> the deniers of providence (<em>al-Qadariyah<\/em>),<a href=\"#_ftn161\" name=\"_ftnref161\">[161]<\/a> and others who oppose the united community and have made a pact of misguidance. We are innocent of them, for they are, to us, astray and ruined. And in Allah alone is protection and guidance.<\/p>\n<p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]<\/a> “There is nothing like unto Him, and He is the Hearing, the Seeing.” (Sūrat al-Shūrā 42:11)<\/p>\n<p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]<\/a> “We have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight.” (Sūrat al-Jinn 72:11)<\/p>\n<p><a href=\"#_ftnref3\" name=\"_ftn3\">[3]<\/a> “Your god is one God. There is nothing worthy of worship but Him, the Gracious, the Merciful.” (Sūrat al-Baqarah 2:163)<\/p>\n<p><a href=\"#_ftnref4\" name=\"_ftn4\">[4]<\/a> “He is the First and the Last, the Ascendant and the Intimate, for He knows all things.” (Sūrat al-Ḥadīd 57:3)<\/p>\n<p><a href=\"#_ftnref5\" name=\"_ftn5\">[5]<\/a> “Everything will perish but His Face.” (28:88)<\/p>\n<p><a href=\"#_ftnref6\" name=\"_ftn6\">[6]<\/a> “You do not will except that Allah wills. Verily, Allah is ever Knowing and Wise.” (Sūrat al-Insān 76:30)<\/p>\n<p><a href=\"#_ftnref7\" name=\"_ftn7\">[7]<\/a> “They encompass not a thing of His knowledge except for what He wills.” (Sūrat al-Baqarah 2:255)<\/p>\n<p><a href=\"#_ftnref8\" name=\"_ftn8\">[8]<\/a> “So do not assert similarities to Allah. Verily, Allah knows and you do not know.” (Sūrat al-Naḥl 16:74)<\/p>\n<p><a href=\"#_ftnref9\" name=\"_ftn9\">[9]<\/a> “Rely upon the Living who does not die, and exalt with His praise.” (Sūrat al-Furqān 25:58)<\/p>\n<p><a href=\"#_ftnref10\" name=\"_ftn10\">[10]<\/a> “If you should disbelieve, you and whoever is on the earth together, then Allah is still Independent and Praiseworthy.” (Sūrat Ibrāhīm 14:8)<\/p>\n<p><a href=\"#_ftnref11\" name=\"_ftn11\">[11]<\/a> “His command, when He intends a thing, is that He merely says to it, &#8216;Be,&#8217; and it is.” (Sūrat Yā Sīn 36:82)<\/p>\n<p><a href=\"#_ftnref12\" name=\"_ftn12\">[12]<\/a> “O Allah, you are the First, there is nothing before you. You are the Last, there is nothing after you. You are the Manifest, there is nothing above you. You are the Hidden, there is nothing beyond you.” (Ṣaḥīḥ Muslim 2713, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2018\/01\/29\/sleep-right-side-supplication-dua\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref13\" name=\"_ftn13\">[13]<\/a> “Allah is Independent, while you are in need.” (Sūrat Muḥammad 47:38)<\/p>\n<p><a href=\"#_ftnref14\" name=\"_ftn14\">[14]<\/a> Sūrat al-Shura 42:11.<\/p>\n<p><a href=\"#_ftnref15\" name=\"_ftn15\">[15]<\/a> “Does He who created not know, while He is the Subtle, the Aware?” (Sūrat al-Mulk 67:14)<\/p>\n<p><a href=\"#_ftnref16\" name=\"_ftn16\">[16]<\/a> “Verily, all things We created with measure (<em>qadr<\/em>).” (54:49)<\/p>\n<p><a href=\"#_ftnref17\" name=\"_ftn17\">[17]<\/a> “Allah does not respite a soul when its appointed term has come, for Allah is aware of what you do.” (Sūrat al-Munāfiqūn 63:11)<\/p>\n<p><a href=\"#_ftnref18\" name=\"_ftn18\">[18]<\/a> “Allah knows what is before them and what will be after them, but they do not encompass any of its knowledge.” (20:110)<\/p>\n<p><a href=\"#_ftnref19\" name=\"_ftn19\">[19]<\/a> “Say, ‘Obey Allah and the Messenger,’ but if they turn away, then Allah does not love the unbelievers.” (Sūrat Ali ‘Imrān 3:32)<\/p>\n<p><a href=\"#_ftnref20\" name=\"_ftn20\">[20]<\/a> “Allah is victorious in His affair, but most people do not know.” (Sūrat Yusuf 12:21)<\/p>\n<p><a href=\"#_ftnref21\" name=\"_ftn21\">[21]<\/a> “Allah sends astray whomever He wills and He guides to the Straight Path whomever He wills.” (Sūrat al-An’ām 6:39)<\/p>\n<p><a href=\"#_ftnref22\" name=\"_ftn22\">[22]<\/a> “Whatever strikes you of disaster, it is for what your hands have earned, yet He pardons much.” (Sūrat al-Shūrā 42:30)<\/p>\n<p><a href=\"#_ftnref23\" name=\"_ftn23\">[23]<\/a> “He punishes whomever He wills and He has mercy upon whomever He wills, and to Him you will be returned.” (Sūrat al-‘Ankabūt 29:21)<\/p>\n<p><a href=\"#_ftnref24\" name=\"_ftn24\">[24]<\/a> “There is no one worthy of worship but Him, the Almighty, the Wise.” (Sūrat Ali &#8216;Imran 3:6)<\/p>\n<p><a href=\"#_ftnref25\" name=\"_ftn25\">[25]<\/a> “So direct your face towards the upright religion before a Day comes from Allah which cannot be repelled.&#8221; (Sūrat al-Rūm 30:43)<\/p>\n<p><a href=\"#_ftnref26\" name=\"_ftn26\">[26]<\/a> “Those firm in knowledge say, ‘We believe in it. All of it is from our Lord.’” (Sūrat Ali &#8216;Imrān 3:7)<\/p>\n<p><a href=\"#_ftnref27\" name=\"_ftn27\">[27]<\/a> “Muhammad is the Messenger of Allah.” (Sūrat al-Fatḥ 48:29)<\/p>\n<p><a href=\"#_ftnref28\" name=\"_ftn28\">[28]<\/a> “Muhammad is not the father of any one of your men, but rather he is the Messenger of Allah and last of the prophets.” (Sūrat al-Aḥzāb 33:40)<\/p>\n<p><a href=\"#_ftnref29\" name=\"_ftn29\">[29]<\/a> “Verily, there will be thirty liars among my nation, all of them claiming to be a prophet, but I am the seal of the Prophets. There is no prophet after me.” (Sunan al-Tirmidhī 2219, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/05\/21\/signs-hour-idol-worship\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref30\" name=\"_ftn30\">[30]<\/a> “O people, I am the Messenger of Allah to you all, from Him to whom belongs the dominion of the heavens and the earth.” (Sūrat al-A&#8217;rāf 7:158)<\/p>\n<p><a href=\"#_ftnref31\" name=\"_ftn31\">[31]<\/a> “Verily, this is the word of a noble messenger, established in the presence of the Lord of the Throne.” (Sūrat al-Takwīr 81:19-20)<\/p>\n<p><a href=\"#_ftnref32\" name=\"_ftn32\">[32]<\/a> This refers to the principle of <em>bi l kayf<\/em>, i.e. not ascribing a definite form to matters of the Unseen.<\/p>\n<p><a href=\"#_ftnref33\" name=\"_ftn33\">[33]<\/a> “If the sea were ink for writing the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.” (Sūrat al-Kahf 18:109)<\/p>\n<p><a href=\"#_ftnref34\" name=\"_ftn34\">[34]<\/a> Sūrat al-Mudathir 74:26.<\/p>\n<p><a href=\"#_ftnref35\" name=\"_ftn35\">[35]<\/a> Sūrat al-Mudathir 74:25.<\/p>\n<p><a href=\"#_ftnref36\" name=\"_ftn36\">[36]<\/a> “Nor is there to Him any equivalent.” (Sūrat al-Ikhlāṣ 112:4)<\/p>\n<p><a href=\"#_ftnref37\" name=\"_ftn37\">[37]<\/a> Sūrat al-Qiyāmah 75:22-23.<\/p>\n<p><a href=\"#_ftnref38\" name=\"_ftn38\">[38]<\/a> Imam al-Shafi&#8217;i said, “I believe in what has come from Allah, upon what was intended by Allah. I believe in what has come from the Messenger of Allah, upon what was intended by the Messenger of Allah.” (Lum&#8217;at al-I&#8217;tiqād 1\/7)<\/p>\n<p><a href=\"#_ftnref39\" name=\"_ftn39\">[39]<\/a> “Verily, the religion to Allah is Islam (surrendering to His will).” (Sūrat Ali &#8216;Imrān 3:19)<\/p>\n<p><a href=\"#_ftnref40\" name=\"_ftn40\">[40]<\/a> “Allah knows but you do not know.” (Sūrat al-Baqarah 2:216)<\/p>\n<p><a href=\"#_ftnref41\" name=\"_ftn41\">[41]<\/a> “Whoever desires other than Islam as religion, it never will it be accepted from him, and he will lose in the Hereafter.” (Sūrat Ali &#8216;Imrān 3:85)<\/p>\n<p><a href=\"#_ftnref42\" name=\"_ftn42\">[42]<\/a> “O you who have faith, do not ask about things which, if they are shown to you, will distress you.” (Sūrat al-Mā&#8217;idah 5:101)<\/p>\n<p><a href=\"#_ftnref43\" name=\"_ftn43\">[43]<\/a> “Among people is he who worships Allah on an edge. If he is touched by good, he is reassured by it, but if he is struck by trial, he turns on his face.” (Sūrat al-Ḥajj 22:11)<\/p>\n<p><a href=\"#_ftnref44\" name=\"_ftn44\">[44]<\/a> “Verily, you will see your Lord just as you see this moon. There will be no crowd to block your vision.” (Ṣaḥīḥ al-Bukhārī 573, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/09\/vision-allah-full-moon-paradise\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref45\" name=\"_ftn45\">[45]<\/a> “&#8230;that we will not worship but Allah and not associate anything with Him and not take one another as lords besides Allah.” (Sūrat Ali &#8216;Imrān 3:64)<\/p>\n<p><a href=\"#_ftnref46\" name=\"_ftn46\">[46]<\/a> “Verily, your Lord is Allah who created the heavens and the earth in six days and then established Himself above the Throne, arranging the matter.” (Sūrat Yūnus 10:3)<\/p>\n<p><a href=\"#_ftnref47\" name=\"_ftn47\">[47]<\/a> “After the Prophet, peace and blessings be upon him, was miraculously taken by night to the furthest mosque in Jerusalem, the people began to talk about it. Some of them renounced their faith and belief in him. They sought Abu Bakr and they said, ‘Have you heard that your friend imagined he was taken by night to the sacred house?’ Abu Bakr said, &#8216;Did he say that?&#8217; They said yes. Abu Bakr said, ‘If he said it, he has spoken the truth.’ They said, ‘Do you believe he went by night to the sacred house and returned before morning?’ Abu Bakr said, ‘Yes. Verily, I believe what is even more astonishing than that. I believe he has received messages from heaven for everything he does.’ For this reason, Abu Bakr was named the Truthful, al-Siddiq.” (Dalā’il al-Nubuwwah lil-Bayhaqī 2\/361)<\/p>\n<p><a href=\"#_ftnref48\" name=\"_ftn48\">[48]<\/a> Sūrat al-Najm 53:11.<\/p>\n<p><a href=\"#_ftnref49\" name=\"_ftn49\">[49]<\/a> “I will precede you at the Fountain. Whoever arrives at it and drinks from it, he will never feel thirst ever again.” (Ṣaḥīḥ al-Bukhārī 7050, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/12\/hawd-never-thirsty-again\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref50\" name=\"_ftn50\">[50]<\/a> “My intercession is for the people of major sins among my nation.” (Sunan al-Tirmidhī 2435, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/11\/21\/the-prophet-intercedes-ummah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref51\" name=\"_ftn51\">[51]<\/a> “When your Lord took from the children of Adam their progeny, from their loins, and made them testify of themselves, saying, ‘Am I not your Lord?’ They said, ‘Yes, we have testified.’ Lest you should say on the Day of Resurrection, ‘Indeed, we were unaware of this.’” (Sūrat al-A&#8217;rāf 7:172)<\/p>\n<p><a href=\"#_ftnref52\" name=\"_ftn52\">[52]<\/a> “He has encompassed whatever is with them and has enumerated all things in number.” (Sūrat al-Jinn 72:28)<\/p>\n<p><a href=\"#_ftnref53\" name=\"_ftn53\">[53]<\/a> “Allah is not unaware of what you do.” (Sūrat al-Baqarah 2:140)<\/p>\n<p><a href=\"#_ftnref54\" name=\"_ftn54\">[54]<\/a> “As for one who fears Allah and gives charity, We will make easy for him the path of ease. As for one who is miserly and considers himself independent (of Allah) and denies the best (in the Hereafter), We will make easy for him the path of hardship.” (Sūrat al-Layl 92:5-10)<\/p>\n<p><a href=\"#_ftnref55\" name=\"_ftn55\">[55]<\/a> “Verily, deeds are only judged by how they were at the end of life.” (Ṣaḥīḥ al-Bukhārī 6607, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/25\/khawatim-determine-akhirah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref56\" name=\"_ftn56\">[56]<\/a> “He has the keys to the Unseen. None knows them but Him.&#8221; (Sūrat al-An&#8217;ām 6:59)<\/p>\n<p><a href=\"#_ftnref57\" name=\"_ftn57\">[57]<\/a> “If the divine decree is mentioned, be restrained.” (al-Mu’jam al-Kabīr 10302, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/04\/06\/silence-qadr-sahabah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref58\" name=\"_ftn58\">[58]<\/a> Sūrat al-Anbiyā’ 21:23.<\/p>\n<p><a href=\"#_ftnref59\" name=\"_ftn59\">[59]<\/a> “Whoever does not judge by what Allah has revealed, then they are among the disbelievers.&#8221; (Sūrat al-Mā&#8217;idah 5:44). Note: Whoever judges in contradiction to the Law due to mistaken interpretation or ignorance, it is a lesser form of unbelief that does not expel one from the religion. A man said to Ibn Abbas, “Has one who does this committed unbelief?” Ibn Abbas said, “It is a type of unbelief if he does that, but it is not like one who disbelieves in Allah, the Last Day, and so on.” (Tafsīr al-Ṭabarī 5:44)<\/p>\n<p><a href=\"#_ftnref60\" name=\"_ftn60\">[60]<\/a> “Or do you say about Allah that which you do not know?” (Sūrat al-Baqarah 2:80)<\/p>\n<p><a href=\"#_ftnref61\" name=\"_ftn61\">[61]<\/a> “He has remained silent upon matters as mercy for you, not out of forgetfulness, so do not search them out.” (Sunan al-Dāraquṭnī 4396,  <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/07\/03\/hudud-fard-limits\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref62\" name=\"_ftn62\">[62]<\/a> “This is an honored Quran, inscribed on a Preserved Tablet.” (Sūrat al-Burūj 85:21-22); “Verily, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear Register.” (Sūrat Yā Sīn 36:12)<\/p>\n<p><a href=\"#_ftnref63\" name=\"_ftn63\">[63]<\/a> “Know that if the nations gathered together to benefit you, they could not benefit you unless Allah has decreed it for you. And if the nations gathered together to harm you, they could not harm you unless Allah has decreed it for you. The pens have been lifted and the pages have dried.” (Sunan al-Tirmidhī 2516, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/29\/mindful-allah-he-will-protect-you\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref64\" name=\"_ftn64\">[64]<\/a> “If you were to spend the likes of mount Uhud in gold in the way of Allah, He would not accept it from you until you had faith in all of divine providence, such that you know what you acquire could never miss you, and what you missed you could never acquire, and that if you die upon something other than this, you will enter the Hellfire.” (Sunan Ibn Mājah 77, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/04\/26\/allah-never-wrong\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref65\" name=\"_ftn65\">[65]<\/a> “For every nation is a specified term. When their time has come, they will not be delayed for even an hour, nor will they precede it.” (Sūrat al-A&#8217;rāf 7:34)<\/p>\n<p><a href=\"#_ftnref66\" name=\"_ftn66\">[66]<\/a> Sūrat al-Furqān 25:2.<\/p>\n<p><a href=\"#_ftnref67\" name=\"_ftn67\">[67]<\/a> Sūrat al-Ahzāb 33:38.<\/p>\n<p><a href=\"#_ftnref68\" name=\"_ftn68\">[68]<\/a> The Messenger of Allah, peace and blessings be upon him, came to us while we were arguing about the divine decree. Then, the Prophet became angry until his face was red, as if a pomegranate were bursting from his cheeks. The Prophet said, “With this I have commanded you? With this I was sent to you? Verily, the people before you were destroyed when they argued over this matter. I am determined for you not to argue over it.” (Sunan al-Tirmidhī 2133, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/25\/qadr-arguing-divine-decree\/\"><em>Hasan<\/em><\/a>)<\/p>\n<p><a href=\"#_ftnref69\" name=\"_ftn69\">[69]<\/a> “His footstool extends over the heavens and the earth, and their preservation tires Him not, for He is the Most High, the Most Great.” (Sūrat al-Baqarah 2:255).<\/p>\n<p><a href=\"#_ftnref70\" name=\"_ftn70\">[70]<\/a> “Know that Allah is Independent and Praiseworthy.” (Sūrat al-Baqarah 2:267)<\/p>\n<p><a href=\"#_ftnref71\" name=\"_ftn71\">[71]<\/a> “To Allah belongs whatever is in the heavens and on the earth, for Allah ever encompasses all things.” (Sūrat al-Nisā 4:126)<\/p>\n<p><a href=\"#_ftnref72\" name=\"_ftn72\">[72]<\/a> “Allah took Abraham as an intimate friend.” (Sūrat al-Nisā 4:125)<\/p>\n<p><a href=\"#_ftnref73\" name=\"_ftn73\">[73]<\/a> “Allah spoke to Moses directly.” (Sūrat al-Nisā 4:164)<\/p>\n<p><a href=\"#_ftnref74\" name=\"_ftn74\">[74]<\/a> “Whoever disbelieves in Allah, His angels, His Books, His Messengers, and the Last Day has certainly gone far astray.” (Sūrat al-Nisā 4:136)<\/p>\n<p><a href=\"#_ftnref75\" name=\"_ftn75\">[75]<\/a> “Whoever prays our prayer, faces our direction of prayer, and eats our slaughtered animals, they are Muslims under the protection of Allah and His Messenger. Thus, do not betray Allah in the matter of His protection.” (Ṣaḥīḥ al-Bukhārī 391, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/08\/21\/pray-towards-qiblah-muslims\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref76\" name=\"_ftn76\">[76]<\/a> “I guarantee a house on the outskirts of Paradise for one who leaves arguments even if he is right.” (Sunan Abī Dāwūd 4800, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/01\/24\/paradise-guaranteed-husn-khuluq\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref77\" name=\"_ftn77\">[77]<\/a> “Arguing over the Quran is an act of unbelief.” (Sunan Abī Dāwūd 4603, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/07\/05\/arguing-over-quran-kufr\/\"><strong><em>Sahih<\/em><\/strong><\/a>); Al-Munawi commented, “Meaning, one doubts it contains the word of Allah, or indulges the debate over whether it is new or ancient, or bickers over the unclear verses. That leads to denial, persecution, and bloodshed.” (Fayḍ al-Qadīr 6\/265 #9187)<\/p>\n<p><a href=\"#_ftnref78\" name=\"_ftn78\">[78]<\/a> “No doubt, the people of the Book before you split into seventy-two sects and this religion will split into seventy-three sects; seventy-two will be in the Hellfire and one will be in Paradise. It is the united community.” (Sunan Abī Dāwūd 4597, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/03\/27\/sects-desires-hawaa-bidah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref79\" name=\"_ftn79\">[79]<\/a> The Messenger of Allah, peace and blessings be upon him, said, “Gabriel, upon him be peace, came to me to give the good news that anyone from my nation who dies without associating partners with Allah will enter Paradise.” It was said, “Even if he commits adultery and theft?” The Prophet said, “Even if he commits adultery and theft.” (Ṣaḥīḥ al-Bukhārī 1237, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/02\/28\/hereafter-faith-eventually-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a>); Al-Nawawi comments, “This tradition is a proof for the people of the Sunnah, that those who commit major sins will not remain in the Hellfire forever. If they enter it, they will be taken out and eventually admitted into Paradise.” (Sharḥ al-Nawawī ‘alá Ṣaḥīḥ Muslim 2\/97)<\/p>\n<p><a href=\"#_ftnref80\" name=\"_ftn80\">[80]<\/a> The Messenger of Allah, peace and blessings be upon him, said, “Verily, none of you will enter Paradise by his deeds alone.” They said, “Not even you, O Messenger of Allah?” The Prophet said, “Not even me, unless Allah grants me his mercy.&#8221; (Ṣaḥīḥ al-Bukhārī 6467, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/none-paradise-except-mercy\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref81\" name=\"_ftn81\">[81]<\/a> Ibn Mas’ud said, “If you see a man among you seduced into a sin, then neither supplicate to Allah against him nor curse him. Rather, supplicate for Allah to save him and to accept his repentance. When we saw a man do good at the end of his life, we would hope for him. When we saw a man do evil at the end of his life, we would fear for him.” (al-Tawbah li-Ibn Abī Dunyā 112)<\/p>\n<p><a href=\"#_ftnref82\" name=\"_ftn82\">[82]<\/a> “Who despairs of the mercy of his Lord except for those astray?” (Sūrat al-Hijr 15:56)<\/p>\n<p><a href=\"#_ftnref83\" name=\"_ftn83\">[83]<\/a> “Verily, between a man and idolatry and unbelief is abandoning the prayer.” (Ṣaḥīḥ Muslim 82, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/27\/iman-kufr-leaving-salat\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref84\" name=\"_ftn84\">[84]<\/a> “No one testifies that there is no God but Allah and Muhammad is the Messenger of Allah, honestly from the heart, but that Allah will forbid him from entering Hellfire.” (Ṣaḥīḥ al-Bukhārī 128, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/01\/27\/sincerity-hellfire-forever\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref85\" name=\"_ftn85\">[85]<\/a> “Verily, there is nothing to bring you closer to Paradise and distance you from Hellfire but that I have commanded you to do it, and there is nothing to bring you closer to Hellfire and distance you from Paradise but that I have forbidden you from doing it.” (Shu’ab al-Imān 9891, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/25\/prophet-leaves-guidance\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref86\" name=\"_ftn86\">[86]<\/a> “O people, We have created you from male and female and made you into communities and tribes that you may know one another. Verily, the most noble of you to Allah is the most righteous of you.” (Sūrat al- Ḥujurāt 49:13)<\/p>\n<p><a href=\"#_ftnref87\" name=\"_ftn87\">[87]<\/a> “Verily, only Allah and the righteous believers are my allies.” (Ṣaḥīḥ al-Bukhārī 5990, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/05\/12\/maintain-relations-kuffar-family\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref88\" name=\"_ftn88\">[88]<\/a> “Faith is to believe in Allah, His angels, his Books, His Messengers, the Last Day, and to believe in providence, its good and its evil.” (Ṣaḥīḥ Muslim 8, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/25\/jibreel-islam-iman-ihsan\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref89\" name=\"_ftn89\">[89]<\/a> “We believe in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Tribes, and what was given to Moses and Jesus and what was given to the Prophets from their Lord. We make no distinction between any of them, and we are Muslims surrendering to Him.” (Sūrat al-Baqarah 2:136)<\/p>\n<p><a href=\"#_ftnref90\" name=\"_ftn90\">[90]<\/a> “Some people among those who worshiped Allah alone will be punished in Hellfire until they are coals. Then, the mercy of Allah will reach them and they will be taken out and presented at the gates of Paradise. The people of Paradise will pour water over them and they will grow just as the stubble carried by the stream grows. Then, they will enter Paradise.” (Sunan al-Tirmidhī 2597, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2015\/08\/11\/tawhid-nar-first-then-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref91\" name=\"_ftn91\">[91]<\/a> Sūrat al-Nisā 4:116.<\/p>\n<p><a href=\"#_ftnref92\" name=\"_ftn92\">[92]<\/a> “If You punish them, they are Your servants, but if You forgive them, You alone are Almighty and Wise.” (Sūrat al-Mā&#8217;idah 5:118)<\/p>\n<p><a href=\"#_ftnref93\" name=\"_ftn93\">[93]<\/a> “Allah will admit the people of Paradise into Paradise among whomever He wills, due to His mercy, and He will admit the people of Hellfire into Hellfire, then Allah will say, &#8216;Look for those with faith in their hearts as much as a seed and bring them out.&#8217; Then, they will be brought out having been burned and turned into charcoal. They will be cast into the river of life and will sprout just as a seed in the silt is carried away by the flood. Have you not seen that it comes out yellow and entwined?” (Ṣaḥīḥ al-Bukhārī 22, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/15\/none-paradise-except-mercy\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref94\" name=\"_ftn94\">[94]<\/a> “Then will We treat the Muslims like the criminals?” (Sūrat al-Qalam 68:35)<\/p>\n<p><a href=\"#_ftnref95\" name=\"_ftn95\">[95]<\/a> “O Turner of the hearts, affirm my heart upon your religion.” (Sunan al-Tirmidhī 3522, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/06\/05\/dua-affirm-hearts-deen\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref96\" name=\"_ftn96\">[96]<\/a> “Perform funeral prayer over whoever says there is no God but Allah. Perform prayer behind whoever says there is no God but Allah.” (Sunan al-Dāraquṭnī 1761, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/08\/17\/salat-with-for-every-muslim\/\"><strong><em>Sahih li ghayrihi<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref97\" name=\"_ftn97\">[97]<\/a> “Verily, a man may appear to people as doing the deeds of the people of Paradise, yet he is among the people of Hellfire. Verily, a man may appear to people as doing the deeds of the people of Hellfire, yet he is among the people of Paradise.” (Ṣaḥīḥ al-Bukhārī 2898, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/18\/qadr-amal-bil-khawatim\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref98\" name=\"_ftn98\">[98]<\/a> “A man does not accuse another man of wickedness or unbelief but that it will be turned against him, if his companion is innocent.” (Ṣaḥīḥ al-Bukhārī 6045, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/10\/05\/excommunication-takfir-charges-backfire\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref99\" name=\"_ftn99\">[99]<\/a> Umar ibn al-Khattab said, “Verily, people were judged by revelation in the time of the Messenger of Allah, peace and blessings be upon him, and the revelation has ceased. We only judge now what is manifested outwardly of your deeds. Whoever shows us good, we will trust him and bring him close. It is not for us to judge anything of his inner secrets. Allah will hold him accountable for his inner secrets. Whoever shows us evil, we will never trust him or believe him even if it is said his intentions are good.” (Ṣaḥīḥ al-Bukhārī 2641, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/04\/judge-deeds-not-hearts\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref100\" name=\"_ftn100\">[100]<\/a> “Whoever raises arms against us is not one of us. Whoever deceives us is not one of us.” (Ṣaḥīḥ Muslim 101, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/09\/25\/civil-war-not-true-muslims\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref101\" name=\"_ftn101\">[101]<\/a> “Whoever sees something from his ruler that he hates, let him be patient. Whoever secedes from the community by as much as a handspan and dies will have died a death of ignorance.” (Ṣaḥīḥ al-Bukhārī 7054, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/27\/sabr-with-sultan\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref102\" name=\"_ftn102\">[102]<\/a> Shaykh Ibn Uthaymeen said, “It is appropriate for us to supplicate for the people of falsehood that Allah might turn them back from their falsehood to the truth, to benefit themselves and others. This is justice, as opposed to what is done by some of the ignorant. When they see those who are deep in falsehood, they supplicate against them.” (Sharḥ al-Kāfiyah al-Shāfiyah 4\/416)<\/p>\n<p><a href=\"#_ftnref103\" name=\"_ftn103\">[103]<\/a> “It is a duty upon a Muslim man to listen and obey authorities, whether he likes it or not, unless they command sinful disobedience. If they command sinful disobedience, then there is no listening or obedience to them.” (Ṣaḥīḥ al-Bukhārī 7144, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/07\/15\/obey-unless-command-sin\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref104\" name=\"_ftn104\">[104]<\/a> Al-Fudayl ibn ‘Iyad said, “If I had one supplication to be answered, I would make it for no one but the ruler. If the ruler is righteous, it will lead to the righteousness of the country and the people.” (Siyar A’lām al-Nubalā 8\/434)<\/p>\n<p><a href=\"#_ftnref105\" name=\"_ftn105\">[105]<\/a> “You must adhere to my Sunnah and the Sunnah of the righteous, guided successors. Hold firmly to it as if biting with your molar teeth. Beware of newly invented matters, for every new matter is an innovation and every innovation is misguidance.” (Sunan Abī Dāwūd 4607, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/05\/follow-sunnah-beware-bidah\/https:\/www.abuaminaelias.com\/dailyhadithonline\/2012\/03\/05\/follow-sunnah-beware-bidah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref106\" name=\"_ftn106\">[106]<\/a> “Whoever loves for the sake of Allah, hates for the sake of Allah, gives for the sake of Allah, and withholds for the sake of Allah has perfected the faith.” (Sunan Abī Dāwūd 4681, <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/12\/love-hate-allah-perfect-faith\/\">Sahih<\/a><\/em><\/strong>); Al-Azimabadi commented, “That he hates for the sake of Allah does not mean he harms the one he hates. Rather, the hatred is for his unbelief and disobedience.” (‘Awn al-Ma’būd 12\/285)<\/p>\n<p><a href=\"#_ftnref107\" name=\"_ftn107\">[107]<\/a> “Allah and His Messenger know best.” (Ṣaḥīḥ al-Bukhārī 7373, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/01\/20\/rights-allah-tawheed\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref108\" name=\"_ftn108\">[108]<\/a> “The Messenger of Allah, peace and blessings be upon him, wiped over leather socks and head coverings in ablution.” (Ṣaḥīḥ Muslim 275, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/12\/21\/wipe-over-socks-headgear-wudu\/\"><strong><em>Sahih<\/em><\/strong><\/a>); NOTE: This point of Fiqh is mentioned here because many of the heretical sects denied it was part of the Sunnah.<\/p>\n<p><a href=\"#_ftnref109\" name=\"_ftn109\">[109]<\/a> “Due to Allah from the people is a pilgrimage to the House, for whoever is able to find thereto a way.” (Sūrat Ali &#8216;Imrān 3:97); “There is no longer emigration, but rather only jihad and good intentions. When you are called to duty, go forth.” (Ṣaḥīḥ al-Bukhārī 3077, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/04\/29\/no-obligatory-hijrah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref110\" name=\"_ftn110\">[110]<\/a> “Man does not utter any word but that with him is an observer prepared.” (Sūrat Qaf 50:18)<\/p>\n<p><a href=\"#_ftnref111\" name=\"_ftn111\">[111]<\/a> “The angel of death, who has been entrusted with you, will take you. Then to your Lord you will be returned.” (Sūrat al-Sajdah 32:11)<\/p>\n<p><a href=\"#_ftnref112\" name=\"_ftn112\">[112]<\/a> “When the deceased is buried in his grave, two black and blue angels come to him. One of them is called Munkar and the other is called Nakir. They will both say: What do you say about this man?” (Sunan al-Tirmidhī 1071, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/01\/15\/munkar-nakir-questions\/\"><em>Jayyid<\/em><\/a>)<\/p>\n<p><a href=\"#_ftnref113\" name=\"_ftn113\">[113]<\/a> “Verily, the grave is the first stage of the Hereafter. If one is saved from it, whatever comes after will be easier for him. If one is not saved from it, whatever comes after will be harder for him. I have never seen anything more frightening than the grave.” (Sunan al-Tirmidhī 2308, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/08\/24\/qabr-first-stage-akhirah\/\"><em>Hasan<\/em><\/a>)<\/p>\n<p><a href=\"#_ftnref114\" name=\"_ftn114\">[114]<\/a> “The weighing of deeds that Day will be the truth. So those whose scales are heavy with good, they will be successful.” (Sūrat al-A&#8217;rāf 7:8)<\/p>\n<p><a href=\"#_ftnref115\" name=\"_ftn115\">[115]<\/a> Abu Sa’id al-Khudri said, “I have come to know that the bridge over Hell is thinner than a hair and sharper than a sword.” (Ṣaḥīḥ Muslim 183, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/11\/sirat-thinner-than-hair\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref116\" name=\"_ftn116\">[116]<\/a> “When the people of Paradise will be sent to Paradise, and the people of Hellfire will be sent to Hellfire, until they are separated between them. Then, death will be slaughtered and a heavenly caller will announce: O people of Paradise, there is no death! O people of Hellfire, there is no death! For the people of Paradise, it will add joy to their joy, and for the people of Hellfire, it will add grief to their grief.” (Ṣaḥīḥ Muslim 2850, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/05\/28\/afterlife-no-mawt\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref117\" name=\"_ftn117\">[117]<\/a> “When Allah created Paradise and Hellfire, He sent Gabriel to Paradise saying: Behold it and what I have prepared therein for its people.” (Sunan al-Tirmidhī 2560, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/23\/jibreel-fears-hellfire-hereafter\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref118\" name=\"_ftn118\">[118]<\/a> “Allah said to Paradise, ‘You are My mercy with which I show mercy to those of My servants whom I will.’ Allah said to Hellfire, ‘You are My punishment with which I punish those of My servants whom I will, and both of you will be full.’” (Ṣaḥīḥ al-Bukhārī 4850, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/11\/24\/jannah-rahmah-nar-adhab\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref119\" name=\"_ftn119\">[119]<\/a> We were sitting with the Prophet, peace and blessings be upon him, and he said, “There are none among you but that his place in Paradise or his place in Hellfire are decreed.” We said, “O Messenger of Allah, shall we not depend on this alone?” The Prophet said, “No, you must work, for all will be facilitated.” (Ṣaḥīḥ al-Bukhārī 4945, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/04\/03\/qadr-act-earn-favor-decree\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref120\" name=\"_ftn120\">[120]<\/a> “We tested them with good and evil that perhaps they would return to Allah.” (Sūrat al-A&#8217;rāf 168)<\/p>\n<p><a href=\"#_ftnref121\" name=\"_ftn121\">[121]<\/a> “While Allah created you and what you do?” (Sūrat al-Ṣaffāt 37:96)<\/p>\n<p><a href=\"#_ftnref122\" name=\"_ftn122\">[122]<\/a> Sūrat al-Baqarah 2:286.<\/p>\n<p><a href=\"#_ftnref123\" name=\"_ftn123\">[123]<\/a> “For those their refuge will be the Hellfire because of what they used to earn.” (10:8)<\/p>\n<p><a href=\"#_ftnref124\" name=\"_ftn124\">[124]<\/a> “The pen is lifted from three people: a sleeping person until he awakens, a child until he becomes an adult, and an insane person until he regains his sanity.” (Sunan al-Tirmidhī 1423, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2019\/05\/07\/pen-lifted-from-three\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref125\" name=\"_ftn125\">[125]<\/a> “Increase your plantings in Paradise, for its water is sweet and its soil is clean. Its plantings are to say: there is no movement or might but in Allah.” (al-Mu’jam al-Kabīr 13354, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/12\/24\/plant-trees-jannah\/\"><em>Hasan<\/em><\/a>)<\/p>\n<p><a href=\"#_ftnref126\" name=\"_ftn126\">[126]<\/a> “All praise is due to Allah, by whose favor good deeds are accomplished.” (Sunan Ibn Mājah 3803, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/24\/hamdulillah-ala-kul-hal\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref127\" name=\"_ftn127\">[127]<\/a> “Do you not know that Allah knows what is in the heaven and the earth? Verily, that is in a Record. That is easy for Allah.” (Sūrat al-Ḥajj 22:70)<\/p>\n<p><a href=\"#_ftnref128\" name=\"_ftn128\">[128]<\/a> “We will not be outdone.” (Sūrat al-Ma&#8217;ārij 70:41)<\/p>\n<p><a href=\"#_ftnref129\" name=\"_ftn129\">[129]<\/a> “Allah would never have wronged them, but rather they were wronging themselves.” (Sūrat al-Rum 30:9)<\/p>\n<p><a href=\"#_ftnref130\" name=\"_ftn130\">[130]<\/a> Sūrat al-Anbiyā’ 21:23.<\/p>\n<p><a href=\"#_ftnref131\" name=\"_ftn131\">[131]<\/a> “When the human being dies, his deeds end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him.” (Ṣaḥīḥ Muslim 1631, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/23\/sadaqah-al-jariyah\/\"><strong><em>Sahih<\/em><\/strong><\/a>); A man came to the Prophet, peace and blessings be upon him, and he said, “O Messenger of Allah, my mother died suddenly without writing a will. I think if she could speak, she would give in charity. Will she have a reward if I give charity on her behalf?” The Prophet said, “Yes.” (Ṣaḥīḥ al-Bukhārī 1388, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2020\/01\/12\/charity-on-behalf-of-parents\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref132\" name=\"_ftn132\">[132]<\/a> “There is no Muslim who calls upon Allah, without sin or cutting family ties, but that Allah will give him one of three answers: He will quickly fulfill his supplication, He will store it for him in the Hereafter, or He will divert an evil from him similar to it.” (Musnad Aḥmad 11133, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/05\/25\/supplication-answered-three-ways\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref133\" name=\"_ftn133\">[133]<\/a> “Blessed is He in whose hand is the dominion, for He has power over all things.” (Sūrat al-Mulk 67:1)<\/p>\n<p><a href=\"#_ftnref134\" name=\"_ftn134\">[134]<\/a> “Nay! Verily, man transgresses because he considers himself independent.” (Surat al-‘Alaq 96:6-7)<\/p>\n<p><a href=\"#_ftnref135\" name=\"_ftn135\">[135]<\/a> “That is because they followed that which angered Allah, and hated that which pleased Him, so He made their deeds fruitless.&#8221; (Sūrat Muḥammad 47:28)<\/p>\n<p><a href=\"#_ftnref136\" name=\"_ftn136\">[136]<\/a> Imam Ahmad said, “Do not exaggerate in anything, even love and hatred.” (al-Ādāb al-Shar’īyah 1\/52)<\/p>\n<p><a href=\"#_ftnref137\" name=\"_ftn137\">[137]<\/a> “If my companions are mentioned, be restrained.” (al-Mu’jam al-Kabīr 10302, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2017\/04\/06\/silence-qadr-sahabah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref138\" name=\"_ftn138\">[138]<\/a> “None loves the Ansar but a believer, and none hates them but a hypocrite. Whoever loves them, Allah will love him. Whoever hates them, Allah will hate him.” (Ṣaḥīḥ al-Bukhārī 3783, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/05\/02\/love-ansar-companions-faith\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref139\" name=\"_ftn139\">[139]<\/a> The Prophet, peace and blessings be upon him, became ill and when his condition was critical, he said, “Tell Abu Bakr to lead the people in prayer.” (Ṣaḥīḥ al-Bukhārī 678, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/20\/abu-bakr-khalifah-imam-salat\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref140\" name=\"_ftn140\">[140]<\/a> “Before you were nations with divinely inspired people. If such a person were in my nation, it would surely be Umar.” (Ṣaḥīḥ al-Bukhārī 3689, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/27\/umar-ibn-al-khattab-inspired\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref141\" name=\"_ftn141\">[141]<\/a> “The most merciful of my nation is Abu Bakr. The strictest of them in the religion of Allah is Umar. The most sincerely conscientious of them is Uthman. The wisest of them in judgment is Ali ibn Abi Talib.” (Sunan Ibn Mājah 154, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2016\/04\/17\/sahaba-senior-companions\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref142\" name=\"_ftn142\">[142]<\/a> “Abu Bakr is in Paradise. Umar is in Paradise. Uthman is in Paradise. Ali is in Paradise. Talhah is in Paradise. Al-Zubayr is in Paradise. Abdur Rahman ibn ‘Awf is in Paradise. Sa’d is in Paradise. Sa’id is in Paradise. Abu ‘Ubaydah ibn al-Jarrah is in Paradise.” (Sunan al-Tirmidhī 3747, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/01\/06\/ten-sahabah-promised-jannah\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref143\" name=\"_ftn143\">[143]<\/a> “Love Allah for the blessings by which He nourishes you, love me for the love of Allah, and love the people of my house for the love of me.” (Sunan al-Tirmidhī 3789, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2021\/02\/24\/love-allah-messenger-ahl-bayt\/\"><em>Hasan<\/em><\/a>)<\/p>\n<p><a href=\"#_ftnref144\" name=\"_ftn144\">[144]<\/a> “The best people are those of my generation, then those who come after them, then those who come after them. Then, there will come people after them whose testimony precedes their oaths and their oaths precede their testimony.” (Ṣaḥīḥ al-Bukhārī 6429, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/05\/14\/sahabah-tabieen-salaf-salih\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref145\" name=\"_ftn145\">[145]<\/a> “The scholars are the inheritors of the Prophets. They do not leave behind gold or silver coins, but rather they leave behind knowledge. Whoever has taken hold of it has been given an abundant share.” (Sunan Abī Dāwūd 3641, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/03\/20\/heavens-earth-praise-scholars\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref146\" name=\"_ftn146\">[146]<\/a> It was said, “O Messenger of Allah, which people are tested most severely?” The Messenger of Allah, peace and blessings be upon him, said, “They are the prophets, then the next best, then the next best. A man is put to trial according to his religion. If he is firm in his religion, his trials will be more severe. If he is weak in his religion, he is put to trial according to his strength in religion. The servant will continue to be put to trial until he is left walking upon the earth without any sin.” (Sunan al-Tirmidhī 2398, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/09\/29\/prophets-righteous-severely-tested\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref147\" name=\"_ftn147\">[147]<\/a> Ibn Taymiyyah said, “The miracles of the saints are true by the consensus of the Imams of Islam, Sunnah, and the united community. They are included in the Quran in several places, the authentic prophetic narrations, and widespread reports from the companions, the successors, and others.” (Mukhtaṣar al-Fatāwá al-Miṣrīyah 1\/600)<\/p>\n<p><a href=\"#_ftnref148\" name=\"_ftn148\">[148]<\/a> “Nothing between the creation of Adam until the establishment of the Hour is a greater tribulation than the affair of the False Messiah.” (Ṣaḥīḥ Muslim 2946, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/08\/20\/dajjal-tribulation-false-messiah-greatest\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref149\" name=\"_ftn149\">[149]<\/a> “By Allah, the son of Mary will descend as a just ruler. He will abolish the cross, kill the swine, and annul the tribute, but he will leave the she-camel such that no one collects from it. He will cause rancor, hatred, and envy to disappear, and he will call people to give their wealth in charity but no one will need it.” (Ṣaḥīḥ Muslim 155, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2013\/06\/02\/second-coming-jesus\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref150\" name=\"_ftn150\">[150]<\/a> “The Hour will not be established until the sun rises from the West.” (Ṣaḥīḥ al-Bukhārī 4636, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2012\/04\/25\/iman-after-sun-rises-maghrib\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref151\" name=\"_ftn151\">[151]<\/a> “The Beast will emerge and place a mark on the faces of the people. They will be plentiful among you such that a man will purchase a camel and it will be said: From whom did you buy it? He will say: I bought it from one of those with the mark.” (Musnad Aḥmad 22309, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/11\/30\/mark-of-the-beast\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref152\" name=\"_ftn152\">[152]<\/a> Some people asked the Messenger of Allah, peace and blessings be upon him, about soothsayers. The Prophet said, “They are upon nothing.” They said, “O Messenger of Allah, sometimes they speak about things that come true.” The Prophet said, “Those are the words snatched by the jinn, who whisper it into the ears of their friends and it is mixed with more than one hundred lies.” (Ṣaḥīḥ al-Bukhārī 6213, <a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2014\/01\/29\/soothsayers-jinn-mix-lies\/\"><strong><em>Sahih<\/em><\/strong><\/a>)<\/p>\n<p><a href=\"#_ftnref153\" name=\"_ftn153\">[153]<\/a> “Hold firmly to the rope of Allah all together and do not become divided.” (Sūrat Ali &#8216;Imrān 3:103)<\/p>\n<p><a href=\"#_ftnref154\" name=\"_ftn154\">[154]<\/a> Sūrat Ali ‘Imrān 3:19.<\/p>\n<p><a href=\"#_ftnref155\" name=\"_ftn155\">[155]<\/a> Sūrat al-Mā’idah 5:3.<\/p>\n<p><a href=\"#_ftnref156\" name=\"_ftn156\">[156]<\/a> Hudhayfah ibn al-Yaman said, “O townspeople, remain upright and you will have taken a great lead, but if you swerve right or left, you will have been led far astray.” (Ṣaḥīḥ al-Bukhārī 7282, <strong><em><a href=\"https:\/\/www.abuaminaelias.com\/dailyhadithonline\/2011\/10\/29\/hudhayfah-straight-path\/\">Sahih<\/a><\/em><\/strong>)<\/p>\n<p><a href=\"#_ftnref157\" name=\"_ftn157\">[157]<\/a> This sect and theologians like them ascribe the attributes of created beings to Allah.<\/p>\n<p><a href=\"#_ftnref158\" name=\"_ftn158\">[158]<\/a> This sect gave prominence to rational philosophy, such as found in ancient Greece, which led them to deny a number of core tenets of Islam.<\/p>\n<p><a href=\"#_ftnref159\" name=\"_ftn159\">[159]<\/a> This sect denied a number of the Attributes of Allah, among other false beliefs.<\/p>\n<p><a href=\"#_ftnref160\" name=\"_ftn160\">[160]<\/a> This sect denied the free will of human beings and claimed Allah coerces us to perform all of our deeds.<\/p>\n<p><a href=\"#_ftnref161\" name=\"_ftn161\">[161]<\/a> This sect denied the divine providence of Allah and claimed He has no control over our actions.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;This is a clear presentation of the creed of Ahl al-Sunnah wal Jamā’ah,&#8221;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":8,"comment_status":"closed","ping_status":"closed","template":"","meta":{"site-sidebar-layout":"default","site-content-layout":"","ast-site-content-layout":"default","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"","site-post-title":"","ast-breadcrumbs-content":"","ast-featured-img":"","footer-sml-layout":"","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"set","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"var(--ast-global-color-4)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"footnotes":""},"class_list":["post-741","page","type-page","status-publish","hentry"],"aioseo_notices":[],"jetpack_shortlink":"https:\/\/wp.me\/P5YGRL-bX","jetpack-related-posts":[{"id":12884,"url":"https:\/\/www.abuaminaelias.com\/about-me\/","url_meta":{"origin":741,"position":0},"title":"About Me","author":"Abu Amina Elias","date":"February 13, 2013","format":false,"excerpt":"My name is Abu Amina Elias (Justin Parrott). This website is dedicated to spreading the message of Islam according to the Quran, the Sunnah, the way of the righteous predecessors, and the scholars who followed them. Citations are always provided so that others can independently verify the authenticity of the…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":18687,"url":"https:\/\/www.abuaminaelias.com\/al-aqeedah-al-wasitiyyah-by-ibn-taymiyyah\/","url_meta":{"origin":741,"position":1},"title":"Al-Aqidah al-Wasitiyyah by Ibn Taymiyyah","author":"Abu Amina Elias","date":"January 25, 2018","format":false,"excerpt":"\"This is the creed of the saved and victorious group until the establishment of the Hour, Ahl al-Sunnah wal Jamā’ah,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":20423,"url":"https:\/\/www.abuaminaelias.com\/al-targhib-wal-tarhib\/","url_meta":{"origin":741,"position":2},"title":"Inspiring Hope and Inciting Fear by Imam al-Mundhiri","author":"Abu Amina Elias","date":"June 14, 2019","format":false,"excerpt":"Al-Targhīb wal-Tarhīb (Inspiring Hope and Inciting Fear) is a book of Hadith collected by Imam al-Mundhirī. It is distinguished because of its inclusion of Hadith besides those found in the Six Books, such as in collections by Imam Ahmad, Al-Tabarani, and Al-Bayhaqi. The following are some select chapters with English…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":14257,"url":"https:\/\/www.abuaminaelias.com\/riyad-us-saliheen-by-an-nawawi\/","url_meta":{"origin":741,"position":3},"title":"Meadows of the Righteous by Imam al-Nawawi","author":"Abu Amina Elias","date":"July 16, 2013","format":false,"excerpt":"Riyad al-Salihin (Meadows of the Righteous) by Imam Yahya ibn Sharaf al-Nawawi is a book of Islamic ethics, manners, and acts of worship. The following are select chapters of this work in English translation with the Arabic text. Virtues and Good Deeds Sincerity, Good Intentions Good Character and Manners Seeking…","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":735,"url":"https:\/\/www.abuaminaelias.com\/forty-hadith-nawawi\/","url_meta":{"origin":741,"position":4},"title":"Forty Hadith al-Nawawi","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"Verily, deeds are only with intentions,\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]},{"id":718,"url":"https:\/\/www.abuaminaelias.com\/forty-sacred-hadith-qudsi-english-arabic\/","url_meta":{"origin":741,"position":5},"title":"Forty Sacred Hadith Qudsi","author":"Abu Amina Elias","date":"December 18, 2010","format":false,"excerpt":"\"Spend in charity, O son of Adam, and I shall spend on you.\"","rel":"","context":"Similar post","block_context":{"text":"Similar post","link":""},"img":{"alt_text":"","src":"","width":0,"height":0},"classes":[]}],"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/741","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/comments?post=741"}],"version-history":[{"count":0,"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/pages\/741\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.abuaminaelias.com\/wp-json\/wp\/v2\/media?parent=741"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}