




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?jqpkg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</span><BR>
Thursday, December 31 2009 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Yusuf al-Qardawi is one of the most prominent of the contemporary figureheads of al-Ikhwan al-Muslimeen and he has written many times on the movements of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>. We see a couple of trends amongst todays Ikhwanis. Seeing that the ideologies of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> found in Qutb's books are harmful to their cause, a group amongst them (like al-Qaradawi) are trying to distance the Ikhwaan from these teachings. He is opposed by others, who try to downplay the issue of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and argue that the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> have been fundamental to the Ikhwaani movement, and that they have an important role to play. We'll leave them to argue about these issues, but here is a statement of al-Qaradawi taken from an article published on 4th May 2004 called (<span class='arb'>&#1607;&#1604; &#1610;&#1603;&#1601;&#1617;&#1585; "&#1587;&#1610;&#1583; &#1602;&#1591;&#1576;" &#1605;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1610;&#1608;&#1605;&#1567;</span>) in which he outlines the ideology of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> in the works of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>.    <P>
<div class='sidebar'><b><a href=assets/images/qaradawi-qutb-takfir-article.gif>View the entire article here in Arabic</a></b></div>    <P>
He writes, in relation to a passage from Qutb's commentary az-Zilal (7/87) (<span class='arb'>&#1601;&#1610; &#1592;&#1604;&#1575;&#1604; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1591;&#1576;&#1593;&#1577; &#1593;&#1610;&#1587;&#1609; &#1575;&#1604;&#1581;&#1604;&#1576;&#1610; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577;</span>), and he is essentially summarizing the main points from what he quoted from Qutb:    <P>
<div class='arabic' align='right'>&#1605;&#1587;&#1604;&#1605;&#1608; &#1575;&#1604;&#1610;&#1608;&#1605;.. &#1603;&#1605;&#1588;&#1585;&#1603;&#1610; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577;    <P>
&#1608;&#1605;&#1606; &#1571;&#1580;&#1604; &#1584;&#1604;&#1603; &#1571;&#1603;&#1583; &#1587;&#1610;&#1583; &#1602;&#1591;&#1576; &#1605;&#1585;&#1575;&#1578; &#1608;&#1605;&#1585;&#1575;&#1578; &#1575;&#1604;&#1593;&#1606;&#1575;&#1610;&#1577; &#1576;&#1583;&#1593;&#1608;&#1577; &#1575;&#1604;&#1606;&#1575;&#1587; &#1575;&#1604;&#1584;&#1610;&#1606; "&#1610;&#1587;&#1605;&#1608;&#1606; &#1571;&#1606;&#1601;&#1587;&#1607;&#1605; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606;" &#1573;&#1604;&#1609; &#1575;&#1593;&#1578;&#1606;&#1575;&#1602; &#1575;&#1604;&#1593;&#1602;&#1610;&#1583;&#1577; &#1602;&#1576;&#1604; &#1603;&#1604; &#1588;&#1610;&#1569;&#1548; &#1602;&#1576;&#1604; &#1571;&#1606; &#1578;&#1583;&#1593;&#1608;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1578;&#1588;&#1585;&#1610;&#1593; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1548; &#1571;&#1608; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1548; &#1576;&#1604; &#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1575;&#1604;&#1571;&#1587;&#1575;&#1587;&#1610; &#1571;&#1606; &#1606;&#1583;&#1593;&#1608;&#1607;&#1605; &#1604;&#1610;&#1587;&#1604;&#1605;&#1608;&#1575; &#1571;&#1608;&#1604;&#1575;&#1563; &#1604;&#1610;&#1588;&#1607;&#1583;&#1608;&#1575; &#1571;&#1606; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1576;&#1605;&#1601;&#1607;&#1608;&#1605;&#1607;&#1575; &#1575;&#1604;&#1602;&#1591;&#1576;&#1610; &#1575;&#1604;&#1580;&#1583;&#1610;&#1583;&#1548; &#1608;&#1576;&#1607;&#1584;&#1575; &#1610;&#1582;&#1585;&#1580;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1575;&#1585;&#1578;&#1603;&#1587;&#1608;&#1575; &#1601;&#1610;&#1607;&#1575;&#1548; &#1608;&#1610;&#1583;&#1582;&#1604;&#1608;&#1606; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;.    <P>
&#1608;&#1575;&#1604;&#1581;&#1602; &#1571;&#1606;&#1606;&#1575; &#1604;&#1605; &#1606;&#1585; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;&#1548; &#1608;&#1604;&#1575; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577;&#1548; &#1608;&#1604;&#1575; &#1575;&#1604;&#1578;&#1575;&#1576;&#1593;&#1610;&#1606;&#1548; &#1608;&#1604;&#1575; &#1571;&#1581;&#1583;&#1575; &#1605;&#1606; &#1575;&#1604;&#1587;&#1604;&#1601; &#1571;&#1608; &#1575;&#1604;&#1582;&#1604;&#1601; &#1601;&#1587;&#1585; &#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1576;&#1605;&#1575; &#1601;&#1587;&#1585;&#1607;&#1575; &#1576;&#1607; &#1587;&#1610;&#1583; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607;. &#1573;&#1606;&#1605;&#1575; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1583;&#1593;&#1608;&#1606; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1593;&#1585;&#1576; &#1608;&#1575;&#1604;&#1593;&#1580;&#1605; &#1573;&#1604;&#1609; "&#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607;" &#1575;&#1604;&#1578;&#1610; &#1610;&#1593;&#1585;&#1601; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1583;&#1604;&#1608;&#1604;&#1607;&#1575; &#1576;&#1601;&#1591;&#1585;&#1578;&#1607;&#1605;&#1563; &#1601;&#1581;&#1610;&#1606; &#1610;&#1583;&#1593;&#1609; &#1575;&#1604;&#1605;&#1580;&#1608;&#1587;&#1610; &#1573;&#1604;&#1609; "&#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607;" &#1610;&#1601;&#1607;&#1605; &#1571;&#1606; &#1605;&#1593;&#1606;&#1575;&#1607;&#1575; &#1571;&#1606; &#1610;&#1578;&#1585;&#1603; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1606;&#1575;&#1585;&#1548; &#1608;&#1571;&#1604;&#1575; &#1610;&#1602;&#1608;&#1604; &#1576;&#1573;&#1604;&#1607;&#1610;&#1606; &#1575;&#1579;&#1606;&#1610;&#1606;: &#1573;&#1604;&#1607; &#1604;&#1604;&#1582;&#1610;&#1585; &#1608;&#1575;&#1604;&#1606;&#1608;&#1585;&#1548; &#1608;&#1573;&#1604;&#1607; &#1604;&#1604;&#1588;&#1585; &#1608;&#1575;&#1604;&#1592;&#1604;&#1605;&#1577;&#1548; &#1608;&#1610;&#1578;&#1580;&#1607; &#1576;&#1589;&#1604;&#1575;&#1578;&#1607; &#1608;&#1606;&#1587;&#1603;&#1607; &#1608;&#1578;&#1584;&#1604;&#1604;&#1617;&#1607; &#1604;&#1604;&#1607; &#1608;&#1581;&#1583;&#1607;.    <P>
&#1608;&#1575;&#1604;&#1607;&#1606;&#1583;&#1608;&#1587;&#1610; &#1581;&#1610;&#1606;&#1605;&#1575; &#1610;&#1583;&#1593;&#1609; &#1573;&#1604;&#1609; "&#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607;" &#1610;&#1601;&#1607;&#1605; &#1605;&#1606;&#1607;&#1575; &#1571;&#1606; &#1610;&#1583;&#1593; &#1593;&#1576;&#1575;&#1583;&#1577; &#1575;&#1604;&#1576;&#1602;&#1585; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1581;&#1610;&#1608;&#1575;&#1606;&#1575;&#1578; &#1608;&#1602;&#1608;&#1609; &#1575;&#1604;&#1591;&#1576;&#1610;&#1593;&#1577; &#1575;&#1604;&#1605;&#1582;&#1578;&#1604;&#1601;&#1577;&#1548; &#1608;&#1610;&#1578;&#1580;&#1607; &#1576;&#1593;&#1576;&#1575;&#1583;&#1578;&#1607; &#1604;&#1604;&#1607; &#1585;&#1576; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;&#1610;&#1606;.    <P>
&#1608;&#1606;&#1606;&#1602;&#1604; &#1607;&#1606;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1606;&#1589; &#1605;&#1606; &#1578;&#1602;&#1583;&#1610;&#1605; &#1587;&#1608;&#1585;&#1577; &#1575;&#1604;&#1571;&#1606;&#1593;&#1575;&#1605;&#1548; &#1610;&#1602;&#1585;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1593;&#1606;&#1609; &#1575;&#1604;&#1584;&#1610; &#1571;&#1604;&#1605;&#1581;&#1606;&#1575; &#1573;&#1604;&#1610;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The Muslims of Today are Like the Mushriks of Jaahiliyyah    <P>
And for this reason [referring to an earlier discussion - see here and here] <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> emphasized many times over the concern with calling the people who "call themselves Muslims" to embrace the aqidah [afresh] before everything else, before calling them to the Islamic legislation, or the Islamic order (nidhaam). <b>Rather, the most fundamental obligation (to Qutb) is that we call them so that they become Muslims firstly, so that they testify that "None has the right to be worshipped except Allaah, alone", <u>with its new Qutbi understanding</u>, and they will leave [as a result] the <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>Jaahiliyyah</font></a> in which they have degenerated, and enter Islaam, through this</b>.    <P>
And the truth is that we did not see the Messenger (sallallaahu alayhi wasallam), and nor the Sahaabah and nor the Taabi'een, and nor anyone from the Salaf and the Khalaf explain the kalimah of Tawhid with what Sayyid (rahimahullah) has explained it with. Indeed, they used to call the people, from the Arabs and non-Arabs to that "<i>Laa ilaaha ilallaah</i>" whose meaning the people would come to known through their fitrah (innate instinct). So when the Majoosee (fire-worshipper) is invited to "<i>Laa ilaaha ilallaah</i>" he understands that it's meaning is that he abandons the worship of the fire, and that he does not speak with [their being] two gods, the god of good and goodness, and the god of evil and darkness, and that he turn to Allaah alone with his prayer, devotion and humility.    <P>
And Hindu, when he is invited to "<i>Laa ilaaha ilallaah</i>" he understands from it that he leave the worship of the cow and other animals besides it, and the various natural phenomena, and that he turn to the Lord of the worlds with his worship.    <P>
And we will quote here, this text from the introduction to Surah al-An'aam, in which he (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) corroborates this meaning which we have alluded to.</blockquote>    <P>
Then al-Qaradawi, quotes the passage in (7/87) and you can read it in the link to the article that has been provided above.    <P>
<b>Note:</b> From this we see that the labelling of people as "<a href=http://www.themadkhalis.com/>Madkhalis</a>" is an intellectual fraud through which Muslims who are sincerely and genuinely confused about these issues are averted and diverted away from the truth, and from its Scholars. The truth is that "Qutbi" and "<a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a>" are not figments on the imagination and they are not labels invented by the "<a href=http://www.themadkhalis.com/>Madkhalis</a>", rather they are terms used by prominent figureheads of al-Ikhwaan al-Muslimeen themselves and the Scholars of Ahl us-Sunnah like Shaykh Saalih al-Fawzaan and Shaykh Ibn Uthaymeen recognize that there is an actual  manhaj known as the "Qutbi Manhaj" which is a deviant manhaj and which has propounders, books and followers.    <P>
<img src=assets/images/shipwreck-qutbiyyah.gif align=right border=1 hspace=6 vspace=6 border=0>We have <a href=index9734.html?zyxuc >divinely revealed texts</a> of how the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> (<a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a>) will continue to emerge and be cut off. Then we have testimonies from many figureheads of Ikhwaan, such as al-Qaradawi and Ali Juraisah (<a href=index62cd.html?vdeiu>see here</a>) and <a href='tags/fareed-abdul-khaliq.html' class='tagLink'><font class='tagLink'>Fareed Abdul-Khaliq</font></a> (<a href=indexc30b.html?ezjol>see here</a>) that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> gave birth to the destructive <a href='tags/takfiri-movements.html' class='tagLink'><font class='tagLink'>Takfiri movements</font></a> through his works. Some of them explicitly affirm and use the terms "Qutbi" and "<a href="tags/qutbiyyah.html" class="tagLink"><font class="tagLink">Qutbiyyah</font></a>", like al-Qaradawi and <a href='tags/salaah-as-saawee.html' class='tagLink'><font class='tagLink'>Salaah as-Saawee</font></a>, (see <a href=index13c7.html?hulwt >here</a> and <a href=indexa79a.html?rxvjg >here</a>) Then we have explicit undeniable proofs that the likes of Shaykh Ibn Uthaymeen and Shaykh Saalih al-Fawzaan recognize the existence of "a Qutbi manhaj" which has adherents and callers (see <a href=http://www.themadkhalis.com/md/?xwcmm>here</a> and <a href=http://www.themadkhalis.com/md/?sxptl>here</a>), that this ideology is one of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and revolution, and that it should be warned against. And add to that what <a href='tags/ali-al-timimi.html' class='tagLink'><font class='tagLink'>Ali al-Timimi</font></a> used to explain in the days before he got poisoned (<a href=index55f3.html?mcjur >listen to him  here</a>).    <P>
And then in light of all of this, when you have a clear judgement (through the witness of many of the Scholars combined) that these factions of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> are included amongst those referred to in the divinely revealed texts, <u>such as these</u>:    <P>
<div class='sidebar'>In the Musnad of Imaam Ahmad there occurs in the hadeeth of Abdullaah bin Amr bin al-Aaas:    <P>
<div class='arabic' align='right'>&#1587;&#1605;&#1593;&#1578; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604; : &#1587;&#1610;&#1582;&#1585;&#1580; &#1571;&#1606;&#1575;&#1587; &#1605;&#1606; &#1571;&#1605;&#1578;&#1610; &#1605;&#1606; &#1602;&#1576;&#1604; &#1575;&#1604;&#1605;&#1588;&#1585;&#1602; &#1610;&#1602;&#1585;&#1572;&#1608;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1604;&#1575; &#1610;&#1580;&#1575;&#1608;&#1586; &#1578;&#1585;&#1575;&#1602;&#1610;&#1607;&#1605; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1581;&#1578;&#1609; &#1593;&#1583;&#1607;&#1575; &#1586;&#1610;&#1575;&#1583;&#1577; &#1593;&#1604;&#1609; &#1593;&#1588;&#1585;&#1577; &#1605;&#1585;&#1575;&#1578; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1581;&#1578;&#1609; &#1610;&#1582;&#1585;&#1580; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604; &#1601;&#1610; &#1576;&#1602;&#1610;&#1578;&#1607;&#1605; </div>    <P>
<blockquote>I heard the Messenger of Allaah (sallallaahu alayhi wasallam) saying: "There will emerge a people from my Ummah from the East who recite the Qur'an but it does not go beyond their throats. Every time a faction amongst them emerges it will be cut off. Every time a faction amongst them emerges it will be cut off", until he said it ten times, "Every time a faction amongst them emerges it will be cut off, until the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> appears amongst their (later) remnants." </blockquote>    <P>
Ahmad Shakir in his tahqeeq of the Musnad declared this to be <b>Saheeh</b> (11/88).    <P>
There is also the hadeeth of Abdullah bin Umar in which he narrates that the Messenger (sallallaahu alayhi wasallam) said:    <P>
<div class='arabic' align='right'>&#1610;&#1606;&#1588;&#1608; &#1606;&#1588;&#1608; &#1610;&#1602;&#1585;&#1572;&#1608;&#1606; &#1575;&#1604;&#1602;&#1585;&#1575;&#1606; &#1548; &#1604;&#1575; &#1610;&#1580;&#1575;&#1608;&#1586; &#1578;&#1585;&#1575;&#1602;&#1610;&#1607;&#1605; &#1548; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1548; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1548; &#1581;&#1578;&#1609; &#1610;&#1582;&#1585;&#1580; &#1601;&#1610; &#1571;&#1593;&#1585;&#1575;&#1590;&#1607;&#1605; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604;</div>    <P>
<blockquote>A group will emerge who recite the Qur'an but it does not go beyond their throats. Every time a faction amongst them emerges it will be cut off. Every time a faction amongst them emerges it will be cut off, until the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> appears amongst them.</blockquote>    <P>
This hadeeth is graded <b>Hasan</b> by Shaykh al-Albaani in Saheeh al-Jaami' (no. 8171), and it is narrated by Ibn Majah from Ibn Umar.</div>    <P>
Then the misguidance of these people and all those who defend them and ally with them, <b>could not be any more clearer</b>.    <P>
   <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/jqpkg-yusuf-al-qaradawi-the-new-qutbi-understanding-of-tawheed.html">Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</a><BR>
//www.takfiris.com/takfir/?jqpkg<BR>

<li><a href="articles/lyhev-yusuf-al-qaradawi-on-sayyid-qutb-all-muslims-are-kuffaar-mushrikeen-apostates-except-those-who-agree-with-my-ideology.html">Yusuf al-Qaradawi on Sayyid Qutb: All Muslims Are Apostates (Kuffaar, Mushrikeen) Except Those Who Agree With My Ideology and Join My Group</a><BR>
//www.takfiris.com/takfir/?lyhev<BR>

<li><a href="articles/xbnsa-yusuf-al-qaradawi-sayyid-qutb-makes-it-explicitly-clear-that-all-muslims-today-are-disbelievers.html">Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</a><BR>
//www.takfiris.com/takfir/?xbnsa<BR>

<li><a href="articles/rxvjg-salaah-as-saawee-a-qutbi-theoretician-on-the-qutbiyyoon-and-the-basis-of-their-teachings.html">Salaah as-Saawee (A Qutbi Theoretician) on the Qutbiyyoon and the Basis of Their Teachings</a><BR>
//www.takfiris.com/takfir/?rxvjg<BR>

<li><a href="articles/hulwt-yusuf-al-qardawi-groups-known-as-the-qutbiyyoon-found-harboring-the-doctrines-of-takfir-found-in-az-zilaal.html">Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</a><BR>
//www.takfiris.com/takfir/?hulwt<BR>

<li><a href="articles/wmagi-yusuf-al-qaradawi-the-takfir-of-all-societies-and-announcement-of-destructive-revolutions-in-the-final-works-of-sayyid-qutb.html">Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?wmagi<BR>

<li><a href="articles/ihnep-ali-al-timimi-on-secular-laws-the-saudi-government-and-takfir.html">Ali al-Timimi on Secular Laws, the Saudi Government, Takfir and Deviant Philosophies of Jihaad</a><BR>
//www.takfiris.com/takfir/?ihnep<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?jqpkg by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


