




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?kpavv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Usamah bin Laden is a Takfiri Kharijite And is Worse than the Kharijites of Old by Far</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Usamah bin Laden is a Takfiri Kharijite And is Worse than the Kharijites of Old by Far</span><BR>
Wednesday, June 12 2013 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<div class='sidebar'>  There are those who try to excuse <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> these days by using his express denial that he and those with him are from the Khawaarij and that they make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the sinners. And we do not take a man by his words alone until we see that the rest of his speech and action concords with what he claims. Below is evidence that this man (and his followers) are from the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> and worse than the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> of old, because the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> of old did not praise the killing of innocent women and children (Muslim or non-Muslim) by bombings and terrorist activities, whereas these contemporary <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> (such as Bin Laden) consider the killing of innocent men women and children (Muslim or non-Muslim) as something praiseworthy, this has been verbally stated by Shaykh Saalih al-Fawzaan as occurs in <a href=assets/audio/sh-s-fawzan-on-benladen.mp3>this audio</a> (see 7:00 onwards) and see this article for a translation.</div>    <P>
<font class='titleHeadline'>Usamah bin Laden's <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Rulers, States, Scholars and the Generality of the Muslims and His Praising of Terrorists Who Kill Innocent Women and Children</font>    <P>
First, let us put the stake in straight away so that all sympathesizers of this vile Kharijite can be made to flee on their heels, left with no excuse or defence, lets start off with corroboration from <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> who confirmed that <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the gulf states. Refer to the <a href=index9894.html?owscq>full article here</a> for documentation of the statement and we will just cite the relevant part here, <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> said:    <P>
<div class='arabic' align='right'> &#1579;&#1605; &#1604;&#1605;&#1575; &#1581;&#1589;&#1604;&#1578; &#1608;&#1602;&#1593;&#1577; &#1601;&#1578;&#1606;&#1577; &#1575;&#1604;&#1582;&#1604;&#1610;&#1580; , &#1575;&#1604;&#1578;&#1610; &#1601;&#1610; &#1587;&#1606;&#1577; 11 &#1608; &#1581;&#1589;&#1604; &#1571;&#1606; &#1583;&#1608;&#1604;&#1578;&#1606;&#1575; &#1608;&#1583;&#1608;&#1604;&#1577; &#1575;&#1604;&#1603;&#1608;&#1610;&#1578; &#1575;&#1587;&#1578;&#1602;&#1583;&#1605;&#1608;&#1575; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1575;&#1606; , &#1571;&#1606;&#1603;&#1585; &#1584;&#1604;&#1603; &#1593;&#1604;&#1610;&#1607;&#1605; &#1608;&#1603;&#1571;&#1606;&#1607; &#1578;&#1580;&#1585;&#1571; &#1593;&#1604;&#1609; &#1571;&#1606; &#1607;&#1584;&#1575; &#1603;&#1615;&#1601;&#1585; &#1608; &#1571;&#1606;&#1603;&#1605; &#1602;&#1583; &#1603;&#1601;&#1585;&#1578;&#1605; &#1576;&#1584;&#1604;&#1603; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; , &#1601;&#1571;&#1615;&#1606;&#1603;&#1585; &#1593;&#1604;&#1610;&#1607; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1584;&#1610; &#1607;&#1608; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1583;&#1608;&#1604;&#1577; &#1608;&#1605;&#1606; &#1581;&#1608;&#1604;&#1607;&#1575; , &#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1584;&#1610; &#1571;&#1606;&#1615;&#1603;&#1585; &#1593;&#1604;&#1610;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Then the tribulation of the Gulf occurred, which is in the year 11 (meaning 1411H, that is 1990CE) and it transpired that our state (Saudi) and the state of Kuwait asked the Americans (for aid), and he (Usamah) rejected that from them, and it as if he ventured into the [judgement] that this is disbelief, <b>and that you (the states of Saudi and Kuwait) have disbelieved because of that. So this <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> was rejected against him, which is <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the (Saudi) state and those surrounding it. And this is what was rejected against him</b>... </blockquote>    <P>
Now <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was sympathetic to these innovators and deviants, making excuses for them and allying with them, despite him pointing out their errors or having statements that otherwise refute the foundations and doctrines of these extremists (such as <a href=indexe052.html?eoizx>this one</a> on <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the rulers on account of secular laws). But the intent in quoting him here is to establish, from the statement of one whom the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> have affinity to (<a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a>), that Usamah <a href='tags/bin-ladin.html' class='tagLink'><font class='tagLink'>Bin Ladin</font></a> is indeed upon the doctrines of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>. Now let us look at statements from <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> himself:    <P>
<font class='titleHeadline'>Usamah bin Laden's Takfiri Ideology</font>    <P>
It is from the fake piety of these <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> that they make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Scholars, rulers and general Muslims (as we shall see below from Bin Laden's speech) on account of matters that do not necessitate <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, and this is because they are the most ignorant of people of the Shari'ah of Islam and of the Prophetic Seerah and methodology. As throughout history, these <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> never had people of knowledge with them, just ignoramuses and pretenders to knowledge who are driven by raw sentiments. Let us take a glimpse at the takfiri doctrine of Usamah bin Laden:    <P>
<div class='arabic' align='right'>&#1602;&#1575;&#1604; &#1601;&#1610; &#1605;&#1602;&#1575;&#1576;&#1604;&#1577; &#1606;&#1588;&#1585;&#1578;&#1607;&#1575; (&#1580;&#1585;&#1610;&#1583;&#1577; &#1575;&#1604;&#1585;&#1571;&#1610; &#1575;&#1604;&#1593;&#1575;&#1605; &#1575;&#1604;&#1603;&#1608;&#1610;&#1578;&#1610;&#1577;) &#1605;&#1593; &#1571;&#1587;&#1575;&#1605;&#1577; &#1576;&#1606; &#1604;&#1575;&#1583;&#1606; &#1576;&#1578;&#1575;&#1585;&#1610;&#1582; 11/11/2001&#1605; &#1587;&#1574;&#1604; &#1575;&#1604;&#1587;&#1572;&#1575;&#1604; &#1575;&#1604;&#1578;&#1575;&#1604;&#1610;: &#1573;&#1584;&#1575; &#1582;&#1585;&#1580; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1603;&#1610;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577; &#1608;&#1578;&#1605; &#1578;&#1581;&#1585;&#1610;&#1585; &#1575;&#1604;&#1605;&#1587;&#1580;&#1583; &#1575;&#1604;&#1571;&#1602;&#1589;&#1609;&#1548; &#1607;&#1604; &#1587;&#1578;&#1608;&#1575;&#1601;&#1602; &#1593;&#1604;&#1609; &#1578;&#1602;&#1583;&#1610;&#1605; &#1606;&#1601;&#1587;&#1603; &#1604;&#1604;&#1605;&#1581;&#1575;&#1603;&#1605;&#1577; &#1601;&#1610; &#1576;&#1604;&#1583; &#1605;&#1587;&#1604;&#1605;&#1567;    <P>
&#1601;&#1571;&#1580;&#1575;&#1576; &#1571;&#1587;&#1575;&#1605;&#1577; &#1576;&#1606; &#1604;&#1575;&#1583;&#1606; :  &#1571;&#1601;&#1594;&#1575;&#1606;&#1587;&#1578;&#1575;&#1606; &#1608;&#1581;&#1583;&#1607;&#1575; &#1583;&#1608;&#1604;&#1577; &#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;&#1548; &#1576;&#1575;&#1603;&#1587;&#1578;&#1575;&#1606; &#1578;&#1578;&#1576;&#1593; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606; &#1575;&#1604;&#1573;&#1606;&#1603;&#1604;&#1610;&#1586;&#1610;&#1548; &#1608;&#1571;&#1606;&#1575; &#1604;&#1575; &#1571;&#1593;&#1578;&#1576;&#1585; &#1575;&#1604;&#1587;&#1593;&#1608;&#1583;&#1610;&#1577; &#1583;&#1608;&#1604;&#1577; &#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;&#1548;... .</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>In an interview with <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> published by the newspaper, "al-Ra'i" (of al-Kuwait) on 11/11/2001, he was asked the following question, "If the Americans leave Saudi and the liberation of al-Masjid al-Aqsaa is completed will you agree to present yourself for trial in a Muslim land?"    <P>
He replied: "Afghanistan alone is an Islamic state, Pakistan follows the English law and I do not consider Saudi to be an Islamic state."  </blockquote>    <P>
In the above statement <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> negated the Islam of the Saudi state. In speech directed to the people of Iraq in 1423H, <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> said the following:    <P>
<div class='arabic' align='right'>  &#1573;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1585;&#1610;&#1583;&#1608;&#1606; &#1581;&#1604; &#1602;&#1590;&#1575;&#1610;&#1575;&#1606;&#1575; &#1608;&#1605;&#1606; &#1571;&#1607;&#1605;&#1607;&#1575; &#1575;&#1604;&#1602;&#1590;&#1610;&#1577; &#1575;&#1604;&#1601;&#1604;&#1587;&#1591;&#1610;&#1606;&#1610;&#1577; &#1593;&#1576;&#1585; &#1575;&#1604;&#1571;&#1605;&#1605; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577; &#1571;&#1608; &#1593;&#1576;&#1585; &#1571;&#1608;&#1575;&#1605;&#1585; &#1575;&#1604;&#1608;&#1604;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577;&#1548; &#1603;&#1605;&#1575; &#1581;&#1589;&#1604; &#1576;&#1605;&#1576;&#1575;&#1583;&#1585;&#1577; &#1575;&#1604;&#1571;&#1605;&#1610;&#1585; &#1593;&#1576;&#1583; &#1575;&#1604;&#1604;&#1607; &#1576;&#1606; &#1593;&#1576;&#1583; &#1575;&#1604;&#1593;&#1586;&#1610;&#1586; &#1601;&#1610; &#1576;&#1610;&#1585;&#1608;&#1578; &#1608;&#1608;&#1575;&#1601;&#1602; &#1593;&#1604;&#1610;&#1607;&#1575; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1593;&#1585;&#1576; &#1608;&#1575;&#1604;&#1578;&#1610; &#1576;&#1575;&#1593; &#1601;&#1610;&#1607;&#1575; &#1583;&#1605;&#1575;&#1569; &#1575;&#1604;&#1588;&#1607;&#1583;&#1575;&#1569; &#1608;&#1576;&#1575;&#1593; &#1601;&#1610;&#1607;&#1575; &#1571;&#1585;&#1590; &#1601;&#1604;&#1587;&#1591;&#1610;&#1606; &#1573;&#1585;&#1590;&#1575;&#1569; &#1608;&#1605;&#1606;&#1575;&#1589;&#1585;&#1577; &#1604;&#1604;&#1610;&#1607;&#1608;&#1583; &#1608;&#1571;&#1605;&#1610;&#1585;&#1603;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1602;&#1583; &#1582;&#1575;&#1606;&#1608;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1608;&#1582;&#1585;&#1580;&#1608;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1604;&#1577; &#1608;&#1582;&#1575;&#1606;&#1608;&#1575; &#1575;&#1604;&#1571;&#1605;&#1577;  </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>The rulers who desire to solve our affairs - and the most important affair is the the Palestinian issue - through the United nations or under the commands of the United States, as has occurred from the ameer, Abdullah bin Abdul-Azeez in Beirut and to which all of the Arabs have agreed to, those who sold the blood of the martyrs by way of it, and they sold the land of Palestine by way it, to please and support the Jews and America over the Muslims, (then) those rulers have been treacherous to Allaah and His Messenger and have exited from the religion and have been treachers to the Ummah...</blockquote>    <P>
This is not the place to elaborate on the bold lie of this ignoramus that negotiations regarding an appropriate settlement for Palestine or for truces so as to bring safety and security to men, women and children equate to apostasy. One only need to take a cursory glance at the Prophetic Seerah to see that truces, agreements, covenants and the likes are permitted in the Shari'ah in order to repel harm and bring about benefit, and the Messenger (sallallaahu alayhi wasallam) himself entered into treaties and agreements, even in situations where they were entirely one-sided and against the apparent interests of Muslims (al-Hudaybiyyah). But what we are dealing with here are ignorant non-scholars who have no grounding in Islamic knowledge and jurisprudence. The point here is that <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> has made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the rulers of the Arab countries on account of something which is actually permitted in the Shari'ah and has its basis in the actions of the Prophet (sallallaahu alayhi wasallam). The greater shame is that the widespread ignorance and malaise amongst the Muslims - in not seeking a sound and thorough understanding of their religion - allows people such as <a href='tags/bin-laden.html' class='tagLink'><font class='tagLink'>Bin Laden</font></a> to be treated as heroes for speaking with such rhetoric when they are in fact ignorant non-scholars.     <P>
In the same speech he also said:    <P>
<div class='arabic' align='right'>&#1603;&#1605;&#1575; &#1606;&#1572;&#1603;&#1583; &#1593;&#1604;&#1609; &#1575;&#1604;&#1589;&#1575;&#1583;&#1602;&#1610;&#1606; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1571;&#1606;&#1607; &#1610;&#1580;&#1576; &#1593;&#1604;&#1610;&#1607;&#1605; &#1571;&#1606; &#1610;&#1578;&#1581;&#1585;&#1603;&#1608;&#1575; &#1608;&#1610;&#1581;&#1585;&#1590;&#1608;&#1575; &#1608;&#1610;&#1580;&#1610;&#1588;&#1608;&#1575; &#1575;&#1604;&#1571;&#1605;&#1577; &#1601;&#1610; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1581;&#1583;&#1575;&#1579; &#1575;&#1604;&#1593;&#1592;&#1575;&#1605; &#1608;&#1575;&#1604;&#1571;&#1580;&#1608;&#1575;&#1569; &#1575;&#1604;&#1587;&#1575;&#1582;&#1606;&#1577; &#1604;&#1578;&#1578;&#1581;&#1585;&#1585; &#1605;&#1606; &#1593;&#1576;&#1608;&#1583;&#1610;&#1577; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1606;&#1592;&#1605;&#1577; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605;&#1577; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605;&#1577; &#1575;&#1604;&#1605;&#1585;&#1578;&#1583;&#1577; &#1575;&#1604;&#1605;&#1587;&#1578;&#1593;&#1576;&#1583;&#1577; &#1605;&#1606; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575; &#1608;&#1604;&#1610;&#1602;&#1610;&#1605;&#1608;&#1575; &#1581;&#1603;&#1605; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610; &#1575;&#1604;&#1571;&#1585;&#1590;&#1548; &#1608;&#1605;&#1606; &#1571;&#1603;&#1579;&#1585; &#1575;&#1604;&#1605;&#1606;&#1575;&#1591;&#1602; &#1578;&#1571;&#1607;&#1604;&#1575;&#1611; &#1604;&#1604;&#1578;&#1581;&#1585;&#1610;&#1585;&#1548; &#1575;&#1604;&#1571;&#1585;&#1583;&#1606; &#1608;&#1575;&#1604;&#1605;&#1594;&#1585;&#1576; &#1608;&#1606;&#1610;&#1580;&#1610;&#1585;&#1610;&#1575; &#1608;&#1576;&#1575;&#1603;&#1587;&#1578;&#1575;&#1606; &#1608;&#1576;&#1604;&#1575;&#1583; &#1575;&#1604;&#1581;&#1585;&#1605;&#1610;&#1606; &#1608;&#1575;&#1604;&#1610;&#1605;&#1606;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Just as we emphasize to the truthful ones from the Muslims that it is obligatory upon them to move, mobilize and prepare armies (from the) ummah in the likes of these great events and aggravated atmospheres that it may liberate (itself) from servitude to these oppressive, apostate ruling authorities, enslaved by America, and that they may establish the rule of Allaah upon the Earth. And from the most worthy of regions worthy of liberation are Jordan, al-Maghreb (Morocco), Nigeria, Pakistan and the Land of the Two Sanctuaries (<a href='tags/saudi-arabia.html' class='tagLink'><font class='tagLink'>Saudi Arabia</font></a>) and Yemen.</blockquote>    <P>
<!---And in the same speech he also said:    <P>
<div class='arabic' align='right'>&#1601;&#1582;&#1604;&#1575;&#1601;&#1606;&#1575; &#1605;&#1593; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1604;&#1610;&#1587; &#1582;&#1604;&#1575;&#1601;&#1575; &#1601;&#1585;&#1593;&#1610;&#1575; &#1610;&#1605;&#1603;&#1606; &#1581;&#1604;&#1607;&#1548; &#1608;&#1573;&#1606;&#1605;&#1575; &#1606;&#1578;&#1581;&#1583;&#1579; &#1593;&#1606; &#1585;&#1571;&#1587; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1548; &#1588;&#1607;&#1575;&#1583;&#1577; &#1571;&#1606; &#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1571;&#1606; &#1605;&#1581;&#1605;&#1583; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; &#1602;&#1583; &#1606;&#1602;&#1590;&#1608;&#1607;&#1575; &#1605;&#1606; &#1571;&#1587;&#1575;&#1587;&#1607;&#1575; &#1576;&#1605;&#1608;&#1575;&#1604;&#1575;&#1578;&#1607;&#1605; &#1604;&#1604;&#1603;&#1601;&#1575;&#1585; &#1608;&#1576;&#1578;&#1588;&#1585;&#1610;&#1593;&#1607;&#1605; &#1604;&#1604;&#1602;&#1608;&#1575;&#1606;&#1610;&#1606; &#1575;&#1604;&#1608;&#1590;&#1593;&#1610;&#1577; &#1608;&#1573;&#1602;&#1585;&#1575;&#1585;&#1607;&#1605; &#1608;&#1575;&#1581;&#1578;&#1603;&#1575;&#1605;&#1607;&#1605; &#1604;&#1602;&#1608;&#1575;&#1606;&#1610;&#1606; &#1575;&#1604;&#1571;&#1605;&#1605; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577; &#1575;&#1604;&#1605;&#1604;&#1581;&#1583;&#1577;&#1548; &#1601;&#1608;&#1604;&#1575;&#1610;&#1578;&#1607;&#1605; &#1602;&#1583; &#1587;&#1602;&#1591;&#1578; &#1588;&#1585;&#1593;&#1575; &#1605;&#1606;&#1584; &#1586;&#1605;&#1606; &#1576;&#1593;&#1610;&#1583; &#1601;&#1604;&#1575; &#1587;&#1576;&#1610;&#1604; &#1604;&#1604;&#1576;&#1602;&#1575;&#1569; &#1578;&#1581;&#1578;&#1607;&#1575;</div>    <P>
<blockquote class='quote'><img src='//www.takfiris.com/takfir/images/quote-start.gif'>So our difference with the rulers is not a subsidiary difference that can be resolved. Rather, we are speaking about the chief part of Islam, the testimony that none has the right to be worshipped except Allaah alone and that Muhammad is the Messenger of Allaah. So those rulers have nullified this from its foundations by their loyalty to the non-Muslims andtheir legislating <a href='//www.takfiris.com/takfir/tags/secular-laws.cfm' class='tagLink'><font class='tagLink'>Secular Laws</font></a> and their affirmation of referring to the laws of the deviant  United Nations. Hence, loyalty to them  has been legislatively invalidated since a long time ago and there is no way of remaining under it.</blockquote> //--->    <P>
This is the doctrine of mass-takfir brought by <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> who declared all governments and states to be apostates on account of matters that do not necessitate that and <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> was tutored and nurtured upon these doctrines.This is another clear  proof that he is indeed a Takfiri and no one has fabricated any lie against him in this regard.     <P>
As for <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> praising the killing of innocent men, women and children (including Muslims), then these are his statements of praise for terrorist activities committed in various places, in an interview with al-Jazeerah, he stated the following:    <P>
<div class='arabic' align='right'> &#1601;&#1571;&#1606;&#1575; &#1571;&#1606;&#1592;&#1585; &#1576;&#1573;&#1580;&#1604;&#1575;&#1604; &#1603;&#1576;&#1610;&#1585; &#1608;&#1575;&#1581;&#1578;&#1585;&#1575;&#1605; &#1573;&#1604;&#1609; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1585;&#1580;&#1575;&#1604; &#1575;&#1604;&#1593;&#1592;&#1575;&#1605; &#1593;&#1604;&#1609; &#1571;&#1606;&#1607;&#1605; &#1585;&#1601;&#1593;&#1608;&#1575; &#1575;&#1604;&#1607;&#1608;&#1575;&#1606; &#1593;&#1606; &#1580;&#1576;&#1610;&#1606; &#1571;&#1605;&#1578;&#1606;&#1575; &#1587;&#1608;&#1575;&#1569; &#1575;&#1604;&#1584;&#1610;&#1606; &#1601;&#1580;&#1585;&#1608;&#1575; &#1601;&#1610; &#1575;&#1604;&#1585;&#1610;&#1575;&#1590; &#1571;&#1608; &#1578;&#1601;&#1580;&#1610;&#1585;&#1575;&#1578; &#1575;&#1604;&#1582;&#1576;&#1585; &#1571;&#1608; &#1578;&#1601;&#1580;&#1610;&#1585;&#1575;&#1578; &#1588;&#1585;&#1602; &#1573;&#1601;&#1585;&#1610;&#1602;&#1610;&#1575; &#1608;&#1605;&#1575; &#1588;&#1575;&#1576;&#1607; &#1584;&#1604;&#1603;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>For I look with great respect and veneration to those mighty men who raised humiliation from the forehead of our ummah, whether those who detonated bombs in Riyaadh or bombings in al-Khobar or the bombings in East Africa and what resembles that.</blockquote>    <P>
This is with our knowledge that both Muslims and non-Muslims were killed in these bombings. In response to these bombings that <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> is praising, the Salafi Scholar, Shaykh Ibn al-Uthaymeen (rahimahullaah) said as occurs in the cassette "al-Hadith al-Ajeeb Fil-Balad al-Habeeb":    <P>
<div class='arabic' align='right'>&#1575;&#1604;&#1608;&#1575;&#1580;&#1576; &#1593;&#1604;&#1609; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1571;&#1606; &#1610;&#1576;&#1610;&#1606;&#1608;&#1575; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1606;&#1607;&#1580; [ &#1571;&#1610;: &#1605;&#1575; &#1581;&#1589;&#1604; &#1605;&#1606; &#1578;&#1601;&#1580;&#1610;&#1585; &#1601;&#1610; &#1575;&#1604;&#1585;&#1610;&#1575;&#1590; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575; ] &#1605;&#1606;&#1607;&#1580; &#1582;&#1576;&#1610;&#1579;&#1548; &#1605;&#1606;&#1607;&#1580; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580;...</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>It is obligatory upon the students of knowledge to clarify that this methodology [meaning the bombings that took place in Riyadh and elsewhere] is a vile methodology, it is the methodology of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>.</blockquote>    <P>
And Shaykh Abdul-Azeez bin Baaz (rahimahullaah) said, as was published in the newspaper, al-Madeenah (25/05/1416H):    <P>
<div class='arabic' align='right'>&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1575;&#1583;&#1579; &#1573;&#1606;&#1605;&#1575; &#1610;&#1602;&#1608;&#1605; &#1576;&#1607; &#1605;&#1606; &#1604;&#1575; &#1610;&#1572;&#1605;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1610;&#1608;&#1605; &#1575;&#1604;&#1570;&#1582;&#1585;&#1548; &#1604;&#1575; &#1578;&#1580;&#1583; &#1605;&#1606; &#1610;&#1572;&#1605;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1575;&#1604;&#1610;&#1608;&#1605; &#1575;&#1604;&#1570;&#1582;&#1585; &#1573;&#1610;&#1605;&#1575;&#1606;&#1575; &#1589;&#1581;&#1610;&#1581;&#1575; &#1610;&#1593;&#1605;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1593;&#1605;&#1604; &#1575;&#1604;&#1573;&#1580;&#1585;&#1575;&#1605;&#1610; &#1575;&#1604;&#1582;&#1576;&#1610;&#1579; &#1575;&#1604;&#1584;&#1610; &#1581;&#1589;&#1604; &#1576;&#1607; &#1575;&#1604;&#1590;&#1585;&#1585; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1608;&#1575;&#1604;&#1601;&#1587;&#1575;&#1583; &#1575;&#1604;&#1603;&#1576;&#1610;&#1585;&#1548; &#1573;&#1606;&#1605;&#1575; &#1610;&#1601;&#1593;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1581;&#1575;&#1583;&#1579; &#1608;&#1571;&#1588;&#1576;&#1575;&#1607;&#1607; &#1606;&#1601;&#1608;&#1587; &#1582;&#1576;&#1610;&#1579;&#1577; &#1605;&#1605;&#1604;&#1608;&#1569;&#1577; &#1605;&#1606; &#1575;&#1604;&#1581;&#1602;&#1583; &#1608;&#1575;&#1604;&#1581;&#1587;&#1583; &#1608;&#1575;&#1604;&#1588;&#1585; &#1608;&#1575;&#1604;&#1601;&#1587;&#1575;&#1583; &#1608;&#1593;&#1583;&#1605; &#1575;&#1604;&#1573;&#1610;&#1605;&#1575;&#1606; &#1576;&#1575;&#1604;&#1604;&#1607; &#1608;&#1585;&#1587;&#1608;&#1604;&#1607; &#1606;&#1587;&#1571;&#1604; &#1575;&#1604;&#1604;&#1607; &#1575;&#1604;&#1593;&#1575;&#1601;&#1610;&#1577; &#1608;&#1575;&#1604;&#1587;&#1604;&#1575;&#1605;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There is no doubt that this event was carried out by those who do not have faith in Allaah and the Last Day, you will not find one who has faith in Allaah and the Last Day with a sound (correct) faith doing the likes of this vile, criminal act through which great harm and great corruption has occurred. Rather, this even and its likes are performed by filthy souls that are filleld with jealousy, hatred, evil, corruption and absence of faith in Allaah and His Messenger, we ask Allaah for pardon and safety.</blockquote>    <P>
So you <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> praising those vile criminals and you have deeply-grounded Scholars such as Ibn al-Uthaymeen and Ibn Baz describing theme as filthy souls filled with hatred and evil and upon the vile methodology of the Kharijites!    <P>
Usamah <a href='tags/bin-laden.html' class='tagLink'><font class='tagLink'>Bin Laden</font></a> stated - making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the bulk of the Muslim Ummah - as broadcast on al-Jazeerah (08/10/2001) - after 9/11:    <P>
<div class='arabic' align='right'>&#1573;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1571;&#1581;&#1583;&#1575;&#1579; &#1602;&#1583; &#1602;&#1587;&#1605;&#1578; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1576;&#1571;&#1587;&#1585;&#1607; &#1573;&#1604;&#1609; &#1601;&#1587;&#1591;&#1575;&#1591;&#1610;&#1606; &#1601;&#1587;&#1591;&#1575;&#1591; &#1573;&#1610;&#1605;&#1575;&#1606; &#1604;&#1575; &#1606;&#1601;&#1575;&#1602; &#1601;&#1610;&#1607; &#1608;&#1601;&#1587;&#1591;&#1575;&#1591; &#1603;&#1601;&#1585; &#1571;&#1593;&#1575;&#1584;&#1606;&#1575; &#1575;&#1604;&#1604;&#1607; &#1608;&#1573;&#1610;&#1575;&#1603;&#1605; &#1605;&#1606;&#1607;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Indeed these events have divided the entire world into two camps. A camp in which there is (pure) faith, complete devoid of hypocrisy and a camp of kufr (disbelief).</blockquote>    <P>
He means here that those who support 9/11 are in the camp of pure faith and those who do not are in the camp of disbelief and this applies to the entire Earth. This is clear <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the majority of the Muslims on the earth.     <P>
These statements are a glimpse of the creed and methodology of <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> and it is the creed of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> who make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of rulers and sinners and who <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> and exit from their obedience and who make oppressive judgements of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> upon the masses of Muslims on account of issues that do not warrant that.    <P>
Finally, it should be said that the primary enmity and resentment of these people is towards "apostates" and governments in the Muslim lands, they treat such people as the greatest enemy, more worthy of being fought and killed than non-Muslim aggressors. It just so happens that non-Muslim involvement in Muslim nations has gotten in the way of their plans. If there had not been a single American, British or European soldier in any of the Muslim lands, it would have been these people that would be blowing up and killing Muslims after having accused them of apostasy and indeed that was already happening well before 9/11 in the Muslim lands. This renders futile the claim that these terrorists do what they do because of foreign policy of non-Muslim governments. <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/kpavv-usamah-bin-laden-is-a-takfiri-kharijite-and-is-worse-than-the-kharijites-of-old-by-far.html">Usamah bin Laden is a Takfiri Kharijite And is Worse than the Kharijites of Old by Far</a><BR>
//www.takfiris.com/takfir/?kpavv<BR>

<li><a href="articles/owscq-shaykh-ibn-jibreen-was-not-with-the-leninist-takfiri-kharijites-part-3---usama-bin-laden-and-followers-make-takfir-of-the-muslims.html">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 3 - Usamah bin Laden and Followers Make Takfir of the Muslims</a><BR>
//www.takfiris.com/takfir/?owscq<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?kpavv by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


