




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?ortzt by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Shaykh al-Islam Ibn Taymiyyah on Tabdeel and Shar' Mubaddal - Part 1</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh al-Islam Ibn Taymiyyah on Tabdeel and Shar' Mubaddal - Part 1</span><BR>
Wednesday, January 26 2011 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><img src=assets/images/al-hamd-salat.gif border=0>    <P>
<font class='titleHeadline'>Introduction</font>    <P>
<div class='sidebar'>In previous articles, we addressed one of the major doubts of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> (Qutbiyyah, Kharijiyyah Asriyyah) in using many statements of Shaykh al-Islam Ibn Taymiyyah which they do not understand, and twist and distort for their own nefarious purposes. This doubt pertains to what is <i>iltizaam</i> and <i>imtinaa'</i> and you can read those two articles <a href=index72af.html?ooxme>here</a> and <a href=indexfae6.html?dawrs>here</a>.    <P>
Another of the major doubts of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> is pertaining to the subjects of <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>tabdeel</font></a> (alteration) and <a href='tags/istibdaal.html' class='tagLink'><font class='tagLink'>istibdaal</font></a> (substitution, replacement) and what is common in the writings of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> is that they do not distinguish between the two, and they use the speech of Ibn Taymiyyah out of context, and for other than what it is actually referring to. In this series, we want to document statements from Ibn Taymiyyah on <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>tabdeel</font></a> in particular so that we can establish firmly, that <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>tabdeel</font></a> is to "alter" the religion, meaning to make something from it that is not from it and to ascribe it to Allaah. As for <a href='tags/istibdaal.html' class='tagLink'><font class='tagLink'>istibdaal</font></a> (substitution, replacement), then we will document the statements of the Scholars on that subject separately. These materials are approximately eight years old and are being republished for easier and wider access.</div>    <P>
Shaykh al-Islam Ibn Taymiyyah said in <i>Majmu' al-Fataawaa</i> (11/265):     <P>
<div class='arabic' align='right'>&#1608;&#1571;&#1605;&#1575; &#1573;&#1584;&#1575; &#1571;&#1585;&#1610;&#1583; &#1576;&#1575;&#1604;&#1588;&#1585;&#1593; &#1581;&#1603;&#1605; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605; &#1601;&#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1592;&#1575;&#1604;&#1605;&#1575; &#1608;&#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1593;&#1575;&#1583;&#1604;&#1575; &#1608;&#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1589;&#1608;&#1575;&#1576;&#1575; &#1608;&#1602;&#1583; &#1610;&#1603;&#1608;&#1606; &#1582;&#1591;&#1571; &#1608;&#1602;&#1583; &#1610;&#1585;&#1575;&#1583; &#1576;&#1575;&#1604;&#1588;&#1585;&#1593; &#1602;&#1608;&#1604; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1601;&#1602;&#1607; : &#1603;&#1571;&#1576;&#1610; &#1581;&#1606;&#1610;&#1601;&#1577; &#1608;&#1575;&#1604;&#1579;&#1608;&#1585;&#1610; &#1608;&#1605;&#1575;&#1604;&#1603; &#1576;&#1606; &#1571;&#1606;&#1587; &#1608;&#1575;&#1604;&#1571;&#1608;&#1586;&#1575;&#1593;&#1610;  &#1608;&#1575;&#1604;&#1604;&#1610;&#1579; &#1576;&#1606; &#1587;&#1593;&#1583; &#1608;&#1575;&#1604;&#1588;&#1575;&#1601;&#1593;&#1610; &#1608;&#1571;&#1581;&#1605;&#1583; &#1608;&#1573;&#1587;&#1581;&#1575;&#1602; &#1608;&#1583;&#1575;&#1608;&#1583; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1601;&#1607;&#1572;&#1604;&#1575;&#1569; &#1571;&#1602;&#1608;&#1575;&#1604;&#1607;&#1605; &#1610;&#1581;&#1578;&#1580; &#1604;&#1607;&#1575; &#1576;&#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1573;&#1584;&#1575; &#1602;&#1604;&#1583; &#1594;&#1610;&#1585;&#1607; &#1581;&#1610;&#1579; &#1610;&#1580;&#1608;&#1586; &#1584;&#1604;&#1603; &#1603;&#1575;&#1606; &#1580;&#1575;&#1574;&#1586;&#1575; &#1571;&#1610; &#1604;&#1610;&#1587; &#1575;&#1578;&#1576;&#1575;&#1593; &#1571;&#1581;&#1583;&#1607;&#1605; &#1608;&#1575;&#1580;&#1576;&#1575; &#1593;&#1604;&#1609; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1571;&#1605;&#1577; &#1603;&#1575;&#1578;&#1576;&#1575;&#1593; &#1575;&#1604;&#1585;&#1587;&#1608;&#1604; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1604;&#1575; &#1610;&#1581;&#1585;&#1605; &#1578;&#1602;&#1604;&#1610;&#1583; &#1571;&#1581;&#1583;&#1607;&#1605; &#1603;&#1605;&#1575; &#1610;&#1581;&#1585;&#1605; &#1575;&#1578;&#1576;&#1575;&#1593; &#1605;&#1606; &#1610;&#1578;&#1603;&#1604;&#1605; &#1576;&#1594;&#1610;&#1585; &#1593;&#1604;&#1605; . &#1608;&#1571;&#1605;&#1575; &#1573;&#1606; &#1571;&#1590;&#1575;&#1601; &#1571;&#1581;&#1583; &#1573;&#1604;&#1609; &#1575;&#1604;&#1588;&#1585;&#1610;&#1593;&#1577; &#1605;&#1575; &#1604;&#1610;&#1587; &#1605;&#1606;&#1607;&#1575; &#1605;&#1606; &#1571;&#1581;&#1575;&#1583;&#1610;&#1579; &#1605;&#1601;&#1578;&#1585;&#1575;&#1577; &#1571;&#1608; &#1578;&#1571;&#1608;&#1604; &#1575;&#1604;&#1606;&#1589;&#1608;&#1589; &#1576;&#1582;&#1604;&#1575;&#1601; &#1605;&#1585;&#1575;&#1583; &#1575;&#1604;&#1604;&#1607; &#1608;&#1606;&#1581;&#1608; &#1584;&#1604;&#1603; ; &#1601;&#1607;&#1584;&#1575; &#1605;&#1606; &#1606;&#1608;&#1593; &#1575;&#1604;&#1578;&#1576;&#1583;&#1610;&#1604; &#1601;&#1610;&#1580;&#1576; &#1575;&#1604;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1588;&#1585;&#1593; &#1575;&#1604;&#1605;&#1606;&#1586;&#1604; &#1608;&#1575;&#1604;&#1588;&#1585;&#1593; &#1575;&#1604;&#1605;&#1572;&#1608;&#1604; &#1608;&#1575;&#1604;&#1588;&#1585;&#1593; &#1575;&#1604;&#1605;&#1576;&#1583;&#1604; &#1603;&#1605;&#1575; &#1610;&#1601;&#1585;&#1602; &#1576;&#1610;&#1606; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1575;&#1604;&#1603;&#1608;&#1606;&#1610;&#1577; &#1608;&#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1575;&#1604;&#1583;&#1610;&#1606;&#1610;&#1577; &#1575;&#1604;&#1571;&#1605;&#1585;&#1610;&#1577; &#1608;&#1576;&#1610;&#1606; &#1605;&#1575; &#1610;&#1587;&#1578;&#1583;&#1604; &#1593;&#1604;&#1610;&#1607;&#1575; &#1576;&#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1576;&#1610;&#1606; &#1605;&#1575; &#1610;&#1603;&#1578;&#1601;&#1609; &#1601;&#1610;&#1607;&#1575; &#1576;&#1584;&#1608;&#1602; &#1589;&#1575;&#1581;&#1576;&#1607;&#1575; &#1608;&#1608;&#1580;&#1583;&#1607; . </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for when the judgement of a ruler is intended by [the term] al-shar' (the legislation), then he could be oppressive, and he could be just, and he could be correct, or he could be in error. Evidences are sought from the Book and the Sunnah for the statements of ash-Shaafi'ee, Ahmad, Ishaaq, Daawood and others, and when a person blindly follows another person, [in the situation] that is permitted for him, then it is permissible. Meaning, that the following (ittibaa') of one of them is not obligatory upon the whole Ummah just like the following (ittibaa') of the Messenger (sallallaahu alaihi wasallam) (is obligatory upon the whole Ummah). And nor is taqleed of one of them prohibited in the same manner as following (ittibaa') the one who speaks without knowledge (is prohibited). <b>And as for whatever a person ascribes to the Sharee'ah that is not from it, such as the fabricated ahaadeeths, or interpolating (ta'awwul) the texts in a way that opposes the desired intent of Allaah, and other such things, then this is a form of <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>tabdeel</font></a> (altering, changing)</b>. Thus it is obligatory <u>to differentiate</u> between the revealed legislation (ash-shar' al-munazzal), the interpreted legislation (ash-shar' al-mu'awwal) and the altered legislation (ash-shar' al-mubaddal), just as it is to be differentiated between the creational reality and the commanded religious reality and also between that which the Book and the Sunnah give evidence to and that in which (a person's) feelings and impulses are sufficed with.</blockquote>    <P>
<font class='titleHeadline'>Comments</font>    <P>
<blockquote>In this statement it is clear that Ibn Taymiyyah is differentiating between what is the actual revealed legislation (al-shar' al-munazzal) and between the views and opinions of the scholars and jurists based upon the revealed legislation but which are their interpretations, and the altered religion (al-shar' al-mubaddal) which is whatever is ascribed to the religion but is not from it, and the prominent example of that is the fabricated ahaadeeth.    <P>
Thus, <a href='tags/tabdeel.html' class='tagLink'><font class='tagLink'>tabdeel</font></a> is to ascribe something to the religion that which is not from it, and this applies across the board in all affairs of the religion (as we shall see from further quotes), in beliefs, in worship, in dealings, and in rulings. And this is why it is said about previous religions in that they were "alterered" (<a href='tags/mubaddal.html' class='tagLink'><font class='tagLink'>mubaddal</font></a>) and those alterations being taken as the deen with Allaah, the Exalted, when Allaah gave no authority for those matters. And Ibn Taymiyyah wrote a work in refutation of the Christians who altered the religion of the Messiah, Jesus, and it is named, (<span class='arb'>&#1575;&#1604;&#1580;&#1608;&#1575;&#1576; &#1575;&#1604;&#1589;&#1581;&#1610;&#1581; &#1604;&#1605;&#1606; &#1576;&#1583;&#1604; &#1583;&#1610;&#1606; &#1575;&#1604;&#1605;&#1587;&#1576;&#1581;</span>), <i>The Correct Reply to the One Who Altered the Religion of the Messiah</i>, and there is no doubt that what the Christians innovated was treated by them as being from the religion brought by Christ from his Lord.  </blockquote> <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/ortzt-shaykh-al-islam-ibn-taymiyyah-on-tabdeel-and-shar-mubaddal---part-1.html">Shaykh al-Islam Ibn Taymiyyah on Tabdeel and Shar' Mubaddal - Part 1</a><BR>
//www.takfiris.com/takfir/?ortzt<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?ortzt by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


