




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?wmagi by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</span><BR>
Tuesday, December 29 2009 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Yusuf al-Qaradawi, said in his book (<span class='arb'>&#1571;&#1608;&#1604;&#1608;&#1610;&#1575;&#1578; &#1575;&#1604;&#1581;&#1585;&#1603;&#1577; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577;</span>) "<i>Priorities of the Islamic Movement</i>" (p.110):    <P>
<div class='arabic' align='right'>&#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1592;&#1607;&#1585;&#1578; &#1603;&#1578;&#1576; &#1575;&#1604;&#1588;&#1607;&#1610;&#1583; &#1587;&#1610;&#1583; &#1602;&#1591;&#1576;&#1548; &#1575;&#1604;&#1578;&#1610; &#1578;&#1605;&#1579;&#1604; &#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1575;&#1604;&#1571;&#1582;&#1610;&#1585;&#1577; &#1605;&#1606; &#1578;&#1601;&#1603;&#1610;&#1585;&#1607;&#1548; &#1608;&#1575;&#1604;&#1578;&#1610; &#1578;&#1606;&#1590;&#1581; &#1576;&#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593;&#1548; &#1608;&#1578;&#1571;&#1580;&#1610;&#1604; &#1575;&#1604;&#1583;&#1593;&#1608;&#1577; &#1573;&#1604;&#1609; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610; &#1576;&#1601;&#1603;&#1585;&#1577; &#1578;&#1580;&#1583;&#1610;&#1583; &#1575;&#1604;&#1601;&#1602;&#1607; &#1608;&#1578;&#1591;&#1608;&#1610;&#1585;&#1607;&#1548; &#1608;&#1573;&#1581;&#1610;&#1575;&#1569; &#1575;&#1604;&#1575;&#1580;&#1578;&#1607;&#1575;&#1583;&#1548; &#1608;&#1578;&#1583;&#1593;&#1608; &#1573;&#1604;&#1609; &#1575;&#1604;&#1593;&#1586;&#1604;&#1577; &#1575;&#1604;&#1588;&#1593;&#1608;&#1585;&#1610;&#1577; &#1593;&#1606; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593;&#1548; &#1608;&#1602;&#1591;&#1593; &#1575;&#1604;&#1593;&#1604;&#1575;&#1602;&#1577; &#1605;&#1593; &#1575;&#1604;&#1570;&#1582;&#1585;&#1610;&#1606;&#1548; &#1608;&#1573;&#1593;&#1604;&#1575;&#1606; &#1575;&#1604;&#1580;&#1607;&#1575;&#1583; &#1575;&#1604;&#1607;&#1580;&#1608;&#1605;&#1610; &#1593;&#1604;&#1609; &#1575;&#1604;&#1606;&#1575;&#1587; &#1603;&#1575;&#1601;&#1577;&#1548; &#1608;&#1575;&#1604;&#1573;&#1586;&#1585;&#1575;&#1569; &#1576;&#1583;&#1593;&#1575;&#1577; &#1575;&#1604;&#1578;&#1587;&#1575;&#1605;&#1581; &#1608;&#1575;&#1604;&#1605;&#1585;&#1608;&#1606;&#1577;&#1548; &#1608;&#1585;&#1605;&#1610;&#1607;&#1605; &#1576;&#1575;&#1604;&#1587;&#1584;&#1575;&#1580;&#1577; &#1608;&#1575;&#1604;&#1607;&#1586;&#1610;&#1605;&#1577; &#1575;&#1604;&#1606;&#1601;&#1587;&#1610;&#1577; &#1571;&#1605;&#1575;&#1605; &#1575;&#1604;&#1581;&#1590;&#1575;&#1585;&#1577; &#1575;&#1604;&#1594;&#1585;&#1576;&#1610;&#1577;&#1548; &#1608;&#1610;&#1578;&#1580;&#1604;&#1609; &#1584;&#1604;&#1603; &#1571;&#1608;&#1590;&#1581; &#1605;&#1575; &#1610;&#1603;&#1608;&#1606; &#1601;&#1610; &#1578;&#1601;&#1587;&#1610;&#1585; "&#1601;&#1610; &#1592;&#1604;&#1575;&#1604; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606;" &#1601;&#1610; &#1591;&#1576;&#1593;&#1578;&#1607; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577;&#1548; &#1608;&#1601;&#1610; "&#1605;&#1593;&#1575;&#1604;&#1605; &#1601;&#1610; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602;"&#1548; &#1608;&#1605;&#1593;&#1592;&#1605;&#1607; &#1605;&#1602;&#1578;&#1576;&#1587; &#1605;&#1606; &#1575;&#1604;&#1592;&#1604;&#1575;&#1604;&#1548; &#1608;&#1601;&#1610; "&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1608;&#1605;&#1588;&#1603;&#1604;&#1575;&#1578; &#1575;&#1604;&#1581;&#1590;&#1575;&#1585;&#1577;"&#1548; &#1608;&#1594;&#1610;&#1585;&#1607;&#1575;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And it was in this period that the books of the Shaheed, <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> appeared, the books that represented his final thoughts (in ideology, before his death). Those which <b>justified the <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of (whole) societies</b>... the breaking of all sentimental attachments to society, breaking off ties with others, and <b>the announcement of a destructive jihad against the whole of mankind</b>. And showing contempt against the du?at who call for lenience and softness, accusing them of idiocy, and being defeatist [Saying all of this], in front of the western civilisation. He made this manifest, in the most clear manner in the tafsir, "<i>Fee Zilaal il-Qur'aan</i>", in the 2nd edition and in "<i>Ma'alim fit-Tariq</i>" (Milestones), and the bulk of it is taken from "<i>Zilal</i>" and "<i>Al-Islam wa Mushkilat al-Hadaarah</i>" and others...</blockquote>    <P>
In this quote one of major figureheads of al-Ikhwaan al-Muslimeen confirms that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> revived the manhaj of the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> (Khawaarij) based upon his <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the whole Ummah, and called for a destructive "Jihaad" (which really means a Leninist Revolution Islamicized as "Jihaad") against all governments and nations. As for his <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all nations and societies, it is a matter as clear as daylight and there are abundant explicit texts in this regard in his books which we will highlight inshaa'Allaah. As for the Leninist-type revolution he advocated in the name of Jihaad, then contemporary members of the Muslim Brotherhood acknowledge that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> was influenced by Leninist revolutionary methodology. Ibrahim al-Houdaiby writes in an article "<i>Four Decades After Sayyid Qutb's Execution</i>" (bold emphasis is ours):    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>In "Milestones" <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> presents a manifesto for change, <b>one heavily influenced by Lenin's "What is to be done," with the clear Islamization of its basic notions</b>. He argued that society was suffering from "jahiliyya" (a state of ignorance which preceded the revelation of Islam) and that consequently, there is no room for middle ground between Islamists and their societies.</blockquote>    <P>
Shaykh Saalih al-Fawzaan said, as occurs in the book (<span class='arb'>&#1575;&#1604;&#1573;&#1580;&#1575;&#1576;&#1575;&#1578; &#1575;&#1604;&#1605;&#1607;&#1605;&#1577; &#1601;&#1609; &#1575;&#1604;&#1605;&#1588;&#1575;&#1603;&#1604; &#1575;&#1604;&#1605;&#1604;&#1605;&#1577;</span>) in response to a question by some students pertaining to those who revile a particular Scholar who refuted <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and then advise the students to read the books of Sayyid Qutb:    <P>
<div class='arabic' align='right'> &#1571;&#1605;&#1575; &#1578;&#1582;&#1589;&#1610;&#1589;&#1607; &#1602;&#1585;&#1575;&#1569;&#1577; &#1603;&#1578;&#1576; &#1601;&#1604;&#1575;&#1606; &#1601;&#1602;&#1591; &#1548; &#1601;&#1607;&#1584;&#1575; &#1610;&#1583;&#1604; &#1593;&#1604;&#1609; &#1571;&#1606;&#1607; &#1589;&#1575;&#1581;&#1576; &#1607;&#1608;&#1609; ... &#1608;&#1606;&#1581;&#1606; &#1575;&#1584;&#1575; &#1602;&#1585;&#1571;&#1606;&#1575; &#1603;&#1578;&#1576; &#1587;&#1610;&#1583; &#1602;&#1591;&#1576; &#1571;&#1608; &#1594;&#1610;&#1585;&#1607;&#1575; &#1605;&#1575;&#1584;&#1575; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1567;  &#1607;&#1604; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1578;&#1608;&#1581;&#1610;&#1583; &#1567;  &#1607;&#1604; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1588;&#1585;&#1603; &#1567;  &#1607;&#1604; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1593;&#1585;&#1601;&#1577; &#1575;&#1604;&#1593;&#1576;&#1575;&#1583;&#1575;&#1578; &#1567;  &#1607;&#1604; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1593;&#1585;&#1601;&#1577; &#1571;&#1581;&#1603;&#1575;&#1605; &#1575;&#1604;&#1605;&#1593;&#1575;&#1605;&#1604;&#1575;&#1578; &#1608;&#1575;&#1604;&#1601;&#1602;&#1607; &#1567;  &#1604;&#1575; &#1571;&#1592;&#1606; &#1571;&#1606;&#1606;&#1575; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1606;&#1607;&#1575; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1608;&#1593;&#1610;&#1575;&#1578; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605;&#1577; &#1605;&#1606; &#1575;&#1604;&#1593;&#1604;&#1605;  &#1576;&#1604; &#1606;&#1587;&#1578;&#1601;&#1610;&#1583; &#1605;&#1606;&#1607;&#1575; &#1575;&#1604;&#1581;&#1605;&#1575;&#1587; &#1575;&#1604;&#1601;&#1575;&#1585;&#1594; &#1548; &#1608;&#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585; &#1604;&#1593;&#1605;&#1608;&#1605; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1548; &#1608;&#1575;&#1604;&#1571;&#1601;&#1603;&#1575;&#1585; &#1575;&#1604;&#1579;&#1608;&#1585;&#1610;&#1577;  &#1601;&#1575;&#1604;&#1606;&#1575;&#1589;&#1581; &#1610;&#1608;&#1589;&#1610; &#1575;&#1604;&#1591;&#1604;&#1575;&#1576; &#1576;&#1602;&#1585;&#1575;&#1569;&#1577; &#1575;&#1604;&#1603;&#1578;&#1576; &#1575;&#1604;&#1605;&#1601;&#1610;&#1583;&#1577; &#1604;&#1607;&#1605; &#1601;&#1610; &#1593;&#1602;&#1610;&#1583;&#1578;&#1607;&#1605; &#1548; &#1608;&#1601;&#1610; &#1593;&#1576;&#1575;&#1583;&#1575;&#1578;&#1607;&#1605; &#1548; &#1608;&#1601;&#1610; &#1605;&#1593;&#1575;&#1605;&#1604;&#1575;&#1578;&#1607;&#1605; &#1548; &#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1606;&#1575;&#1589;&#1581;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>As for him specifying reading the books of so and so only, then this indicates he is a person of desire ... and when we read the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> or other than them, [with what] shall we benefit? Will be benefit in knowing Tawheed? Will we benefit in knowing Shirk? Will we benefit in knowing the acts of worship? Will we benefit in knowing the rulings of the mu'aamalaat and fiqh? I do not think we will benefit from these great types of knowledge. <b>Rather, we will benefit from them [only with] empty sentiments, <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the generality of the Muslims, and revolutionary ideologies (i.e. rebellions and snatches of power)</b>. So the advisor [ought to] advise the students to read the books beneficial to them in their aqidah, their [acts of] worship, their dealings. This is the one who is the [sincere] advisor.</blockquote>    <P>
And this statement shows that these people are not attached to the books of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> <b>except for the reason</b> that they contain <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of all Muslim societies and calls for violent (Leninist-type) revolutions. This is now a known, established truth, its out in the open, and excuses are not possible any more, because once the truth is established, the excuses are cut off, the doors have been shut, the hujjah has been established, and no one persists in propagandizing for <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> after this, or going out of their way to defend his ideologies whilst slandering, reviling, abusing and attacking those who defend the aqidah from Qutb's excesses except an astray deviant.    <P>
   <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/wurdh-ali-al-timimi-on-the-rulers-who-rule-by-secular-laws.html">Concerning Ali al-Timimi on the Rulers Who Rule by Secular Laws and the Qutbi Accusation of Irjaa' Against the Imaams of the Sunnah</a><BR>
//www.takfiris.com/takfir/?wurdh<BR>

<li><a href="articles/owscq-shaykh-ibn-jibreen-was-not-with-the-leninist-takfiri-kharijites-part-3---usama-bin-laden-and-followers-make-takfir-of-the-muslims.html">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 3 - Usamah bin Laden and Followers Make Takfir of the Muslims</a><BR>
//www.takfiris.com/takfir/?owscq<BR>

<li><a href="articles/qyrnf-shaykh-salih-al-fawzans-refutation-of-salman-al-awdahs-generalized-mass-takfir-of-all-the-muslims.html">Shaykh Salih al-Fawzan's Refutation of Salman al-Awdah's Generalized Mass Takfir of All the Muslims</a><BR>
//www.takfiris.com/takfir/?qyrnf<BR>

<li><a href="articles/aorjc-shaykh-salih-al-fawzan-on-the-salman-al-awdahs-saying-the-absent-ummah-this-necessitates-the-takfir-of-the-whole-ummah.html">Shaykh Salih al-Fawzan on Salman al-Awdah's Saying 'The Absent Ummah': This Necessitates the Takfir of the Whole Ummah</a><BR>
//www.takfiris.com/takfir/?aorjc<BR>

<li><a href="articles/jqpkg-yusuf-al-qaradawi-the-new-qutbi-understanding-of-tawheed.html">Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</a><BR>
//www.takfiris.com/takfir/?jqpkg<BR>

<li><a href="articles/lyhev-yusuf-al-qaradawi-on-sayyid-qutb-all-muslims-are-kuffaar-mushrikeen-apostates-except-those-who-agree-with-my-ideology.html">Yusuf al-Qaradawi on Sayyid Qutb: All Muslims Are Apostates (Kuffaar, Mushrikeen) Except Those Who Agree With My Ideology and Join My Group</a><BR>
//www.takfiris.com/takfir/?lyhev<BR>

<li><a href="articles/xbnsa-yusuf-al-qaradawi-sayyid-qutb-makes-it-explicitly-clear-that-all-muslims-today-are-disbelievers.html">Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</a><BR>
//www.takfiris.com/takfir/?xbnsa<BR>

<li><a href="articles/mcjur-ali-al-timimi-on-the-emergence-of-takfiri-leninism-in-1965-egypt-and-the-obligation-to-warn-from-its-evil.html">Ali al-Timimi on the Emergence of Takfiri Leninism in 1965 Egypt and The Obligation to Warn From Its Evil</a><BR>
//www.takfiris.com/takfir/?mcjur<BR>

<li><a href="articles/pmjvl-fareed-abdul-khaliq-former-murshid-of-ikhwaan-the-emergence-of-the-doctrines-of-jaahliyyah-haakimiyyah-and-takfir-of-all-societies.html">Fareed Abdul-Khaliq (Former Murshid of Ikhwaan): The Emergence of the Doctrines of Jaahliyyah, Haakimiyyah and Takfir of All Societies</a><BR>
//www.takfiris.com/takfir/?pmjvl<BR>

<li><a href="articles/hulwt-yusuf-al-qardawi-groups-known-as-the-qutbiyyoon-found-harboring-the-doctrines-of-takfir-found-in-az-zilaal.html">Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</a><BR>
//www.takfiris.com/takfir/?hulwt<BR>

<li><a href="articles/ezjol-fareed-abdul-khaliq-former-murshid-of-ikhwaan-the-origins-of-mass-takfir-of-muslim-societies-lie-in-the-books-of-sayyid-qutb.html">Fareed Abdul-Khaliq (Former Murshid of Ikhwaan): The Origins of Mass Takfir of Muslim Societies Lie In the Books of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?ezjol<BR>

<li><a href="articles/wmagi-yusuf-al-qaradawi-the-takfir-of-all-societies-and-announcement-of-destructive-revolutions-in-the-final-works-of-sayyid-qutb.html">Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?wmagi<BR>

<li><a href="articles/ihnep-ali-al-timimi-on-secular-laws-the-saudi-government-and-takfir.html">Ali al-Timimi on Secular Laws, the Saudi Government, Takfir and Deviant Philosophies of Jihaad</a><BR>
//www.takfiris.com/takfir/?ihnep<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?wmagi by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
</html>


