




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?dawrs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Invalidating Takfiri Doubts: Part 1 - Concerning al-Iltizaam (&#1575;&#1604;&#1573;&#1604;&#1578;&#1586;&#1575;&#1605;) and al-Imtinaa' (&#1575;&#1604;&#1573;&#1605;&#1578;&#1606;&#1575;&#1593;) - Part 2 of 2</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Invalidating Takfiri Doubts: Part 1 - Concerning al-Iltizaam (&#1575;&#1604;&#1573;&#1604;&#1578;&#1586;&#1575;&#1605;) and al-Imtinaa' (&#1575;&#1604;&#1573;&#1605;&#1578;&#1606;&#1575;&#1593;) - Part 2 of 2</span><BR>
Thursday, February 11 2010 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><div class='sidebar'>This is the second part of this article, please make sure you read <b><a href=index72af.html?ooxme>the first part here</a></b> that lays down the background for this article.</div>    <P>
<font class='titleHeadline'>Recap From The First Part</font>    <P>
All the words, <i>al-juhood</i>, <i>al-istihlaal</i>, <i>al-qubool</i>, <i>al-imtinaa'</i>, <i>al-iltizaam</i>, have very specific precise meanings that are different to each other, and in particular <i>al-iltizaam</i> means, "<i>acceptance of the ruling</i>" in the sense that "<i>one accepts that the obligation applies to oneself</i>", and it is not synonymous with the actual fulfilment of the obligation itself. And <i>al-imtinaa'</i> is <i>to withhold from fulfilling an obligation</i> because of either a) not considering that the obligation applies to oneself, which is the absence of al-iltizaam, or b) out of something that constitutes kufr in an of itself such as al-kibr (pride) al-istikbaar (arrogance), al-bughd (hatred) and the likes, even if one accepts that the obligation applies to oneself.    <P>
These are the correct usages of these terms, and this is how the scholars use these terms, both Shaykh ul-Islaam Ibn Taymiyyah and likewise Shaykh ul-Islam Ibn Abdul-Wahhaab. These types of statements <u>are not</u> in relation to the rulers who make iltizaam of the obligations but fall short in fulfilling them in practice.     <P>
<font class='titleHeadline'>Going Back to the Citations of the <a href="tags/takfiris.html" class="tagLink"><font class="tagLink">Takfiris</font></a></font>    <P>
Now that we have laid these foundations and clarified the matter, and learned that all of these words have very specific meanings (istihlaal, qubool, juhood, iltizaam, imtinaa'), that are not to be confused with each other, we can now unveil those <u>academic, intellectual frauds</u> and the multiple levels upon which they are being carried out - and this is very common with the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, Takfiriyyah, Kharijiyyah with respect to the statements of Shaykh ul-Islam Ibn Taymiyyah (and also Shaykh ul-Islam Muhammad bin Abdul-Wahhab) - they take statements from these Scholars and apply them to situations that they do not even apply to.    <P>
Here they are:    <P>
<img src=assets/images/ia-ibn-taymiyyah-imtinaa.gif border=1 border=0>    <P>
These arguments and quotations in this manner are found frequently on the website, forum run by one of the most extreme and bigoted of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, <a href='tags/abu-zubair-saleem-beg.html' class='tagLink'><font class='tagLink'>Abu Zubair <a href="tags/saleem-beg.html" class="tagLink"><font class="tagLink">Saleem Beg</font></a></font></a> al-Azzami, who provides a platform for the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a>, <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> and other extremists to spread their ignorance, deception and lies with  free license. Let's take a closer look at these quotes:    <P>
<b><u>The First Quote is About the Tartars</u></b>    <P>
Let's take the first quote.     <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Any party that refrains from following a single order from the Apparent Shari'a of Islam, they should be fought until they are Disciplined with the Shari'a, even if they were announcing the Two shahaadas (the two statements of 'I bear witness that there is No god but Allah' and 'Muhammad is His Messenger') and practising some of the Shari'a."(Majmu'a Fataawa, V. 28).</blockquote>    <P>
There is no full reference given to it, just a volume number. It actually occurs on page 502 of volume 28. The quoted statement above is in response to a question, and the question is about the Tartars (not about rulers):    <P>
<div class='arabic' align='right'>&#1605;&#1575; &#1578;&#1602;&#1608;&#1604; &#1575;&#1604;&#1601;&#1602;&#1607;&#1575;&#1569; &#1571;&#1574;&#1605;&#1577; &#1575;&#1604;&#1583;&#1610;&#1606; &#1601;&#1610; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1578;&#1578;&#1575;&#1585; &#1575;&#1604;&#1584;&#1610;&#1606; &#1602;&#1583;&#1605;&#1608;&#1575; &#1587;&#1606;&#1577; &#1578;&#1587;&#1593; &#1608;&#1578;&#1587;&#1593;&#1610;&#1606; &#1608;&#1587;&#1578;&#1605;&#1575;&#1574;&#1577; &#1608;&#1601;&#1593;&#1604;&#1608;&#1575; &#1605;&#1575; &#1575;&#1588;&#1578;&#1607;&#1585; &#1605;&#1606; &#1602;&#1578;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1587;&#1576;&#1610; &#1576;&#1593;&#1590; &#1575;&#1604;&#1584;&#1585;&#1575;&#1585;&#1610; &#1608;&#1575;&#1604;&#1606;&#1607;&#1576; &#1604;&#1605;&#1606; &#1608;&#1580;&#1583;&#1608;&#1607; &#1605;&#1606; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1607;&#1578;&#1603;&#1608;&#1575; &#1581;&#1585;&#1605;&#1575;&#1578; &#1575;&#1604;&#1583;&#1610;&#1606; &#1605;&#1606; &#1573;&#1584;&#1604;&#1575;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1573;&#1607;&#1575;&#1606;&#1577; &#1575;&#1604;&#1605;&#1587;&#1575;&#1580;&#1583; &#1604;&#1575; &#1587;&#1610;&#1605;&#1575; " &#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1602;&#1583;&#1587; " &#1608;&#1571;&#1601;&#1587;&#1583;&#1608;&#1575; &#1601;&#1610;&#1607;  &#1608;&#1571;&#1582;&#1584;&#1608;&#1575; &#1605;&#1606; &#1571;&#1605;&#1608;&#1575;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1608;&#1571;&#1605;&#1608;&#1575;&#1604; &#1576;&#1610;&#1578; &#1575;&#1604;&#1605;&#1575;&#1604; &#1575;&#1604;&#1581;&#1605;&#1604; &#1575;&#1604;&#1593;&#1592;&#1610;&#1605; &#1608;&#1571;&#1587;&#1585;&#1608;&#1575; &#1605;&#1606; &#1585;&#1580;&#1575;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1575;&#1604;&#1580;&#1605; &#1575;&#1604;&#1594;&#1601;&#1610;&#1585; &#1608;&#1571;&#1582;&#1585;&#1580;&#1608;&#1607;&#1605; &#1605;&#1606; &#1571;&#1608;&#1591;&#1575;&#1606;&#1607;&#1605; . &#1608;&#1575;&#1583;&#1593;&#1608;&#1575; &#1605;&#1593; &#1584;&#1604;&#1603; &#1575;&#1604;&#1578;&#1605;&#1587;&#1603; &#1576;&#1575;&#1604;&#1588;&#1607;&#1575;&#1583;&#1578;&#1610;&#1606; &#1608;&#1575;&#1583;&#1593;&#1608;&#1575; &#1578;&#1581;&#1585;&#1610;&#1605; &#1602;&#1578;&#1575;&#1604; &#1605;&#1602;&#1575;&#1578;&#1604;&#1607;&#1605; &#1604;&#1605;&#1575; &#1586;&#1593;&#1605;&#1608;&#1575; &#1605;&#1606; &#1575;&#1578;&#1576;&#1575;&#1593; &#1571;&#1589;&#1604; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1608;&#1604;&#1603;&#1608;&#1606;&#1607;&#1605; &#1593;&#1601;&#1608;&#1575; &#1593;&#1606; &#1575;&#1587;&#1578;&#1574;&#1589;&#1575;&#1604; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; . &#1601;&#1607;&#1604; &#1610;&#1580;&#1608;&#1586; &#1602;&#1578;&#1575;&#1604;&#1607;&#1605; &#1571;&#1608; &#1610;&#1580;&#1576; &#1608;&#1571;&#1610;&#1605;&#1575; &#1603;&#1575;&#1606; &#1601;&#1605;&#1606; &#1571;&#1610; &#1575;&#1604;&#1608;&#1580;&#1608;&#1607; &#1580;&#1608;&#1575;&#1586;&#1607; &#1571;&#1608; &#1608;&#1580;&#1608;&#1576;&#1607; &#1567; &#1571;&#1601;&#1578;&#1608;&#1606;&#1575; &#1605;&#1571;&#1580;&#1608;&#1585;&#1610;&#1606; .</div>    <P>
This question is about the Tartars who swept across those lands in the year 699H and killed the Muslims, humiliated them, destroyed the mosques, and belittled the Bayt ul-Maqdis, took the wealth of the Muslims, and the bayt ul-maal, and took a great number of Muslim men as captives. Alongside all of this, they claimed attachment to the two shahaadahs (testifications) and claimed the prohibition of fighting against them because they claimed to follow the basis of Islam. So the questioner asks about these people:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>Is it permissible to fight them or is it obligatory (to fight them), and whichever of the two it is, from which angles is it permissible or obligatory...</blockquote>    <P>
Ibn Taymiyyah answered:    <P>
<div class='arabic' align='right'>&#1601;&#1571;&#1580;&#1575;&#1576; : &#1575;&#1604;&#1581;&#1605;&#1583; &#1604;&#1604;&#1607; &#1603;&#1604; &#1591;&#1575;&#1574;&#1601;&#1577; &#1605;&#1605;&#1578;&#1606;&#1593;&#1577; &#1593;&#1606; &#1575;&#1604;&#1578;&#1586;&#1575;&#1605; &#1588;&#1585;&#1610;&#1593;&#1577; &#1605;&#1606; &#1588;&#1585;&#1575;&#1574;&#1593; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1592;&#1575;&#1607;&#1585;&#1577; &#1575;&#1604;&#1605;&#1578;&#1608;&#1575;&#1578;&#1585;&#1577; ; &#1605;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1602;&#1608;&#1605; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1601;&#1573;&#1606;&#1607; &#1610;&#1580;&#1576; &#1602;&#1578;&#1575;&#1604;&#1607;&#1605; &#1581;&#1578;&#1609; &#1610;&#1604;&#1578;&#1586;&#1605;&#1608;&#1575; &#1588;&#1585;&#1575;&#1574;&#1593;&#1607; &#1608;&#1573;&#1606; &#1603;&#1575;&#1606;&#1608;&#1575; &#1605;&#1593; &#1584;&#1604;&#1603; &#1606;&#1575;&#1591;&#1602;&#1610;&#1606; &#1576;&#1575;&#1604;&#1588;&#1607;&#1575;&#1583;&#1578;&#1610;&#1606; &#1608;&#1605;&#1604;&#1578;&#1586;&#1605;&#1610;&#1606; &#1576;&#1593;&#1590; &#1588;&#1585;&#1575;&#1574;&#1593;&#1607; &#1603;&#1605;&#1575; &#1602;&#1575;&#1578;&#1604; &#1571;&#1576;&#1608; &#1576;&#1603;&#1585; &#1575;&#1604;&#1589;&#1583;&#1610;&#1602; &#1608;&#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605; &#1605;&#1575;&#1606;&#1593;&#1610; &#1575;&#1604;&#1586;&#1603;&#1575;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>So he replied: All praise is due to Allaah. Every faction that abstains, withholds (<span class='arb'>&#1591;&#1575;&#1574;&#1601;&#1577; &#1605;&#1605;&#1578;&#1606;&#1593;&#1577;</span>) <u>from making <i>iltizaam</i></u> of a legislated (act) from the legislated (acts) of Islaam that are manifest and [known through] large-scale successive transmission - whether they are from those people or other than them - it is obligatory to fight them <u>until they make <i>iltizaam</i></u> of its legislated acts, even if they utter the two testimonials alongside that, and make iltizaam of some of its (other) legislated (acts), just as Abu Bakr as-Siddeeq and the Companions (radiallaahu anhum) fought against the those who withheld the zakaah.</blockquote>    <P>
We can see from this answer that:    <P>
<ul><li> The quote is about those Tartars who affirm the Shahadah and consider some of the obligations of Islaam binding upon them, but do not consider others (which are well-known, well-transmitted, openly-known obligations) to be binding upon them, even if they accept that they are obligations. Meaning, that they do not make <i>iltizaam</i> of some of the legislated acts.    <P>
<li> So any one who does that, then it is obligatory upon <u>the Islamic authority (rulers)</u> to fight against them until they make <i>iltizaam</i> of that legislated act, which means that they accept that the obligation applies to them.    <P>
<li> This quote from Ibn Taymiyyah has nothing to do with sinful, disobedient rulers who are neglectful in fulfilling or implementing certain obligations. Rather it is about factions of people who make <u>imtinaa'</u> of the well-known outward obligations of Islam such as prayer, zakah, fasting and the likes.  </ul>    <P>
You have to remember that these Takfiri fraudsters who make attachment to Shaykh ul-Islam Ibn Taymiyyah, they lie upon him often, and they twist his statements often, and we see in this example a perfect illustration. They try to apply this to the situation of the rulers who do not act upon or implement some of the legislated obligations of Islam or who may fall into some of the prohibitions, alongside the fact that the rulers actually make <i>iltizaam</i> of those obligations or prohibitions, they accept that the obligation does apply to them. And we see that Ibn Taymiyyah has hundreds of statements prohibiting from fighting against the rulers, and rebelling against them, even if they sin, and oppress the people and fail to abide by aspects of the Sharee'ah - and this is mutawaatir in the Sunnah itself, as occurs in the hadeeth of Hudhayfah as found in Saheeh Muslim, the saying of the Messenger (alayhis salaam):    <P>
<div class='arabic' align='right'> &#1610;&#1603;&#1608;&#1606; &#1576;&#1593;&#1583;&#1610; &#1571;&#1574;&#1605;&#1577; &#1604;&#1575; &#1610;&#1607;&#1578;&#1583;&#1608;&#1606; &#1576;&#1607;&#1583;&#1610; &#1548; &#1608;&#1604;&#1575; &#1610;&#1587;&#1578;&#1606;&#1608;&#1606; &#1576;&#1587;&#1606;&#1578;&#1610; &#1548; &#1608;&#1587;&#1610;&#1602;&#1608;&#1605; &#1601;&#1610;&#1607;&#1605; &#1585;&#1580;&#1575;&#1604; &#1602;&#1604;&#1608;&#1576;&#1607;&#1605; &#1602;&#1604;&#1608;&#1576; &#1575;&#1604;&#1588;&#1610;&#1575;&#1591;&#1610;&#1606; &#1601;&#1610; &#1580;&#1579;&#1605;&#1575;&#1606; &#1573;&#1606;&#1587;. &#1602;&#1604;&#1578; : &#1603;&#1610;&#1601; &#1571;&#1589;&#1606;&#1593; &#1610;&#1575; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1573;&#1606; &#1571;&#1583;&#1585;&#1603;&#1578; &#1584;&#1604;&#1603;&#1567; &#1602;&#1575;&#1604;: &#1578;&#1587;&#1605;&#1593; &#1608;&#1578;&#1591;&#1610;&#1593; &#1604;&#1604;&#1571;&#1605;&#1610;&#1585; &#1608;&#1573;&#1606; &#1590;&#1585;&#1576; &#1592;&#1607;&#1585;&#1603; &#1608;&#1571;&#1582;&#1584; &#1605;&#1575;&#1604;&#1603; </div>     <P>
Here the Prophet (alayhis salaam) said that there will be leaders who will <b>a)</b> not follow the guidance of the Prophet <b>b)</b> not follow his Sunnah <b>c)</b> have the hearts of devils in bodies of men <b>d)</b> beat the people <b>e)</b> confiscate their wealth, and alongside all of that the Prophet advised that the people hear and obey them. This is a matter of creed (aqidah), and the Salaf included it in their works on creed and it is a matter of ijmaa'. Unfortunately, these 20th Century Leninist Takfiri <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>, work against this particular aqidah, through the doctrine and understanding of "social justice" that came to them from <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>, and which itself was taken by <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> from the philosophies of atheist secular Jews and their revolutionary manifestos (<a href=indexb2fc.html?qyowp>see here</a>).    <P>
So you understand what is going on here, the intellectual and academic fraud that is rampant across all Takfiri polemical works, is that they apply the verdicts (of Ibn Taymiyyah and all other Scholars) that pertain to factions who make <i>imtinaa'</i>, meaning they do not make <i>iltizaam</i> (upon the meaning already explained) of something that is a well-known, legislated obligation (such as zakah, or hajj, or fasting and the likes) - they apply these verdicts, wrongly, upon the rulers who make <i>iltizaam</i> (upon the meaning explained) of the obligations but who do not necessarily fulfill the obligations.    <P>
This is one of the major taghuts of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> that they have used for a long time to confuse and deceive the people and by which they lie upon Shaykh ul-Islam Ibn Taymiyyah - so please take note of this matter and understand it well! And when you understand the true meaning of iltizaam and imtinaa, then you will understand much of the speech of Ibn Taymiyyah and Ibn Abdul-Wahhaab and through that, the many quotes brought by the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> to justify their <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and <a href='tags/rebellion.html' class='tagLink'><font class='tagLink'>rebellion</font></a>, will become clear to you.    <P>
<b><u>The Second Quote</u></b>    <P>
The next two quotes are claimed to be from the same page (28/556)    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>"It is known from the religion by necessity, and unanimously by the Muslims to fight any group that stopped one Shari'a of Islamic Shari`a which is apparent and nobody can dispute About it."(ibid., V. 28, p. 556).    <P>
"It is permissible and even compulsory to fight any group or  Party which refrains from a single order from the Shari'a, from  The known and the apparent Islamic law." (Ibid., p. 556)</blockquote>    <P>
When we return to the quotes, we find that these are taken from an answer to a question, and that the question is similar to the previous one, it appears to be in relation to the Tartars and their likes, since the actions described are just like theirs. Also the translations provided are not really accurate. Here is the question:    <P>
<div class='arabic' align='right'> &#1608;&#1587;&#1574;&#1604; &#1575;&#1604;&#1588;&#1610;&#1582; &#1593;&#1606; &#1602;&#1608;&#1605; &#1584;&#1608;&#1610; &#1588;&#1608;&#1603;&#1577; &#1605;&#1602;&#1610;&#1605;&#1610;&#1606; &#1576;&#1571;&#1585;&#1590; &#1608;&#1607;&#1605; &#1604;&#1575; &#1610;&#1589;&#1604;&#1608;&#1606; &#1575;&#1604;&#1589;&#1604;&#1608;&#1575;&#1578; &#1575;&#1604;&#1605;&#1603;&#1578;&#1608;&#1576;&#1575;&#1578; &#1608;&#1604;&#1610;&#1587; &#1593;&#1606;&#1583;&#1607;&#1605; &#1605;&#1587;&#1580;&#1583; &#1608;&#1604;&#1575; &#1571;&#1584;&#1575;&#1606; &#1608;&#1604;&#1575; &#1573;&#1602;&#1575;&#1605;&#1577; &#1608;&#1573;&#1606; &#1589;&#1604;&#1609; &#1571;&#1581;&#1583;&#1607;&#1605; &#1589;&#1604;&#1609; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1594;&#1610;&#1585; &#1575;&#1604;&#1605;&#1588;&#1585;&#1608;&#1593;&#1577; . &#1608;&#1604;&#1575; &#1610;&#1572;&#1583;&#1608;&#1606; &#1575;&#1604;&#1586;&#1603;&#1575;&#1577; &#1605;&#1593; &#1603;&#1579;&#1585;&#1577; &#1571;&#1605;&#1608;&#1575;&#1604;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1605;&#1608;&#1575;&#1588;&#1610; &#1608;&#1575;&#1604;&#1586;&#1585;&#1608;&#1593; . &#1608;&#1607;&#1605; &#1610;&#1602;&#1578;&#1578;&#1604;&#1608;&#1606; &#1601;&#1610;&#1602;&#1578;&#1604; &#1576;&#1593;&#1590;&#1607;&#1605; &#1576;&#1593;&#1590;&#1575; &#1608;&#1610;&#1606;&#1607;&#1576;&#1608;&#1606; &#1605;&#1575;&#1604; &#1576;&#1593;&#1590;&#1607;&#1605; &#1576;&#1593;&#1590;&#1575; &#1608;&#1610;&#1602;&#1578;&#1604;&#1608;&#1606; &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1608;&#1602;&#1583; &#1604;&#1575; &#1610;&#1605;&#1578;&#1606;&#1593;&#1608;&#1606; &#1593;&#1606; &#1587;&#1601;&#1603; &#1575;&#1604;&#1583;&#1605;&#1575;&#1569; &#1608;&#1571;&#1582;&#1584; &#1575;&#1604;&#1571;&#1605;&#1608;&#1575;&#1604; &#1604;&#1575; &#1601;&#1610; &#1588;&#1607;&#1585; &#1585;&#1605;&#1590;&#1575;&#1606; &#1608;&#1604;&#1575; &#1601;&#1610; &#1575;&#1604;&#1571;&#1588;&#1607;&#1585; &#1575;&#1604;&#1581;&#1585;&#1605; &#1608;&#1604;&#1575; &#1594;&#1610;&#1585;&#1607;&#1575; &#1608;&#1573;&#1584;&#1575; &#1571;&#1587;&#1585; &#1576;&#1593;&#1590;&#1607;&#1605; &#1576;&#1593;&#1590;&#1575; &#1576;&#1575;&#1593;&#1608;&#1575; &#1571;&#1587;&#1585;&#1575;&#1607;&#1605; &#1604;&#1604;&#1573;&#1601;&#1585;&#1606;&#1580; . &#1608;&#1610;&#1576;&#1610;&#1593;&#1608;&#1606; &#1585;&#1602;&#1610;&#1602;&#1607;&#1605; &#1605;&#1606; &#1575;&#1604;&#1584;&#1603;&#1608;&#1585; &#1608;&#1575;&#1604;&#1573;&#1606;&#1575;&#1579; &#1604;&#1604;&#1573;&#1601;&#1585;&#1606;&#1580; &#1593;&#1604;&#1575;&#1606;&#1610;&#1577; &#1608;&#1610;&#1587;&#1608;&#1602;&#1608;&#1606;&#1607;&#1605; &#1603;&#1587;&#1608;&#1602; &#1575;&#1604;&#1583;&#1608;&#1575;&#1576; . &#1608;&#1610;&#1578;&#1586;&#1608;&#1580;&#1608;&#1606; &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1601;&#1610; &#1593;&#1583;&#1578;&#1607;&#1575; . &#1608;&#1604;&#1575; &#1610;&#1608;&#1585;&#1579;&#1608;&#1606; &#1575;&#1604;&#1606;&#1587;&#1575;&#1569; . &#1608;&#1604;&#1575; &#1610;&#1606;&#1602;&#1575;&#1583;&#1608;&#1606; &#1604;&#1581;&#1575;&#1603;&#1605; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; . &#1608;&#1573;&#1584;&#1575; &#1583;&#1593;&#1610; &#1571;&#1581;&#1583;&#1607;&#1605; &#1573;&#1604;&#1609; &#1575;&#1604;&#1588;&#1585;&#1593; &#1602;&#1575;&#1604; : &#1573;&#1606;&#1575; &#1575;&#1604;&#1588;&#1585;&#1593; . &#1573;&#1604;&#1609; &#1594;&#1610;&#1585; &#1584;&#1604;&#1603; . &#1601;&#1607;&#1604; &#1610;&#1580;&#1608;&#1586; &#1602;&#1578;&#1575;&#1604;&#1607;&#1605; &#1608;&#1575;&#1604;&#1581;&#1575;&#1604;&#1577; &#1607;&#1584;&#1607; &#1567; &#1608;&#1603;&#1610;&#1601; &#1575;&#1604;&#1591;&#1585;&#1610;&#1602; &#1573;&#1604;&#1609; &#1583;&#1582;&#1608;&#1604;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1605;&#1593; &#1605;&#1575; &#1584;&#1603;&#1585; &#1567; </div>    <P>
We can quickly paraphrase the first part of this question, Ibn Taymiyyah is asked about a people who have some power, established in a land, but they do not pray the prescribed prayers, they don't have a mosque, and no adhaan or iqaamah, and if they do pray, it is with an non-legislated prayer. That despite having a lot of wealth, they don't give the zakah. They kill each other, and take the wealth of each other, and they also kill children and do not withhold from shedding blood, or taking wealth (from others) neither in the month of Ramadan, nor the prohibited months or others. And when they take each other captive they sell some of them to the Europeans, or they sell their male and female slaves to the Europeans and parade them like animals. The questioner continues, leading up to the question:    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>They also marry a woman in her iddah period, and they don't give inheritance to women, and they do not comply with (obey) the ruler of the Muslims. When one of them is invited to the legislation, he says, "We are the legislation", and other than that. So is it permissible to fight them whilst the situation is like this, and what is the way to entering them into Islam alongside what has been mentioned?</blockquote>    <P>
We see that the question is in relation to this category of people, not in relation to Rulers who are sinful or do not fulfil some of the obligations, even if they make <i>iltizaam</i> of them.     <P>
Ibn Taymiyyah answers, and this is the part that is found in the quotes from the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> cited above:    <P>
<div class='arabic' align='right'>&#1601;&#1571;&#1580;&#1575;&#1576; : &#1606;&#1593;&#1605; . &#1610;&#1580;&#1608;&#1586; ; &#1576;&#1604; &#1610;&#1580;&#1576; &#1576;&#1573;&#1580;&#1605;&#1575;&#1593; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1602;&#1578;&#1575;&#1604; &#1607;&#1572;&#1604;&#1575;&#1569; &#1608;&#1571;&#1605;&#1579;&#1575;&#1604;&#1607;&#1605; &#1605;&#1606; &#1603;&#1604; &#1591;&#1575;&#1574;&#1601;&#1577; &#1605;&#1605;&#1578;&#1606;&#1593;&#1577; &#1593;&#1606; &#1588;&#1585;&#1610;&#1593;&#1577; &#1605;&#1606; &#1588;&#1585;&#1575;&#1574;&#1593; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1604;&#1592;&#1575;&#1607;&#1585;&#1577;  &#1575;&#1604;&#1605;&#1578;&#1608;&#1575;&#1578;&#1585;&#1577;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>He replied: Yes. It is permissible. Rather, it is obligatory by consensus of the Muslims to fight these and their likes from every faction that withholds (makes <i>imtinaa'</i>) from a legislated (act) from amongst the legislated (acts) of Islam that are manifest (well-known) and reported with large-scale successive transmission...</blockquote>    <P>
Please note that the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> have not provided direct, accurate, verbatim translations, rather they have taken the first part of Ibn Taymiyyah's answer above, and just paraphrased it in those two paragraphs of theirs.    <P>
Like in the previous quote, the obligation to fight such factions of people is for those in authority (the rulers), in order to force them to make <i>iltizaam</i> of the Sharee'ah, and these situations have nothing to do with that situation that the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>, Takfiriyyah, Khaarijiyyah want to apply these sayings of Ibn Taymiyyah to, which is the ruler who fails to abide by some of the obligations because Ibn Taymiyyah has countless sayings and verdicts that relate to this situation specifically, prohibiting <a href='tags/rebellion.html' class='tagLink'><font class='tagLink'>rebellion</font></a> and ordering obedience in that which is good and giving advice in the proper legislated manner and having patience and the likes.    <P>
So we see these people committing this great crime by drawing upon statements of Shaykh ul-Islaam Ibn Taymiyyah and applying them to situations they do not apply to, alongside their complete ignorance of the real and true meanings of the terms such as <i>al-iltizaam</i> and <i>al-imtinaa'</i>.    <P>
<b>We have said before in this article, we will repeat it again. All of what you see in the writings of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> are these types of disgraces, academic and intellectual frauds, twisting of words, confusing and deceiving non-Arabic speaking people, and lying upon the people of knowledge, and they do this a lot through the statements of Shaykh ul-Islam Ibn Taymiyyah.</b>    <P>
<font class='titleHeadline'>Conclusion</font>    <P>
Though there are many quotes that the <a href='tags/leninist-takfiris.html' class='tagLink'><font class='tagLink'>Leninist <a href="tags/takfiris.html" class="tagLink"><font class="tagLink">Takfiris</font></a></font></a> bring from the likes of Ibn Taymiyyah (and Ibn Abdul-Wahhaab), the examples provided in this article are just an illustration, and the same would apply to all such quotations, in that <i>al-iltizaam</i> and <i>al-imtinaa'</i> have very clear specific meanings, and they are other than <i>al-qubool</i> and <i>al-juhood</i>, and distinguishing between these, as is found in the works of the Scholars, is extremely important otherwise it leads to the kind of confusion that we see the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> steeped in. Through this clarification, one of the  major taghuts (false principles) of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> is demolished and if you ever see these people flashing these types of quotes on the websites, forums and blogs, just do your due diligence, check the original references and find out what is really being spoken of, and you will find, as we have come to know from experience over many long years, that these quotes are being misused and misapplied. This is the reality of the nature of the many so-called evidences that these <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> bring to deceive the people and to misguide them. <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/knqvq-isis-kharijites-execute-one-of-their-sharia-judges-hazimi-haddadis-and-takfiri-implosion.html">ISIS Kharijites Execute One of their Sharia Judges: Hazimi Haddadis and Takfiri Implosion</a><BR>
//www.takfiris.com/takfir/?knqvq<BR>

<li><a href="articles/oyifg-the-kharijites-do-not-always-make-takfir-on-account-of-every-major-sin.html">The Kharijites Do Not Always Make Takfir On Account of Every Major Sin!</a><BR>
//www.takfiris.com/takfir/?oyifg<BR>

<li><a href="articles/ocpfv-shaykh-al-fawzaan-applying-the-label-of-kharijite-to-those-involved-in-bombings.html">Shaykh al-Fawzaan: Applying the Label of 'Kharijite' to Those Involved in Bombings and Who Resemble the Baatiniyyah and Secret Orders</a><BR>
//www.takfiris.com/takfir/?ocpfv<BR>

<li><a href="articles/dvbrv-the-kharijite-who-engineered-the-slaughter-of-sunni-scholars-at-the-hands-of-the-ubaydi-baatini-shiah.html">A Lesson from History: The Kharijite Who Engineered the Slaughter of Sunni Scholars at the Hands of the Ubaydi Baatini Shi'ah</a><BR>
//www.takfiris.com/takfir/?dvbrv<BR>

<li><a href="articles/avcwd-shaykh-abdul-muhsin-those-who-have-given-bayah-to-al-baghdadi-isis.html">Shaykh Abdul-Muhsin: Those Who Have Given Bay'ah to al-Baghdadi (ISIS) Haven Given Bay'ah to a Shaytan (Devil)</a><BR>
//www.takfiris.com/takfir/?avcwd<BR>

<li><a href="articles/pqdbf-takfiris-on-steroids-3-saudi-member-of-jabhah-al-nusrah-executes-two-saudis-from-isis-daish.html">Takfiris on Steroids (3): Saudi Member of Jabhah al-Nusrah Executes Two Saudis From ISIS (Daish)</a><BR>
//www.takfiris.com/takfir/?pqdbf<BR>

<li><a href="articles/sewep-takfiris-on-steroids-the-alleged-jihad-of-the-dogs-of-hellfire---isis-and-al-nusrah-in-iraq-and-syria.html">Takfiris on Steroids (2): The Alleged 'Jihad' of 'The Dogs of Hellfire' - ISIS and al-Nusrah in Iraq and Syria</a><BR>
//www.takfiris.com/takfir/?sewep<BR>

<li><a href="articles/xpxlk-takfiri-chaos-isis-make-takfir-and-kills-leader-of-al-nusrah.html">Takfiris on Steroids (1): ISIS Declares Regional Leader of Rival Faction (al-Nusrah) an Apostate and Kills Him</a><BR>
//www.takfiris.com/takfir/?xpxlk<BR>

<li><a href="articles/cetiy-shaykh-al-fawzan-those-who-perform-terrorist-acts-are-worse-than-the-kharijites-of-old.html">Shaykh al-Fawzan: Those Who Perform Terrorist Acts Are Worse Than the Kharijites of Old and Their Actions Resemble Those of the (Baatiniyyah) Qaraamitah</a><BR>
//www.takfiris.com/takfir/?cetiy<BR>

<li><a href="articles/dawrs-invalidating-takfiri-doubts-part-1---concerning-al-iltizaam-and-al-imtinaa.html">Invalidating Takfiri Doubts: Part 1 - Concerning al-Iltizaam (&#1575;&#1604;&#1573;&#1604;&#1578;&#1586;&#1575;&#1605;) and al-Imtinaa' (&#1575;&#1604;&#1573;&#1605;&#1578;&#1606;&#1575;&#1593;) - Part 2 of 2</a><BR>
//www.takfiris.com/takfir/?dawrs<BR>

<li><a href="articles/ooxme-annihilating-the-doubts-of-20th-century-leninist-takfiris-part-1---concerning-al-imtinaa-and-al-iltizaam.html">Invalidating Takfiri Doubts: Part 1 - Concerning al-Iltizaam (&#1575;&#1604;&#1573;&#1604;&#1578;&#1586;&#1575;&#1605;) and al-Imtinaa' (&#1575;&#1604;&#1573;&#1605;&#1578;&#1606;&#1575;&#1593;) - Part 1 of 2</a><BR>
//www.takfiris.com/takfir/?ooxme<BR>

<li><a href="articles/esjal-abu-zubair-saleem-beg-promotes-and-defends-the-books-responsible-for-the-revival-of-sayyid-qutbs-jihad-and-takfir-in-21st-century-britain.html">Abu Zubair Saleem Beg Defends, Promotes and Propagandizes for The Books Responsible For The Appearance and  Revival of Sayyid Qutb's Deviant Doctrines of 'Jaahiliyyah', 'Jihad' and 'Takfir' in 21st Century Great Britain and United States</a><BR>
//www.takfiris.com/takfir/?esjal<BR>

<li><a href="articles/pmjvl-fareed-abdul-khaliq-former-murshid-of-ikhwaan-the-emergence-of-the-doctrines-of-jaahliyyah-haakimiyyah-and-takfir-of-all-societies.html">Fareed Abdul-Khaliq (Former Murshid of Ikhwaan): The Emergence of the Doctrines of Jaahliyyah, Haakimiyyah and Takfir of All Societies</a><BR>
//www.takfiris.com/takfir/?pmjvl<BR>

<li><a href="articles/ezjol-fareed-abdul-khaliq-former-murshid-of-ikhwaan-the-origins-of-mass-takfir-of-muslim-societies-lie-in-the-books-of-sayyid-qutb.html">Fareed Abdul-Khaliq (Former Murshid of Ikhwaan): The Origins of Mass Takfir of Muslim Societies Lie In the Books of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?ezjol<BR>

<li><a href="articles/zyxuc-the-khariijtes-will-continue-to-appear-and-be-cut-off-each-time-until-the-dajjaal-appears-in-their-later-remnants.html">Hadeeth: The Kharijites Will Continue to Appear And Be Cut Off Each Time Until The Dajjaal (Anti-Christ) Appears Amongst Their Latter-Day Remnants</a><BR>
//www.takfiris.com/takfir/?zyxuc<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?dawrs by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


