




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?vdeiu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Ali Juraisha (Major Ikhwaani Figurehead): Emergence of the Takfiris Who Made Takfir of Whole Societies</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Ali Juraisha (Major Ikhwaani Figurehead): Emergence of the Takfiris Who Made Takfir of Whole Societies</span><BR>
Wednesday, December 30 2009 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Ali Juraisha was a prominent, major Ikhwani figurehead and he stated in his book (<span class='arb'>&#1575;&#1604;&#1575;&#1578;&#1580;&#1575;&#1607;&#1575;&#1578; &#1575;&#1604;&#1601;&#1603;&#1585;&#1610;&#1577; &#1575;&#1604;&#1605;&#1593;&#1575;&#1589;&#1585;&#1577;</span>), "Contemporary Ideological Orientations" (p. 279):    <P>
<div class='arabic' align='right'> &#1575;&#1606;&#1588;&#1602;&#1578; &#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1593;&#1604;&#1609; &#1580;&#1605;&#1575;&#1593;&#1577; &#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1603;&#1576;&#1610;&#1585;&#1577; &#1573;&#1576;&#1575;&#1606; &#1608;&#1580;&#1608;&#1583;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1587;&#1580;&#1608;&#1606;... &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; &#1604;&#1580;&#1571;&#1578; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1573;&#1604;&#1609; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1575;&#1604;&#1603;&#1576;&#1610;&#1585;&#1577;&#1563; &#1604;&#1571;&#1606;&#1607;&#1575; &#1604;&#1575; &#1578;&#1586;&#1575;&#1604; &#1593;&#1604;&#1609; &#1585;&#1571;&#1610;&#1607;&#1575; &#1601;&#1610; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605; &#1608;&#1571;&#1593;&#1608;&#1575;&#1606; &#1575;&#1604;&#1581;&#1575;&#1603;&#1605; &#1579;&#1605; &#1575;&#1604;&#1605;&#1580;&#1578;&#1605;&#1593; &#1603;&#1604;&#1607;&#1548; &#1579;&#1605; &#1575;&#1606;&#1588;&#1602;&#1578; &#1575;&#1604;&#1605;&#1580;&#1605;&#1608;&#1593;&#1577; &#1575;&#1604;&#1605;&#1584;&#1603;&#1608;&#1585;&#1577; &#1573;&#1604;&#1609; &#1605;&#1580;&#1605;&#1608;&#1593;&#1575;&#1578; &#1603;&#1579;&#1610;&#1585;&#1577;&#1548; &#1603;&#1604; &#1605;&#1606;&#1607;&#1575; &#1610;&#1603;&#1601;&#1585; &#1575;&#1604;&#1570;&#1582;&#1585;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>A group split (away) from a large Islamic group during their presence in the prisons ... and alongside that, that group sought recourse to making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of that large group; because (this small group) did not cease being upon its own viewpoint regarding <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the ruler, and the aiders of the ruler, and then the whole society. Then the aforementioned group [itself] split into many factions, each of them making <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the other.</blockquote>    <P>
He is speaking here of the mid 1960s in which the Takfiri-Leninist methodology came out from the prisons of Egypt and took its course through the society. <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/vdeiu-ali-juraisha-major-ikhwaani-figurehead-emergence-of-the-takfiris-who-made-takfir-of-whole-societies.html">Ali Juraisha (Major Ikhwaani Figurehead): Emergence of the Takfiris Who Made Takfir of Whole Societies</a><BR>
//www.takfiris.com/takfir/?vdeiu<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?vdeiu by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
</html>


