




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?srjss by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 2 - Ibn Jibreen Calls Them 'The Kharijite, Terrorist, Dogs of Hellfire', Those Who Revolt Against the Rulers</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 2 - Ibn Jibreen Calls Them 'The Kharijite, Terrorist, Dogs of Hellfire', Those Who Revolt Against the Rulers</span><BR>
Monday, January 04 2010 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">

<font class='titleHeadline'>Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> and the Innovators</font>    <P>
Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was a person of knowledge who in the early 1990s got involved, unfortunately, with personalities like Muhammad al-Misery and his organization called CDLR (an organization practically working to effect Leninist and Marxist type revolutions in Muslim lands). Through this interaction the Shaykh was led to hold erroneous opinions towards Innovators such as Hasan al-Banna and <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>. He proceeded to defend these individuals, not upon knowledge and baseerah or any kind of detailed research, but out of sentiments and out of the affectation he suffered from as a result of being involved with such unsavouries. Shaykh Ibn Uthaymeen (rahimahullaah) and other scholars blasted the CDLR in very powerful words (we have the audio and will publish separately on this site inshaa'Allaah) and the scholars expressed their disappointment with the likes of <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> getting involved with these people. Unfortunately that connection harmed the Shaykh in that he became blinded to what these people were really upon, for he, in his methodology, was not upon the doctrines and methodologies that these takfiri revolutionaries were upon, even if he was deceived by them in his perception of the Innovators such as <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> and Bannaa. As such, whilst the truth is clear expressed in many of his statements regarding the rulers, the issues of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>, the issue pertaining to the <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> that the rulers have been put to trial with, revolting, terrorism and so on, he unfortunately, showed lenience towards these Innovators even if the truth that is found in much of his speech actually convicts these very same people. Due to Shaykh Ibn Jibreen's persistence in defending these people however, Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was powerfully and forcefully refuted, and his contradiction made clear by the likes of Shaykh Ahmad an-Najmee who wrote a series of refutations against him, and also expelled him from Ahl us-Sunnah for his continued allegiance to and defence of Jahmite Ash'ari and Sufi Innovators  (<a href=http://www.themadkhalis.com/md/series/concerning-shaykh-ibn-jibreens-defence-of-hasan-al-banna-and-sayyid-qutb.cfm>see this series here</a>) and <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> such as <a href='tags/usamah-bin-laden.html' class='tagLink'><font class='tagLink'>Usamah <a href="tags/bin-laden.html" class="tagLink"><font class="tagLink">Bin Laden</font></a></font></a> (<a href=index9894.html?owscq>see here</a>). <P> 


<p><font class='titleHeadline'>Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> on the Khawaarij (Revolters)</font>    <P>
In fatwa no 5876, with the title (<span class='arb'>	 &#1581;&#1603;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1608;&#1610;&#1587;&#1578;&#1576;&#1610;&#1581;&#1608;&#1606; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1608;&#1604;&#1575;&#1577; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585;</span>) (<i>The Ruling on Those who Make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> by Way of Sin and Permit Revolting Against the Rulers</i>), Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was asked:    <P>
<div class='arabic' align='right'>&#1608;&#1585;&#1583; &#1601;&#1610; &#1571;&#1581;&#1583; &#1601;&#1578;&#1608;&#1575;&#1603;&#1605; &#1585;&#1602;&#1605; (3407) &#1605;&#1575; &#1606;&#1589;&#1607;:. . . &#1571;&#1605;&#1575; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1608;&#1610;&#1587;&#1578;&#1576;&#1610;&#1581;&#1608;&#1606; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1608;&#1604;&#1575;&#1577; &#1575;&#1604;&#1571;&#1605;&#1608;&#1585; &#1601;&#1573;&#1606;&#1607;&#1605; &#1573;&#1584;&#1575; &#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1604;&#1575;&#1577; &#1601;&#1607;&#1605; &#1582;&#1608;&#1575;&#1585;&#1580; &#1608;&#1573;&#1585;&#1607;&#1575;&#1576;&#1610;&#1608;&#1606; &#1608;&#1605;&#1606; &#1603;&#1604;&#1575;&#1576; &#1575;&#1604;&#1606;&#1575;&#1585; &#1602;&#1575;&#1604; &#1575;&#1604;&#1576;&#1593;&#1590;: &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1608;&#1604;&#1575; &#1610;&#1587;&#1578;&#1576;&#1610;&#1581;&#1608;&#1606; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1604;&#1575; &#1610;&#1587;&#1605;&#1608;&#1606; &#1582;&#1608;&#1575;&#1585;&#1580;&#1548; &#1601;&#1607;&#1604; &#1578;&#1601;&#1590;&#1604;&#1578;&#1605; &#1576;&#1576;&#1610;&#1575;&#1606; &#1584;&#1604;&#1603;&#1567; &#1608;&#1605;&#1575; &#1581;&#1603;&#1605; &#1605;&#1593;&#1575;&#1605;&#1604;&#1577; &#1605;&#1606; &#1571;&#1592;&#1607;&#1585; &#1575;&#1604;&#1589;&#1604;&#1581; &#1605;&#1606;&#1607;&#1605; &#1608;&#1571;&#1606;&#1607; &#1585;&#1580;&#1593;&#1567; &#1608;&#1607;&#1604; &#1610;&#1581;&#1584;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606;&#1607;&#1605; &#1604;&#1571;&#1601;&#1603;&#1575;&#1585;&#1607;&#1605;&#1567;</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>There occurs in your fatwa no 3407, whose text is:     <P>
<blockquote>As for those who make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> by way of sins and permit <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> against the rulers then if they <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> against the rulers they are <b><a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a></b> and <b>Terrorists (Irhaabiyyoon)</b>, and from <b>the Dogs of Hellfire</b></blockquote>    <P>
Some said: Those who make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> by way of sins but to not permit <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> against the ruler are not to be called <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>. So if you would be gracious enough to explain that. And what is the ruling upon interacting with (i.e. negotiating with) the one who showed (intent towards) reconciliation, and that he has recanted. And are the people to be warned against them due to their ideas?   </blockquote>    <P>
The Shaykh's response:    <P>
<div class='arabic' align='right'>&#1605;&#1575; &#1584;&#1603;&#1585; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1601;&#1578;&#1608;&#1609; &#1601;&#1573;&#1606;&#1607; &#1589;&#1581;&#1610;&#1581;&#1548; &#1608;&#1602;&#1583; &#1584;&#1603;&#1585; &#1575;&#1604;&#1593;&#1604;&#1605;&#1575;&#1569; &#1571;&#1606;&#1607; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1606;&#1576;&#1584; &#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1608;&#1604;&#1575; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1609; &#1575;&#1604;&#1571;&#1574;&#1605;&#1577;&#1548; &#1608;&#1604;&#1575; &#1605;&#1601;&#1575;&#1585;&#1602;&#1577; &#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577;&#1548; &#1608;&#1571;&#1606; &#1593;&#1604;&#1609; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605; &#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1604;&#1608;&#1604;&#1575;&#1577; &#1575;&#1604;&#1571;&#1605;&#1585; &#1608;&#1604;&#1608; &#1592;&#1607;&#1585; &#1605;&#1606;&#1607;&#1605; &#1576;&#1593;&#1590; &#1575;&#1604;&#1605;&#1593;&#1575;&#1589;&#1610;&#1548; &#1601;&#1573;&#1606; &#1575;&#1604;&#1582;&#1585;&#1608;&#1580; &#1593;&#1604;&#1610;&#1607;&#1605; &#1610;&#1581;&#1583;&#1579; &#1575;&#1604;&#1601;&#1608;&#1590;&#1609; &#1608;&#1603;&#1579;&#1585;&#1577; &#1575;&#1604;&#1601;&#1578;&#1606; &#1608;&#1586;&#1593;&#1586;&#1593;&#1577; &#1575;&#1604;&#1571;&#1605;&#1606; &#1608;&#1602;&#1578;&#1604; &#1575;&#1604;&#1571;&#1576;&#1585;&#1610;&#1575;&#1569; &#1608;&#1581;&#1589;&#1608;&#1604; &#1575;&#1604;&#1571;&#1584;&#1609;&#1548; &#1601;&#1604;&#1571;&#1580;&#1604; &#1584;&#1604;&#1603; &#1580;&#1575;&#1569; &#1575;&#1604;&#1571;&#1605;&#1585; &#1576;&#1575;&#1604;&#1587;&#1605;&#1593; &#1608;&#1575;&#1604;&#1591;&#1575;&#1593;&#1577; &#1576;&#1602;&#1608;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605;:  "&#1575;&#1587;&#1605;&#1593; &#1608;&#1571;&#1591;&#1593; &#1608;&#1573;&#1606; &#1590;&#1615;&#1585;&#1576; &#1592;&#1607;&#1585;&#1603; &#1608;&#1571;&#1615;&#1582;&#1584; &#1605;&#1575;&#1604;&#1603;" &#1608;&#1604;&#1575; &#1588;&#1603; &#1571;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1603;&#1601;&#1585;&#1608;&#1606; &#1576;&#1575;&#1604;&#1584;&#1606;&#1608;&#1576; &#1610;&#1593;&#1578;&#1576;&#1585;&#1608;&#1606; &#1605;&#1606; &#1575;&#1604;&#1582;&#1608;&#1575;&#1585;&#1580; &#1608;&#1604;&#1608; &#1604;&#1605; &#1610;&#1582;&#1585;&#1580;&#1608;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1604;&#1575;&#1577;&#1548; &#1608;&#1578;&#1580;&#1608;&#1586; &#1605;&#1593;&#1575;&#1605;&#1604;&#1577; &#1605;&#1606; &#1571;&#1592;&#1607;&#1585; &#1575;&#1604;&#1589;&#1604;&#1581; &#1608;&#1602;&#1575;&#1605; &#1576;&#1575;&#1604;&#1608;&#1575;&#1580;&#1576;&#1548; &#1601;&#1610;&#1593;&#1575;&#1605;&#1604; &#1603;&#1605;&#1593;&#1575;&#1605;&#1604;&#1577; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1581;&#1578;&#1609; &#1610;&#1592;&#1607;&#1585; &#1605;&#1606;&#1607; &#1605;&#1575; &#1610;&#1582;&#1575;&#1604;&#1601; &#1575;&#1604;&#1581;&#1602; &#1608;&#1575;&#1604;&#1583;&#1604;&#1610;&#1604;.</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>What was mentioned in this fatwa is correct, for the Scholars have mentioned that it is not permissible to shun obedience and nor to <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> against the Rulers, and nor to separate from the Jamaa'ah, and that it is upon a Muslim to hear and obey those in authority, even if some of the sins appear from them. <b>For revolting against them brings about confusion (strife) and an abundance of tribulations, the violent rocking of the (the current) security, safety (that is present), killing of the innocent, and the attainment of harm. For this reason, the command to hear and obey has come with his (sallallaahu alayhi wasallam's) saying: "<i>Hear and obey, even if your back is beaten and your wealth is confiscated</i>"</b>.     <P>
And there is no doubt that those who make <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> by way of sins are considered <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a>, even if they do not <a href='tags/revolt.html' class='tagLink'><font class='tagLink'>revolt</font></a> against the Rulers. And it is permissible to interact with the one (from the Kharijites) who showed (his intent) for reconciliation and who performed what is obligatory upon him. So he is to be dealt with just like the Muslims are dealt with, until he displays what opposes the truth and the evidence.</blockquote>    <P>
Another, <u>huge and mighty stake</u> in the da'wah of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a>. As we have said, Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> was deceived about the truth regarding <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, Banna and others by the unsavoury people that he got involved with in the early 1990s. And while he was vocal in his defence of these innovators, he was certainly not upon the methodologies of these people.     <P>
<div class='sidebar'>So in this fatwa we see that the Qutbiyyeen (who are upon these methodologies) are rendered:    <P>
<ul><li><b>Khawaarij</b> (<span class='arb'>&#1582;&#1608;&#1575;&#1585;&#1580;</span>)  <li><b>Terrorists (Irhaabiyyoon)</b> (<span class='arb'>&#1573;&#1585;&#1607;&#1575;&#1576;&#1610;&#1608;&#1606;</span>)  <li><b>Dogs of Hellfire</b> (<span class='arb'> &#1603;&#1604;&#1575;&#1576; &#1575;&#1604;&#1606;&#1575;&#1585;</span>)</ul>    <P>
And this is with the knowledge that <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> is not with these Kharijite, Terrorist, Dogs of Hellfire in their <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the rulers who have been put to trial with something of the <a href='tags/secular-laws.html' class='tagLink'><font class='tagLink'>Secular Laws</font></a> - <a href=indexe052.html?eoizx>see this article here</a>!</div>    <P>
And who revived <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the sinners (rulers or ruled) and calls for destructive Leninist type revolts against rulers and ruled, the same characteristics upon which Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a> applied the labels of (<span class='arb'>&#1582;&#1608;&#1575;&#1585;&#1580; &#1608;&#1573;&#1585;&#1607;&#1575;&#1576;&#1610;&#1608;&#1606; &#1608;&#1605;&#1606; &#1603;&#1604;&#1575;&#1576; &#1575;&#1604;&#1606;&#1575;&#1585;</span>) "<b>Khawaarij, Terrorists, Dogs of Hellfire</b>"? Here is your answer:    <P>
<div class='sidebar'><ul><li> <b>Shaykh Salih Aal ash-Shaykh</b>: The Ghuluww (Extremism) of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> in <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of the Sinners - (<a href=http://www.themadkhalis.com/md/?zlzrg>see here</a>)  <li> <b><a href='tags/yusuf-al-qaradawi.html' class='tagLink'><font class='tagLink'>Yusuf al-Qaradawi</font></a></b>: The New 'Qutbi' Understanding of Tawheed - (<a href=index938a.html?jqpkg>see here</a>)  <li> <b><a href='tags/yusuf-al-qaradawi.html' class='tagLink'><font class='tagLink'>Yusuf al-Qaradawi</font></a></b> on Sayyid Qutb: All Muslims Are Apostates (Kuffaar, Mushrikeen) Except Those Who Agree With My Ideology and Join My Group - (<a href=indexe852.html?lyhev>see here</a>)  <li> <b><a href='tags/yusuf-al-qaradawi.html' class='tagLink'><font class='tagLink'>Yusuf al-Qaradawi</font></a></b>: <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> Makes it Explicitly Clear That All Muslims Today Are Disbelievers - (<a href=index2b71.html?xbnsa>see here</a>)  <li> <b><a href='tags/fareed-abdul-khaliq.html' class='tagLink'><font class='tagLink'>Fareed Abdul-Khaliq</font></a></b> (Former Murshid of Ikhwaan): The Emergence of the Doctrines of Jaahliyyah, <a href='tags/haakimiyyah.html' class='tagLink'><font class='tagLink'>Haakimiyyah</font></a> and <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of All Societies - (<a href=index065a.html?pmjvl>see here</a>)  <li> <b><a href='tags/yusuf-al-qaradawi.html' class='tagLink'><font class='tagLink'>Yusuf al-Qaradawi</font></a></b>: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> Found in az-Zilaal - (<a href=index13c7.html?hulwt>see here</a>)  <li> <b><a href='tags/ali-juraisha.html' class='tagLink'><font class='tagLink'>Ali Juraisha</font></a></b> (Major Ikhwaani Figurehead): Emergence of the <a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a> Who Made <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Whole Societies - (<a href=index62cd.html?vdeiu>see here</a>)  <li> <b><a href='tags/fareed-abdul-khaliq.html' class='tagLink'><font class='tagLink'>Fareed Abdul-Khaliq</font></a></b> (Former Murshid of Ikhwaan): The Origins of Mass <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of Muslim Societies Lie In the Books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> - (<a href=indexc30b.html?ezjol>see here</a>)  <li> <b><a href='tags/yusuf-al-qaradawi.html' class='tagLink'><font class='tagLink'>Yusuf al-Qaradawi</font></a></b>: The <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> of All Societies and Announcement of Destructive Revolutions In the Final Works of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> - (<a href=index2d44.html?wmagi>see here</a>)  </ul></div>    <P>
And it is from the greatest of deception of the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> - which has now been thoroughly exposed - that they pick and choose statements of the Scholars to cause doubt and confusion and through which they try to make out that they are with the Scholars. All they were doing for the past 15 years was to pick and choose <u>selected isolated statements, scenarios, or situations</u>, and use them to create layers of mist and fog by which to deceive and delude other Muslims away from from the truth, from recognizing the true methodologies that all of the Scholars were in fact united upon as a whole, even if amongst them were those who had something of error in an issue or two (or more), such as Shaykh <a href='tags/ibn-jibreen.html' class='tagLink'><font class='tagLink'>Ibn Jibreen</font></a>, or Shaykh Bakr Abu Zayd.     <P>
<b>Walhamdulillaah - their misguidance has been laid bare in plain sight! All they need to do now is to make tawbah for their disgraces over the past 15 years.  </b> <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/owscq-shaykh-ibn-jibreen-was-not-with-the-leninist-takfiri-kharijites-part-3---usama-bin-laden-and-followers-make-takfir-of-the-muslims.html">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 3 - Usamah bin Laden and Followers Make Takfir of the Muslims</a><BR>
//www.takfiris.com/takfir/?owscq<BR>

<li><a href="articles/srjss-shaykh-ibn-jibreen-was-not-with-the-leninist-takfiri-kharijites-part-2.html">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 2 - Ibn Jibreen Calls Them 'The Kharijite, Terrorist, Dogs of Hellfire', Those Who Revolt Against the Rulers</a><BR>
//www.takfiris.com/takfir/?srjss<BR>

<li><a href="articles/eoizx-shaykh-ibn-jibreen-was-not-with-the-leninist-takfiri-kharijites-part-1---on-those-who-rule-by-secular-laws.html">Between Shaykh Ibn Jibreen and the Leninist Takfiri Kharijites: Part 1 - On Those Who Rule By Secular Laws</a><BR>
//www.takfiris.com/takfir/?eoizx<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?srjss by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


