




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?xbnsa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</span><BR>
Thursday, December 31 2009 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Yusuf al-Qardawi is one of the most prominent of the contemporary figureheads of al-Ikhwan al-Muslimeen and he has written many times on the movements of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>. We see a couple of trends amongst todays Ikhwanis. Seeing that the ideologies of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> found in Qutb's books are harmful to their cause, a group amongst them (like al-Qaradawi) are trying to distance the Ikhwaan from these teachings. He is opposed by others, who try to downplay the issue of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and argue that the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> have been fundamental to the Ikhwaani movement, and that they have an important role to play. We'll leave them to argue about these issues, but here is a statement of al-Qaradawi taken from an article published on 4th May 2004 called (<span class='arb'>&#1607;&#1604; &#1610;&#1603;&#1601;&#1617;&#1585; "&#1587;&#1610;&#1583; &#1602;&#1591;&#1576;" &#1605;&#1587;&#1604;&#1605;&#1610; &#1575;&#1604;&#1610;&#1608;&#1605;&#1567;</span>) in which he outlines the ideology of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> in the works of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a>.    <P>
<div class='sidebar'><b><a href=assets/images/qaradawi-qutb-takfir-article.gif>View the entire article here in Arabic</a></b></div>    <P>
He writes, after quoting a lengthy passage from Qutb's commentary az-Zilal (7/238-240) (<span class='arb'>&#1601;&#1610; &#1592;&#1604;&#1575;&#1604; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1591;&#1576;&#1593;&#1577; &#1593;&#1610;&#1587;&#1609; &#1575;&#1604;&#1581;&#1604;&#1576;&#1610; &#1575;&#1604;&#1579;&#1575;&#1606;&#1610;&#1577;</span>), and he is essentially summarizing the main points from what he quoted from Qutb:    <P>
<div class='arabic' align='right'>&#1607;&#1584;&#1575; &#1607;&#1608; &#1575;&#1604;&#1585;&#1580;&#1604; &#1610;&#1589;&#1585;&#1581; -&#1576;&#1604; &#1610;&#1589;&#1585;&#1582;- &#1576;&#1605;&#1575; &#1604;&#1575; &#1610;&#1583;&#1593; &#1605;&#1580;&#1575;&#1604;&#1575; &#1604;&#1604;&#1588;&#1603; &#1608;&#1575;&#1604;&#1575;&#1581;&#1578;&#1605;&#1575;&#1604;: &#1571;&#1606; &#1575;&#1604;&#1571;&#1608;&#1591;&#1575;&#1606; &#1575;&#1604;&#1578;&#1610; &#1603;&#1575;&#1606;&#1578; &#1578;&#1593;&#1578;&#1576;&#1585; &#1601;&#1610; &#1610;&#1608;&#1605; &#1605;&#1606; &#1575;&#1604;&#1571;&#1610;&#1575;&#1605; "&#1583;&#1575;&#1585;&#1575; &#1604;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;"&#1548; &#1608;&#1571;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1571;&#1602;&#1608;&#1575;&#1605; (&#1605;&#1606; &#1587;&#1604;&#1575;&#1604;&#1575;&#1578; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;) &#1575;&#1604;&#1584;&#1610;&#1606; &#1603;&#1575;&#1606; &#1571;&#1580;&#1583;&#1575;&#1583;&#1607;&#1605; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1601;&#1610; &#1610;&#1608;&#1605; &#1605;&#1606; &#1575;&#1604;&#1571;&#1610;&#1575;&#1605;.. &#1604;&#1605; &#1610;&#1593;&#1608;&#1583;&#1608;&#1575; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606;&#1548; &#1608;&#1573;&#1606; &#1592;&#1606;&#1608;&#1575; &#1571;&#1606;&#1607;&#1605; &#1610;&#1583;&#1610;&#1606;&#1608;&#1606; &#1576;&#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1575;&#1548; &#1601;&#1610; &#1581;&#1610;&#1606; &#1571;&#1606;&#1607;&#1605; &#1604;&#1610;&#1587;&#1608;&#1575; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1604;&#1575; &#1593;&#1605;&#1604;&#1575; &#1608;&#1604;&#1575; &#1575;&#1593;&#1578;&#1602;&#1575;&#1583;&#1575;&#1563; &#1604;&#1571;&#1606;&#1607;&#1605; &#1604;&#1605; &#1610;&#1588;&#1607;&#1583;&#1608;&#1575; &#1571;&#1606; "&#1604;&#1575; &#1573;&#1604;&#1607; &#1573;&#1604;&#1575; &#1575;&#1604;&#1604;&#1607;" &#1576;&#1605;&#1583;&#1604;&#1608;&#1604;&#1607;&#1575; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1610; &#1603;&#1605;&#1575; &#1581;&#1583;&#1583;&#1607; &#1607;&#1608;&#1548; &#1608;&#1571;&#1588;&#1602; &#1605;&#1575; &#1578;&#1593;&#1575;&#1606;&#1610;&#1607; &#1575;&#1604;&#1581;&#1585;&#1603;&#1575;&#1578; &#1575;&#1604;&#1573;&#1587;&#1604;&#1575;&#1605;&#1610;&#1577; &#1571;&#1606;&#1607;&#1575; &#1604;&#1605; &#1610;&#1578;&#1590;&#1581; &#1604;&#1607;&#1575; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1601;&#1607;&#1608;&#1605; &#1575;&#1604;&#1580;&#1583;&#1610;&#1583;.. &#1571;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1610;&#1592;&#1606;&#1608;&#1606; &#1571;&#1606;&#1601;&#1587;&#1607;&#1605; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606; &#1575;&#1604;&#1610;&#1608;&#1605; &#1607;&#1605; &#1603;&#1601;&#1575;&#1585; &#1601;&#1610; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577;&#1548; &#1608;&#1607;&#1608; &#1610;&#1585;&#1610;&#1583; &#1605;&#1606; &#1607;&#1584;&#1607; &#1575;&#1604;&#1581;&#1585;&#1603;&#1575;&#1578; &#1608;&#1583;&#1593;&#1575;&#1578;&#1607;&#1575; &#1571;&#1606; &#1610;&#1580;&#1607;&#1585;&#1608;&#1575; &#1576;&#1603;&#1604;&#1605;&#1577; &#1575;&#1604;&#1601;&#1589;&#1604; &#1608;&#1604;&#1575; &#1610;&#1576;&#1575;&#1604;&#1608;&#1575; &#1576;&#1600;"&#1578;&#1607;&#1605;&#1577; &#1578;&#1603;&#1601;&#1610;&#1585; &#1575;&#1604;&#1605;&#1587;&#1604;&#1605;&#1610;&#1606;". &#1601;&#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1571;&#1606;&#1607;&#1605; &#1604;&#1610;&#1587;&#1608;&#1575; &#1605;&#1587;&#1604;&#1605;&#1610;&#1606;!!</div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>This (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) is the man who makes it clear - rather [one who] screams - with what leaves no room for any doubt or other plausible consideration [in meaning] [except] that the lands <b>used to be</b> considered in the days gone by "an abode for Islaam" and that those peoples from the descendants of those Muslims, those whose ancestors used to Muslims in the days gone by, <b>that they have not continued to remain Muslims</b>, even if they think, in their belief, that they are practicising Islaam, because they have not testified that "None has the right to be worshipped except Allaah, alone" upon its true, real meaning, as he (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) has defined. And he considered it troublesome what the Islamic movements were concerned about, that this new understanding had not become clear to them ... <b>that those who think themselves to be Muslims today are Kuffar in reality</b>. And he (<a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>) desired from these movements and their callers to openly proclaim a word of clarity (in this regard) and [that] they should not care about the "tuhmah (slanderous accusation)" of making <a href='tags/takfeer.html' class='tagLink'><font class='tagLink'>Takfeer</font></a> of the Muslims, for the reality (to Qutb) is that they are not Muslims!!</blockquote>    <P>
This was the way of thinking of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a>, and this representation of this thinking is not coming from the "<a href=http://www.themadkhalis.com/>Madkhalis</a>", but from prominent Ikhwani figureheads themselves.    <P>
The actual methodology of <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> is summarized as follows:    <P>
<ul><li>To make clear that all lands today are lands of kufr and not lands of Islaam, because there is no total, complete rule by Allaah's law.  <li> To make a clear distinction between the believers and the criminal non-believers, and he means by this the apostates who left Islaam, which are all the societies and all people.  <li> To openly pronounce this and not to care one bit if accused with making "takfir of the Muslims", because this pronouncement is an explanation of the meaning of the shahaadah!  <li> To then separate and isolate oneself from this <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>Jaahiliyyah</font></a> that surrounds everything.  <li> To then build a community (vanguard) of believers who will call to Islaam afresh.  <li> That this vanguard will plot a revolution to snatch power from the apostates and to stand up against this <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>Jaahiliyyah</font></a>.  </ul>    <P>
There is no doubt to any sincere Muslim, that this is the deen of the Khawaarij, <u>only it is more severe</u>, more evil and more repugnant, and amazing is the state of a people willing to expend the greatest of efforts in trying to propagandize for this man's works and to defend him and his books in which there is nothing left, after you remove all the aspects of the aqidah of the Jahmiyyah, Mu'tazilah, Ash'ariyyah, Raafidah, except the madhhab of the Khawaarij and the manifestos of secular atheist Jews, such as <a href=http://www.themadkhalis.com/md/?rhmeq><a href="tags/vladimir-lenin.html" class="tagLink"><font class="tagLink">Vladimir Lenin</font></a></a>. <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/jqpkg-yusuf-al-qaradawi-the-new-qutbi-understanding-of-tawheed.html">Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</a><BR>
//www.takfiris.com/takfir/?jqpkg<BR>

<li><a href="articles/lyhev-yusuf-al-qaradawi-on-sayyid-qutb-all-muslims-are-kuffaar-mushrikeen-apostates-except-those-who-agree-with-my-ideology.html">Yusuf al-Qaradawi on Sayyid Qutb: All Muslims Are Apostates (Kuffaar, Mushrikeen) Except Those Who Agree With My Ideology and Join My Group</a><BR>
//www.takfiris.com/takfir/?lyhev<BR>

<li><a href="articles/xbnsa-yusuf-al-qaradawi-sayyid-qutb-makes-it-explicitly-clear-that-all-muslims-today-are-disbelievers.html">Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</a><BR>
//www.takfiris.com/takfir/?xbnsa<BR>

<li><a href="articles/rxvjg-salaah-as-saawee-a-qutbi-theoretician-on-the-qutbiyyoon-and-the-basis-of-their-teachings.html">Salaah as-Saawee (A Qutbi Theoretician) on the Qutbiyyoon and the Basis of Their Teachings</a><BR>
//www.takfiris.com/takfir/?rxvjg<BR>

<li><a href="articles/hulwt-yusuf-al-qardawi-groups-known-as-the-qutbiyyoon-found-harboring-the-doctrines-of-takfir-found-in-az-zilaal.html">Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</a><BR>
//www.takfiris.com/takfir/?hulwt<BR>

<li><a href="articles/wmagi-yusuf-al-qaradawi-the-takfir-of-all-societies-and-announcement-of-destructive-revolutions-in-the-final-works-of-sayyid-qutb.html">Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?wmagi<BR>

<li><a href="articles/ihnep-ali-al-timimi-on-secular-laws-the-saudi-government-and-takfir.html">Ali al-Timimi on Secular Laws, the Saudi Government, Takfir and Deviant Philosophies of Jihaad</a><BR>
//www.takfiris.com/takfir/?ihnep<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?xbnsa by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
</html>


