




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?gdyjh by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Shaykh ul-Islam Ibn Taymiyyah: Who Is Defined as a 'Haakim' (Ruler)?</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Shaykh ul-Islam Ibn Taymiyyah: Who Is Defined as a 'Haakim' (Ruler)?</span><BR>
Tuesday, February 02 2010 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p><font class='titleHeadline'>Who is Defined as a <a href='tags/haakim.html' class='tagLink'><font class='tagLink'>haakim</font></a> (Ruler, Judge)?</font>    <P>
Allaah the Most High said:    <P>
<div class='arabicquran'><img src='images/qnstart.gif'> &#1608;&#1614;&#1605;&#1614;&#1606; &#1604;&#1617;&#1614;&#1605;&#1618; &#1610;&#1614;&#1581;&#1618;&#1603;&#1615;&#1605; &#1576;&#1616;&#1605;&#1614;&#1575; &#1571;&#1614;&#1606;&#1586;&#1614;&#1604;&#1614; &#1575;&#1604;&#1604;&#1617;&#1607;&#1615; &#1601;&#1614;&#1571;&#1615;&#1608;&#1618;&#1604;&#1614;&#1600;&#1574;&#1616;&#1603;&#1614; &#1607;&#1615;&#1605;&#1615; &#1575;&#1604;&#1618;&#1603;&#1614;&#1575;&#1601;&#1616;&#1585;&#1615;&#1608;&#1606;&#1614; <img src='images/qnend.gif'></div>    <P>
<blockquote class='quotequran'><img src='images/qnstart.gif'><b> And <u>whosoever</u> does not judge by <u>whatsoever</u> Allaah has revealed, such are the Kafirun (disbelievers).  (Al-Ma'idah 5:44) </b><img src='images/qnend.gif'></blockquote>    <P>
There is what indicates in this verse - as has been pointed out by the Scholars of Islam and the Sunnah - that this verse applies to every individual Muslim, since the two particles used (<span class='arb'>&#1605;&#1614;&#1606;</span>) "<b>whosoever</b>" and (<span class='arb'>&#1605;&#1614;&#1575;</span>) "<b>whatsoever</b>" covers every Muslim firstly, and secondly, everything that Allaah has revealed secondly. In modern times, groups have emerged trying to scapegoat the rulers for the problems of the Muslim Ummah. Whilst we have been informed in the Sunnah of the nature of the rulers that are to appear (having hearts of devils, do not follow the Guidance or the Sunnah of Muhammad, confiscate wealth, beat the people and so on) to blame them alone for the problems of the Ummah and for not "<i>judging by what Allaah has revealed</i>" displays the extremely shallow understanding of the combined subjects of Tawhid, the Divine Qadar, the creational and legislative asbaab (ways and means), the Divine Wisdom, as well as deviation in the understanding of the verse cited above in particular.    <P>
In defining who is considered to be a <a href='tags/haakim.html' class='tagLink'><font class='tagLink'>haakim</font></a>, with the wider context of a discussion pertaining to justice (<i>adl</i>) and oppression (<i>dhulm</i>), Shaykh ul-Islaam Ibn Taymiyyah said in "Majmoo al-Fataaawaa" (18/170):    <P>
<div class='arabic' align='right'> <blockquote>&#1608;&#1604;&#1605;&#1575; &#1603;&#1575;&#1606; &#1575;&#1604;&#1593;&#1583;&#1604; &#1604;&#1575; &#1576;&#1583; &#1571;&#1606; &#1610;&#1578;&#1602;&#1583;&#1605;&#1607; &#1593;&#1604;&#1605; - &#1573;&#1584; &#1605;&#1606; &#1604;&#1575; &#1610;&#1593;&#1604;&#1605; &#1604;&#1575; &#1610;&#1583;&#1585;&#1610; &#1605;&#1575; &#1575;&#1604;&#1593;&#1583;&#1604; &#1567; &#1608;&#1575;&#1604;&#1573;&#1606;&#1587;&#1575;&#1606; &#1592;&#1575;&#1604;&#1605; &#1580;&#1575;&#1607;&#1604; &#1573;&#1604;&#1575; &#1605;&#1606; &#1578;&#1575;&#1576; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1601;&#1589;&#1575;&#1585; &#1593;&#1575;&#1604;&#1605;&#1575; &#1593;&#1575;&#1583;&#1604;&#1575; - &#1589;&#1575;&#1585; &#1575;&#1604;&#1606;&#1575;&#1587; &#1605;&#1606; &#1575;&#1604;&#1602;&#1590;&#1575;&#1577; &#1608;&#1594;&#1610;&#1585;&#1607;&#1605; &#1579;&#1604;&#1575;&#1579;&#1577; &#1571;&#1589;&#1606;&#1575;&#1601; : &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; &#1575;&#1604;&#1580;&#1575;&#1574;&#1585; &#1608;&#1575;&#1604;&#1580;&#1575;&#1607;&#1604; &#1575;&#1604;&#1592;&#1575;&#1604;&#1605; ; &#1601;&#1607;&#1584;&#1575;&#1606; &#1605;&#1606; &#1571;&#1607;&#1604; &#1575;&#1604;&#1606;&#1575;&#1585; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; :  " { &#1575;&#1604;&#1602;&#1590;&#1575;&#1577; &#1579;&#1604;&#1575;&#1579;&#1577; : &#1602;&#1575;&#1590;&#1610;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; &#1608;&#1602;&#1575;&#1590; &#1601;&#1610; &#1575;&#1604;&#1580;&#1606;&#1577; : &#1585;&#1580;&#1604; &#1593;&#1604;&#1605; &#1575;&#1604;&#1581;&#1602; &#1608;&#1602;&#1590;&#1609; &#1576;&#1607; &#1601;&#1607;&#1608; &#1601;&#1610; &#1575;&#1604;&#1580;&#1606;&#1577; ; &#1608;&#1585;&#1580;&#1604; &#1602;&#1590;&#1609; &#1604;&#1604;&#1606;&#1575;&#1587; &#1593;&#1604;&#1609; &#1580;&#1607;&#1604; &#1601;&#1607;&#1608; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; ; &#1608;&#1585;&#1580;&#1604; &#1593;&#1604;&#1605; &#1575;&#1604;&#1581;&#1602; &#1608;&#1602;&#1590;&#1609; &#1576;&#1582;&#1604;&#1575;&#1601;&#1607; &#1601;&#1607;&#1608; &#1601;&#1610; &#1575;&#1604;&#1606;&#1575;&#1585; } " &#1601;&#1607;&#1584;&#1575;&#1606; &#1575;&#1604;&#1602;&#1587;&#1605;&#1575;&#1606; &#1603;&#1605;&#1575; &#1602;&#1575;&#1604; : " { &#1605;&#1606; &#1602;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1576;&#1585;&#1571;&#1610;&#1607; &#1601;&#1571;&#1589;&#1575;&#1576; &#1601;&#1602;&#1583; &#1571;&#1582;&#1591;&#1571; &#1608;&#1605;&#1606; &#1602;&#1575;&#1604; &#1601;&#1610; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1576;&#1585;&#1571;&#1610;&#1607; &#1601;&#1571;&#1582;&#1591;&#1571; &#1601;&#1604;&#1610;&#1578;&#1576;&#1608;&#1571; &#1605;&#1602;&#1593;&#1583;&#1607; &#1605;&#1606; &#1575;&#1604;&#1606;&#1575;&#1585; } " . &#1608;&#1603;&#1604; &#1605;&#1606; &#1581;&#1603;&#1605; &#1576;&#1610;&#1606; &#1575;&#1579;&#1606;&#1610;&#1606; &#1601;&#1607;&#1608; &#1602;&#1575;&#1590; &#1587;&#1608;&#1575;&#1569; &#1603;&#1575;&#1606; &#1589;&#1575;&#1581;&#1576; &#1581;&#1585;&#1576; &#1571;&#1608; &#1605;&#1578;&#1608;&#1604;&#1610; &#1583;&#1610;&#1608;&#1575;&#1606; &#1571;&#1608; &#1605;&#1606;&#1578;&#1589;&#1576;&#1575; &#1604;&#1604;&#1575;&#1581;&#1578;&#1587;&#1575;&#1576; &#1576;&#1575;&#1604;&#1571;&#1605;&#1585; &#1576;&#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601; &#1608;&#1575;&#1604;&#1606;&#1607;&#1610; &#1593;&#1606; &#1575;&#1604;&#1605;&#1606;&#1603;&#1585; &#1581;&#1578;&#1609; &#1575;&#1604;&#1584;&#1610; &#1610;&#1581;&#1603;&#1605; &#1576;&#1610;&#1606; &#1575;&#1604;&#1589;&#1576;&#1610;&#1575;&#1606; &#1601;&#1610; &#1575;&#1604;&#1582;&#1591;&#1608;&#1591; &#1601;&#1573;&#1606; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1603;&#1575;&#1606;&#1608;&#1575; &#1610;&#1593;&#1583;&#1608;&#1606;&#1607; &#1605;&#1606; &#1575;&#1604;&#1581;&#1603;&#1575;&#1605; .</blockquote></div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And since [it is the case] that it is necessary for knowledge to precede  justice - since the one who does not have knowledge, does not know what justice is, and [since] a human [as a species] is [characterized as] an oppresser and ignorant, except the one to whom Allaah has turned [and thus] become knowing and just - then the people amongst the judges and other than them become divided into three groupings: The knowing oppressor and the ignorant oppressor and these two are from the people of the fire, as the Prophet (sallallaahu alayhi wasallam) said, "<i>The judges are [of] three [types]: Two judges in the fire and one in Paradise [which is] the man who knew the truth and judged by it, so he is in Paradise. And a man who made judgement for the people upon ignorance, then he is in the fire. And a man who knew the truth and judged in opposition to it, then he is in the Fire</i>". And these [latter] two types are just as he said, "<i>Whoever spoke about the Qur'an with his opinion and was correct, then he has erred, and whoever spoke about the Qur'an with his opinion and erred, then let him take  his seat in the Hellfire</i>".    <P>
<b>And everyone who judged between [any] two people, then he is [considered] a qaadi (judge) irrespective of whether he is a person of war, or one commissioned into [any position of] office, or appointed in the consideration [of the affairs] of enjoining good and forbidding evil, until even the one who judges between two children regarding [their] handwriting, then the Companions considered [all] such people to be <a href='tags/hukkaam.html' class='tagLink'><font class='tagLink'>hukkaam</font></a> (rulers)</b>.</blockquote>    <P>
From this statement of Ibn Taymiyyah (rahimahullaah) anyone who judges between two people on any particular matter, is considered a "<i><a href='tags/haakim.html' class='tagLink'><font class='tagLink'>haakim</font></a></i>", who has been ordered to judge by what Allaah has revealed which is justice and truth.    <P>
    <P>
 <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/gdyjh-shaykh-ul-islam-ibn-taymiyyah-who-is-defined-as-a-haakim-ruler.html">Shaykh ul-Islam Ibn Taymiyyah: Who Is Defined as a 'Haakim' (Ruler)?</a><BR>
//www.takfiris.com/takfir/?gdyjh<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?gdyjh by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:16 GMT -->
</html>


