




<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?hulwt by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Takfiris.Com | Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</title>
	<link rel="STYLESHEET" type="text/css" href="styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right"><img src="images/printheader.jpg"></td></tr>
<tr><td>
<span class="articleTitle">Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</span><BR>
Wednesday, December 30 2009 - by Takfiris.Com 
<hr size="1" noshade>
<b>Read more articles at Takfiris.Com</b>
<hr size="1" noshade>

<div class="articleContent">




<p>Yusuf al-Qardawi is one of the most prominent of the contemporary figureheads of al-Ikhwan al-Muslimeen and he has written many times on the movements of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a>. We see a couple of trends amongst todays Ikhwanis. Seeing that the ideologies of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> found in Qutb's books are harmful to their cause, a group amongst them (like al-Qaradawi) are trying to distance the Ikhwaan from these teachings. He is opposed by others, who try to downplay the issue of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and argue that the books of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> have been fundamental to the Ikhwaani movement, and that they have an important role to play. We'll leave them to argue about these issues, but here is a statement of al-Qaradawi taken from an article published on Thursday, 16 September 2004 called (<span class='arb'>&#1603;&#1604;&#1605;&#1577; &#1571;&#1582;&#1610;&#1585;&#1577; &#1581;&#1608;&#1604; &#1587;&#1610;&#1583; &#1602;&#1591;&#1576;</span>) in which he outlines the ideology of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> in the works of <a href='tags/sayyid-qutb.html' class='tagLink'><font class='tagLink'>Sayyid <a href="tags/qutb.html" class="tagLink"><font class="tagLink">Qutb</font></a></font></a> and the emergence of the groups of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> thereafter.    <P>
<div class='arabic' align='right'>&#1608;&#1602;&#1583; &#1585;&#1571;&#1610;&#1606;&#1575; &#1578;&#1580;&#1605;&#1593;&#1575;&#1578; &#1601;&#1610; &#1571;&#1602;&#1591;&#1575;&#1585; &#1605;&#1582;&#1578;&#1604;&#1601;&#1577; &#1610;&#1587;&#1605;&#1608;&#1606; (&#1575;&#1604;&#1602;&#1591;&#1576;&#1610;&#1610;&#1606;)&#1548; &#1610;&#1578;&#1576;&#1606;&#1608;&#1606; &#1601;&#1603;&#1585;&#1577; &#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585;&#1548; &#1608;&#1602;&#1583; &#1585;&#1571;&#1610;&#1578; &#1605;&#1606; &#1570;&#1579;&#1575;&#1585; &#1584;&#1604;&#1603;: &#1605;&#1606; &#1587;&#1571;&#1604;&#1608;&#1606;&#1610; &#1593;&#1606; &#1575;&#1604;&#1589;&#1604;&#1575;&#1577; &#1601;&#1610; &#1575;&#1604;&#1576;&#1610;&#1608;&#1578;&#1548; &#1608;&#1578;&#1585;&#1603; &#1575;&#1604;&#1605;&#1587;&#1575;&#1580;&#1583; &#1576;&#1575;&#1593;&#1578;&#1576;&#1575;&#1585;&#1607;&#1575; &#1605;&#1593;&#1575;&#1576;&#1583; &#1575;&#1604;&#1580;&#1575;&#1607;&#1604;&#1610;&#1577;&#1548; &#1608;&#1607;&#1608; &#1605;&#1605;&#1575; &#1601;&#1607;&#1605;&#1608;&#1607; &#1605;&#1606; &#1575;&#1604;&#1592;&#1604;&#1575;&#1604; &#1601;&#1610; &#1578;&#1601;&#1587;&#1610;&#1585; &#1602;&#1608;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; (&#1608;&#1575;&#1580;&#1593;&#1604;&#1608;&#1575; &#1576;&#1610;&#1608;&#1578;&#1603;&#1605; &#1602;&#1576;&#1604;&#1577;)&#1548; &#1608;&#1602;&#1583; &#1585;&#1583;&#1583;&#1578; &#1593;&#1604;&#1610;&#1607;&#1605; &#1601;&#1610; &#1575;&#1604;&#1580;&#1586;&#1569; &#1575;&#1604;&#1571;&#1608;&#1604; &#1605;&#1606; &#1603;&#1578;&#1575;&#1576;&#1610; (&#1601;&#1578;&#1575;&#1608;&#1609; &#1605;&#1593;&#1575;&#1589;&#1585;&#1577;).    <P>
&#1608;&#1605;&#1606; &#1602;&#1585;&#1571; &#1571;&#1583;&#1576;&#1610;&#1575;&#1578; &#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1575;&#1604;&#1578;&#1603;&#1601;&#1610;&#1585; &#1610;&#1580;&#1583; &#1570;&#1579;&#1575;&#1585; &#1607;&#1584;&#1575; &#1575;&#1604;&#1601;&#1603;&#1585; &#1608;&#1593;&#1576;&#1575;&#1585;&#1575;&#1578;&#1607; &#1575;&#1604;&#1605;&#1593;&#1585;&#1608;&#1601;&#1577; &#1601;&#1610; &#1589;&#1604;&#1576; &#1607;&#1584;&#1575; &#1575;&#1604;&#1601;&#1603;&#1585;&#1548; &#1608;&#1573;&#1606; &#1604;&#1605; &#1610;&#1589;&#1585;&#1581;&#1608;&#1575; &#1576;&#1575;&#1604;&#1606;&#1602;&#1604; &#1593;&#1606;&#1607;. </div>    <P>
<blockquote class='quote'><img src='images/quote-start.gif'>And we have seen groupings in various regions called "The Qutbiyyoon" embracing the ideology of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> (excommunication), and I have seen the signs of that: From those who ask me about praying in houses and abandoning the mosques upon the consideration that they are <a href='tags/jaahiliyyah.html' class='tagLink'><font class='tagLink'>Jaahiliyyah</font></a> places of worship, and this is from what they understood from az-Zilaal in tafseer of the saying of Allaah, "And take your houses as a qiblah", and I refuted them in the first chapter of my book "Fataawaa Mu'aasirah".    <P>
And whoever reads the literary works of Jamaa'at at-Takfir will find the remnants of this ideology, and its well known expressions that are from the core, essence of this ideology, even if they do not explicitly reveal their quoting from it (i.e. from the actual source, the works of Qutb).</blockquote>    <P>
The game is already over, and we've only just started. All people with sound fitrah and sound intellect know that the <a href='tags/qutbiyyah.html' class='tagLink'><font class='tagLink'>Qutbiyyah</font></a> are finished, their ship sunk years ago and all we have left today are ignoramuses thinking that holding onto the flotsam is going to save them from drowning. Every man and his dog can come online and bark as loud as he wants, and he will surely get followers from the ignoramuses, but that will avail nothing against the truth.    <P>
We have <a href=index9734.html?zyxuc >divinely revealed texts</a> of how the <a href='tags/kharijites.html' class='tagLink'><font class='tagLink'>Kharijites</font></a> (<a href='tags/takfiris.html' class='tagLink'><font class='tagLink'>Takfiris</font></a>) will continue to emerge and be cut off. Then we have testimonies from many figureheads of Ikhwaan, such as al-Qaradawi and Ali Juraisah (<a href=index62cd.html?vdeiu>see here</a>) and <a href='tags/fareed-abdul-khaliq.html' class='tagLink'><font class='tagLink'>Fareed Abdul-Khaliq</font></a> (<a href=indexc30b.html?ezjol>see here</a>) that <a href='tags/qutb.html' class='tagLink'><font class='tagLink'>Qutb</font></a> gave birth to the destructive <a href='tags/takfiri-movements.html' class='tagLink'><font class='tagLink'>Takfiri movements</font></a> through his works. Then we have the scores of Scholars from Ahl us-Sunnah and very explicit undeniable proofs that the likes of Shaykh Ibn Uthaymeen and Shaykh Saalih al-Fawzaan recognize the existence of "a Qutbi manhaj" which has adherents and callers (see <a href=http://www.themadkhalis.com/md/?xwcmm>here</a> and <a href=http://www.themadkhalis.com/md/?sxptl>here</a>), and this ideology is one of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> and revolution.     <P>
So when you have a clear judgement (through the witness of many of the Scholars combined) that these factions of <a href='tags/takfir.html' class='tagLink'><font class='tagLink'>Takfir</font></a> are included amongst those referred to in the divinely revealed texts:    <P>
<div class='sidebar'>In the Musnad of Imaam Ahmad there occurs in the hadeeth of Abdullaah bin Amr bin al-Aaas:    <P>
<div class='arabic' align='right'>&#1587;&#1605;&#1593;&#1578; &#1585;&#1587;&#1608;&#1604; &#1575;&#1604;&#1604;&#1607; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1610;&#1602;&#1608;&#1604; : &#1587;&#1610;&#1582;&#1585;&#1580; &#1571;&#1606;&#1575;&#1587; &#1605;&#1606; &#1571;&#1605;&#1578;&#1610; &#1605;&#1606; &#1602;&#1576;&#1604; &#1575;&#1604;&#1605;&#1588;&#1585;&#1602; &#1610;&#1602;&#1585;&#1572;&#1608;&#1606; &#1575;&#1604;&#1602;&#1585;&#1570;&#1606; &#1604;&#1575; &#1610;&#1580;&#1575;&#1608;&#1586; &#1578;&#1585;&#1575;&#1602;&#1610;&#1607;&#1605; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1581;&#1578;&#1609; &#1593;&#1583;&#1607;&#1575; &#1586;&#1610;&#1575;&#1583;&#1577; &#1593;&#1604;&#1609; &#1593;&#1588;&#1585;&#1577; &#1605;&#1585;&#1575;&#1578; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1605;&#1606;&#1607;&#1605; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1581;&#1578;&#1609; &#1610;&#1582;&#1585;&#1580; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604; &#1601;&#1610; &#1576;&#1602;&#1610;&#1578;&#1607;&#1605; </div>    <P>
<blockquote>I heard the Messenger of Allaah (sallallaahu alayhi wasallam) saying: "There will emerge a people from my Ummah from the East who recite the Qur'an but it does not go beyond their throats. Every time a faction amongst them emerges it will be cut off. Every time a faction amongst them emerges it will be cut off", until he said it ten times, "Every time a faction amongst them emerges it will be cut off, until the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> appears amongst their (later) remnants." </blockquote>    <P>
Ahmad Shakir in his tahqeeq of the Musnad declared this to be <b>Saheeh</b> (11/88).    <P>
There is also the hadeeth of Abdullah bin Umar in which he narrates that the Messenger (sallallaahu alayhi wasallam) said:    <P>
<div class='arabic' align='right'>&#1610;&#1606;&#1588;&#1608; &#1606;&#1588;&#1608; &#1610;&#1602;&#1585;&#1572;&#1608;&#1606; &#1575;&#1604;&#1602;&#1585;&#1575;&#1606; &#1548; &#1604;&#1575; &#1610;&#1580;&#1575;&#1608;&#1586; &#1578;&#1585;&#1575;&#1602;&#1610;&#1607;&#1605; &#1548; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1548; &#1603;&#1604;&#1605;&#1575; &#1582;&#1585;&#1580; &#1602;&#1585;&#1606; &#1602;&#1591;&#1593; &#1548; &#1581;&#1578;&#1609; &#1610;&#1582;&#1585;&#1580; &#1601;&#1610; &#1571;&#1593;&#1585;&#1575;&#1590;&#1607;&#1605; &#1575;&#1604;&#1583;&#1580;&#1575;&#1604;</div>    <P>
<blockquote>A group will emerge who recite the Qur'an but it does not go beyond their throats. Every time a faction amongst them emerges it will be cut off. Every time a faction amongst them emerges it will be cut off, until the <a href='tags/dajjaal.html' class='tagLink'><font class='tagLink'>Dajjaal</font></a> appears amongst them.</blockquote>    <P>
This hadeeth is graded <b>Hasan</b> by Shaykh al-Albaani in Saheeh al-Jaami' (no. 8171), and it is narrated by Ibn Majah from Ibn Umar.</div>    <P>
Then the misguidance of these people and all those who defend them and ally with them, could not be any more clearer.   <P> 

</div>
<br>

<span class="smallHeadline">Related Articles:</span><BR>



<ul>

<li><a href="articles/jqpkg-yusuf-al-qaradawi-the-new-qutbi-understanding-of-tawheed.html">Yusuf al-Qaradawi: The New 'Qutbi' Understanding of Tawheed</a><BR>
//www.takfiris.com/takfir/?jqpkg<BR>

<li><a href="articles/lyhev-yusuf-al-qaradawi-on-sayyid-qutb-all-muslims-are-kuffaar-mushrikeen-apostates-except-those-who-agree-with-my-ideology.html">Yusuf al-Qaradawi on Sayyid Qutb: All Muslims Are Apostates (Kuffaar, Mushrikeen) Except Those Who Agree With My Ideology and Join My Group</a><BR>
//www.takfiris.com/takfir/?lyhev<BR>

<li><a href="articles/xbnsa-yusuf-al-qaradawi-sayyid-qutb-makes-it-explicitly-clear-that-all-muslims-today-are-disbelievers.html">Yusuf al-Qaradawi: Sayyid Qutb Makes it Explicitly Clear That All Muslims Today Are Disbelievers</a><BR>
//www.takfiris.com/takfir/?xbnsa<BR>

<li><a href="articles/rxvjg-salaah-as-saawee-a-qutbi-theoretician-on-the-qutbiyyoon-and-the-basis-of-their-teachings.html">Salaah as-Saawee (A Qutbi Theoretician) on the Qutbiyyoon and the Basis of Their Teachings</a><BR>
//www.takfiris.com/takfir/?rxvjg<BR>

<li><a href="articles/hulwt-yusuf-al-qardawi-groups-known-as-the-qutbiyyoon-found-harboring-the-doctrines-of-takfir-found-in-az-zilaal.html">Yusuf al-Qaradawi: Groups Known as 'the Qutbiyyoon' Found in Various Places Harboring the Doctrines of Takfir Found in az-Zilaal</a><BR>
//www.takfiris.com/takfir/?hulwt<BR>

<li><a href="articles/wmagi-yusuf-al-qaradawi-the-takfir-of-all-societies-and-announcement-of-destructive-revolutions-in-the-final-works-of-sayyid-qutb.html">Yusuf al-Qaradawi: The Takfir of All Societies and Announcement of Destructive Revolutions In the Final Works of Sayyid Qutb</a><BR>
//www.takfiris.com/takfir/?wmagi<BR>

<li><a href="articles/ihnep-ali-al-timimi-on-secular-laws-the-saudi-government-and-takfir.html">Ali al-Timimi on Secular Laws, the Saudi Government, Takfir and Deviant Philosophies of Jihaad</a><BR>
//www.takfiris.com/takfir/?ihnep<BR>

</ul>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.takfiris.com/takfir/print.cfm?hulwt by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 11 Aug 2025 11:01:17 GMT -->
</html>


