

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.salafis.com/print.cfm?rjfiewo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:51:06 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Salafis.Com | Shaykh Salih Al-Fawzan on Saying 'I Am Salafi'</title>
	<link rel="STYLESHEET" type="text/css" href="../salafis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../salafis.com/layout/salafis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Salafis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Salih Al-Fawzan on Saying 'I Am Salafi'</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Thursday, July, 31 2014 and
 filed under <a href="categories/xu-ascription.html">Ascription</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=../salafis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
Shaykh Salih al-Fawzaan was asked in his lesson on Sharh Fath al-Majeed (23/04/1434H) (<a href=fawwzan-ana-salafiba66.mp3?a=zinknw>MP3</a>):    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1601;&#1590;&#1610;&#1604;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1608;&#1601;&#1602;&#1603;&#1605; &#1575;&#1604;&#1604;&#1607; &#1610;&#1602;&#1608;&#1604; : &#1610;&#1602;&#1608;&#1604; &#1576;&#1593;&#1590; &#1591;&#1604;&#1576;&#1577; &#1575;&#1604;&#1593;&#1604;&#1605; &#1573;&#1606;&#1607; &#1604;&#1575; &#1610;&#1606;&#1576;&#1594;&#1610; &#1604;&#1571;&#1581;&#1583; &#1571;&#1606; &#1610;&#1602;&#1608;&#1604; &#1571;&#1606;&#1575; &#1587;&#1604;&#1601;&#1610; &#1604;&#1571;&#1606; &#1601;&#1610; &#1607;&#1584;&#1575; &#1578;&#1586;&#1603;&#1610;&#1577; &#1604;&#1604;&#1606;&#1601;&#1587; &#1601;&#1607;&#1604; &#1605;&#1575; &#1610;&#1602;&#1608;&#1604;&#1607; &#1589;&#1581;&#1610;&#1581; &#1567;</div>    <P>
<blockquote class='quote'><img src='../salafis.com/images/quote-start.gif'>Esteemed Shaykh, may Allah grant you success, he (the questioner) says: Some of the students of <a href='tags/knowledge.html' class='tagLink'><font class='tagLink'>knowledge</font></a> say it is not desirable for anyone to say 'I am Salafi' because this is commendation of oneself. Is it correct what he says?</blockquote>    <P>
To which he  replied:    <P>
<div class='arabic' align='right' lang='AR-SA'>&#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1610;&#1602;&#1608;&#1604; &#1607;&#1584;&#1575; &#1605;&#1606; &#1576;&#1575;&#1576; &#1578;&#1586;&#1603;&#1610;&#1577; &#1606;&#1601;&#1587;&#1607; &#1604;&#1575; &#1610;&#1580;&#1608;&#1586; &#1607;&#1584;&#1575; &#1606;&#1593;&#1605; &#1548; &#1575;&#1605;&#1575; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1610;&#1602;&#1608;&#1604;&#1607; &#1605;&#1606; &#1576;&#1575;&#1576; &#1575;&#1604;&#1576;&#1610;&#1575;&#1606; &#1604;&#1571;&#1606;&#1607; &#1576;&#1610;&#1606; &#1571;&#1581;&#1586;&#1575;&#1576; &#1608;&#1580;&#1605;&#1575;&#1593;&#1575;&#1578; &#1605;&#1582;&#1575;&#1604;&#1601;&#1577; &#1608;&#1610;&#1578;&#1576;&#1585;&#1571; &#1605;&#1606;&#1607;&#1605; &#1548; &#1608;&#1610;&#1602;&#1608;&#1604; &#1571;&#1606;&#1575; &#1587;&#1604;&#1601;&#1610; &#1571;&#1606;&#1575; &#1593;&#1604;&#1609; &#1605;&#1606;&#1607;&#1580; &#1575;&#1604;&#1587;&#1604;&#1601; &#1605;&#1606; &#1576;&#1575;&#1576; &#1575;&#1604;&#1576;&#1585;&#1575;&#1569;&#1577; &#1607;&#1584;&#1575; &#1591;&#1610;&#1576; &#1548; &#1606;&#1593;&#1605;</div>    <P>
<blockquote class='quote'><img src='../salafis.com/images/quote-start.gif'>If he says this from the angle of commending himself, it is not permissible. Yes, as for when he says it from the angle of clarifying, because he is amidst the various opposing parties and groups and (desires) to free himself from them, and says 'I am Salafi, I am upon the methodology of the Salaf' from the angle of freeing himself (from them), then this is good. Yes.</blockquote>    <P>
Translated by Abu Iyaad. <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.salafis.com/print.cfm?rjfiewo by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:51:06 GMT -->
</html>


