

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>

<!-- Mirrored from www.salafis.com/print.cfm?rvvgzve by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:52:09 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=iso-8859-1" /><!-- /Added by HTTrack -->
<head>
	<title>Salafis.Com | Shaykh Ibn Uthaymeen:  the Salafis Are Ahl Al-Sunnah Wal-Jamaa'ah and Ahl Al-Athar</title>
	<link rel="STYLESHEET" type="text/css" href="../salafis.com/css/global.css">
	<link rel="STYLESHEET" type="text/css" href="../salafis.com/layout/salafis/styleprint.css">
</head>
<body topmargin="0" leftmargin="15">



<table width="650" cellpadding="0" cellspacing="0">
<tr><td align="right">
<BR><font style="font-size:38px;font-family:Book Antiqua;color:#454545"><strong>Salafis.Com</strong></font><BR><BR>
</td></tr>
<tr><td>
<span class="articleTitle">Shaykh Ibn Uthaymeen:  the Salafis Are Ahl Al-Sunnah Wal-Jamaa'ah and Ahl Al-Athar</span><BR>

<span style="font-size:11px;">Posted by <a href="authors/Abu.Iyaad.html">Abu.Iyaad</a> on  Tuesday, April, 23 2013 and
 filed under <a href="categories/xu-ascription.html">Ascription</a></span><BR>

<span style="font-size:11px;"> 



<div class="articleContent">






<p><div align=center><img src=../salafis.com/assets/sysimages/aal-hamd.gif border=0></div>    <P>
Shaykh Ibn Uthaymeen explains that anyone who follows the way of the Prophet (sallallaahu alayhi wasallam) and his Companions is a Salafi and that ony the Salafis who adhere to the way of the Salaf (in truth) are Ahl al-Sunnah wal-Jamaa'ah:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1602;&#1575;&#1604; &#1575;&#1604;&#1593;&#1604;&#1575;&#1605;&#1577; &#1575;&#1604;&#1588;&#1610;&#1582; &#1605;&#1581;&#1605;&#1583; &#1576;&#1606; &#1589;&#1575;&#1604;&#1581; &#1575;&#1604;&#1593;&#1579;&#1610;&#1605;&#1610;&#1606; &#1585;&#1581;&#1605;&#1607; &#1575;&#1604;&#1604;&#1607; &#1578;&#1593;&#1575;&#1604;&#1609; : &#1601;&#1571;&#1607;&#1604; &#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1575;&#1604;&#1580;&#1605;&#1575;&#1593;&#1577; &#1607;&#1605; &#1575;&#1604;&#1587;&#1604;&#1601; &#1605;&#1593;&#1578;&#1602;&#1583;&#1575;&#1611; &#1581;&#1578;&#1609; &#1575;&#1604;&#1605;&#1578;&#1571;&#1582;&#1585; &#1573;&#1604;&#1609; &#1610;&#1608;&#1605; &#1575;&#1604;&#1602;&#1610;&#1575;&#1605;&#1577; &#1573;&#1584;&#1575; &#1603;&#1575;&#1606; &#1593;&#1604;&#1609; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1606;&#1576;&#1610; &#1589;&#1604;&#1609; &#1575;&#1604;&#1604;&#1607; &#1593;&#1604;&#1610;&#1607; &#1608;&#1587;&#1604;&#1605; &#1608;&#1571;&#1589;&#1581;&#1575;&#1576;&#1607; &#1601;&#1573;&#1606;&#1607; &#1587;&#1604;&#1601;&#1610;    </div></blockquote>    <P>
The Allaamah, Shaykh Muhammad bin Saalih al-Uthaymeen (rahimahullaah) said (Sharh al-Aqeedah al-Waasitiyyah 1/45):    <P>
<blockquote class='quote'><img src='../salafis.com/images/quote-start.gif'>For Ahl al-Sunnah wal-Jamaa'ah, they are the Salaf in terms of <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a>, even the latecomer until the Day of Judgement, if he is upon the way of the Prophet (sallallaahu alayhi wasallam) and his Companions then he is a Salafi.</blockquote>    <P>
And in the first cassette of his explanation of al-Aqeedah al-Safaraaniyyah, he said:    <P>
<blockquote><div class='arabic' align='right' lang='AR-SA'>&#1605;&#1606; &#1607;&#1605; &#1571;&#1607;&#1604; &#1575;&#1604;&#1571;&#1579;&#1585; &#1567; &#1607;&#1605; &#1575;&#1604;&#1584;&#1610;&#1606; &#1575;&#1578;&#1576;&#1593;&#1608;&#1575; &#1575;&#1604;&#1571;&#1579;&#1575;&#1585; &#1548; &#1575;&#1578;&#1576;&#1593;&#1608;&#1575; &#1575;&#1604;&#1603;&#1578;&#1575;&#1576; &#1608;&#1575;&#1604;&#1587;&#1606;&#1577; &#1608;&#1571;&#1602;&#1608;&#1575;&#1604; &#1575;&#1604;&#1589;&#1581;&#1575;&#1576;&#1577; &#1585;&#1590;&#1610; &#1575;&#1604;&#1604;&#1607; &#1593;&#1606;&#1607;&#1605; &#1608;&#1607;&#1584;&#1575; &#1604;&#1575; &#1610;&#1578;&#1571;&#1578;&#1609; &#1601;&#1610; &#1571;&#1610; &#1601;&#1585;&#1602;&#1577; &#1605;&#1606; &#1575;&#1604;&#1601;&#1585;&#1602; &#1573;&#1604;&#1575; &#1593;&#1604;&#1609; &#1575;&#1604;&#1587;&#1604;&#1601;&#1610;&#1610;&#1606; &#1575;&#1604;&#1584;&#1610;&#1606; &#1575;&#1604;&#1578;&#1586;&#1605;&#1608;&#1575; &#1591;&#1585;&#1610;&#1602; &#1575;&#1604;&#1587;&#1604;&#1601;</div></blockquote>    <P>
<blockquote class='quote'><img src='../salafis.com/images/quote-start.gif'>Who are the Ahl al-Athar? They are the ones who follow the aathaar (narrations), they follow the Book and the Sunnah and the sayings of the Companions (radiallaahu anhum). And this does not stem (arise) from anyone sect from the sects except the Salafis, those who cling to the way of the Salaf.</blockquote>    <P>
Shaykh Ibn al-Uthaymeen (rahimahullaah) has some other speech in which he warns that <a href='tags/salafiyyah.html' class='tagLink'><font class='tagLink'>Salafiyyah</font></a> is not a "<i>hizb</i>" (a party amongst the parties) but that it is following the way of the Salaf truthfully, we shall document that separately and answer many of the doubts of the biased partisans who used that speech in order to attack ascription to the Salaf in ones <a href='tags/creed.html' class='tagLink'><font class='tagLink'>creed</font></a> and methodology.    <P>

<BR>





</div>
<br>



</td></tr></table>
<body>



</body>

<!-- Mirrored from www.salafis.com/print.cfm?rvvgzve by HTTrack Website Copier/3.x [XR&CO'2014], Mon, 18 Aug 2025 15:52:09 GMT -->
</html>


